{"filename": "./data/Bed008.txt", "transcript": "0:00:00\tNone\n Yeah, yeah.\n\n0:00:01\tSPEAKER_02\n Hey, bus.\n\n0:00:02\tSPEAKER_02\n Yeah, it's a guy.\n\n0:00:04\tNone\n Yeah.\n\n0:00:06\tNone\n Yeah.\n\n0:00:07\tNone\n And just more to come.\n\n0:00:08\tSPEAKER_02\n And forever you get to.\n\n0:00:09\tSPEAKER_02\n I didn't look for air, but at the end.\n\n0:00:12\tSPEAKER_03\n And please turn off the microphone.\n\n0:00:13\tSPEAKER_03\n At the end, if you can remember, that's the most exciting light.\n\n0:00:16\tNone\n Great.\n\n0:00:16\tNone\n We'll move.\n\n0:00:17\tNone\n Make sure they're all on.\n\n0:00:19\tSPEAKER_04\n Yeah.\n\n0:00:19\tSPEAKER_04\n Yeah.\n\n0:00:20\tNone\n You know your record should be on, even if you're not talking like this.\n\n0:00:23\tSPEAKER_02\n Right.\n\n0:00:24\tSPEAKER_03\n Yeah.\n\n0:00:25\tSPEAKER_03\n Got anything good?\n\n0:00:26\tSPEAKER_03\n Good.\n\n0:00:27\tSPEAKER_03\n Well, Keaton, today we get to sort of do our stuff and drumming that.\n\n0:00:31\tSPEAKER_05\n Yeah.\n\n0:00:32\tSPEAKER_05\n That's all.\n\n0:00:33\tSPEAKER_05\n Yeah.\n\n0:00:34\tSPEAKER_02\n OK, got it.\n\n0:00:36\tSPEAKER_02\n Thank you putting it on backwards.\n\n0:00:38\tSPEAKER_02\n I think the hinge bent.\n\n0:00:39\tSPEAKER_02\n Anyway, there you go.\n\n0:00:54\tSPEAKER_05\n All right.\n\n0:00:55\tSPEAKER_05\n I should read all of these numbers.\n\n0:00:58\tSPEAKER_05\n 8551 14 8198 807 966 85 7691 9493 4771 246 00 7533 3226 3880 7491 9493 954896 097 347 163 56161 9731\n\n0:01:48\tSPEAKER_03\n Hey, transcript L87 864 664 171 803 256 803 225 202 311 611 7 424 058 8 4 2 1 8 3 6 9 1 7 5 2 1 4 3 5 9 0 9 7 6 1 6 9 6 6 0 281 209 8 1 3 0 4 5 or 7 8\n\n0:02:31\tSPEAKER_01\n Transcript L85 57367 1 348 4 545 8 5 9 9 6 5 4 7 3 2 0 1 8 3 7 8 2 2 1 9 0 9 2 0 6 6 7 7 2 6 4 6 1 6 4 4 4 3 9 7 5 4 1 1 0 5 3 3 2 6 4 3 8 4 8 5 1 6 7 5 5 5 7 8 4 4 4 4 4 4 6 7 0 9 0 4 5 9 8 4 1 1 6 8 0 1 1 1 1 4 1\n\n0:03:26\tNone\n 8 4 4 7 6 7 1 8 9 7 8 8 8 8 4 4 0 9 3 0 9 9 9 9 9 9 9 Transcript L83 9247 6 9 4 5 5 5 7 8 7 0 9 9 8 8 2 9 4 5 3 0 9 7 1 5 4 1 4 2 7 6 6 8 6 1 8 7 6 8 0 7 2 7 4 2 4 9 9 4 6 9 6 7 7 0 7 4 2 9 4 2 1 4 2 2 5 5 0 0 6 4 6 82 8 2 4 5 4 6\n\n0:04:26\tSPEAKER_01\n No 2 So my idea for today, and we can decide that that isn't the right thing to do, was to spend at least part of the time trying to build the influence links, which sets things are relevant to which decisions. And actually I had specific gestion to start first with the path ones, the database ones being in some sense less interesting to us although probably have to be done. And so to do that, so there's, and the idea was we were going to do two things.\n\n0:05:41\tSPEAKER_01\n Oh right. Well, we're going to do two things, one of which is just lay out the influence structure of what we think influences what. And then as a separate but related task, particularly buscrow and I were going to try to decide what kinds of belief nodes are needed in order to do what we need to do once. So we should sort of have all of the basic design of what influences what done before we decide exactly how to compute it. So did you get a chance to look at all? Yeah, look at some of that stuff. Great. Okay, so let's start with the belief that's general influence stuff and then we'll also, at some point,\n\n0:06:42\tSPEAKER_03\n break and talk about the techie stuff. Well, I think one could go, I think we can do this because everything. First of all, this I added, I knew from sort of basically this has to be there, right? Oh, are you going to go there or not? Yeah. So one, not transverse the castle, the decision is that's the first one to go there. Right. True. Does have to\n\n0:07:07\tSPEAKER_01\n be there. And I'm sure we'll find more as we go then. So go there in the first place\n\n0:07:14\tSPEAKER_03\n or not just definitely one of the basic ones we can start with that interesting effort. Is this basically true of false or maybe we'll get? Well, go there. So there is this question about we actually get just the entities, right? For each one here. Yeah, when we're done.\n\n0:07:44\tSPEAKER_01\n The reason it might not be true or false is that we did have this idea of when. So it's you know, current for next and so forth and so on or not at all, right? And so that's a decision would be do we want that? So you could do two different things you could do.\n\n0:08:06\tSPEAKER_01\n You could have all those values for go there or you could have go there be binary and given that you're going there. So let's say. I mean, it seems that you could. It seems\n\n0:08:23\tSPEAKER_05\n that those things would be logically independent like you would want to have them separate a binary go there and then the possibility is hard to go there because. Okay. Let's start that way because you know, it might be easy to figure out that this person is going to need more film eventually from their utterance, but it's much more complex to query when\n\n0:08:42\tSPEAKER_03\n would be the most appropriate time. Okay. And so I've tried to come up with some initial things one could serve. So who is the user? Everything that has user, it comes with the user model. Everything that has situation comes with the situation model. It should be here.\n\n0:09:01\tSPEAKER_03\n But when it comes to sort of writing down when you do these things, is it here? You sort of have to write the values this can take. Right? And here I was really, and sometimes I was really sort of standing in front of a wall feeling very stupid because in this case, it's pretty simple, but as we will see the other ones. For example, if it's a running budget, so what are the discrete values of a running budget? So maybe my understanding goes to a power. Right here that this is something a number that keeps on changing, but okay. This is understandable. Yes. So here. You've seen this before. I'll keep these\n\n0:09:55\tSPEAKER_05\n belief net things. No, but I think I'm following it. So here is the, that we had that the\n\n0:10:01\tSPEAKER_03\n user sponsored me influence the outcome of decisions. There we wanted to keep sort of a running\n\n0:10:06\tSPEAKER_06\n total of things. Is this like an humble represents how much money they have left to spend? Okay. Well, I mean, how is it different from user finance? The finance is sort of here\n\n0:10:18\tSPEAKER_03\n thought of as the financial policy person carries out in his life. He's actually cheap, average or spendy. Right. And I did become maybe a user. I don't know. I didn't want to write\n\n0:10:32\tSPEAKER_01\n that. But, or cheapness. Well, a user-thrift. Thrift is good. Right. There it is. So Keith, what's behind this is actually a program that will, once you fill all this in, actually solve your belief nets for you and stuff. So this is not just a display. This is actually a GUI to a simulator that will, if we tell it all the right things, will wind up with a functioning belief net at the other end. And it's so simple that I can use it. Wow,\n\n0:11:10\tSPEAKER_03\n that is simple. Okay. So here it was. Okay. I can think of people being cheap, average, or spendy, or we can even have a finer scale of the matter. It doesn't matter. It doesn't matter. Agreed there. But here, I wasn't sure what to write in. Let's go ahead. Well,\n\n0:11:28\tSPEAKER_06\n I mean, you've written in what seems to be required. Like what else do you want?\n\n0:11:34\tSPEAKER_01\n If that's permissible, then. Well, yeah. So here's what's permissible is that you can arrange so that the value of that is going to have to be updated. It's not a belief update, right? You took some actions, you spent money and stuff. So the update of that is going to have to be essentially external to the belief net. Right? And then what you're going to need is for the things that it influences. Well, let's see if it does influence anything.\n\n0:12:10\tSPEAKER_01\n And if it does influence anything, then you're going to need something that converts from the number here to something that's relevant to the decision there. So it could be right, there are quite different ranges that are relevant for different decisions or whatever, but for the moment, this is just a node that is conditioned externally and might influence\n\n0:12:31\tSPEAKER_03\n various things. Yeah, this is where, okay, anyways, let's get it. That's fine. Well, anyway.\n\n0:12:43\tSPEAKER_06\n Okay. And so the other thing is that every time that's updated, belief is up to be propagated, but then the question is, do you want to propagate, believe every single time it's updated\n\n0:12:53\tSPEAKER_01\n or when we need to? Yeah, that's a good question. And does it have a lazy mode? I don't remember.\n\n0:13:03\tSPEAKER_06\n Well, I mean, in Trini's thing, there was this thing, there was this option like propagate\n\n0:13:09\tSPEAKER_01\n differences, which suggests that it probably does. So what if the track hit down? And I think actually one of the items for the user home base should be essentially non-local. They're only there for the day and they don't have a place that they're staying.\n\n0:13:50\tSPEAKER_03\n I'll just accidentally erase this. I just had values here, such as, we had in our list, we had, is he staying in our hotel? Is he staying with friends? Yeah.\n\n0:14:02\tSPEAKER_01\n Okay. So it's clear where we are right now. So my suggestion is we just pick up.\n\n0:14:19\tSPEAKER_01\n Yeah, one of the, well, let's do the first one. Let's do the one that we already think we did.\n\n0:14:30\tSPEAKER_01\n So that would be endpoint.\n\n0:14:37\tSPEAKER_06\n So it's two or false? No, that's a BBA. So what's the same mode? Yeah.\n\n0:14:53\tSPEAKER_06\n And endpoint? Oh, that mode was, that's more of transportation? Yeah. Okay. Also true of false. Yeah, he hasn't filled the bin yet.\n\n0:15:10\tSPEAKER_03\n No, probably nothing done here. Oh, we're just doing the other ones. Okay. Make sense. Okay. So this was EVA.\n\n0:15:28\tSPEAKER_03\n Maybe we can think of more things across. Yeah. Okay. I'm Rob. I'm the merge.\n\n0:15:37\tSPEAKER_02\n Yeah. That's just the point. But it would be an endpoint if you were crossing over it.\n\n0:15:42\tSPEAKER_01\n Yeah, it would be for a given segment. You know, you first go to the town square.\n\n0:15:49\tSPEAKER_05\n Well, I mean, if you go to, you know, if you go to Prague or whatever, one of your key points that you have to do is cross the Charles Bridge.\n\n0:15:56\tSPEAKER_05\n It doesn't really matter which way you cross, which where you end up at the end, but the part that good part is walking over it.\n\n0:16:05\tSPEAKER_01\n That's subtle, but true. Anyway. So let's just leave it with three for now.\n\n0:16:13\tSPEAKER_01\n And let's see if we can get it linked up just to get ourselves started.\n\n0:16:22\tSPEAKER_01\n Okay. You'll see it. You'll see something comes up immediately. That reason I want to do this.\n\n0:16:25\tSPEAKER_03\n Well, the user was right. Definitely more likely to write for if he's a local, more likely to view if he's a tourist.\n\n0:16:38\tSPEAKER_03\n And then of course, we had the fact that given the fact that he's thrifty and there will be admission that we get all these cross.\n\n0:16:46\tSPEAKER_01\n We did, but the three things that contributed this, in fact, the other two aren't up there. So one was the ontology.\n\n0:16:55\tSPEAKER_03\n What type of building is it?\n\n0:16:57\tSPEAKER_01\n Yeah. And the third thing we talked about was something from the discourse.\n\n0:17:04\tSPEAKER_03\n What he has mentioned before.\n\n0:17:07\tSPEAKER_01\n Okay. So this is right. So what we seem to need here.\n\n0:17:12\tSPEAKER_01\n And this is why it starts getting into the technical stuff. The way we had been designing this, there were three intermediate nodes, which were the endpoint decision as seen from the user model as seen from the ontology and as seen from the discourse.\n\n0:17:31\tSPEAKER_01\n So each of those, the way we had it designed, now we can change the design. The design we had was there was a decision with the same three outcomes based on those three separate considerations.\n\n0:17:46\tSPEAKER_01\n So if we wanted to do that, would have to put in three intermediate nodes.\n\n0:18:02\tSPEAKER_01\n And then what you and I have to talk about is, okay, if we're doing that and they get combined somehow, how do they get combined? But they're not only going to be more things to worry about.\n\n0:18:12\tSPEAKER_03\n So this was just it for this one.\n\n0:18:23\tSPEAKER_03\n So let's, in our, in John was sort of pictogram everything that could contribute to whether person wants to interview or approach some.\n\n0:18:33\tSPEAKER_01\n Oh, it was called mode. So this is, this is mode here means the same as endpoint.\n\n0:18:42\tSPEAKER_01\n Okay, why don't we change that?\n\n0:19:06\tSPEAKER_01\n Yeah, but that was actually, yeah, unfortunately, that was a, kind of an intermediate version. That's, I don't think what we would currently do.\n\n0:19:21\tSPEAKER_02\n Can I ask about slurred and angry? Absolutely. Like, they're either true or false and the, well, I see if the, if the person talking is angry or slurs their speech, it might be tired or, you know,\n\n0:19:40\tSPEAKER_01\n they're strong. And therefore, and, you know, possibly less likely to enter some, yeah, that seems to be, yeah, so, somebody else must do is, is get this down to what we think is actually likely to be a strong influence. But yeah, that was what he had in mind.\n\n0:20:05\tSPEAKER_01\n Let's think about this, this question of how do we want to handle the two separate things. One is, at least two.\n\n0:20:14\tSPEAKER_01\n One is, how do we want to handle the notion of the ontology? Now, what we talked about, and this is another technical thing, mascara, is, can we arrange so that, I think we can, so that the belief that itself has properties.\n\n0:20:32\tSPEAKER_01\n And the properties are filled in from ontology items. So let's take the case of the, this endpoint thing. The notion was that if you had a few key properties like, is this a tourist site, you know, some kind of landmark, is it a place of business?\n\n0:20:51\tSPEAKER_01\n Is it something you physically could enter? Okay, et cetera. So that there be certain properties that would fit into the decision node.\n\n0:21:00\tSPEAKER_01\n And then, again, as part of the outer control and conditioning of this thing, those would be set so that somehow, someone would find this word, look it up in the ontology, pull out these properties, put it into the belief net, and then the decision would flow.\n\n0:21:18\tSPEAKER_03\n Now, it seems to me that we've sort of embodied a lot embedded a lot of these things we had previously, in some of the other final decisions done here, for example, if we would know that this thing is exhibiting something.\n\n0:21:34\tSPEAKER_03\n If it's exhibiting itself, it is a landmark, and it would be more likely to be viewed. If it is exhibiting pictures or sculptures and stuff like this, then it's more likely to be entered.\n\n0:21:48\tSPEAKER_01\n I think that's completely right, and I think that's good. So what that says is that we might be able to take and in particular, so the ones we talked about were exhibiting and selling accessibility.\n\n0:22:15\tSPEAKER_03\n If it's closed, one probably won't enter. Or if it's not accessible to a tourist ever. The likelihood of that person actually wanting to enter it, given that he knows it.\n\n0:22:27\tSPEAKER_01\n So let me suggest this. Could you move those up about halfway? The ones that youth in selling, I guess.\n\n0:22:50\tSPEAKER_01\n So here's what it looks like to me, is that you want an intermediate structure which is essentially the order of, for this purpose, of selling, fixing, or servicing.\n\n0:23:07\tSPEAKER_01\n So that is for certain purposes, it becomes important, but for this kind of purpose, one of these places is quite like the other. So it seems right?\n\n0:23:23\tSPEAKER_01\n So it's basically just merging those for just the take of endpoint decision. So the idea would be that you might want to merge those three.\n\n0:23:40\tSPEAKER_01\n Well, it's here's where it gets a little tricky. From the belief net point of view it is. From another point of view, of course, it's important to know what it's selling or servicing and so forth.\n\n0:23:54\tSPEAKER_01\n So for this decision, it's just a true or false. And in this is a case where the order seems just what you want. If any of those things is true, then it's the kind of place that you are more likely to enter.\n\n0:24:17\tSPEAKER_01\n So you just want to have them all pointing to a, yeah, so let's do that.\n\n0:24:27\tSPEAKER_01\n No, no, no, no, no, an intermediate node. That's the part of the idea.\n\n0:24:32\tSPEAKER_03\n Is that the object type node?\n\n0:24:35\tSPEAKER_03\n Is it the kind of object that sells fixes or servicing?\n\n0:24:39\tSPEAKER_01\n Open up object type and let's see what its values are.\n\n0:24:42\tSPEAKER_01\n So it's not so far. Oh, well, first of all, it's not objects we call them entities, right?\n\n0:25:06\tSPEAKER_03\n We have sort of the, let's say put commercial.\n\n0:25:12\tSPEAKER_03\n I was just going to commercial action inside.\n\n0:25:15\tSPEAKER_01\n Let's do commercial landmark and. What was the. Well, accessible. I think it's different because that's temporary. That varies temporarily. Whereas this is a.\n\n0:25:37\tSPEAKER_02\n What would a hotel fall under?\n\n0:25:41\tSPEAKER_01\n I would call that a service, but, but I don't know. Well, I mean in terms of entity type.\n\n0:25:46\tSPEAKER_01\n It's a, well, it's, I would again, and for this purpose, I think it's commercial.\n\n0:25:51\tSPEAKER_01\n Some place you want to go in to do some kind of business.\n\n0:25:56\tSPEAKER_06\n What is the underscore T at the end of each of those things?\n\n0:26:00\tSPEAKER_03\n Things. So places that service things.\n\n0:26:04\tSPEAKER_03\n So things. Okay. Or fix things. This is an exhibit things.\n\n0:26:11\tSPEAKER_06\n That also points to entity type, I guess.\n\n0:26:14\tSPEAKER_05\n So we're deriving. This, this feature of whether the main action at this place happens inside or outside or what we're deriving that from what kind of activity is done there.\n\n0:26:27\tSPEAKER_05\n Couldn't you have it as just a primitive feature of the. Well, you could. That's a choice.\n\n0:26:32\tSPEAKER_05\n So, I mean, it seems like that's much more reliable because you could have outdoor places that sell things and indoor places.\n\n0:26:40\tSPEAKER_01\n Yeah, the problem with it is that it's sort of putting in a feature just for one decision.\n\n0:26:47\tSPEAKER_01\n Now, we may wind up having to do that. That's an, at a metal level, that's what we're going to have to sort out.\n\n0:26:53\tSPEAKER_01\n So, you know, what does this look like? What are what are intermediate things that are worth computing?\n\n0:26:58\tSPEAKER_01\n So, what are the features we need in order to make all these decisions? And what's the best way to organize this so that it's clean and consistent and all that sort of stuff?\n\n0:27:12\tSPEAKER_05\n I'm just thinking about how people, human beings who know about places and places to go and so on would store this.\n\n0:27:19\tSPEAKER_05\n And it would probably, you wouldn't just sort of remember that they sell stuff and then deduce from that.\n\n0:27:24\tSPEAKER_03\n Well, it must be going on. I think entity maybe should be regard as a vector of several possible things that can either do sell things, fix things, service things, fix things.\n\n0:27:35\tSPEAKER_03\n It can be a landmark at the same time as doing these things. It's not either or.\n\n0:27:40\tSPEAKER_03\n It certainly best can be a hotel and a famous site.\n\n0:27:44\tSPEAKER_03\n Many people might think it can be generally a landmark and be accessible, i.e. a castle or can be a landmark and not accessible of some statue.\n\n0:27:59\tSPEAKER_01\n Anyway, so let me suggest to do something else, which is to get rid of that long link between the user and the endpoint.\n\n0:28:14\tSPEAKER_01\n No, no, I don't want the link there at all.\n\n0:28:19\tSPEAKER_01\n Because what we're going to want is an intermediate thing, which is the endpoint decision based on the user model.\n\n0:28:32\tSPEAKER_01\n So what we talked about is three separate endpoint decisions. So let's make a new node.\n\n0:28:41\tSPEAKER_02\n Just as a suggestion, maybe you could save as to keep your old one nice and clean and so you can mess with this one.\n\n0:28:50\tSPEAKER_03\n The old one was not there. Not that important, I think.\n\n0:28:54\tSPEAKER_02\n Okay, well, not a big deal then.\n\n0:28:57\tSPEAKER_03\n Let's do it then.\n\n0:29:00\tSPEAKER_02\n Isn't there a save as inside of Java page?\n\n0:29:04\tSPEAKER_03\n Okay.\n\n0:29:18\tSPEAKER_03\n This was user.\n\n0:29:20\tSPEAKER_01\n Let's put it this way. Let's do endpoint under bar U. End point. It's the endpoint. Let's say under bar U. So that's the endpoint decision as seen through the.\n\n0:29:41\tSPEAKER_01\n As related from the user model. Right. So let's actually. Yeah, so you can link that up to the.\n\n0:29:50\tSPEAKER_01\n Should I rename this? Yeah, so that I guess it's endpoint.\n\n0:29:56\tSPEAKER_03\n Under underscore e underscore e for entity and we may change all this, but. Right. And.\n\n0:30:18\tSPEAKER_01\n Actually, I guess the easiest thing would move move the endpoint. Well, go ahead. Just do whatever.\n\n0:30:27\tSPEAKER_03\n Isn't this possible?\n\n0:30:30\tSPEAKER_02\n Yeah, thank you. You have to be in move mode before.\n\n0:30:35\tSPEAKER_00\n Right.\n\n0:30:47\tSPEAKER_01\n So now we look for user related things that. Yeah. And maybe maybe it's just one who is the user. I don't know. Maybe maybe there's more.\n\n0:31:01\tSPEAKER_03\n Well, if he's using a car right now.\n\n0:31:06\tSPEAKER_03\n What was that people with Harry drove the car into the coffee? Never mind.\n\n0:31:15\tSPEAKER_01\n Anyway, this is crude. Now, but so the but then the question is.\n\n0:31:22\tSPEAKER_01\n So and we assume that some of these properties would come in directly through an ontology, but then we had this third idea of input from the discourse.\n\n0:31:32\tSPEAKER_03\n Well, that's finished. Sure. Okay. The user interests.\n\n0:31:36\tSPEAKER_01\n User thrift, the user budget. Well, maybe I again, I'd go, okay, put him in, but what we're going to want to do is actually.\n\n0:31:45\tSPEAKER_03\n This was one of my problems. We have the user interest is a vector of 500 values. So.\n\n0:31:53\tSPEAKER_03\n Oh, you mean this problem? No, not levels of interest, but things you can be interested in.\n\n0:31:58\tSPEAKER_03\n Somebody else has built this user model. So it's like a vector of 500 ones or zeros.\n\n0:32:10\tSPEAKER_06\n Like for each thing, I see.\n\n0:32:17\tSPEAKER_01\n Okay. So you could. So here, let me give you two ways to handle that. All right. One is.\n\n0:32:25\tSPEAKER_01\n You could ignore it. But the other thing you could do is have a, this is, you give me the flavor of the way it's going to.\n\n0:32:31\tSPEAKER_01\n You can have a node that's that was a measure of the match between the objects feature, you know, the match between the object, the entity.\n\n0:32:40\tSPEAKER_01\n I'm sorry. And the user. So you could have a fit node. And again, that would have to be computed by someone else.\n\n0:32:48\tSPEAKER_01\n But so that.\n\n0:32:55\tSPEAKER_03\n Just as a mental note.\n\n0:33:03\tSPEAKER_01\n Yeah, that's all.\n\n0:33:08\tSPEAKER_03\n And should we say that this interests affects the likelihood of entering?\n\n0:33:14\tSPEAKER_04\n Yeah. Which could.\n\n0:33:18\tSPEAKER_03\n And also, if it's an expensive place to enter, this may also.\n\n0:33:23\tSPEAKER_05\n Okay. User schedule.\n\n0:33:27\tSPEAKER_05\n Time to go in and climb all the way to the top of the kernel DOM. Or do I just have to.\n\n0:33:32\tSPEAKER_02\n It seems like everything in the user model affects.\n\n0:33:35\tSPEAKER_01\n Well, that's what we don't want to do. See that? Yeah. Because then we get into huge combinatorics and stuff like that.\n\n0:33:41\tSPEAKER_02\n Because if the user is tired, the user state, right, it would affect stuff.\n\n0:33:47\tSPEAKER_02\n But I can't see why anything, everything in the model wouldn't be.\n\n0:33:51\tSPEAKER_01\n Well, that's what we say we can't do that. So we're going to have to.\n\n0:33:54\tSPEAKER_01\n This is a good discussion. We're going to have to somehow figure out.\n\n0:33:58\tSPEAKER_01\n So if there is some general notion of, for example, the relation to the time to do this to the amount of time the guy has.\n\n0:34:14\tSPEAKER_01\n Or something like that is the compatibility with his current state.\n\n0:34:19\tSPEAKER_01\n So that's what you'd have to do. You'd have to get it down to something which.\n\n0:34:24\tSPEAKER_01\n It's the same thing. So it could be compatibility with his current state, which would include the money in this time and his energy.\n\n0:34:34\tSPEAKER_02\n Yeah, it just seems like it pushed the problem back a level.\n\n0:34:37\tSPEAKER_06\n It does. No, but it's more than that. The more sort of you break it up, the more that it.\n\n0:34:41\tSPEAKER_06\n Because if you have everything pointing to one node, it's like exponential.\n\n0:34:44\tSPEAKER_06\n Whereas if you like you break it up more and more, it's not exponential anymore.\n\n0:34:48\tSPEAKER_01\n So the two advantages. That's the one technical one.\n\n0:34:51\tSPEAKER_02\n It's a great solution. It gets you subgrouping. Subgrouping basically.\n\n0:34:56\tSPEAKER_02\n Yeah. So basically make it more tree like going backwards.\n\n0:35:00\tSPEAKER_01\n Right. Right. But there's two advantages. One is the technical one that you don't wind up with such big exponential.\n\n0:35:06\tSPEAKER_01\n Cpt's the others can be it presumably can be used for multiple decisions.\n\n0:35:11\tSPEAKER_01\n So if you have this idea of the compatibility with requirements of an action to the state of the user.\n\n0:35:19\tSPEAKER_01\n You can well imagine that that was not only is it is it cleaner to compute it separately, but it could be that it's used in multiple places.\n\n0:35:27\tSPEAKER_01\n So in general, this is the design. This is a really designed problem.\n\n0:35:31\tSPEAKER_01\n Okay. You've got to send it all into set of decisions.\n\n0:35:35\tSPEAKER_01\n How do we do this?\n\n0:35:39\tSPEAKER_03\n What do I have under user state? Because I named that already something. Oh, that's tired fresh.\n\n0:35:51\tSPEAKER_03\n Maybe should be renamed into physical state.\n\n0:35:55\tSPEAKER_01\n Or if it's user fatigue, even.\n\n0:36:00\tSPEAKER_03\n That's what the G.\n\n0:36:05\tSPEAKER_03\n Whatever that we can make a user state.\n\n0:36:10\tSPEAKER_01\n What's what we were talking about is compatibility.\n\n0:36:14\tSPEAKER_01\n Or something. I don't know.\n\n0:36:23\tSPEAKER_02\n I guess the question is it's hard for me to imagine how everything wouldn't just contribute to user state again.\n\n0:36:31\tSPEAKER_01\n Or user compatibility.\n\n0:36:36\tSPEAKER_01\n The thing is that we had some things that don't.\n\n0:36:42\tSPEAKER_03\n The user interest and the user who the user is are completely apart from the fact whether he is tired.\n\n0:36:52\tSPEAKER_02\n The node we're creating right now is user compatibility to the current action.\n\n0:37:01\tSPEAKER_02\n Everything in the user model would contribute to whether or not the user was compatible with something.\n\n0:37:06\tSPEAKER_01\n Maybe not. That's the issue.\n\n0:37:13\tSPEAKER_01\n Even if it was true in some abstract general sense, it might not be true in terms of the information we actually had and can make use of.\n\n0:37:21\tSPEAKER_01\n Anyway, we're going to have to find some way to get this sufficiently simple to make it feasible.\n\n0:37:30\tSPEAKER_03\n If we split it up again and if we look at the end point again, we said that for each of these things there are certain preconditions.\n\n0:37:42\tSPEAKER_03\n So you can only enter a place if you are not too tired to do so and also have the money to do so because of something.\n\n0:37:52\tSPEAKER_03\n So if you can afford it and perform it, preconditions.\n\n0:38:00\tSPEAKER_03\n Viewing usually is cheap.\n\n0:38:07\tSPEAKER_01\n With the way we're defining it, I think.\n\n0:38:13\tSPEAKER_03\n Viewing without definition of view is free.\n\n0:38:20\tSPEAKER_05\n What about the grand canyon?\n\n0:38:27\tSPEAKER_01\n I mean, never mind. No, you have to enter the park. Almost by definition, paying involves entering, going through some.\n\n0:38:40\tSPEAKER_01\n So let me suggest we switch to another one. I mean, clearly it's more work to be done on this, but I think it's going to be more instructive to think about other decisions that we need to make in path land.\n\n0:38:51\tSPEAKER_01\n And what they're going to look like.\n\n0:38:55\tSPEAKER_02\n So you can save this one as and open up the old one, right?\n\n0:39:00\tSPEAKER_02\n And then everything would be clean. So you could do it again.\n\n0:39:04\tSPEAKER_01\n I think we're saving this one, but I think I'd like to keep this one because I want to see if we're going to reuse any of this stuff.\n\n0:39:22\tSPEAKER_03\n What makes it?\n\n0:39:27\tSPEAKER_01\n Well, you tell me. So in terms of the planner, what's a good one to do?\n\n0:39:33\tSPEAKER_03\n Go there or not. I think it's a good one. It's a very basic one.\n\n0:39:40\tSPEAKER_03\n So what makes things more likely that?\n\n0:39:47\tSPEAKER_01\n Well, the first thing is getting back to the thing we left out of the other is the actual discourse.\n\n0:39:55\tSPEAKER_01\n So Keith, this is going to get into your world because we're going to want to know which constructions indicate various of these properties.\n\n0:40:07\tSPEAKER_01\n And so I don't yet know how to do this. I guess we're going to wind up pulling out discourse properties like we have object properties.\n\n0:40:20\tSPEAKER_01\n And we don't know what they are yet. So that the go there decision will have a node from discourse.\n\n0:40:28\tSPEAKER_01\n And I guess why don't we just stick a discourse thing up there to be as a placeholder for?\n\n0:40:33\tSPEAKER_03\n We also had discourse features, of course, for the endpoint.\n\n0:40:38\tSPEAKER_03\n Of course.\n\n0:40:39\tSPEAKER_03\n Identify that.\n\n0:40:40\tSPEAKER_03\n And so again, that's completely correct. We have the user model of the situation model here.\n\n0:40:45\tSPEAKER_03\n We don't have the discourse model here yet. We're just in the way. We don't have the ontology here.\n\n0:40:50\tSPEAKER_01\n Well, the ontology we sort of said we would pull these various kinds of properties from the ontology, like exhibiting, selling, and so forth.\n\n0:40:57\tSPEAKER_01\n So in some sense, it's there. But the discourse we don't have represented at all yet.\n\n0:41:19\tSPEAKER_03\n Let's be specific for a second here.\n\n0:41:25\tSPEAKER_03\n And we probably would have something like a discourse for endpoint.\n\n0:41:43\tSPEAKER_01\n But if we do, we don't have the three values. You don't have the EVA values.\n\n0:41:48\tSPEAKER_03\n If we have it, just for starters. And here discourse, for go there, probably is true and false, let's say.\n\n0:41:57\tSPEAKER_01\n That's what we talked about.\n\n0:42:00\tSPEAKER_03\n Well, I think, I mean, looking at the little data that we have, so people say, how do I get to the castle?\n\n0:42:09\tSPEAKER_03\n And this usually means they want to go there. So this should sort of push it.\n\n0:42:13\tSPEAKER_03\n Right. In one direction, however, people also sometimes say, how do I get there in order to find out how to get there without wanting to go there?\n\n0:42:21\tSPEAKER_03\n And sometimes people say, where is it? Because they want to know where it is. But in most cases, they're from...\n\n0:42:28\tSPEAKER_01\n Yeah, but that doesn't change the fact that you want these two values.\n\n0:42:32\tSPEAKER_03\n Yeah, true.\n\n0:42:36\tSPEAKER_03\n So this is sort of some external thing that takes all the discourse stuff and then says, here it's either, yep, A or A.\n\n0:42:45\tSPEAKER_04\n Okay.\n\n0:42:54\tSPEAKER_01\n And there'll be a user go there.\n\n0:43:02\tSPEAKER_06\n And maybe that's all I don't know. A situation go there, I mean, because whether it's open or not.\n\n0:43:08\tSPEAKER_06\n Okay, good. That definitely is.\n\n0:43:11\tSPEAKER_06\n But that... Now that kind of... What's the word...\n\n0:43:19\tSPEAKER_06\n That interacts with the EVA thing. If they just want to view it, then it's fine to go there when it's closed.\n\n0:43:25\tSPEAKER_06\n Whereas if they want to...\n\n0:43:27\tSPEAKER_01\n Right.\n\n0:43:30\tSPEAKER_01\n Right. So that's where it starts getting to be potentially more interesting.\n\n0:43:34\tSPEAKER_01\n So what Baskar says, which is completely right, is if you know that they're only going to view it, then it doesn't matter whether it's closed or not in terms of...\n\n0:43:45\tSPEAKER_01\n The time of day.\n\n0:43:47\tSPEAKER_01\n You know, whether you want to go there.\n\n0:43:52\tSPEAKER_02\n It does matter though if there's like a strike or a riot or something.\n\n0:43:55\tSPEAKER_01\n Absolutely. There are other situational things that do matter.\n\n0:43:58\tSPEAKER_06\n So, yeah, that's just that just having one situational node may not be enough because that node by itself wouldn't distinguish.\n\n0:44:09\tSPEAKER_01\n Well, it can have various values.\n\n0:44:12\tSPEAKER_01\n But you're right, it might not be enough.\n\n0:44:16\tSPEAKER_06\n Yeah, I mean, see, I'm thinking that any node that begins to go there is either going to be true or false.\n\n0:44:23\tSPEAKER_05\n Ah, I see. That could be.\n\n0:44:28\tSPEAKER_05\n So that node, I mean, the go there is S node would just be fed by separate ones for...\n\n0:44:32\tSPEAKER_05\n There's different things.\n\n0:44:34\tSPEAKER_06\n Next situation traffic and so on.\n\n0:44:36\tSPEAKER_01\n So now the other thing that Baskar pointed out is what this says is that there should be a link.\n\n0:44:44\tSPEAKER_01\n And this is where things are going to get very messy.\n\n0:44:46\tSPEAKER_01\n From the endpoint decision, maybe the final...\n\n0:44:55\tSPEAKER_01\n I guess the very bottom end point decision to the go there node.\n\n0:45:00\tSPEAKER_01\n And don't worry about layout. I mean, we'll go nuts.\n\n0:45:04\tSPEAKER_06\n But maybe we could have an intermediate node that just the endpoint and the go there S node sort of fed into.\n\n0:45:12\tSPEAKER_06\n Could be.\n\n0:45:13\tSPEAKER_06\n Right? Because that's what we... I mean, that's where this is.\n\n0:45:16\tSPEAKER_01\n Or actually the endpoint node could feed into the go there S.\n\n0:45:21\tSPEAKER_01\n Yeah, that's right. So the endpoint node, make that up to the go there there.\n\n0:45:26\tSPEAKER_01\n And again, we'll do layout at some point. But something like that.\n\n0:45:29\tSPEAKER_01\n Now it's going to be important not to have loops by the way.\n\n0:45:32\tSPEAKER_01\n It's really important to be in the belief world not to have loops.\n\n0:45:37\tSPEAKER_03\n How long does it take you to compete?\n\n0:45:40\tSPEAKER_01\n No, it's much worse than that.\n\n0:45:43\tSPEAKER_01\n Things don't converge. It's not well defined if they're loops.\n\n0:45:47\tSPEAKER_01\n You just... You have to...\n\n0:45:48\tSPEAKER_01\n There are all sorts of ways of breaking it up so that there isn't...\n\n0:45:54\tSPEAKER_03\n Okay.\n\n0:45:55\tSPEAKER_03\n This is not a loop yet. I'm just saying we...\n\n0:45:59\tSPEAKER_06\n But the good thing is we could have loopy belief propagation, which we all love.\n\n0:46:06\tSPEAKER_01\n Okay. So anyway, so that's another decision. What's another decision you like?\n\n0:46:13\tSPEAKER_03\n Okay. These have no parents yet, but I guess it sort of doesn't matter.\n\n0:46:20\tSPEAKER_03\n Right?\n\n0:46:21\tSPEAKER_01\n Well, the idea is that the go there you go comes from something about the user.\n\n0:46:25\tSPEAKER_01\n This comes from something about the situation. And the...\n\n0:46:30\tSPEAKER_01\n The discourse is a mystery.\n\n0:46:32\tSPEAKER_01\n Should I just make some?\n\n0:46:33\tSPEAKER_03\n Sure, if you want.\n\n0:46:35\tSPEAKER_03\n If there's parking, maybe...\n\n0:46:38\tSPEAKER_04\n Okay.\n\n0:46:41\tSPEAKER_03\n Okay. And if he has seen it already or not...\n\n0:46:45\tSPEAKER_03\n Right.\n\n0:46:46\tSPEAKER_03\n Okay.\n\n0:46:47\tSPEAKER_03\n This discourse is something that sort of...\n\n0:46:53\tSPEAKER_03\n Should we make a key note here?\n\n0:46:55\tSPEAKER_01\n Sure.\n\n0:46:56\tSPEAKER_03\n Okay.\n\n0:47:14\tSPEAKER_03\n Okay.\n\n0:47:15\tSPEAKER_01\n Then also the discourse endpoint.\n\n0:47:20\tSPEAKER_01\n I guess it points up to you if you want to make it consistent.\n\n0:47:27\tSPEAKER_05\n Actually, is this the right way to have it where go there from the user and go there from the situation?\n\n0:47:32\tSPEAKER_05\n Just sort of don't know about each other, but they both need to go their decision.\n\n0:47:35\tSPEAKER_05\n I think so.\n\n0:47:36\tSPEAKER_05\n I mean...\n\n0:47:40\tSPEAKER_05\n Okay.\n\n0:47:42\tSPEAKER_05\n And maybe not.\n\n0:47:43\tSPEAKER_05\n It still allows for the possibility of the user model affecting our decision about whether a strike is the sort of thing which is going to keep you going.\n\n0:47:49\tSPEAKER_05\n Right.\n\n0:47:50\tSPEAKER_05\n All that kind of decision making happens at the go there node.\n\n0:47:55\tSPEAKER_01\n If you needed to do that.\n\n0:47:58\tSPEAKER_05\n If you needed to do that.\n\n0:48:00\tSPEAKER_05\n Yeah.\n\n0:48:01\tSPEAKER_05\n But okay.\n\n0:48:02\tSPEAKER_05\n I was just thinking...\n\n0:48:03\tSPEAKER_05\n I guess maybe I'm conflating that user node with possible asking of the user.\n\n0:48:07\tSPEAKER_05\n Is this strike on?\n\n0:48:10\tSPEAKER_05\n Does that affect whether or not...\n\n0:48:12\tSPEAKER_05\n Good point.\n\n0:48:13\tSPEAKER_05\n I don't know how we're going to...\n\n0:48:16\tSPEAKER_05\n Yes, that might not come out of the user model, but directly out of direction.\n\n0:48:23\tSPEAKER_01\n I get the yes, my current...\n\n0:48:25\tSPEAKER_01\n Don't you know, yes, yes, enough.\n\n0:48:30\tSPEAKER_01\n My current idea on that would be that each of these decision nodes has questions associated with it.\n\n0:48:40\tSPEAKER_01\n And the question wouldn't itself be one of these conditional things.\n\n0:48:44\tSPEAKER_01\n Given that you know there's a strike do you still want to go.\n\n0:48:47\tSPEAKER_01\n But if you told him a bunch of stuff, then you would ask him do you want to go.\n\n0:48:52\tSPEAKER_01\n But I think trying to formulate the conditional question, that sounds too much.\n\n0:48:57\tSPEAKER_01\n Right, sure.\n\n0:48:58\tSPEAKER_01\n To me.\n\n0:48:59\tSPEAKER_01\n Let's stay with us a minute because I want to do a little bit of organization before we get more in the details.\n\n0:49:05\tSPEAKER_01\n The organization is going to be that the flavor of what's going on is going to be that...\n\n0:49:14\tSPEAKER_01\n As we sort of do in detail, indeed Keith is going to worry about the various constructions that people might use.\n\n0:49:22\tSPEAKER_01\n And John O. has committed himself to being the parser wizard.\n\n0:49:27\tSPEAKER_01\n So what's going to happen is that eventually, like by the time he graduates, okay, there'll be some sort of system which is able to take the discourse in context and have outputs that can feed the rest of the belief net.\n\n0:49:50\tSPEAKER_01\n I assume everybody knows that I just want to get closer that that'll be the game then.\n\n0:49:57\tSPEAKER_01\n So the semantics that you'll get out of the discourse will be values that go into the various discourse-based decision notes.\n\n0:50:07\tSPEAKER_01\n And now some of those will get fancier like mode of transportation and stuff.\n\n0:50:11\tSPEAKER_01\n So it isn't by any means necessarily a simple thing that you want out.\n\n0:50:18\tSPEAKER_01\n So if there is, and there is mode of transportation.\n\n0:50:22\tSPEAKER_03\n There's sort of also a split if you blow this up and look at it in more detail, there is something that comes from the discourse in terms of what was actually just set, what's the utterance giving us, and then what's the discourse history.\n\n0:50:34\tSPEAKER_01\n Yeah, well, we'll have to decide how much of where that goes.\n\n0:50:41\tSPEAKER_01\n And it's not clear yet.\n\n0:50:43\tSPEAKER_01\n It could be those are two separate things. It could be that the discourse gadget itself integrates which would be my guess.\n\n0:50:50\tSPEAKER_01\n You'd have to do, see in order to do reference and stuff like that, you've got to have both the current discourse and the context to say, I want to go back there. Why don't, what does that mean?\n\n0:51:06\tSPEAKER_01\n All right.\n\n0:51:08\tSPEAKER_03\n So, but is this picture that's emerging here?\n\n0:51:14\tSPEAKER_03\n Just my wish that you have noticed already for symmetry or is it that we get for each, each decision on the very bottom, we sort of get the sub e sub d sub u and maybe a sub o for autonomy.\n\n0:51:30\tSPEAKER_03\n Meta node.\n\n0:51:31\tSPEAKER_01\n I don't know.\n\n0:51:33\tSPEAKER_01\n But it might just, it could be, this is getting into the thing I want to talk about next, which is, if that's true, how do we want to combine those or when it's true.\n\n0:51:46\tSPEAKER_03\n But this would be nice though that we only have at most four at the moment.\n\n0:51:53\tSPEAKER_03\n Yeah.\n\n0:51:54\tSPEAKER_03\n And then, eros going to each of the bottom decisions. Yeah. And four, we can handle.\n\n0:52:04\tSPEAKER_01\n No.\n\n0:52:05\tSPEAKER_01\n Well, if it's four things and each of them has four values, it turns out to be a big CPT. It's not completely impossible.\n\n0:52:16\tSPEAKER_01\n It's not beyond what the system could solve, but it's probably beyond what we could actually write down or learn.\n\n0:52:27\tSPEAKER_01\n But, you know, it's four to the fourth.\n\n0:52:32\tSPEAKER_00\n It's pretty big.\n\n0:52:34\tSPEAKER_02\n 256, as I was saying.\n\n0:52:39\tSPEAKER_01\n Yeah, I mean, it's, and I don't think it's going to, I don't think it will get worse than that, by the way.\n\n0:52:43\tSPEAKER_03\n So that's a good, didn't we decide all of these are true or false?\n\n0:52:49\tSPEAKER_01\n Forgot there, but not for the other ones, three values for endpoint already.\n\n0:52:56\tSPEAKER_06\n Yeah, I mean, you'll need actually three to the five because, well, I mean, if it has four inputs and then it itself has three values.\n\n0:53:03\tSPEAKER_06\n I mean, it can get big fast.\n\n0:53:05\tSPEAKER_03\n For endpoint? No, it's the EVA.\n\n0:53:08\tSPEAKER_03\n Yeah, down here, but this one only has two.\n\n0:53:11\tSPEAKER_06\n No, it's still has three.\n\n0:53:13\tSPEAKER_01\n It will still have three.\n\n0:53:15\tSPEAKER_01\n From each point of view, you're making the same decision.\n\n0:53:20\tSPEAKER_01\n So from the point of view of the entity.\n\n0:53:26\tSPEAKER_06\n And also, I mean, there's other places where, like, for example, consider endpoint U.\n\n0:53:31\tSPEAKER_06\n It has inputs coming from user budget, user-driven.\n\n0:53:35\tSPEAKER_01\n So even, those are not necessarily binary.\n\n0:53:38\tSPEAKER_01\n We're going to have to use some care in the knowledge engineering to not have this explode.\n\n0:53:44\tSPEAKER_01\n And in fact, I think it doesn't, in the sense that, actually, with the underlying semantics and stuff, I think it isn't like you have 256 different ways of thinking about whether this user wants to go to some place.\n\n0:54:02\tSPEAKER_01\n So we just have to figure out what the regularities are and code them.\n\n0:54:09\tSPEAKER_01\n But what I was going to suggest next is maybe we want to work on this a little longer.\n\n0:54:15\tSPEAKER_01\n But I do want to also talk about the thing that we started into now of, well, it's all fine to say all these arrows come into the same place.\n\n0:54:25\tSPEAKER_01\n What rule of combination is used there?\n\n0:54:29\tSPEAKER_01\n So these things all affected. How do they affect it?\n\n0:54:33\tSPEAKER_01\n And belief nets have their own beliefs about what are good ways to do that.\n\n0:54:41\tSPEAKER_01\n So it's clear enough what the issue is.\n\n0:54:44\tSPEAKER_01\n So we want to switch to that. Now we want to do some more of this.\n\n0:54:48\tSPEAKER_03\n Basically, we just need to sort of get some closure on this.\n\n0:54:52\tSPEAKER_03\n Figure out how we're going to get this picture sort of completely messy.\n\n0:54:58\tSPEAKER_01\n Well, here's one of the things that I don't know how easy to just do this in the interface.\n\n0:55:06\tSPEAKER_01\n But it would be great if you could actually just display at a given time all the things that you pick up, you click on endpoint, okay, and everything else fades.\n\n0:55:20\tSPEAKER_01\n And you just see the links that are relevant to that.\n\n0:55:25\tSPEAKER_01\n And do anybody remember the GUI on this?\n\n0:55:29\tSPEAKER_02\n I would only say that the way to do that would be to open up or make, you know, and many belief nets and then open them every time you wanted to look at a different one versus that.\n\n0:55:39\tSPEAKER_03\n It's very easy to do it in HTML.\n\n0:55:43\tSPEAKER_06\n Yeah, but HTML.\n\n0:55:46\tSPEAKER_03\n Yeah, each of these things, each of the end leaflets be a patron and you click on the thing and then.\n\n0:55:52\tSPEAKER_01\n Yeah, anyway, so it's clear that even with this, if we put in all the arrows, nobody's going to be able to read the diagram.\n\n0:56:04\tSPEAKER_01\n Yeah.\n\n0:56:05\tSPEAKER_01\n All right, so we have to figure out some basically display hack or something to do is because, anyway, let me suggest that's not a first order consideration.\n\n0:56:16\tSPEAKER_01\n We have two first order considerations, which is what are the influences A and B, how do they get combined mathematically?\n\n0:56:25\tSPEAKER_02\n How do we display them as an issue, but?\n\n0:56:29\tSPEAKER_02\n I don't, yeah, I just don't think this has been designed to support something like that.\n\n0:56:34\tSPEAKER_06\n Yeah, I mean, it might soon, if this is going to be used in a serious way like JavaBase, then it might soon be necessary to start modifying it.\n\n0:56:42\tSPEAKER_06\n Right.\n\n0:56:43\tSPEAKER_01\n So, that's what we're going to do with our purposes.\n\n0:56:46\tSPEAKER_01\n Yeah, and that seems like a perfectly feasible thing to get into, but we have to know what we want first.\n\n0:57:09\tSPEAKER_01\n So, there's a little bit about decision nodes and what the choices might be for these.\n\n0:57:16\tSPEAKER_02\n You can technically wear that as you're talking.\n\n0:57:19\tSPEAKER_02\n Yeah.\n\n0:57:20\tSPEAKER_04\n I guess this board works fine.\n\n0:57:42\tSPEAKER_06\n So, recall the basic problem, which is that you have a belief net and you have a lot of different nodes, all contributing to one node.\n\n0:58:04\tSPEAKER_06\n Right. So, as you discussed, specifying this kind of thing is a big pain and it will take a long time to write down, because for example, if these have three possibilities each and this has three possibilities, then you have 243 possibilities, which is already a lot of numbers to write down.\n\n0:58:23\tSPEAKER_06\n So, what helps us in our situation is that these all have values in the same set.\n\n0:58:33\tSPEAKER_06\n Right. These are all like saying EV or A. Right.\n\n0:58:36\tSPEAKER_06\n So, it's not just a generalized situation.\n\n0:58:39\tSPEAKER_06\n I mean, basically, we want to just take a combination of, we want to view each of these as experts, each of them is making a decision based on some factors, and we want to sort of combine their decisions and create, you know.\n\n0:58:55\tSPEAKER_06\n Sort of a weighted combination.\n\n0:58:58\tSPEAKER_03\n The rover decision.\n\n0:58:59\tSPEAKER_06\n The what decision?\n\n0:59:00\tSPEAKER_03\n rover. All of their outputs combined.\n\n0:59:05\tSPEAKER_06\n Yeah. Yeah. So, the problem is to specify the, so the conditional probability of this given all those.\n\n0:59:15\tSPEAKER_06\n Right. That's the way belief nets are defined, like each node given its parent.\n\n0:59:19\tSPEAKER_06\n Right. So, that's what we want.\n\n0:59:22\tSPEAKER_06\n We want, for example, p of, let's call this guy y, and let's call these x1, x2, xn.\n\n0:59:29\tSPEAKER_06\n Right. So, we want probably that y equals, you know, for example, e, given that these guys are, as it's referred to this as like x, hat or something, like all of them, given that, for example, say this is, you know, a, v, a, e, or something.\n\n0:59:50\tSPEAKER_06\n Right.\n\n0:59:51\tNone\n Yep.\n\n0:59:51\tSPEAKER_06\n So, we would like to do this kind of combination.\n\n0:59:53\tSPEAKER_01\n All right. So, is that, I want to make sure everybody is with us before he goes on.\n\n1:00:05\tSPEAKER_01\n It's clear. Is it clear what he wants to compute?\n\n1:00:10\tSPEAKER_06\n So, right. So, basically, what we don't want to do is to, for every single combination of e and v and a, and every single letter e is given number, because that's obviously not desirable.\n\n1:00:24\tSPEAKER_06\n What we want to do is find some principle way of saying what each of these is, and we want it to be a valid probability distribution.\n\n1:00:32\tSPEAKER_06\n So, we want it to add up to one, right.\n\n1:00:36\tSPEAKER_06\n So, those are the two things that we need.\n\n1:00:39\tSPEAKER_06\n So, what, I guess what Jerry suggested earlier was basically that we, you know, view these guys' voting, and we just take the, we essentially take averages, right.\n\n1:00:56\tSPEAKER_06\n So, for example, here are two people of word for a.\n\n1:00:59\tSPEAKER_06\n One is word for v and one is word for e.\n\n1:01:01\tSPEAKER_06\n So, we could say that the probabilities are, you know, probably being e is 1 over 4, because one person word for e are 4.\n\n1:01:10\tSPEAKER_06\n And similarly, probably if, so this is probability of e, and then probably of a given all that is 2 out of 4.\n\n1:01:19\tSPEAKER_06\n And probably if v is 1 out of 4.\n\n1:01:24\tSPEAKER_06\n Right. So, that's, step, that's the, yeah, that's the basic thing.\n\n1:01:30\tSPEAKER_03\n Now, is that all the way?\n\n1:01:34\tSPEAKER_03\n So, step 1 outcome, that's, what?\n\n1:01:37\tSPEAKER_03\n If x, x 1 voted for a, x 2 voted for v, and so forth.\n\n1:01:43\tSPEAKER_01\n Right. Yeah.\n\n1:01:44\tSPEAKER_01\n So, this is sum symmetry and equal weights and all those sort of things, which may or may not be a good assumption.\n\n1:01:51\tSPEAKER_06\n So, that, yeah.\n\n1:01:52\tSPEAKER_06\n So, step 2 is, right.\n\n1:01:54\tSPEAKER_06\n So, we've assumed equal weights, whereas it might turn out that, you know, some, we, that, for example, what the, the actual, the verbal content of what the person said, like what, what might be, somehow more important than the, x 1 matters more in the next, sure.\n\n1:02:12\tSPEAKER_06\n Sure. So, we don't want to, like, give them all equal weights.\n\n1:02:14\tSPEAKER_06\n So, currently we've been giving them all weight 1, 4th.\n\n1:02:17\tSPEAKER_06\n So, we could replace this by, uh, w 1, w 2, w 3, and w 4.\n\n1:02:23\tSPEAKER_06\n Right. And in order for this to be a valid probability distribution for each, um, x hat, we just need that the w sum to 1.\n\n1:02:31\tSPEAKER_06\n So, they can be, for example, you know, you could have 0.1, 0.3, 0.2, and 0.4.\n\n1:02:39\tSPEAKER_06\n See.\n\n1:02:40\tSPEAKER_04\n That's 1.\n\n1:02:41\tSPEAKER_06\n And that would be 1.\n\n1:02:43\tSPEAKER_06\n So, that, um, also seems to work fine.\n\n1:02:47\tSPEAKER_02\n And, um, so it just, just to make sure I understand this, so in this case, um, we would still compute the average.\n\n1:02:56\tSPEAKER_02\n So, the probability of e would be, uh, so in this case, the probability that y equals a would be, uh, w 1 times, or a, or, let's say, 1, 4, quarter times 0.1.\n\n1:03:11\tSPEAKER_06\n Not 1 quarter. So, these numbers have been replaced with 0.1, 0.3, 0.2, and 0.4.\n\n1:03:16\tSPEAKER_06\n So, you can view this as gone.\n\n1:03:19\tSPEAKER_06\n Okay.\n\n1:03:20\tSPEAKER_01\n So, in this case, it would be, probably, a value of a would be 0.3.\n\n1:03:27\tNone\n Probably.\n\n1:03:28\tNone\n If v would be 0.3, and the probability of v would be 0.4.\n\n1:03:31\tSPEAKER_00\n Okay.\n\n1:03:32\tSPEAKER_06\n Yeah.\n\n1:03:33\tSPEAKER_06\n Okay.\n\n1:03:34\tSPEAKER_06\n So, all right.\n\n1:03:36\tSPEAKER_06\n So, this is a step two.\n\n1:03:38\tSPEAKER_06\n So, the next possibility is that, um, we've given just a single weight to each expert, right?\n\n1:03:44\tSPEAKER_06\n Whereas it might be the case that, um, in certain situations, one of the experts is more reliable, and in certain situations, the other expert is more reliable.\n\n1:03:53\tSPEAKER_06\n So, the way this is handled is by what's called a mixture of experts.\n\n1:03:58\tSPEAKER_06\n So, what you can have is, you augment this diagram slightly.\n\n1:04:06\tSPEAKER_06\n So, you have a new thing called H. Okay.\n\n1:04:13\tSPEAKER_06\n This is a hidden variable.\n\n1:04:18\tSPEAKER_06\n And what this is, is, it gets as input from x1, x2, x3, and x4.\n\n1:04:23\tSPEAKER_06\n And what it does is it decides which of the experts is to be trusted in this particular situation.\n\n1:04:28\tSPEAKER_06\n Right?\n\n1:04:29\tSPEAKER_06\n And then, these guys all come here.\n\n1:04:38\tSPEAKER_06\n So, this is slightly more complicated.\n\n1:04:40\tSPEAKER_06\n So, what's going on is that, um, this H node looks at these four values of those guys.\n\n1:04:46\tSPEAKER_06\n And it decides, in, given these values, which of these, isn't likely to be more reliable or most reliable.\n\n1:04:53\tSPEAKER_06\n So, H produces some, you know, it produces a number, either one, two, three, or four, in our situation, right?\n\n1:04:59\tSPEAKER_06\n Now, this guy, he looks at the value of H, say it's two, and then he just selects the, uh, thing.\n\n1:05:06\tSPEAKER_06\n Yeah. So, that's one thing you can do.\n\n1:05:09\tSPEAKER_06\n So, here we go on and say, you can say, you can say, you can say, you can say, I guess, about it.\n\n1:05:12\tSPEAKER_01\n What is it? Because the other thing you can do is you, so this, in this case, a mixture of x3, or just a mixture of x4.\n\n1:05:18\tSPEAKER_06\n Right. So, you can have a mixture of that.\n\n1:05:20\tSPEAKER_06\n So, what you can do, if you need it, is to say that, in here, there's a fourth frame.\n\n1:05:26\tSPEAKER_01\n There's a fifth frame, okay, which is the eighth frame.\n\n1:05:30\tSPEAKER_01\n So, let's suppose the H says, in such, let me do alpha.\n\n1:05:35\tSPEAKER_01\n Okay. In situation alpha, that's the waiting vector.\n\n1:05:38\tSPEAKER_01\n But in situation beta, is the other waiting vector.\n\n1:05:42\tSPEAKER_01\n So, you still, you might need to wait, but the weights aren't always the same.\n\n1:05:47\tSPEAKER_01\n That this guy, uh, detects for you, that this is a situation in which you should wait as more or less.\n\n1:05:54\tSPEAKER_05\n So, the function of the thing that comes out of H is very different from the function of the other input.\n\n1:05:59\tSPEAKER_05\n Right. It's actually, it's driving how the other four are interpreting.\n\n1:06:02\tSPEAKER_01\n It's, it's conditioning how the other four are.\n\n1:06:05\tSPEAKER_01\n Yeah. So, in what people do in another literature is learn, don't stop.\n\n1:06:10\tNone\n So, you learn the weights, you can learn the expert, etc.\n\n1:06:14\tSPEAKER_01\n If you have not dated, then make perfect good sense to do that.\n\n1:06:18\tSPEAKER_02\n So, H passes a vector on to the next node?\n\n1:06:21\tSPEAKER_02\n It could, it could.\n\n1:06:22\tSPEAKER_02\n No, I know, it could, could just pass a vector of the weights is, yeah, it could.\n\n1:06:25\tSPEAKER_01\n No, not normally, it would just pass to the selected.\n\n1:06:29\tSPEAKER_01\n So, it could pass either...\n\n1:06:31\tSPEAKER_05\n Well, a vector with three zeroes and one one.\n\n1:06:33\tSPEAKER_01\n Well, it could, yeah, it could, yeah, it could do that.\n\n1:06:37\tNone\n Okay. Uh, you know, uh, uh, a binary max.\n\n1:06:41\tSPEAKER_02\n Oh, it's basically to tell the bottom node which one of the situations that's in?\n\n1:06:45\tSPEAKER_02\n Or which one of the weighting systems?\n\n1:06:48\tSPEAKER_02\n Right. So, I would just, if you wanted to do it, you just...\n\n1:06:51\tSPEAKER_02\n I mean, the way you do it, or the one, you could pass a weighting system, though, too.\n\n1:06:54\tSPEAKER_01\n I think what...\n\n1:06:56\tSPEAKER_01\n That's not, that's harder than to just say there are discrete numbers,\n\n1:07:01\tNone\n in this situation, and this says, you know, in your situation alpha. Um, because each have to have another input to tell it alpha, beta, whatever.\n\n1:07:10\tSPEAKER_05\n Or is the, that's determined by what the experts are saying, like the type of...\n\n1:07:14\tSPEAKER_05\n Yeah.\n\n1:07:15\tSPEAKER_05\n Okay.\n\n1:07:16\tSPEAKER_01\n Well, this definitely could have other, it absolutely could have other inputs from something\n\n1:07:21\tNone\n that has, how they can directly do with these experts. And it's actually often done.\n\n1:07:26\tSPEAKER_05\n So, I mean, it just seems that, like, without that, that outside input, you've got a situation where, you know, like, if, if, uh, X1 says no, you know, a low value coming out of X1, or if X1 says no, then ignore X1, you know, I mean, that seems like...\n\n1:07:41\tSPEAKER_06\n Yeah, well, it could be things like if X2 and X3C, yes, then ignore X1 also.\n\n1:07:45\tSPEAKER_05\n Oh, okay.\n\n1:07:46\tSPEAKER_05\n Or X2 is greater than X1.\n\n1:07:48\tSPEAKER_01\n It could have imagined it all towards the perfect.\n\n1:07:50\tSPEAKER_01\n All right.\n\n1:07:51\tSPEAKER_01\n So, these, so this is, this is one collection of technology that we could bring to the back of the app.\n\n1:08:01\tSPEAKER_02\n The situations that H has, are they built into the net or...\n\n1:08:06\tSPEAKER_02\n Okay.\n\n1:08:07\tSPEAKER_02\n So, they could either be hand coded or learned or...\n\n1:08:10\tSPEAKER_02\n Yeah.\n\n1:08:11\tNone\n Okay.\n\n1:08:12\tSPEAKER_02\n Based on training data, okay.\n\n1:08:17\tSPEAKER_01\n And there were some, some, some, actually, Michael Jordan did a lot of nice work in the earlier, on,\n\n1:08:23\tNone\n the situation which you could actually train and stuff and stuff. I don't think we're going to be in a situation where, realistic, we're going to have enough data to actually train these things.\n\n1:08:36\tNone\n Any time soon.\n\n1:08:38\tNone\n But, it still thinks a nice idea of the architecture is a force.\n\n1:08:44\tNone\n So, you know, you say here's the sign and, and, and, and, and, and, update, it comes along.\n\n1:08:50\tNone\n You could, you could, you could, you could, you could, you could do that.\n\n1:08:55\tNone\n I still have some of the things that I'm very, very, very, very, very, very, and, I don't know.\n\n1:09:04\tSPEAKER_03\n So, this is two for the case that X1 born at 4A, it's the word, but, yes.\n\n1:09:11\tSPEAKER_03\n Now, X1 puts the potentially awesome board key.\n\n1:09:16\tSPEAKER_01\n That would be another sort of thing.\n\n1:09:18\tSPEAKER_01\n Absolutely.\n\n1:09:19\tSPEAKER_02\n So, you specify one of these things for every one of those possible situations.\n\n1:09:23\tSPEAKER_01\n No, because, no, because you've got a general rule.\n\n1:09:28\tSPEAKER_01\n Oh, yeah.\n\n1:09:29\tSPEAKER_01\n You see, the point is rather especially on the combination, you could, you could, you could, you know, you've got a general rule that says, let's just take the average.\n\n1:09:35\tSPEAKER_01\n It doesn't matter who specifies one, we're just going to count the number of votes for each of the real three.\n\n1:09:42\tSPEAKER_01\n So, you know, like an actual combative.\n\n1:09:47\tNone\n So, that, that was the first thing about the first thing.\n\n1:09:50\tNone\n Forget who voting, let's just count the number of votes.\n\n1:09:53\tNone\n You know, you think about that much, much, much better.\n\n1:09:57\tSPEAKER_04\n Okay, so, the whole problem is, yeah.\n\n1:10:02\tSPEAKER_01\n And so, what he's saying here is, well, maybe that's right, but then you, you still, you can still get by without specifying all the combinations by saying, well, there are a few different situations in which you want to do a different one.\n\n1:10:16\tSPEAKER_01\n Or, you know, a different one.\n\n1:10:18\tSPEAKER_01\n Now, we might be able to learn, that was probably already possible that we could learn waiting on, you know, this, these, these gubby's.\n\n1:10:29\tSPEAKER_06\n Well, I mean, to learn them, we need data, where are we going to get data?\n\n1:10:35\tSPEAKER_01\n Well, so that's what's going on with this.\n\n1:10:40\tSPEAKER_06\n Well, I mean, we need data about people's intentions, right?\n\n1:10:43\tSPEAKER_01\n Which is slightly tricky.\n\n1:10:45\tSPEAKER_01\n I'm not so sure. So, we're having these people come in and have these dialogues.\n\n1:10:48\tSPEAKER_01\n Right.\n\n1:10:49\tSPEAKER_01\n Okay, that's what I just do it.\n\n1:10:54\tNone\n Okay, far here.\n\n1:10:56\tSPEAKER_01\n So, so we're going to get them. So they have some data.\n\n1:11:00\tSPEAKER_01\n They've taken before.\n\n1:11:03\tNone\n And, really able.\n\n1:11:06\tSPEAKER_06\n But what's the data about like, are we able to get these nodes from the data?\n\n1:11:10\tNone\n I think so.\n\n1:11:12\tSPEAKER_05\n Like how thrifty the user is, don't do we have access to that?\n\n1:11:15\tSPEAKER_01\n No, but you don't need that. This is just combining, this is simple. This is a very important point.\n\n1:11:21\tSPEAKER_01\n All you're saying here is give it these considerations from the user, the text, you know, what he says, and the kind of object, which is the best predictor of either he's going to use one of these nodes.\n\n1:11:33\tSPEAKER_01\n It doesn't say, how is it that you make that decision based on user or for that matter on the input line?\n\n1:11:42\tSPEAKER_01\n So there's a whole issue of how the hell do you do that and what constructions tell you from the input that you think he wants to handle?\n\n1:11:50\tSPEAKER_01\n All this says it is give it, we think these things are independent, which I think they are.\n\n1:11:57\tSPEAKER_01\n How do you wait?\n\n1:12:00\tSPEAKER_01\n Can we create an update for that?\n\n1:12:02\tSPEAKER_06\n Yeah, but that's my question. Like how do we, I mean, how do we have data about something like endpoint sub-e or endpoint sub?\n\n1:12:11\tSPEAKER_02\n Well, this is based on this dialogue that we have, which one of the things that they said, whether it was the entity relations or whatever, was the thing that determined what mode it was, right?\n\n1:12:23\tSPEAKER_01\n So it could be, for example, that you should really wait the intent, what you got to dialogue very strongly, because he said I want to enter it.\n\n1:12:34\tSPEAKER_01\n So, for example, it could be that our dialogue processing is not all that good, and that you shouldn't give it a high way. We just aren't good enough yet to get it in line.\n\n1:12:43\tSPEAKER_01\n And it may be that in this model, what it could be is that the autology information should be weighted quite highly.\n\n1:12:59\tSPEAKER_01\n The autology plus the situation information is basically what determines it.\n\n1:13:05\tSPEAKER_01\n Because in the kind of thing you could answer your US situation where it's possible to enter, and if those things are true and you've talked about it, it would be actually one ender.\n\n1:13:18\tNone\n I don't know.\n\n1:13:20\tSPEAKER_06\n So this is what we want to learn.\n\n1:13:45\tNone\n So, maybe we could do it over time that you have to.\n\n1:13:51\tSPEAKER_01\n The more important thing is to have an architecture in which, if you have more information as the designer you can add it, and if you get an update in so that you could turn a learning crank on it, the architecture supports that.\n\n1:14:08\tNone\n So, I think the language...\n\n1:14:15\tSPEAKER_03\n You're learning hard days, and you're going to walk around for this system, try to learn all the parking situations, and realize the trimester's approach.\n\n1:14:24\tSPEAKER_03\n And then they connect you down that and then you go.\n\n1:14:28\tNone\n So, there are, yeah, there's this geography, part of the entire version, has people doing busy on things like this.\n\n1:14:43\tSPEAKER_01\n Anyway, so this is one of these. Another one we talked about is the destruction. So this says these are all empty.\n\n1:14:58\tSPEAKER_01\n Oh, this is one over here about exhibiting, selling, fixing, et cetera. So this was not a situation where you would expect some weighted factors if it's a place that exhibits or sell, or repairs, or whatever, if they're commercial selling.\n\n1:15:17\tSPEAKER_01\n So it'll be some of which you want to disjunction. There will be some of which you probably have to actually lay out the product with the, you know, actions really lay out to do the hopefully will be those, you can think of it as small.\n\n1:15:32\tNone\n But that's, you know, the actual decision-making.\n\n1:15:37\tNone\n So, I'm going to do it.\n\n1:15:48\tSPEAKER_04\n So, and is there, and is there another one which we, if it turned out that there was something to do with this contract, you know, that you always think that we could be familiarized with sure that that's fine.\n\n1:16:09\tSPEAKER_06\n I don't think, well, you have a, can you bring up the function thing?\n\n1:16:22\tSPEAKER_06\n Where is the thing that allows you to sort of, that's only added variables, isn't it? Oh, a function property is decided. I guess not.\n\n1:16:40\tSPEAKER_06\n Yeah, that's. Right. Okay. And it, so either it'll allow us to do everything which I think is unlikely. I think more likely it allows to do very few of these things.\n\n1:17:03\tSPEAKER_06\n And in that case, we'll have to just write up little things that allow you to create such CPDs on your own in the Java-based format.\n\n1:17:12\tNone\n So, I think, yeah, I think the one with, what, here's what's tricky about it. It is that the, this is not only in Swayberg, this is actually a system that's all of these methods. And you can't just drop one of these in and expect all of its solution algorithms, because, oh, good.\n\n1:17:31\tSPEAKER_01\n And if it isn't, if it isn't, the problem of putting it is, it's not something you want to do. But you have to get into the guts of propagation algorithms.\n\n1:17:48\tNone\n And that, that, I would think it's possible. I mean, what Bofi was saying is, you can always convert into a CPD. You can have one macro that takes whatever role you have.\n\n1:18:01\tSPEAKER_06\n And then the system is going to have to go through its standard. I was assuming that's what we always do, because, yeah, I was assuming that's what we'd always do. It's.\n\n1:18:21\tSPEAKER_01\n So, and then the other question is, is this display question? Maybe you can check that out. What we can, you can look at this before.\n\n1:18:42\tSPEAKER_02\n How is, what are the options? Highly, is there some way to just see parts of things? How, how is it going to do it?\n\n1:18:54\tSPEAKER_02\n Well, in terms of Java based, I think it's basically what you see is what you get. And I don't, yeah, I would be surprised if it supports anything more than what we have right here.\n\n1:19:15\tNone\n And it doesn't matter. I mean, it does have enough space. It seems that you can stretch it out. Oh, you can make it very big. So that's not the problem. The problem I was interested in was, we all know that we can just argue and discuss it.\n\n1:19:32\tSPEAKER_03\n We should discuss from each detail and future control of free up new stuff. And in this, we would consider it as your final decision. And as we ended up at time with this, it was not simpler.\n\n1:19:47\tSPEAKER_03\n because you're just\n\n1:20:04\tNone\n You know, the other people are so much different. You're the one who really does have the understanding of the new.\n\n1:20:16\tNone\n And what the planning system is going to need is...\n\n1:20:21\tSPEAKER_01\n So we've done this guys coming in Germany next week.\n\n1:20:44\tSPEAKER_01\n So we'll probably be meeting you all in the last week as focus on the next guy ahead.\n\n1:20:51\tSPEAKER_01\n So we're really looking at how he manages the new.\n\n1:20:54\tNone\n So we're going to be doing probably...\n\n1:20:57\tNone\n We probably are talking about smart phones.\n\n1:20:59\tNone\n Parts in general.\n\n1:21:01\tNone\n So throughout the end of the smart phone operating, I understand that the media is promoted as a striped keyboard.\n\n1:21:15\tNone\n And that's why it's quite a lot of the picture of the system.\n\n1:21:19\tNone\n It's not too action-finding and the issue.\n\n1:21:22\tNone\n So the...\n\n1:21:25\tNone\n I think we're going to have him here on Monday.\n\n1:21:29\tNone\n And see what we do.\n\n1:21:32\tSPEAKER_03\n We really want to talk to them about the parsing issues.\n\n1:21:36\tSPEAKER_03\n And maybe we can expect out of the parsing issues.\n\n1:21:39\tSPEAKER_03\n We don't understand.\n\n1:21:41\tNone\n And maybe a lot of us are thinking about future work.\n\n1:21:45\tNone\n We're not in the business.\n\n1:21:47\tSPEAKER_03\n Wouldn't that be a goal to try to persuade them to abandon the way they're parsed\n\n1:21:51\tNone\n and some things for people and all these discussion-based work in the future? One of the questions is that.\n\n1:21:59\tNone\n What I think we want to do is get the first set of results and then show them.\n\n1:22:08\tNone\n Yeah.\n\n1:22:09\tSPEAKER_03\n So, in the missionary work only after you've done the system on a miracle.\n\n1:22:13\tSPEAKER_05\n Yeah.\n\n1:22:14\tSPEAKER_01\n That's my view of the...\n\n1:22:16\tSPEAKER_01\n The mirror of the smart mirror.\n\n1:22:22\tSPEAKER_05\n So...\n\n1:22:23\tSPEAKER_05\n By the way, I'm just talking about that general end of things.\n\n1:22:28\tSPEAKER_05\n Is there going to be data soon from what people say when they're interacting with the system and so on?\n\n1:22:33\tSPEAKER_05\n Like, I mean, what kind of questions are we going to be asking?\n\n1:22:36\tSPEAKER_05\n Okay.\n\n1:22:37\tSPEAKER_05\n Yeah, yeah.\n\n1:22:38\tNone\n The new data is on the website.\n\n1:22:42\tNone\n Okay.\n\n1:22:43\tNone\n You can just move by a lot.\n\n1:22:45\tNone\n And I hope the pay is working on this.\n\n1:22:49\tNone\n But I haven't heard from...\n\n1:22:51\tNone\n We have someone who's supposedly gathering us 50 or so.\n\n1:22:54\tNone\n Okay, you mean?\n\n1:22:59\tNone\n Okay.\n\n1:23:00\tNone\n Okay.\n\n1:23:01\tNone\n Okay.\n\n1:23:02\tNone\n Okay.\n\n1:23:03\tNone\n Okay.\n\n1:23:04\tNone\n Okay.\n\n1:23:05\tSPEAKER_05\n Okay.\n\n1:23:06\tNone\n Okay.\n\n1:23:07\tSPEAKER_05\n I'm just wondering because in terms of, you know, I mean, the figure...\n\n1:23:14\tSPEAKER_05\n I was thinking about this figure that we talked about 50 constructions or whatever.\n\n1:23:17\tSPEAKER_05\n That's a whole lot of constructions.\n\n1:23:19\tSPEAKER_05\n You bet.\n\n1:23:24\tSPEAKER_05\n And, you know, I mean, one might be fairly pleased with getting a really good analysis of five, maybe 10 in a summer.\n\n1:23:28\tSPEAKER_05\n So, I mean, I know we're going for sort of a...\n\n1:23:32\tSPEAKER_01\n Rough and rate is...\n\n1:23:35\tNone\n Including the little trigum of the appraisal.\n\n1:23:39\tNone\n It's not...\n\n1:23:41\tNone\n We're not going to talk about 50...\n\n1:23:44\tNone\n Okay.\n\n1:23:49\tNone\n So, you want the composition.\n\n1:23:51\tSPEAKER_05\n So, in order to do 10 potential constructions, I agree that we do 5.\n\n1:23:55\tSPEAKER_05\n You're going to need phrasal constructions or the VPs smaller.\n\n1:23:58\tSPEAKER_05\n Okay.\n\n1:23:59\tSPEAKER_05\n I mean, I was talking about the...\n\n1:24:02\tSPEAKER_05\n You know, if you wanted to do it really into tail, and we don't really need all the detail for what we're doing right now.\n\n1:24:06\tSPEAKER_01\n But anyway, in terms of just narrowing that task, you know, which 50 do I do?\n\n1:24:10\tSPEAKER_01\n I want to see what people are using, so.\n\n1:24:12\tSPEAKER_01\n And, you know, they inspire me.\n\n1:24:15\tNone\n Yeah, I agree.\n\n1:24:16\tNone\n I agree.\n\n1:24:17\tSPEAKER_04\n Do we only want some blend of what people use and what you actually do?\n\n1:24:20\tSPEAKER_04\n Right, sure.\n\n1:24:21\tNone\n We're going to be able to do this.\n\n1:24:23\tSPEAKER_03\n We're probably not going to have to take this because it can't be...\n\n1:24:27\tSPEAKER_03\n Right.\n\n1:24:28\tSPEAKER_03\n Yeah, sure.\n\n1:24:29\tSPEAKER_03\n Did you raise for sure?\n\n1:24:30\tSPEAKER_03\n Were they spontaneous people?\n\n1:24:32\tSPEAKER_05\n Yeah.\n\n1:24:33\tSPEAKER_05\n Okay.\n\n1:24:34\tSPEAKER_05\n Right.\n\n1:24:35\tSPEAKER_05\n Okay.\n\n1:24:36\tNone\n Okay.\n\n1:24:38\tNone\n Okay.\n\n1:24:45\tSPEAKER_01\n So, in terms of this thing, I believe that I've never seen this.\n\n1:25:11\tNone\n Let's see.\n\n1:25:41\tNone\n You\n\n", "summary": [{"summary_text": "Today, Speaker and Keaton are going to do their stuff and drumming. Speaker is trying to build the links to influence the decisions that are relevant to him. Keaton is putting the microphone on backwards. Speak is reading the Transcript L85 57367."}]}