{"filename": "./data/Bed011.txt", "transcript": "0:00:00\tSPEAKER_04\n No, can you give me the\n\n0:00:06\tSPEAKER_01\n three, two, five, four, one, six, zero, zero, three, nine, six, seven, eight, five, three, two, seven, three, three, one, seven, nine, three, nine, five, seven, six, two, one, two, one, six, four, seven, zero, nine, three, four, three, six, one, four, nine, zero, one, six, zero, six, four,\n\n0:00:46\tSPEAKER_00\n OK, so, can you read your numbers? Zero, one, nine, four, five, zero, five, eight, five eight, nine, four, two, eight, eight, seven, three, seven, four, seven, six, five, one, seven, eight, eight, three, nine, four, one, three, zero, two, 9, 2, 8, 1, 3, 4, 5, 6, 5, 6, 6, 7, 8, 6, 8, 8, 7, 5, 6, 8, 9, 5, 6, 8, 9, 5, 4, 0, 8, 8, 7, 7, 9, 9, 4, 9, 3, 9, 4, 7, 0, 1, 7, 8, 0, 1, 4, 3.\n\n0:01:28\tSPEAKER_02\n Yeah, let's get started. Hopefully Nassio come as not, she won't.\n\n0:01:40\tSPEAKER_06\n Robert, do you have any way to turn off your screen saver on there so that it's not going off every, it seems to have about a two minute?\n\n0:01:49\tSPEAKER_04\n Yeah, it's not that I didn't try.\n\n0:01:53\tSPEAKER_04\n And I told it to stay on forever and ever but if it's not plugged in it just doesn't obey my commands.\n\n0:01:59\tSPEAKER_04\n Okay.\n\n0:02:00\tNone\n Has a mind.\n\n0:02:01\tSPEAKER_04\n Got it, but I just sort of keep on wailing.\n\n0:02:09\tSPEAKER_04\n We just be working on it as intensely so it doesn't happen.\n\n0:02:14\tSPEAKER_04\n We'll see.\n\n0:02:15\tSPEAKER_04\n Should we plunge right into it?\n\n0:02:19\tSPEAKER_02\n Yeah, I think so.\n\n0:02:21\tSPEAKER_04\n So what I've tried to do here is list all the decision notes that we have identified on this side, commented and what they're about in sort of the properties we may give them.\n\n0:02:38\tSPEAKER_04\n And here are the tasks to be implemented via our data collection.\n\n0:02:48\tSPEAKER_04\n So all of these tasks, the reading is all of these tasks more or less imply that the user wants to go there, sometimes for the other.\n\n0:03:01\tSPEAKER_04\n And inadequately for example here we have our Eva intention and these are the data tasks where we can assume the person would like to enter view or just approach the thing analogously the same on the object information.\n\n0:03:23\tSPEAKER_04\n We can see that we have sort of created these tasks before we came up with our decision notes.\n\n0:03:29\tSPEAKER_04\n So there's a lot of things where we have no analogous tasks and that may or may not be a problem.\n\n0:03:38\tSPEAKER_04\n So we've changed the tasks slightly if we feel that we should have data for sort of for every decision notes trying to implant the intention of going to a place now, going to place later on the same tool, trying to plan the intention of going sometime on the next tour or the next day or whenever.\n\n0:04:04\tSPEAKER_04\n I think that might be overdoing it.\n\n0:04:06\tSPEAKER_02\n So let me pop up a level and make sure that we're all oriented the same.\n\n0:04:15\tSPEAKER_02\n So what we're going to do today is two related things.\n\n0:04:21\tSPEAKER_02\n One of them is to work on the semantics of the belief net which is going to be the main inference engine for the system making decisions and decisions are going to turn out the B parameter choices for calls on other modules.\n\n0:04:47\tSPEAKER_02\n So the natural language understanding thing is we think we only have to choose parameters but a fairly large set of parameters.\n\n0:04:57\tSPEAKER_02\n So to do that we need to do two things, one of which is figure out what all the choices are which we've done a fair amount.\n\n0:05:07\tSPEAKER_02\n Then we need to figure out what influences choices and finally we have to do some technical work on the actual belief relations and presumably estimates of the probabilities and stuff.\n\n0:05:16\tSPEAKER_02\n We are going to do the probabilities stuff today.\n\n0:05:20\tSPEAKER_02\n Technical stuff will do another day probably next week.\n\n0:05:25\tSPEAKER_02\n We are going to worry about all the decisions and the things that contribute to them.\n\n0:05:33\tSPEAKER_02\n And we're also sort of in the same process going to work with FAY on what there should be in the dialogues.\n\n0:05:41\tSPEAKER_02\n So one of the steps that's coming up real soon is to actually get subjects in here and have them actually record like this, record dialogues more or less.\n\n0:05:58\tSPEAKER_02\n And depending on what FAY sort of provokes them to say we'll get information on different things.\n\n0:06:07\tSPEAKER_02\n So if you get people who defraise them and so for Keith and people worrying about what constructions people use we have some ways to affect that by the way the dialogues go.\n\n0:06:23\tSPEAKER_02\n So what Robert kindly did is to lay out a table of the kinds of things that that might come up and the kinds of decisions.\n\n0:06:39\tSPEAKER_02\n So on the left are decision nodes and discrete values.\n\n0:06:48\tSPEAKER_02\n So if we're right you can get by with just this middle column worth of decisions and it's not all that many and it's perfectly feasible technically to build belief nets that we'll do that.\n\n0:07:03\tSPEAKER_02\n Andy has a handout.\n\n0:07:05\tSPEAKER_04\n Yeah maybe it was too fast plunging in there because we have two updates.\n\n0:07:10\tSPEAKER_04\n You can look at this if you want.\n\n0:07:12\tSPEAKER_04\n These are what are subjects going to have to fill out.\n\n0:07:16\tSPEAKER_04\n Any comments are thinking can still be made and the changes will be put in correspondingly.\n\n0:07:21\tSPEAKER_04\n Let me summarize in two sentences mainly for EWAS benefit who probably has not heard about the data collection.\n\n0:07:27\tSPEAKER_04\n Or have you heard about it?\n\n0:07:29\tSPEAKER_04\n No.\n\n0:07:30\tSPEAKER_04\n Okay we're going to put this in front of people.\n\n0:07:32\tSPEAKER_04\n They give us some information on themselves.\n\n0:07:35\tSPEAKER_04\n Then they will read a task where lots of German words are sort of thrown in between.\n\n0:07:43\tSPEAKER_04\n And they have to read isolated proper names.\n\n0:07:47\tSPEAKER_04\n And these are.\n\n0:07:48\tSPEAKER_04\n I don't see a release.\n\n0:07:49\tSPEAKER_02\n No this is not a release form.\n\n0:07:50\tSPEAKER_02\n This is a speaker.\n\n0:07:51\tSPEAKER_02\n Okay fine.\n\n0:07:52\tSPEAKER_04\n The release form is over there in that box.\n\n0:07:55\tSPEAKER_04\n Alright, fair enough.\n\n0:07:57\tSPEAKER_04\n And then they're going to have to choose from one of these tasks which are listed here.\n\n0:08:10\tSPEAKER_04\n They pick a couple say three six is what effect.\n\n0:08:15\tSPEAKER_04\n Six different things they sort of think they would do if they were in Hydeburg or traveling someplace.\n\n0:08:24\tSPEAKER_04\n Then they have a map like this very sketchy simplified map.\n\n0:08:29\tSPEAKER_04\n They can take notes on that map.\n\n0:08:32\tSPEAKER_04\n And then they call this computer system that works perfectly on in a sense everything.\n\n0:08:37\tSPEAKER_04\n And this is a fictional system obviously.\n\n0:08:41\tSPEAKER_04\n Yeah the computer system sits right in front of you that's.\n\n0:08:43\tSPEAKER_04\n And she does know everything.\n\n0:08:46\tSPEAKER_04\n And she has a way of making this machine talk.\n\n0:08:50\tSPEAKER_04\n So she can copy sentences into a window or type really fast and this machine will use speech synthesis to produce that.\n\n0:08:58\tSPEAKER_04\n So if you ask how do I get to the castle then several seconds later it will come out of here in order to get to the castle you do okay.\n\n0:09:07\tSPEAKER_04\n And then after three tests the system breaks down.\n\n0:09:11\tSPEAKER_04\n And Fay comes on the phone as a human operator.\n\n0:09:15\tSPEAKER_04\n And says sorry the system broke down but let's continue.\n\n0:09:18\tSPEAKER_04\n And we sort of get the idea what people do when they think they speak to a machine and what people say when they think they speak to a human or no or assume they speak to a human.\n\n0:09:31\tSPEAKER_04\n That's the data collection.\n\n0:09:36\tSPEAKER_04\n And Fay has some 30 subjects lined up something.\n\n0:09:42\tSPEAKER_04\n And they're ready to roll and we're going to start tomorrow at 3, 4, 1.\n\n0:09:49\tSPEAKER_01\n Tomorrow?\n\n0:09:50\tSPEAKER_01\n Well we don't know for sure because we don't know whether that person is coming up.\n\n0:09:54\tSPEAKER_04\n Okay run for it.\n\n0:09:55\tSPEAKER_04\n And we're still looking for a room on the sixth floor because they stole away that conference room behind our backs.\n\n0:10:05\tSPEAKER_02\n There are these.\n\n0:10:06\tSPEAKER_02\n Oh I see we have the yeah it's tricky.\n\n0:10:09\tSPEAKER_02\n Let's let's get it offline.\n\n0:10:11\tSPEAKER_04\n It's happening.\n\n0:10:12\tSPEAKER_04\n David and Jane and Laila are working on that as we speak.\n\n0:10:16\tSPEAKER_04\n Okay.\n\n0:10:17\tSPEAKER_04\n There was the data collection in a nutshell.\n\n0:10:22\tSPEAKER_04\n And I can report it.\n\n0:10:31\tSPEAKER_04\n So I did this but I also tried to do this.\n\n0:10:36\tSPEAKER_04\n So if I click on here is this wonderful.\n\n0:10:39\tSPEAKER_04\n We get to the belief net just focusing on the go their note.\n\n0:10:47\tSPEAKER_04\n And elegantly this would be sort of the reason note and the timing note and so forth.\n\n0:10:53\tSPEAKER_04\n And what happened is that design wise I'd sort of notice that we can we still get a lot of errors from a lot of points to one of the sub go there user go there situation notes.\n\n0:11:09\tSPEAKER_04\n So I came up with a couple of additional notes here where whether the user is thrifty or not and what is budget is currently like is going to result in some financial state of the user.\n\n0:11:21\tSPEAKER_04\n How much willing is he willing to spend or can spend being the same with this just the money available which may influence us whether he wants to go there if it's you're charging tons of dollars for admission or is going to cost a lot of whatever 22 million to fly to international space station.\n\n0:11:42\tSPEAKER_04\n Not all of you can do that.\n\n0:11:45\tSPEAKER_04\n So and this actually turned out to be pretty key because it's having specified sort of these this this intermediate level and sort of noticing that everything that happens here let's go to our favorite end point one is again more or less we have than the situation notes contributing to the end point situation note which contributes to the end point and so forth.\n\n0:12:17\tSPEAKER_04\n I can now sort of draw straight lines from these to here meaning it of course goes with the sub S everything that comes from situation everything that comes from user goes with the sub U and whatever was specified for the so called key note or the discourse would comes from the parser construction parser will contribute to the D and the ontology to the sub O note and one just sort of has to watch which also final decision notes so it doesn't make sense to figure out whether he wants to interview or approach an object if he never wants to go there in the first place.\n\n0:12:55\tSPEAKER_04\n This makes the design thing fairly simple and now all that's left to do then is the CPT's the conditional probabilities for the likelihood of a person having enough money actually wanting to go a place if it costs you know and and once Baskara has finished his classwork that's what we're going to end up doing you get involved in that process too and and for now the question is how much of these decisions do we want to build and explicitly into our data collection so one could sort of think of you know we could call this C or you know people who visit the zoo we could call it visit the zoo tomorrow so we have a tension of seeing something but not now but later.\n\n0:14:04\tSPEAKER_02\n So let's see I think that from one point of view all these places are the same so that that in terms of the linguistics and stuff there may be a few different kinds of places so it seems to me that we ought to decide you know what things are actually going to matter to us and so the zoo in the university in the castle etc are all big-ish things that you know have different parts to them and one of them might be fine.\n\n0:14:50\tSPEAKER_04\n The reason why we did it that way as a reminder is no person is going to do all of them they're just going to select to their preferences.\n\n0:15:01\tSPEAKER_02\n Oh yeah I usually visit zoos or I usually visit castles or I usually the point is to build a system that's got everything in it that might happen you do one thing to build a system that had the most data on a relatively confined set of things should do something else and the speech people for example are going to do better if they if things come up repeatedly.\n\n0:15:35\tSPEAKER_02\n Now of course if everybody says exactly the same thing then it's not interesting so all of them say there's a kind of question of what we're trying to accomplish and I think my temptation for the data gathering would be to you know these persons only going to do it once you have to worry about them being bored so if it's one service one luxury item one bigish place and so forth and so on then my guess is that the data is going to be easier to handle.\n\n0:16:17\tSPEAKER_02\n Of course you have this I get a possible danger that somehow there are certain constructions that people use when talking about a museum that they wouldn't talk about with the university and stuff but I guess my temptation is to go for simpler you know less variation but\n\n0:16:38\tSPEAKER_06\n I don't know what other people think about this in terms of so I don't exactly understand like I guess we're trying to limit the tale of our ontology of types of places that someone could go right but who is it that has to care about this or what component of the system\n\n0:16:54\tSPEAKER_02\n oh well I think there are two places where it comes up one is in the people who are going to take this and try to do speech with it lots of pronunciations of the same thing are going to give you better data than you know a few pronunciations of lots more things that's one.\n\n0:17:18\tSPEAKER_06\n So we would rather just ask and have a bunch of people talk about the zoo and assume that the constructions they use there will give us everything we need to know about these sort of big zoo castle whatever type things these bigger places.\n\n0:17:35\tSPEAKER_06\n Yeah this is an action for speech data people saying zoo over and over again and over\n\n0:17:39\tSPEAKER_02\n two. So this is a question for you and you know if we do we probably will actually try to build a prototype probably we could get by with the prototype only handling a few of them anyway.\n\n0:17:58\tSPEAKER_05\n So yeah this was sort of these are all different sort of activities but I think I got the\n\n0:18:09\tSPEAKER_04\n point and I think I like it we can do put them in a more hierarchical fashion so go to place and then give them a choice either the symphony type or opera type or the tourist side type or the nightclub disco type person and they say yeah this is on that go to biggest place this is what I would do then we have the fixed thing and then maybe do something the other day thing.\n\n0:18:35\tSPEAKER_04\n So my question is I guess to some extent we should you just have to try it out see if it works it would be challenging in a sense try to make it so so complex that they even really should schedule or plan it more complex thing in terms of okay you know they should get the feeling that there are these six things they have to do and they can be done maybe in two days.\n\n0:19:07\tSPEAKER_04\n Well I think they make these decisions can I go there tomorrow or influences.\n\n0:19:12\tSPEAKER_02\n Well I think it's easy enough to set that up if that's your expectation so the system could say well I would like to set up your program for two days in a Heidelberg you know let's first think about all the things you might like to do.\n\n0:19:30\tSPEAKER_02\n So there I mean I'm sure that if that's what you did then they would start telling you about that and then you could get into various things about ordering if you wanted.\n\n0:19:42\tSPEAKER_04\n But I think this is part of the instructors job and that can be done sort of to say okay now we've picked these six tasks now you have you can call the system and you have two days.\n\n0:19:54\tSPEAKER_02\n I'm sorry but we have to help we have to decide fate we'll carry out whatever we decide but we have to decide you know what is the appropriate scenario that's what we're going to talk about.\n\n0:20:05\tNone\n Yeah.\n\n0:20:06\tSPEAKER_05\n So we have two different scenarios in the early one is a plan of the only kind of human functions on the spot.\n\n0:20:13\tSPEAKER_04\n Yeah but I don't I'm not really interested in sort of face planning capabilities but it's more the how do people phrase these planning requests.\n\n0:20:24\tSPEAKER_04\n So are we going to masquerade the system as this as you said simple response system I have one question I get one response or should we allow for a certain level of complexity and I think the data would be nicer if we get temporal references.\n\n0:20:40\tSPEAKER_02\n So Keith what do you think?\n\n0:20:44\tSPEAKER_06\n Well it seems yeah I mean off the top of my head it kind of seems like you would probably just want you know richer data more complex stuff going on people trying to do more complex things I mean you know if our goal is to really sort of be able to handle a whole bunch of different stuff than throwing harder situations that people will get them to do more linguistic more interesting linguistic stuff but I mean I'm not really sure because I don't fully understand like what our choices are ways to do this here.\n\n0:21:16\tSPEAKER_04\n We have tested this and have you heard listen to the first two or the second person is was faced with exactly this kind of setup.\n\n0:21:25\tSPEAKER_06\n I started to listen to one and it was just like sort of depressing sort of listening to the beginning part and the person was just sort of reading off a script or something.\n\n0:21:35\tSPEAKER_04\n Oh okay that was the first person.\n\n0:21:37\tSPEAKER_06\n First of all it wasn't very good.\n\n0:21:39\tSPEAKER_04\n So it is already with this setup and that particular subject it got pretty complex.\n\n0:21:49\tSPEAKER_04\n So I suggest we make some fine tuning of these get sort of run through ten or so subjects and then take a breather and see whether we want to make it more complex or not depending on what sort of results we're getting.\n\n0:22:04\tSPEAKER_06\n Yeah in fact I am just you know today next couple days going to start really diving into this data I basically looked at one of the files you know one of these you gave me those dozens of files and I looked at one of them which is about ten sentences found fifteen twenty different construction types that we would have to look for and so on and like all right well let's start here.\n\n0:22:25\tSPEAKER_06\n So I haven't really gone into the you know looked at all of the stuff that's going on so I don't really right I mean once I start doing that I'll have more to say about this kind of thing.\n\n0:22:34\tSPEAKER_02\n Okay well you did say something important which is that you can probably keep yourself fairly well occupied with the simple cases for quite a while.\n\n0:22:46\tSPEAKER_02\n Yeah although obviously so that's not so does suggest that now I have looked at all the data and it's actually at least to an amateur quite redundant.\n\n0:22:59\tSPEAKER_02\n Yeah it was very stylized and quite a lot of people said more or less the same thing.\n\n0:23:04\tSPEAKER_06\n I did sort of scan it at first and notice that and then looked into tail at one of them but yeah I noticed that too.\n\n0:23:10\tSPEAKER_02\n So we want to do more than that.\n\n0:23:13\tSPEAKER_04\n And with this we're getting more no question.\n\n0:23:17\tSPEAKER_04\n So do we want to get going beyond more?\n\n0:23:20\tSPEAKER_02\n Well okay so let's take let's I think your suggestion is good which is we'll do a batch okay and say how long is it going to be till you have ten subjects a couple days or the week or I don't have a few friends.\n\n0:23:36\tSPEAKER_01\n I can yeah I mean I think I probably scheduled ten people whenever.\n\n0:23:43\tSPEAKER_02\n Well it's up to you I mean I we don't have any huge time pressures just when you have\n\n0:23:49\tSPEAKER_01\n the yeah. I would say maybe two weeks.\n\n0:23:52\tSPEAKER_02\n Oh okay so let's do this let's plan next Monday okay to have a review of what we have so far.\n\n0:24:02\tSPEAKER_04\n And no transcriptions of course.\n\n0:24:06\tSPEAKER_02\n No I won't have the transcriptions but what we should be able to do and I don't know if you'll have time to do this but it would be great if you could not transcribe it all but pick out some stuff.\n\n0:24:22\tSPEAKER_02\n I mean we could listen just sit here and listen to it all.\n\n0:24:25\tSPEAKER_02\n Are you going to have the audio on the website?\n\n0:24:29\tSPEAKER_02\n Okay.\n\n0:24:30\tSPEAKER_04\n Until we reach the gig up by a thing and David Johnson kills me and we're going to put it on the website yeah.\n\n0:24:36\tSPEAKER_02\n Oh we can get I mean you can buy another disc for $200 right I mean it's okay so I\n\n0:24:42\tSPEAKER_04\n won't take care of David Johnson. Okay.\n\n0:24:45\tSPEAKER_04\n He's been solving all our problems so it's wonderful.\n\n0:24:50\tSPEAKER_02\n So anyway so if you can think of a way to point us to interesting things sort of as you're doing this or something make notes or something that this is you know something worth looking at and other than that yeah I guess we'll just have to listen although I guess it's only 10 minutes each right roughly.\n\n0:25:21\tSPEAKER_01\n I guess I'm not sure how long it's actually.\n\n0:25:23\tSPEAKER_04\n The reading test is a lot shorter therefore it's cut by 50% and the reading nobody's interested in that.\n\n0:25:29\tSPEAKER_04\n Right we don't care about that at all.\n\n0:25:31\tSPEAKER_04\n So it's actually like five minutes dialogue.\n\n0:25:34\tSPEAKER_02\n My guess is it's going to be 10.\n\n0:25:38\tSPEAKER_04\n 10 minutes as long.\n\n0:25:39\tSPEAKER_02\n I understand but people it feels like a long time.\n\n0:25:42\tSPEAKER_04\n It feels like forever when you're doing it but then it turns out to be three minutes and 45 seconds.\n\n0:25:47\tSPEAKER_02\n Could be.\n\n0:25:48\tSPEAKER_02\n Okay.\n\n0:25:49\tSPEAKER_02\n I was thinking people would you know hesitate whatever whatever it is we'll do with it.\n\n0:25:54\tSPEAKER_02\n Yeah it's not.\n\n0:25:55\tSPEAKER_02\n Okay so that'll be on the webpage.\n\n0:25:59\tSPEAKER_02\n That's great.\n\n0:26:00\tSPEAKER_02\n But anyway yeah so I think it's a good idea to start with the sort of relatively straightforward response system and then if we want to get them to start doing multiple step planning with a whole bunch of things and then organize them and tell them which things are near each other and you know any of that stuff.\n\n0:26:27\tSPEAKER_02\n Which things would you like to do Tuesday morning?\n\n0:26:34\tSPEAKER_02\n So yeah that seems pretty straightforward.\n\n0:26:40\tSPEAKER_01\n But were you saying that?\n\n0:26:42\tSPEAKER_04\n I need those back by the way.\n\n0:26:44\tNone\n Okay.\n\n0:26:45\tSPEAKER_02\n That's for if anyone.\n\n0:26:51\tSPEAKER_01\n Maybe one thing we should do is go through this list and sort of select things that are categories and then offer only one member of that category.\n\n0:26:56\tSPEAKER_02\n That's what I was suggesting for the first round.\n\n0:26:58\tSPEAKER_02\n Yeah.\n\n0:26:59\tSPEAKER_01\n Okay.\n\n0:27:00\tSPEAKER_01\n So rather than having a zoom in.\n\n0:27:01\tSPEAKER_01\n And then I mean they could be alternate versions of the same.\n\n0:27:03\tSPEAKER_01\n They could but it would be one of data on difference.\n\n0:27:06\tSPEAKER_02\n Yeah.\n\n0:27:07\tSPEAKER_02\n But.\n\n0:27:08\tSPEAKER_01\n Like one person gets the version with the zoo as a choice.\n\n0:27:18\tSPEAKER_04\n The person don't get it.\n\n0:27:19\tSPEAKER_04\n I mean this is what we did it because when we gave them just three tasks for part A and\n\n0:27:25\tSPEAKER_01\n three tasks for part B. They just want to be able to choose both zoo and say touring the castle.\n\n0:27:30\tSPEAKER_04\n Exactly.\n\n0:27:31\tSPEAKER_04\n This is limiting the choices but yeah right okay sorry.\n\n0:27:34\tSPEAKER_04\n But I think this approach worked very well but the person was able to look at it and say okay this is what I would actually do.\n\n0:27:40\tSPEAKER_04\n Okay.\n\n0:27:41\tSPEAKER_01\n Yeah.\n\n0:27:42\tSPEAKER_01\n Okay.\n\n0:27:43\tSPEAKER_01\n He was vicious.\n\n0:27:44\tSPEAKER_01\n Okay.\n\n0:27:45\tSPEAKER_04\n We got it.\n\n0:27:46\tSPEAKER_04\n We got to disallow traveling to zoos and castles at the same time sort of.\n\n0:27:51\tSPEAKER_01\n I mean they are significantly different but.\n\n0:27:55\tSPEAKER_04\n But no they're sort of this is where tour becomes you know tours maybe a bit different.\n\n0:28:01\tSPEAKER_04\n And these are just places where you enter much like here but we can.\n\n0:28:08\tSPEAKER_02\n Yeah.\n\n0:28:09\tSPEAKER_02\n In fact if you use the right verb for each in common like it you know attend a theater symphony or opera as a group and tour the university castle or zoo all of these do have this kind of tour aspect about the way you would go to them.\n\n0:28:27\tSPEAKER_02\n And the movie theater is probably also a tent etc.\n\n0:28:34\tSPEAKER_02\n So it may turn out to be not so many different kinds of things and then what we would expect is that the sentence types would their responses would tend to be grouped according to the kind of activity you would expect.\n\n0:28:55\tSPEAKER_05\n It seems that the different between going to see something and change my.\n\n0:29:02\tSPEAKER_02\n Oh absolutely.\n\n0:29:03\tSPEAKER_04\n Yeah.\n\n0:29:04\tSPEAKER_04\n Yeah this is where the function itself is definitely different in the getting information or stuff.\n\n0:29:13\tSPEAKER_04\n Okay.\n\n0:29:16\tSPEAKER_04\n But this is open.\n\n0:29:17\tSPEAKER_04\n So since people are going to still pick something we're not going to get any significant amount of redundancy and for reasons we don't want it really in that sense.\n\n0:29:28\tSPEAKER_04\n And we would be ultimately more interested in getting all the possible ways of people asking or for different things with a computer.\n\n0:29:41\tSPEAKER_04\n And so if you can think of any other sort of high level tasks a tourist may do just always just mail them to us and we'll sneak them into the collection.\n\n0:29:53\tSPEAKER_04\n We're not going to do much statistical stuff with it.\n\n0:29:57\tSPEAKER_04\n We don't have enough.\n\n0:29:58\tSPEAKER_04\n But it seems like since we are getting towards subject 50 subjects and if we can keep it up to a sort of five fourish per week rate we may even reach the 100 before Faye takes herself to Chicago.\n\n0:30:17\tSPEAKER_01\n That means that 100 people have to be interested.\n\n0:30:21\tSPEAKER_02\n Good luck.\n\n0:30:25\tSPEAKER_02\n These are all people from campus so far.\n\n0:30:29\tSPEAKER_02\n So we don't know how many we can get next door at the shelter for example.\n\n0:30:34\tSPEAKER_02\n For ten bucks probably quite a few.\n\n0:30:37\tSPEAKER_02\n That's right.\n\n0:30:39\tSPEAKER_02\n All right, so let's go back then to the chart with all the decisions and stuff and see how we're doing.\n\n0:30:47\tSPEAKER_02\n People think that this is going to cover what we need or should we be thinking about more.\n\n0:30:56\tSPEAKER_04\n Okay, in terms of decision notes.\n\n0:30:58\tSPEAKER_04\n Yep.\n\n0:30:59\tSPEAKER_04\n I mean go there is a yes or no.\n\n0:31:02\tSPEAKER_04\n Right?\n\n0:31:03\tSPEAKER_04\n Yep.\n\n0:31:04\tSPEAKER_04\n I'm also interested in this property line here.\n\n0:31:07\tSPEAKER_04\n So if you look at, sorry, look at that.\n\n0:31:12\tSPEAKER_04\n Timing was, I have these three.\n\n0:31:16\tSPEAKER_04\n Do we need a final differentiation there?\n\n0:31:19\tSPEAKER_04\n Now later on the same tour, sometimes on the next tour.\n\n0:31:23\tSPEAKER_06\n What's this idea of next tour?\n\n0:31:24\tSPEAKER_04\n I mean, it's sort of the next day.\n\n0:31:27\tSPEAKER_04\n So you're doing something now and you're planning to do these three four things and you can do something immediately you can sort of tag it on to that tour or you can say this is something I want to do sometime in my life.\n\n0:31:43\tSPEAKER_06\n Okay.\n\n0:31:44\tSPEAKER_06\n So this tour is sort of just like the idea of current round of touristness.\n\n0:31:50\tSPEAKER_02\n Yeah, probably between stuff's back at the hotel.\n\n0:31:53\tSPEAKER_02\n Okay.\n\n0:31:54\tSPEAKER_02\n I mean, if you want to be precise about it, you know, and I think that's the way tours do organize their lives.\n\n0:32:00\tSPEAKER_02\n Sure.\n\n0:32:01\tSPEAKER_02\n Sure.\n\n0:32:02\tSPEAKER_02\n So you can go on then we'll go off and okay.\n\n0:32:04\tSPEAKER_05\n So all tours of eight tour happens only within one day.\n\n0:32:07\tSPEAKER_02\n Yes.\n\n0:32:08\tSPEAKER_05\n It's too early to move.\n\n0:32:09\tSPEAKER_06\n Right.\n\n0:32:10\tSPEAKER_06\n For this.\n\n0:32:11\tSPEAKER_06\n Okay.\n\n0:32:12\tSPEAKER_06\n Just to be totally clear.\n\n0:32:13\tSPEAKER_04\n Well, my visit to Prague, there were some nights where I had never went back to the hotel.\n\n0:32:18\tSPEAKER_06\n So whether that's a two day tour or not, I think you just spend the whole time at Uflekland.\n\n0:32:25\tSPEAKER_02\n We will not ask you more.\n\n0:32:27\tSPEAKER_04\n That's enough.\n\n0:32:28\tSPEAKER_04\n I don't know.\n\n0:32:32\tSPEAKER_04\n What does the English cognate if you want for Zank Nimalans talk?\n\n0:32:37\tSPEAKER_04\n Kind of ano.\n\n0:32:39\tSPEAKER_04\n Sort of.\n\n0:32:40\tSPEAKER_04\n We'll do it.\n\n0:32:41\tSPEAKER_04\n When you say on that date, it means it'll never happen.\n\n0:32:43\tSPEAKER_04\n Right.\n\n0:32:44\tSPEAKER_04\n Okay.\n\n0:32:45\tSPEAKER_04\n Do you have an expression?\n\n0:32:46\tSPEAKER_04\n Probably.\n\n0:32:47\tSPEAKER_06\n Not that I know, I've actually.\n\n0:32:50\tSPEAKER_04\n Yeah, I went out.\n\n0:32:52\tSPEAKER_04\n Yeah.\n\n0:32:53\tSPEAKER_04\n We'll do it when he'll pres us over.\n\n0:32:54\tSPEAKER_04\n So maybe that should be another.\n\n0:32:56\tSPEAKER_04\n Yeah.\n\n0:32:58\tSPEAKER_04\n Property in there.\n\n0:33:03\tSPEAKER_04\n Okay.\n\n0:33:04\tSPEAKER_04\n The reason why do we go there in the first place, I see the foreset scene for meeting people for running errands or doing business.\n\n0:33:20\tSPEAKER_04\n Entertainment is a good one in there, I think.\n\n0:33:23\tSPEAKER_04\n I agree.\n\n0:33:26\tSPEAKER_06\n So business is supposed to be sort of like professional type stuff.\n\n0:33:33\tSPEAKER_06\n Right?\n\n0:33:34\tSPEAKER_06\n Yeah.\n\n0:33:35\tNone\n Okay.\n\n0:33:36\tSPEAKER_04\n I mean, this is an old, a general thing he sort of had it in there.\n\n0:33:49\tSPEAKER_04\n Who is the, is the person?\n\n0:33:51\tSPEAKER_04\n So it might be a tourist.\n\n0:33:52\tSPEAKER_04\n It might be a businessman.\n\n0:33:53\tSPEAKER_04\n Yeah.\n\n0:33:54\tSPEAKER_04\n So it's a good system, what's the sort of go-toism?\n\n0:33:56\tSPEAKER_06\n Yeah, or both.\n\n0:33:57\tSPEAKER_06\n Yeah.\n\n0:33:58\tSPEAKER_06\n I mean, like, for example, my father is about to travel to Prague.\n\n0:34:00\tSPEAKER_06\n He'll be there for two weeks.\n\n0:34:01\tSPEAKER_06\n He's going to, he's there to teach a course at the business school, but he also is touring around, so I may have some.\n\n0:34:07\tSPEAKER_06\n Sure.\n\n0:34:08\tNone\n He's doing things.\n\n0:34:09\tSPEAKER_05\n Okay.\n\n0:34:10\tSPEAKER_05\n Okay.\n\n0:34:11\tSPEAKER_05\n What do you have in mind, the number of socializing people?\n\n0:34:15\tSPEAKER_04\n Just meeting people, basically.\n\n0:34:17\tSPEAKER_04\n I want to meet someone somewhere, which puts a very heavy constraint on the Eva, you know, because then if you're meeting somebody at the town hall, you're not entering it.\n\n0:34:27\tSPEAKER_04\n Usually you just want to approach it.\n\n0:34:30\tSPEAKER_06\n So, I mean, does this capture, like, where do you put exchange money as an errand, right?\n\n0:34:35\tSPEAKER_06\n So I go to a movie, where is now entertainment, Dineout is?\n\n0:34:41\tSPEAKER_02\n No, I, well, I didn't.\n\n0:34:43\tSPEAKER_02\n Well, I, let, let, well, we'll put it somewhere, but, but, I would say that if Dineout is a special, if you're doing it for that purpose, then it's entertainment.\n\n0:34:54\tSPEAKER_02\n Yeah.\n\n0:34:55\tSPEAKER_02\n And we'll also, as, as you, further along, we'll get into business about, well, you're, you know, this is going over a meal time, do you want to stop for a meal or pick up food or something, and that's different.\n\n0:35:06\tSPEAKER_02\n That's, that's sort of part of the, that's not a destination reason, that's sort of, um, a song.\n\n0:35:13\tSPEAKER_04\n That goes with the energy depletion function.\n\n0:35:15\tSPEAKER_04\n Right.\n\n0:35:16\tSPEAKER_04\n Yes.\n\n0:35:17\tSPEAKER_04\n Okay.\n\n0:35:18\tSPEAKER_06\n End point.\n\n0:35:19\tSPEAKER_06\n Bad laugh.\n\n0:35:21\tSPEAKER_04\n End point is pretty clear.\n\n0:35:23\tSPEAKER_04\n Um, mode, uh, I have phone three drive their walk there or, or be driven, which means bus taxi art.\n\n0:35:33\tSPEAKER_04\n Okay.\n\n0:35:34\tSPEAKER_00\n The public transport in general.\n\n0:35:36\tSPEAKER_04\n Yeah.\n\n0:35:37\tSPEAKER_04\n Yeah.\n\n0:35:38\tSPEAKER_02\n Obviously, taxis are very different than buses, but on the other hand, the system doesn't have any public transport.\n\n0:35:45\tSPEAKER_02\n The planar system doesn't have any public transport in it yet.\n\n0:35:49\tSPEAKER_04\n So this granularity would suffice, I think, if we say the person, probably based on the adherence, in this situation, we can conclude once drive their walk there or use some other form of transportation.\n\n0:36:03\tSPEAKER_06\n How much of hydrogen bill can you get around by public transport?\n\n0:36:06\tSPEAKER_06\n I mean, in terms of the interesting bits, there's lots of bits where you don't really, I've only, I was there 10 years ago for a day, so I don't remember, but, you're good.\n\n0:36:14\tSPEAKER_06\n I mean, like, sort of the touristy bits.\n\n0:36:16\tSPEAKER_02\n You can't get to the philosophers way very well, but, I mean, there are hikes that you can't get to.\n\n0:36:21\tSPEAKER_02\n But, yeah.\n\n0:36:22\tSPEAKER_02\n But I think other things, you can't, if I remember right.\n\n0:36:26\tSPEAKER_00\n So it's like biking there, part of the timing?\n\n0:36:28\tSPEAKER_04\n Yeah.\n\n0:36:29\tSPEAKER_04\n And we actually biking should be, should be a separate point because we have a very strong bicycle planning component.\n\n0:36:36\tSPEAKER_04\n Oh.\n\n0:36:37\tSPEAKER_04\n So, uh, bicycle should be in there.\n\n0:36:40\tSPEAKER_04\n But, will we have, I mean, is this realistic?\n\n0:36:46\tSPEAKER_04\n Yeah.\n\n0:36:47\tSPEAKER_02\n Okay, we can leave that.\n\n0:36:49\tSPEAKER_04\n Yeah.\n\n0:36:50\tSPEAKER_04\n We can sort of drive.\n\n0:36:53\tSPEAKER_06\n I would lump it with walk because it will matter, right?\n\n0:36:56\tSPEAKER_06\n Yeah.\n\n0:36:57\tSPEAKER_06\n Like that.\n\n0:36:58\tSPEAKER_02\n Skateboards, I'm going to write it right anyway.\n\n0:37:02\tSPEAKER_02\n Scooters, right?\n\n0:37:03\tSPEAKER_04\n Right.\n\n0:37:04\tSPEAKER_04\n All right.\n\n0:37:06\tSPEAKER_04\n Okay, length is, you want to get this over with as fast as possible.\n\n0:37:13\tSPEAKER_04\n You want to use some part of what, of the time you have.\n\n0:37:20\tSPEAKER_04\n They can, but we should just make a decision whether we feel that they want to use some substantial or some fraction of their time.\n\n0:37:29\tSPEAKER_04\n You know, they want to do it so badly that they are willing to spend, you know, the necessary and plus time.\n\n0:37:36\tSPEAKER_04\n And, um, and, you know, if we feel that they want to do nothing but that thing, then, you know, we should point out that to the planner that they probably want to use all the time they have.\n\n0:37:52\tSPEAKER_04\n So stretch out that visit.\n\n0:37:55\tSPEAKER_06\n Wow, it seems like this would be really hard to guess. I mean, on the part of the system, it seems like it.\n\n0:38:00\tSPEAKER_06\n I mean, you're talking about rather than having the user decide this, you're supposed to figure it out.\n\n0:38:05\tSPEAKER_04\n The user can always say it, right?\n\n0:38:07\tSPEAKER_04\n It's just sort of, we hand over these parameters.\n\n0:38:10\tSPEAKER_04\n If we make, if we have a feeling that they are important and that we can actually infer them to a significant degree, all we ask.\n\n0:38:19\tSPEAKER_02\n Yeah, and part of the system design is that if it looks to be important and you can't figure it out, then you ask.\n\n0:38:25\tSPEAKER_02\n But hopefully you don't ask, you know, all these things all the time.\n\n0:38:29\tSPEAKER_02\n Yeah, yeah, yeah.\n\n0:38:30\tSPEAKER_02\n But there's definitely a back-off position to asking.\n\n0:38:34\tSPEAKER_04\n And if no part of the system ever comes up with the idea that this could be important, no planner is ever going to ask for it.\n\n0:38:42\tSPEAKER_04\n And I like the idea that, you know, sort of, Jerry pushed this idea from the very beginning that it's part of the understanding business to sort of make a good question of what's sort of important in this general picture, what you need.\n\n0:38:55\tSPEAKER_04\n If you want a simulated, for example, what parameters would you need for the simulation?\n\n0:38:59\tSPEAKER_04\n And timing, a length would definitely be part of it.\n\n0:39:04\tSPEAKER_04\n Costs, little money, some money, lots of money.\n\n0:39:10\tSPEAKER_04\n Actually, maybe, yeah, okay.\n\n0:39:15\tSPEAKER_06\n You could say some there.\n\n0:39:21\tNone\n I must say that this one looks a bit strange to me.\n\n0:39:25\tNone\n It's like a problem here.\n\n0:39:27\tNone\n If I go to a sped us.\n\n0:39:29\tNone\n I'm willing to lose.\n\n0:39:33\tSPEAKER_02\n I think there are different things where you have a choice, for example, this interacts with, you're willing to take a taxi.\n\n0:39:45\tSPEAKER_02\n You know, if you're going to the opera, are you going to look for the best seats or the peanut gallery or whatever?\n\n0:39:55\tSPEAKER_02\n So I think there are a variety of things in which tourists really do have different styles eating another one.\n\n0:40:07\tSPEAKER_04\n What my sort of sentiment is there.\n\n0:40:11\tSPEAKER_04\n I once had to write a charter for a student organization.\n\n0:40:16\tSPEAKER_04\n And they had wanted me to define what the quorum is going to be.\n\n0:40:20\tSPEAKER_04\n I looked at the other ones and they were 10% of the student body as we present at the general meeting.\n\n0:40:25\tSPEAKER_04\n Otherwise, it's not.\n\n0:40:26\tSPEAKER_04\n And I wrote in there enough people have to be there.\n\n0:40:31\tSPEAKER_04\n And it was hardly debated, but people agreed with me that everybody probably has a good feeling whether it was a farce joke, whether there were enough people.\n\n0:40:39\tSPEAKER_04\n And if you go to Turkey, you will find when people go shopping, they will say, how much she's you want and they say, enough.\n\n0:40:46\tSPEAKER_04\n This used all over the place because the person is adding the cheese nose.\n\n0:40:50\tSPEAKER_04\n That person has two kids and a husband that dislikes cheese.\n\n0:40:55\tSPEAKER_04\n And so the middle part is always sort of the golden way, right?\n\n0:41:00\tSPEAKER_04\n You can really make it as cheap as possible or you can say, I don't care.\n\n0:41:06\tSPEAKER_04\n Money is no object.\n\n0:41:08\tSPEAKER_04\n Money is no object.\n\n0:41:09\tSPEAKER_04\n Or you say, this one is spent enough or the sufficient or the appropriate amount.\n\n0:41:15\tSPEAKER_04\n But then again, this may turn out to be insufficient for all purposes.\n\n0:41:21\tSPEAKER_04\n But this is my first guess.\n\n0:41:23\tSPEAKER_04\n In much of the same way as how should the route be?\n\n0:41:28\tSPEAKER_04\n Should it be the easiest route, even if it's a little bit longer?\n\n0:41:32\tSPEAKER_04\n No steep incline nations go the normal way.\n\n0:41:36\tSPEAKER_04\n Whatever that again means, or does the person want to rough it?\n\n0:41:41\tSPEAKER_06\n There's a couple of different ways you can interpret these things.\n\n0:41:45\tSPEAKER_06\n I want to go there and I don't care if it's really hard or if you're an extreme sport person.\n\n0:41:51\tSPEAKER_06\n I want to go there and I insist on it being the hard way.\n\n0:41:55\tSPEAKER_06\n I assume we're going for the first interpretation.\n\n0:41:58\tSPEAKER_06\n Something like, I'll go with, I don't know.\n\n0:42:02\tSPEAKER_02\n He was going for the second one, actually.\n\n0:42:05\tSPEAKER_05\n We'll sort that out.\n\n0:42:07\tSPEAKER_03\n What's the answer sign?\n\n0:42:12\tSPEAKER_04\n Absolutely.\n\n0:42:14\tSPEAKER_04\n Well, this is all sort of trouble of my head.\n\n0:42:19\tSPEAKER_04\n No research behind that.\n\n0:42:21\tSPEAKER_04\n Object information, do I want to know anything about that object?\n\n0:42:25\tSPEAKER_04\n Is it the true or false?\n\n0:42:28\tSPEAKER_04\n If I care about it being open accessible or not, I don't think there's any middle ground there.\n\n0:42:36\tSPEAKER_04\n Either I want to know where it is or not.\n\n0:42:39\tSPEAKER_04\n I want to know if it's history or not.\n\n0:42:42\tSPEAKER_04\n Or I want to know what it's good for or not.\n\n0:42:47\tSPEAKER_04\n Maybe one could put scales in there too.\n\n0:42:51\tSPEAKER_04\n What you were saying?\n\n0:42:54\tSPEAKER_04\n One could put scales in there.\n\n0:42:57\tSPEAKER_02\n Yeah, right.\n\n0:42:59\tSPEAKER_02\n Object becomes entity, right?\n\n0:43:02\tSPEAKER_04\n Yep, that's true.\n\n0:43:03\tSPEAKER_04\n I have to do it now.\n\n0:43:06\tSPEAKER_04\n That's the wrong shortcut anyhow.\n\n0:43:15\tSPEAKER_02\n And we think that's it, interestingly enough, that, you know, or something very close to what is going to be enough.\n\n0:43:33\tSPEAKER_02\n Going to be enough.\n\n0:43:36\tSPEAKER_02\n And...\n\n0:43:47\tNone\n Don't run.\n\n0:43:50\tSPEAKER_04\n Yep.\n\n0:43:56\tSPEAKER_02\n Okay.\n\n0:43:59\tSPEAKER_02\n So I think the order of things is that Robert will clean this up a little bit, although it looks pretty good.\n\n0:44:10\tSPEAKER_04\n Well, this is the part that needs to work.\n\n0:44:14\tSPEAKER_02\n Right, so in parallel, three things are going to happen.\n\n0:44:22\tSPEAKER_02\n Robert and even Busker are going to actually build a belief net that has CPTs and tries to infer this from various kinds of information.\n\n0:44:35\tSPEAKER_02\n And Faye is going to start collecting data.\n\n0:44:40\tSPEAKER_02\n And we're going to start thinking about what constructions we want to do to make a data collection.\n\n0:44:52\tSPEAKER_06\n Do you mean eliciting particular constructions?\n\n0:44:57\tSPEAKER_06\n What kinds of things we want to get people talking about?\n\n0:45:01\tSPEAKER_02\n Well, semantically speaking.\n\n0:45:04\tSPEAKER_02\n Both of us constructions are primarily semantic, right?\n\n0:45:09\tSPEAKER_06\n Right.\n\n0:45:11\tSPEAKER_06\n So from my point of view, I'm trying to care about this syntax.\n\n0:45:17\tSPEAKER_02\n Well, that too.\n\n0:45:20\tSPEAKER_02\n But if we make sure that we get them talking about temporal order, that would be great.\n\n0:45:29\tSPEAKER_02\n And if they use prepositional phrases or subordinate clauses or whatever.\n\n0:45:34\tSPEAKER_02\n Whatever form they use is fine.\n\n0:45:38\tSPEAKER_02\n So we're probably going to try to look at it as what semantic constructions do we want them to cause motion?\n\n0:45:49\tSPEAKER_02\n I don't know.\n\n0:45:51\tSPEAKER_02\n Something like that.\n\n0:45:53\tSPEAKER_02\n But this is actually a conversation you and I have to have about your thesis fantasies and how all this fits into that.\n\n0:46:04\tSPEAKER_04\n Well, I will send you the German tourist data because I have not been able to dig out all this stuff out of the 30 DVDs.\n\n0:46:16\tSPEAKER_06\n Is that roughly the equivalent of what I've seen in English?\n\n0:46:19\tSPEAKER_06\n No, not at all.\n\n0:46:21\tSPEAKER_04\n Dialogues.\n\n0:46:22\tSPEAKER_04\n Smartcom human, Wizard of Oz.\n\n0:46:25\tSPEAKER_06\n Okay, same.\n\n0:46:27\tSPEAKER_06\n Got it.\n\n0:46:28\tSPEAKER_06\n What have I got now?\n\n0:46:30\tSPEAKER_06\n What are the files that you sent me are the user side of some interaction with Faye?\n\n0:46:37\tSPEAKER_06\n Is that what it is?\n\n0:46:38\tSPEAKER_06\n With nothing.\n\n0:46:39\tSPEAKER_06\n Just talking into a box and not hearing anything back.\n\n0:46:43\tSPEAKER_04\n Some data I collected in a couple of weeks for training recognizers that you can't have a way back when.\n\n0:46:51\tSPEAKER_04\n Nothing to write home report.\n\n0:46:54\tSPEAKER_04\n And this ontology note is probably something that I will try to expand once we have the full ontology API.\n\n0:47:05\tSPEAKER_04\n What can we expect to get from the ontology?\n\n0:47:08\tSPEAKER_04\n And hopefully you can also try to find out sooner or later in the course of the summer what we can expect to get from the discourse that might, not the discourse, the utterance, as it were, in terms of...\n\n0:47:23\tSPEAKER_02\n Right, but we're not expecting keys to actually build a parser.\n\n0:47:27\tSPEAKER_02\n No, no, no, no.\n\n0:47:28\tSPEAKER_02\n Okay.\n\n0:47:29\tSPEAKER_02\n We are expecting Jono to build a parser.\n\n0:47:31\tSPEAKER_06\n By the end of the summer, too.\n\n0:47:33\tSPEAKER_06\n No.\n\n0:47:34\tSPEAKER_06\n No.\n\n0:47:35\tSPEAKER_02\n But sort of...\n\n0:47:37\tSPEAKER_02\n He's hoping to do this for his master's thesis by a year from now.\n\n0:47:41\tSPEAKER_02\n Still pretty formidable actually.\n\n0:47:43\tSPEAKER_02\n Absolutely.\n\n0:47:44\tSPEAKER_02\n Limited.\n\n0:47:46\tSPEAKER_02\n I mean, the idea is...\n\n0:47:48\tSPEAKER_02\n Well, the hope is that the parser itself is pretty robust, but it's not popular.\n\n0:47:55\tSPEAKER_02\n Right, right.\n\n0:47:56\tSPEAKER_06\n All business proof, you know, so that's what I talked about.\n\n0:47:58\tSPEAKER_06\n It's like infrastructure, yeah.\n\n0:48:01\tSPEAKER_06\n Right.\n\n0:48:02\tSPEAKER_06\n Sometimes I have to talk to some subset of the people in this group at least about what sort of construction I'm looking for.\n\n0:48:09\tSPEAKER_06\n I mean, you know, obviously, like just, again, looking at this one thing, you know, I saw things from sort of as general as argument structure constructions.\n\n0:48:17\tSPEAKER_06\n Oh, you know, I have to do verb phrase.\n\n0:48:19\tSPEAKER_06\n I have to do unbounded dependencies, you know, which are a variety of constructions in instantiate that.\n\n0:48:26\tSPEAKER_06\n On the other hand, I have to have, you know, this particular fixed expressions or semi-fixed expressions like get plus path expression.\n\n0:48:37\tSPEAKER_06\n Or, you know, how do I get there?\n\n0:48:39\tSPEAKER_06\n How do I get in?\n\n0:48:40\tSPEAKER_06\n How do I get away?\n\n0:48:41\tSPEAKER_06\n Right.\n\n0:48:42\tSPEAKER_06\n And all that kind of stuff.\n\n0:48:43\tSPEAKER_06\n So there's a variety of sort of different sorts of constructions.\n\n0:48:46\tSPEAKER_06\n And it is sort of like anything goes like.\n\n0:48:49\tSPEAKER_02\n Okay, so this is, I think, we're going to mainly work on with George.\n\n0:48:52\tSPEAKER_02\n Okay.\n\n0:48:53\tSPEAKER_02\n And here, let me put some of what I think is, is, so the idea is, first of all, I misspoke when I said we thought you should do the constructions.\n\n0:49:03\tSPEAKER_02\n Because apparently for a linguist, that means to do completely and perfectly.\n\n0:49:06\tSPEAKER_02\n So what I meant was do a first cut app.\n\n0:49:12\tSPEAKER_02\n Okay, because we do want to get them perfectly, but I think we're going to have to do a first cut of a lot of them to see how they interact.\n\n0:49:19\tSPEAKER_06\n Right, exactly.\n\n0:49:20\tSPEAKER_06\n Now, we talked about this before, right?\n\n0:49:21\tSPEAKER_06\n And I mean, it would be completely out of the question to really do more than say, like, oh, I don't know, 10 over the summer.\n\n0:49:27\tSPEAKER_06\n But, you know, obviously we need to get sort of a general view of what things look like.\n\n0:49:32\tSPEAKER_02\n Right. So the idea is going to be to do sort of like Nancy did in some of these papers where you do enough of them so you can go from top to bottom.\n\n0:49:44\tSPEAKER_02\n So you can do, you know, have a complete story of some piece of dialogue.\n\n0:49:51\tSPEAKER_02\n And that's going to be much more useful than having all of the causal constructions and nothing else.\n\n0:49:59\tSPEAKER_02\n Or something like that. So the trick is going to be to take this and pick a sort of lattice of constructions, some lexical and some phrasal.\n\n0:50:12\tSPEAKER_02\n And, you know, whatever you need in order to be able to then by hand, you know, explain some fraction of the utterances.\n\n0:50:24\tSPEAKER_02\n And so exactly which ones that partly depend on your research interests and a bunch of other things.\n\n0:50:30\tSPEAKER_06\n Sure. Okay. But I mean, in terms of the sort of level of analysis, you know, these don't necessarily have to be more complex than like the out of construction and the BCP paper.\n\n0:50:39\tSPEAKER_06\n Correct. It's just like, you know, half a page on your drawing.\n\n0:50:41\tSPEAKER_02\n Oh, yeah, yeah. Half a page is what we'd like.\n\n0:50:43\tSPEAKER_02\n Yeah. And if there's something that really requires a lot more than that, then it does and we have to do it.\n\n0:50:48\tSPEAKER_06\n Yeah. For the first cut, that should be fine.\n\n0:50:52\tSPEAKER_04\n Yeah. We could sit down and think of sort of the the ideal speaker utterances.\n\n0:50:59\tSPEAKER_04\n And I mean, two or three that follow each other. So where we can also sort of once we have everything up and running, show the tremendous insane inferencing capabilities of our system.\n\n0:51:15\tSPEAKER_04\n So, you know, as the smart people have just there's standard demo dialogue, which is what the system survives and nothing but that we could also sort of have the analogy of our sample sentences, the ideal sentences where we have complete construction coverage.\n\n0:51:34\tSPEAKER_04\n And sort of they mention I say sort of the how do I get to X?\n\n0:51:39\tSPEAKER_04\n Yeah. It's definitely going to be a major one.\n\n0:51:42\tSPEAKER_06\n Yeah. That's about six times in this little one here.\n\n0:51:45\tSPEAKER_04\n Where is X? Might be another one, which is not too complicated.\n\n0:51:50\tSPEAKER_04\n And tell me something about X.\n\n0:51:53\tSPEAKER_04\n Yeah.\n\n0:51:54\tSPEAKER_04\n And hey, that's already covering 80% of the system's functionality.\n\n0:51:59\tSPEAKER_02\n Right. That's not covering 80% of the intellectual interest.\n\n0:52:02\tSPEAKER_04\n Yeah.\n\n0:52:03\tSPEAKER_04\n No, we can throw in an out of film construction if you want.\n\n0:52:05\tSPEAKER_02\n No, no, no. Well, the thing is there's a lot that needs to be done.\n\n0:52:09\tSPEAKER_02\n To get this right. Okay.\n\n0:52:12\tSPEAKER_02\n Are we done?\n\n0:52:14\tSPEAKER_04\n I have one bit of news.\n\n0:52:16\tSPEAKER_04\n Yes.\n\n0:52:18\tSPEAKER_04\n The action planner guy has wrote has written a lengthy proposal on how he wants to do the action planning.\n\n0:52:29\tSPEAKER_04\n And I responded to him also rather lengthy how he should do the action planning.\n\n0:52:34\tSPEAKER_02\n And action planning meaning discourse modeling.\n\n0:52:36\tSPEAKER_04\n Yes. And I tacked on a little paragraph about the fact that the whole world calls that much of a dialogue manager.\n\n0:52:44\tSPEAKER_04\n Right.\n\n0:52:45\tSPEAKER_04\n Wouldn't it make sense to do this here too?\n\n0:52:47\tSPEAKER_04\n And also, Rainer Mumalaka is going to be visiting us shortly, most likely in the beginning of June.\n\n0:52:54\tSPEAKER_04\n How've we gone?\n\n0:52:55\tSPEAKER_04\n Yeah. He's just in a conference somewhere and he uses to make it through town.\n\n0:52:59\tSPEAKER_04\n And then making me incapable of going to an AACL for which I had funding.\n\n0:53:08\tSPEAKER_04\n But no no Pittsburgh this year.\n\n0:53:14\tSPEAKER_04\n What is the center Barbara who's going to show a lot of people?\n\n0:53:23\tSPEAKER_04\n That's something I would probably should go.\n\n0:53:26\tSPEAKER_02\n That's one you should probably go to.\n\n0:53:29\tSPEAKER_06\n How much does it cost?\n\n0:53:30\tSPEAKER_02\n I haven't planned to go.\n\n0:53:34\tSPEAKER_02\n Probably we can pay for it.\n\n0:53:38\tSPEAKER_02\n Student rate shouldn't be very high.\n\n0:53:43\tSPEAKER_02\n So if we all decided it's a good idea for you to go then you're right.\n\n0:53:47\tSPEAKER_02\n I mean, I don't have a feeling one way or the other at the moment.\n\n0:53:49\tSPEAKER_02\n Okay.\n\n0:53:50\tSPEAKER_02\n Probably is.\n\n0:53:52\tSPEAKER_02\n Okay. Great.\n\n0:54:22\tNone\n Thank you.\n\n", "summary": [{"summary_text": "There is a problem with the screen saver. Speaker is trying to turn it off, but it doesn't obey his commands. The data collection is going to be implemented via the data collection. The Eva intention is the data tasks where the user would assume the person would like to enter view."}]}