{"filename": "./data/Bed014.txt", "transcript": "0:00:00\tSPEAKER_04\n see\n\n0:00:21\tSPEAKER_05\n Mental mental Rom pilot\n\n0:00:43\tSPEAKER_03\n testing\n\n0:00:45\tSPEAKER_04\n Suppolins. Suppolins.\n\n0:00:49\tSPEAKER_04\n Three.\n\n0:00:50\tSPEAKER_04\n I am three.\n\n0:00:52\tSPEAKER_04\n See, that matches the seat up there.\n\n0:00:56\tSPEAKER_02\n Yeah, well, I guess it's coming up then.\n\n0:00:59\tSPEAKER_04\n Because it's, that starts counting from zero and you start counting from one.\n\n0:01:07\tSPEAKER_04\n There it goes, the classic off by one error.\n\n0:01:12\tSPEAKER_05\n But mine is correct.\n\n0:01:13\tSPEAKER_05\n Is it?\n\n0:01:14\tSPEAKER_05\n It's one.\n\n0:01:15\tSPEAKER_05\n Channel one.\n\n0:01:16\tSPEAKER_05\n Your mic.\n\n0:01:17\tSPEAKER_05\n Oh, oh, oh.\n\n0:01:18\tSPEAKER_04\n So it would.\n\n0:01:19\tSPEAKER_04\n Oh.\n\n0:01:20\tSPEAKER_04\n Oh.\n\n0:01:21\tSPEAKER_04\n So.\n\n0:01:22\tSPEAKER_04\n I've bested you again, Nancy.\n\n0:01:23\tSPEAKER_04\n But your paper is correct.\n\n0:01:25\tSPEAKER_05\n Paper is correct.\n\n0:01:26\tSPEAKER_04\n Look at the paper.\n\n0:01:27\tSPEAKER_04\n I didn't, I was saying the microphone, not the paper.\n\n0:01:30\tSPEAKER_04\n It's always offset.\n\n0:01:32\tSPEAKER_05\n Yes, you bested me again.\n\n0:01:34\tSPEAKER_05\n That's how I think of our continuing interaction.\n\n0:01:37\tSPEAKER_05\n Damn, I boiled again.\n\n0:01:40\tSPEAKER_05\n So is Keith showing up?\n\n0:01:43\tSPEAKER_04\n He's talking with George right now.\n\n0:01:44\tSPEAKER_04\n Is he going to get a rip himself away from, from that?\n\n0:01:48\tSPEAKER_01\n Probably not.\n\n0:01:50\tSPEAKER_01\n Is my guess.\n\n0:01:51\tSPEAKER_04\n Oh, then it's just going to be the five of us.\n\n0:01:53\tSPEAKER_03\n Well, he was very affirmative in his mail saying he will be here at four.\n\n0:01:56\tSPEAKER_03\n But, you know, there was before he knew about the George Vector problem.\n\n0:02:00\tSPEAKER_03\n Right.\n\n0:02:01\tSPEAKER_01\n This is not, it's not bad for the project if Keith is talking to George.\n\n0:02:07\tSPEAKER_01\n Okay.\n\n0:02:10\tSPEAKER_01\n So my suggestion is we just.\n\n0:02:12\tSPEAKER_01\n For the head.\n\n0:02:13\tSPEAKER_01\n For the head.\n\n0:02:14\tSPEAKER_01\n Oh.\n\n0:02:20\tSPEAKER_05\n Are you in charge?\n\n0:02:21\tSPEAKER_05\n Sure.\n\n0:02:24\tSPEAKER_03\n Well, I sort of had informal talks with most of you.\n\n0:02:30\tSPEAKER_03\n So, either just the report, he's really happy about the CBT's being in the same order in the XML as in the.\n\n0:02:36\tSPEAKER_03\n The Java declaration formats.\n\n0:02:39\tSPEAKER_03\n So you don't have to do too much in the star sheet.\n\n0:02:43\tSPEAKER_03\n Yeah.\n\n0:02:44\tSPEAKER_03\n Transversion.\n\n0:02:45\tSPEAKER_03\n The Java, the embedded base wants to take input a base net in some Java notation.\n\n0:02:53\tSPEAKER_03\n And Eva is using the XLR and star sheet processor to convert the XML that's output by the Java base.\n\n0:03:02\tSPEAKER_03\n With it into the ebase input.\n\n0:03:07\tSPEAKER_05\n I should maybe try like emailing the guy and see if he has something already.\n\n0:03:12\tSPEAKER_05\n Sure.\n\n0:03:13\tSPEAKER_02\n He has both the Java base and the embedded base.\n\n0:03:17\tSPEAKER_04\n But that's some sort of conversion program.\n\n0:03:19\tSPEAKER_05\n Yeah.\n\n0:03:20\tSPEAKER_05\n And put them into different formats.\n\n0:03:24\tSPEAKER_04\n I think you should demand things from him.\n\n0:03:27\tSPEAKER_01\n He charges so much.\n\n0:03:29\tSPEAKER_01\n Yeah. No, I think it's a good idea that I'm just going to ask.\n\n0:03:35\tSPEAKER_03\n And well, pretty much on the top of my list, I would have asked Keith how the where is X hand parts is standing.\n\n0:03:47\tSPEAKER_03\n Let's skip that.\n\n0:03:54\tSPEAKER_03\n There's good news from Drone Outer generation templates I've run.\n\n0:03:57\tSPEAKER_04\n So the trees for the XML trees for the for the genet for the synthesizer are written.\n\n0:04:06\tSPEAKER_04\n So I just need to do the red and new set of tree combining rules.\n\n0:04:11\tSPEAKER_04\n But I think those are pretty similar to the old ones.\n\n0:04:14\tSPEAKER_01\n So just going to be, you know, you were going to send me a note about hiring.\n\n0:04:24\tSPEAKER_01\n Yes.\n\n0:04:28\tSPEAKER_01\n I didn't finish the sentence, but he understood it.\n\n0:04:30\tSPEAKER_01\n I know what he's talking about.\n\n0:04:31\tSPEAKER_01\n OK.\n\n0:04:32\tSPEAKER_01\n The names he doesn't.\n\n0:04:33\tSPEAKER_05\n Hiring somebody.\n\n0:04:36\tSPEAKER_03\n The guy.\n\n0:04:37\tSPEAKER_03\n OK, so natural language generation produces not just a surface string that is fed into a Texas speech.\n\n0:04:45\tSPEAKER_03\n Yeah.\n\n0:04:46\tSPEAKER_03\n But surface string with a syntax tree that's fed into a concept of speech.\n\n0:04:51\tSPEAKER_03\n Now, this concept of speech module has certain rules on how if you get the following syntactic structure, how to map this into the present rules.\n\n0:05:01\tSPEAKER_03\n And Faye has full heartedly agreed to rewrite the German concept syntax to the present rules.\n\n0:05:10\tSPEAKER_05\n I know she spoke German.\n\n0:05:12\tSPEAKER_03\n No, she doesn't.\n\n0:05:13\tSPEAKER_03\n Oh, OK.\n\n0:05:14\tSPEAKER_05\n She speaks English.\n\n0:05:15\tSPEAKER_05\n Oh, we write the German ones in English.\n\n0:05:17\tSPEAKER_03\n In English.\n\n0:05:18\tSPEAKER_03\n And therefore, if it's OK that we give her a couple more hours a week, then she'll do that.\n\n0:05:28\tSPEAKER_04\n What languages are written?\n\n0:05:30\tSPEAKER_04\n Is that that scheme thing you showed me?\n\n0:05:32\tSPEAKER_03\n That's the list type scheme.\n\n0:05:34\tSPEAKER_03\n She knows how to program in scheme.\n\n0:05:36\tSPEAKER_04\n I hope.\n\n0:05:37\tSPEAKER_03\n No, I...\n\n0:05:39\tSPEAKER_03\n My guess is I ask for a commented version of that file.\n\n0:05:44\tSPEAKER_03\n If we get that, then it's doable even without getting into it.\n\n0:05:48\tSPEAKER_03\n Even though the scheme stuff is really well documented in the...\n\n0:05:51\tSPEAKER_04\n Well, I guess a few not used to functional programming scheme can be completely incomprehensible, because there's no...\n\n0:05:58\tSPEAKER_04\n Like, there's lots of unnamed functions and, you know...\n\n0:06:02\tSPEAKER_01\n Anyway, it will sort this out.\n\n0:06:05\tSPEAKER_01\n But anyway, send me the note and then I'll check with Morgan on the money.\n\n0:06:10\tSPEAKER_01\n I don't anticipate any problem, but we have to ask.\n\n0:06:15\tSPEAKER_01\n Oh, so this is, you know, on the generation thing, if she's really going to do that, then we should be able to get prosody as well.\n\n0:06:27\tSPEAKER_01\n So it'll say it's nonsense with...\n\n0:06:30\tSPEAKER_00\n Perfect.\n\n0:06:31\tSPEAKER_00\n We should.\n\n0:06:33\tSPEAKER_04\n Are we going to...\n\n0:06:34\tSPEAKER_04\n Can we change the voice of the thing?\n\n0:06:36\tSPEAKER_04\n Because right now the voice sounds like a murderer.\n\n0:06:38\tSPEAKER_03\n Yep, we have to change the voice.\n\n0:06:41\tSPEAKER_04\n Which one?\n\n0:06:42\tSPEAKER_04\n The little smarticus.\n\n0:06:43\tSPEAKER_04\n Smarticus sounds like a murderer.\n\n0:06:45\tSPEAKER_04\n Oh.\n\n0:06:46\tSPEAKER_04\n I have your reservations.\n\n0:06:48\tSPEAKER_02\n But I will not give a key on this, you come into my land.\n\n0:06:52\tSPEAKER_03\n We have the choice between the usual festival voices, which I already told the smart people.\n\n0:06:58\tSPEAKER_03\n We aren't going to use because they're really bad.\n\n0:07:01\tSPEAKER_03\n Festival?\n\n0:07:02\tSPEAKER_03\n Yes, program.\n\n0:07:03\tSPEAKER_01\n Oh, okay, no, since the song.\n\n0:07:05\tSPEAKER_03\n But...\n\n0:07:06\tSPEAKER_03\n Oh, gee, I has crafted a couple of iPhone-type voices that are really nice, and we're going to use that.\n\n0:07:16\tSPEAKER_03\n We can still agree on a gender if we want.\n\n0:07:19\tSPEAKER_03\n We still have male or female.\n\n0:07:22\tSPEAKER_05\n Well, it's like whatever sounds best.\n\n0:07:24\tSPEAKER_05\n Whatever sounds best.\n\n0:07:26\tSPEAKER_04\n There's O.G.A. Stanford.\n\n0:07:27\tSPEAKER_04\n Fortunately, probably male original German institute.\n\n0:07:31\tSPEAKER_03\n Oregon.\n\n0:07:32\tSPEAKER_01\n Oregon, graduate institute.\n\n0:07:36\tSPEAKER_01\n Turns out this, the longstanding links with these guys in the speech group.\n\n0:07:41\tSPEAKER_01\n In fact, there's this guy who's basically got a joint appointment.\n\n0:07:45\tSPEAKER_01\n Heenick Hermanski.\n\n0:07:46\tSPEAKER_01\n He spends a fair amount of time here.\n\n0:07:51\tSPEAKER_01\n Anyway.\n\n0:07:52\tSPEAKER_03\n Won't be a problem.\n\n0:07:55\tSPEAKER_03\n Okay.\n\n0:07:56\tSPEAKER_03\n And it's probably also absolutely uninteresting for all of you to learn that as a group, as of 20 minutes ago, David and I per accident managed to get the whole smart-com system running on the XC Linux machines with the XC and T machines, thereby increasing the number of running smart-com systems in this house from one on my laptop to three.\n\n0:08:19\tSPEAKER_03\n I was just by accident.\n\n0:08:22\tSPEAKER_03\n Yeah, I know, but it's very nice.\n\n0:08:25\tSPEAKER_03\n I suggested to try something that was really kind of, you know, against better knowledge, shouldn't have worked, but it worked.\n\n0:08:33\tSPEAKER_03\n Intuition.\n\n0:08:34\tSPEAKER_03\n Maybe a bit for the intuition thing.\n\n0:08:39\tSPEAKER_03\n Okay.\n\n0:08:40\tSPEAKER_03\n And we'll never find out why.\n\n0:08:42\tSPEAKER_03\n It's just like why the generation for the presentation manager is now working.\n\n0:08:49\tSPEAKER_02\n Which is something you get used to as a programmer, right?\n\n0:08:52\tSPEAKER_02\n It's cool it works that way.\n\n0:08:55\tSPEAKER_03\n So the people in Zabrik and I decided not to touch it ever again.\n\n0:09:02\tSPEAKER_03\n Okay.\n\n0:09:03\tSPEAKER_03\n I was going to ask you where something is.\n\n0:09:08\tSPEAKER_03\n What we know about that.\n\n0:09:10\tSPEAKER_03\n Where is that?\n\n0:09:11\tSPEAKER_03\n Where is the junction?\n\n0:09:13\tSPEAKER_03\n Oh, but we can ask, did you get to read off 400 words?\n\n0:09:19\tSPEAKER_03\n Was it a day?\n\n0:09:21\tSPEAKER_04\n I was looking at it, it doesn't follow logically.\n\n0:09:26\tSPEAKER_04\n The first paragraph doesn't seem to have any link to the second paragraph.\n\n0:09:31\tSPEAKER_02\n Each paragraph is good though.\n\n0:09:34\tSPEAKER_02\n It's fine.\n\n0:09:36\tSPEAKER_02\n It was written by committee.\n\n0:09:39\tSPEAKER_01\n Anyway.\n\n0:09:41\tSPEAKER_01\n But the meeting looks like it's going to be good.\n\n0:09:46\tSPEAKER_05\n I didn't know about it until I remember telling you.\n\n0:09:51\tSPEAKER_01\n I ran across it and I didn't even know where.\n\n0:09:55\tSPEAKER_01\n It's just some weird place.\n\n0:09:58\tSPEAKER_01\n I'm surprised I didn't know about it.\n\n0:10:01\tSPEAKER_01\n We know all the invited speakers.\n\n0:10:04\tSPEAKER_01\n I didn't tell me.\n\n0:10:06\tSPEAKER_01\n Anyway.\n\n0:10:07\tSPEAKER_01\n But anyway.\n\n0:10:08\tSPEAKER_01\n Before we were sort of.\n\n0:10:10\tSPEAKER_01\n I also had a nice email correspondence with Daphne Kohler.\n\n0:10:15\tSPEAKER_01\n I'd love to work with us on using these structured belief nets and stuff.\n\n0:10:25\tSPEAKER_01\n But starting in August.\n\n0:10:27\tSPEAKER_01\n She's also got a new student working on this.\n\n0:10:30\tSPEAKER_01\n We should get in touch with them again in August.\n\n0:10:33\tSPEAKER_01\n We'll figure out a way for you to get seriously connected with their group.\n\n0:10:40\tSPEAKER_01\n That looks pretty good.\n\n0:10:50\tSPEAKER_01\n Yeah, I'll say it now.\n\n0:10:55\tSPEAKER_01\n It looks to me like we're now at a good point to do something.\n\n0:11:02\tSPEAKER_01\n Start working on something really hard.\n\n0:11:05\tSPEAKER_01\n And so far working on things that are easy.\n\n0:11:12\tSPEAKER_01\n Which is mental spaces and or.\n\n0:11:23\tSPEAKER_01\n But the other part of it is the way they connect to these.\n\n0:11:30\tSPEAKER_01\n So there's all the problems that the linguists know about mental spaces.\n\n0:11:37\tSPEAKER_01\n And the cognitive linguists know about.\n\n0:11:39\tSPEAKER_01\n But then there's this problem of the.\n\n0:11:44\tSPEAKER_01\n Belief net people have only done a moderately good job of dealing with temporal belief nets.\n\n0:11:51\tSPEAKER_01\n Which they call dynamic.\n\n0:11:53\tSPEAKER_01\n They incorrectly call dynamic belief nets.\n\n0:11:55\tSPEAKER_01\n So there's a term dynamic belief net.\n\n0:11:57\tSPEAKER_01\n It doesn't mean that.\n\n0:12:00\tSPEAKER_01\n It means time slices.\n\n0:12:03\tSPEAKER_01\n And it's really used those people using.\n\n0:12:07\tSPEAKER_01\n But one of the things I would like to do over the next month and make take more.\n\n0:12:15\tSPEAKER_01\n Is to understand to what extent we can not only figure out the constructions for them for multiple world.\n\n0:12:23\tSPEAKER_01\n But the formalism will look like and where the slots and fillers will be.\n\n0:12:27\tSPEAKER_01\n But also what that would translate into in terms of belief net and the inferences.\n\n0:12:33\tSPEAKER_01\n So the story is that if you have these probabilistic relational models, they're set up in principle.\n\n0:12:40\tSPEAKER_01\n So that you can make new instances and instances connect to each other and all sort of stuff.\n\n0:12:45\tSPEAKER_01\n So it should be feasible to set them up in such a way that if you've got the past tense and the present tense, and each of those is a separate belief structure that they do their inferences with just the couplings that are appropriate.\n\n0:13:03\tSPEAKER_01\n But that's as far as I can tell is putting together two real hard problems.\n\n0:13:06\tSPEAKER_01\n One is the linguistic part of what are the couplings.\n\n0:13:12\tSPEAKER_01\n And when you have a certain construction that implies certain couplings and other couplings.\n\n0:13:16\tSPEAKER_01\n Between, let's say the past and the present or any other one of these things.\n\n0:13:21\tSPEAKER_01\n And then we have this inference problem of exactly technically how does the belief net work?\n\n0:13:28\tSPEAKER_01\n If it's got, let's say one in different tenses or my beliefs in your beliefs or any of these other ones of multiple models.\n\n0:13:40\tSPEAKER_01\n So, you know, in the long run we need to solve both of those and my suggestion is that we start digging into them both in a way that hopefully turns out to be consistent.\n\n0:14:01\tSPEAKER_01\n And sometimes it's actually easier to solve two hard problems than one because they constrain each other. I mean, you've got huge, huge drain of possible choices.\n\n0:14:15\tSPEAKER_01\n Anyway, so that's...\n\n0:14:17\tSPEAKER_02\n Well, yeah, like I solved the problem of... you were talking about how do you... various issues of how come a plural noun gets to quote counters and noun phrase, you know, occurs an argument about the construction. But a bear singular stem doesn't get to act that way.\n\n0:14:34\tSPEAKER_02\n And it would take a really long time to explain it now, but I'm about to write it up this evening.\n\n0:14:38\tSPEAKER_02\n I solved that at the same time as how do we keep adjectives from floating to the left of determiners and how do we keep all of that from floating outside the noun phrase to get something like I, the kick dog.\n\n0:14:51\tSPEAKER_02\n That's great.\n\n0:14:52\tSPEAKER_02\n Did it at once. So maybe it will be a second.\n\n0:14:54\tSPEAKER_01\n No, I know. I think that is going to be sort of the key to this whole... to the big project of the summer of getting the instructions right is that...\n\n0:15:07\tSPEAKER_01\n People do manage to do this, so there probably are some relatively clean rules. They're just not context-free trees.\n\n0:15:16\tSPEAKER_01\n And if the formalism is good, then we should be able to have a sort of moderate scale thing.\n\n0:15:26\tSPEAKER_01\n And that, by the way, is key to what I encourage George to be talking with you about not the formalism yet, but the phenomena.\n\n0:15:37\tSPEAKER_01\n Oh, another thing.\n\n0:15:40\tSPEAKER_01\n There was this thing that Nancy agreed to in a weak moment this morning that...\n\n0:15:47\tSPEAKER_01\n That was very strong.\n\n0:15:50\tSPEAKER_01\n Sorry, in a friendly moment.\n\n0:15:53\tSPEAKER_01\n That's the same thing.\n\n0:15:56\tSPEAKER_01\n Anyway, that we were going to try to get a first cut at the revised formalism by the end of next week.\n\n0:16:06\tSPEAKER_01\n Okay, probably skipping the mental spaces part.\n\n0:16:10\tSPEAKER_01\n Just trying to write up essentially what you guys have worked out so that everybody has something to look at.\n\n0:16:18\tSPEAKER_01\n We've talked about it, but only the intermost-intergroup currently knows...\n\n0:16:25\tSPEAKER_05\n Yeah, and not even all of them really do.\n\n0:16:29\tSPEAKER_02\n The group has a whole no. It's about no individual members.\n\n0:16:32\tSPEAKER_01\n This one of the advantages of document, right, is that it actually transfers from head to head.\n\n0:16:38\tSPEAKER_01\n So, communication.\n\n0:16:41\tSPEAKER_01\n Communication.\n\n0:16:43\tSPEAKER_01\n Anyway, so with a little luck, let's head that as a goal anyway.\n\n0:16:50\tSPEAKER_02\n What was the date there of Monday or...\n\n0:16:54\tSPEAKER_01\n No, no, no, no.\n\n0:16:57\tSPEAKER_01\n We've talked about it at the end of next week.\n\n0:16:59\tSPEAKER_05\n But the two of us will probably talk to it well before...\n\n0:17:02\tSPEAKER_02\n Anyway, let's talk separately.\n\n0:17:04\tSPEAKER_02\n It's a week after that.\n\n0:17:07\tSPEAKER_01\n So sometime next week, it turns out that that effort leads us into some big hole.\n\n0:17:14\tSPEAKER_01\n That's fine.\n\n0:17:16\tSPEAKER_01\n You know, if you say, here's a really hard problem, we haven't solved it.\n\n0:17:20\tSPEAKER_02\n That's just fine.\n\n0:17:22\tSPEAKER_02\n But at least sort of trying to work out what the state of the art is.\n\n0:17:25\tSPEAKER_01\n Right, so to the extent that we have it, let's write it.\n\n0:17:29\tSPEAKER_01\n And to the extent that we don't, let's find out what we need to do.\n\n0:17:34\tSPEAKER_03\n Can we... is it worth thinking of an example out of our tourism thing domain that involves a decent mental space shift?\n\n0:17:47\tSPEAKER_01\n I think it is.\n\n0:17:49\tSPEAKER_01\n But I interrupted before Keith got to tell us what happened with where is the powder tower or whatever.\n\n0:17:55\tSPEAKER_02\n Well, what was supposed to happen?\n\n0:17:58\tSPEAKER_02\n I sort of actually caught up in some other ones.\n\n0:18:01\tSPEAKER_02\n You know, I don't have a write-up of... or have it elaborated on the ideas that we were already talking about.\n\n0:18:07\tSPEAKER_03\n Yeah, I think we already came to the conclusion that we have two alternative paths that we... two alternative ways of representing it.\n\n0:18:16\tSPEAKER_03\n When it sort of has...\n\n0:18:20\tSPEAKER_03\n It's gone.\n\n0:18:23\tSPEAKER_02\n The question of whether the polysamy is sort of like in the construction or the frag management.\n\n0:18:28\tSPEAKER_03\n It comes... this resolved later here.\n\n0:18:31\tSPEAKER_02\n I think it has to be the second case.\n\n0:18:34\tSPEAKER_02\n Yeah.\n\n0:18:36\tSPEAKER_02\n So you... isn't clear what we're talking about here.\n\n0:18:39\tSPEAKER_02\n The question is whether the construction is semantic or ambiguous between asking for location and asking for direction.\n\n0:18:46\tSPEAKER_02\n Should we have... or whether the construction semantically is clearly only asking for location but pragmatically that's construed as meaning...\n\n0:18:55\tSPEAKER_03\n And these are two notes that we can observe in the base net.\n\n0:18:58\tSPEAKER_03\n So these are either true or false, and it's also just true or false.\n\n0:19:03\tSPEAKER_03\n If we encounter a phrase such as where is X, should that set this to true and this to true and the base net figures out which under the situation is more likely?\n\n0:19:15\tSPEAKER_03\n Or should it just activate this, have this be false and the base net figures out whether this actually no means?\n\n0:19:25\tSPEAKER_01\n Oh, that's a separate issue.\n\n0:19:28\tSPEAKER_01\n So I agree with you that it's a disaster to try to make separate constructions for every pragmatic reading.\n\n0:19:42\tSPEAKER_01\n Although there are some that will need to be there.\n\n0:19:47\tSPEAKER_01\n Right.\n\n0:19:48\tSPEAKER_05\n Or have every construction list all the possible pragmatic implications...\n\n0:19:52\tSPEAKER_05\n You can't do that in the same way.\n\n0:19:55\tSPEAKER_01\n Almost certainly, can you pass the solve?\n\n0:19:58\tSPEAKER_01\n Is the construction worth noting that there is this?\n\n0:20:02\tSPEAKER_02\n This one is maybe in the gray area.\n\n0:20:06\tSPEAKER_02\n Is it like that or is it just sort of obvious from the world knowledge that no one...\n\n0:20:12\tSPEAKER_02\n You wouldn't want to know the location without wanting to know how to get there.\n\n0:20:15\tSPEAKER_03\n Or in some cases it's quite definite.\n\n0:20:18\tSPEAKER_02\n So that you just want to know what the question is basically is this conventional or conversational?\n\n0:20:24\tSPEAKER_02\n Exactly.\n\n0:20:26\tSPEAKER_01\n I guess the more important thing at this stage is that we should be able to know how we would handle it in the short run.\n\n0:20:34\tSPEAKER_01\n It's more important to know how we would treat technically what we would do if we decided A and what we would do if we decided B.\n\n0:20:42\tSPEAKER_01\n Then it is to decide A or B right now.\n\n0:20:45\tSPEAKER_05\n There will be other examples that are one way.\n\n0:20:48\tSPEAKER_01\n We know for sure that we have to be able to do both.\n\n0:20:51\tSPEAKER_01\n So I guess in the short run let's be real clear on what the two alternatives would be.\n\n0:20:59\tSPEAKER_03\n And then we had another idea floating around which we wanted to get your input on and that concerns the...\n\n0:21:08\tSPEAKER_03\n But the next thing is we would have a person that would like to work on it.\n\n0:21:12\tSPEAKER_03\n And that's Irina Gurriavitch from EML who is going to be visiting us the week before August and a little bit into August.\n\n0:21:23\tSPEAKER_03\n And she would like to apply the ontology that is being crafted at EML.\n\n0:21:32\tSPEAKER_03\n That's not the one I sent you. The one I sent you was from GMD out of the European Crumpet Sterbil.\n\n0:21:38\tSPEAKER_03\n Agreed.\n\n0:21:41\tSPEAKER_03\n And one of the reasons... one of those ideas was...\n\n0:21:45\tSPEAKER_03\n So back to the old journal observation that if you have a dialogue history and it said the word admission fee was mentioned.\n\n0:21:58\tSPEAKER_03\n It's more likely that the person actually wants to enter than just take a picture of it from the outside.\n\n0:22:05\tSPEAKER_03\n Now what could imagine to have a list for each construction of things that one should look up in the discourse history?\n\n0:22:12\tSPEAKER_03\n That's the really stupid way.\n\n0:22:14\tSPEAKER_03\n Then there is the really clever way that was suggested by Keith.\n\n0:22:18\tSPEAKER_03\n And then there is the middle way that I'm suggesting.\n\n0:22:22\tSPEAKER_03\n That is you get X, which is whatever the castle. The ontology will tell us that castles have opening hours, that they have admission fees, they have whatever.\n\n0:22:34\tSPEAKER_03\n And then this is... we go via a Thessaurous and look up certain linguistic surface structures that are related to these concepts and feed those through the dialogue history and check dynamically for each entity.\n\n0:22:49\tSPEAKER_03\n We look it up, check whether any of these were mentioned and then activate the corresponding nodes on the discourse side.\n\n0:22:58\tSPEAKER_03\n But Keith suggested that a much cleaner way would be to keep track of the discourse in such a way that you... if you know that something like that has been mentioned before, this just continues to add up.\n\n0:23:11\tSPEAKER_02\n If someone mentions admission fees, that activates an enter schema which sticks around for a little while in your representation of what's being talked about.\n\n0:23:21\tSPEAKER_02\n And then when someone asks where is Axe, you've already got the end of a priming.\n\n0:23:26\tSPEAKER_05\n Yeah.\n\n0:23:27\tSPEAKER_01\n Priming, spreading the information.\n\n0:23:29\tSPEAKER_01\n So that's certainly more realistic, psychologically.\n\n0:23:35\tSPEAKER_01\n Now it's technically...\n\n0:23:37\tSPEAKER_04\n Well, does it seem like if you just manage the dialogue history with a thread that kept track of the activity of...\n\n0:23:48\tSPEAKER_04\n I mean, because the thread would know what nodes needed to be activated so we could just keep track of how long it's been since something's been mentioned and automatically loaded in.\n\n0:23:59\tSPEAKER_01\n You could do that. But here's a way... in the bullet base network, you could think about it this way.\n\n0:24:11\tSPEAKER_01\n That if at the time admissions fee was mentioned, you could increase the probability that someone wanted to enter.\n\n0:24:24\tSPEAKER_04\n Well, that's what I wasn't thinking in terms of enter scheme as I was just...\n\n0:24:29\tSPEAKER_01\n Fair enough. Okay. But in terms of the current implementation, right?\n\n0:24:33\tSPEAKER_01\n So that...\n\n0:24:35\tSPEAKER_05\n It would be higher in the...\n\n0:24:38\tSPEAKER_01\n The conditional probability that someone... so at the time you mentioned it, this is essentially the base net equivalent of the spreading activation.\n\n0:24:48\tSPEAKER_01\n In some ways, it's not as good, but it's the implementation we got. We don't have a connection with the implementation.\n\n0:24:54\tSPEAKER_01\n Now, my guess is that it's not a question of time, but it is a question of whether another intervening object has been mentioned.\n\n0:25:05\tSPEAKER_01\n I mean, we could look at dialogue. This is... of course, the other thing we do is we have this data coming, which probably will blow all our theories.\n\n0:25:13\tSPEAKER_01\n But skipping that. So... but my guess is what will probably happen... here's a proposed design.\n\n0:25:20\tSPEAKER_01\n Is that there are certain constructions which for our purposes do change the probabilities of EFA decisions and various other kinds.\n\n0:25:31\tSPEAKER_01\n And that the standard way that these contexts work is sort of stacked like or whatever. But that's sort of the most recent thing.\n\n0:25:44\tSPEAKER_01\n And so it could be that when another... tourist entity gets mentioned, you...\n\n0:25:52\tSPEAKER_01\n Re-initialize the state.\n\n0:25:58\tSPEAKER_01\n And of course, if we had a fancy one with multiple worlds, you could have... you could keep track of what someone was saying about this and that.\n\n0:26:12\tSPEAKER_01\n You know, I want to go... in the morning, I want...\n\n0:26:13\tSPEAKER_02\n What's my plan for today? Here's my plan for today.\n\n0:26:15\tSPEAKER_01\n Yeah, in the morning. I'm planning to go shopping the afternoon, to the powder tower. I talk to some talking about shopping.\n\n0:26:22\tSPEAKER_01\n And then you say, you know, well, what's it cost? Or something? Anyway, so one could well imagine, but not yet.\n\n0:26:31\tSPEAKER_01\n But I do think that the... it'll turn out that it's going to be... pretty much on whether there's been an override.\n\n0:26:42\tSPEAKER_03\n Yeah, I mean, if you ask how much I said train ride in Sonoma, around the Winiards cost and then somebody tells you it's $60, and then you say, okay, how much is...\n\n0:26:55\tSPEAKER_03\n I would like to visit the... whatever, something completely different. Then I go to... you know, poor Drase. It's not more likely that you want to enter anything, but it's...\n\n0:27:06\tSPEAKER_05\n It's not a matter of fact, I think, the rejection of entering and doing that. So when you admit... have admission fee and it changes something, it's only for that particular...\n\n0:27:14\tSPEAKER_05\n It's relational, right? Yeah, I think that...\n\n0:27:16\tSPEAKER_01\n Yeah, well, and the simple idea is that it's only... it's only for the current tourist entity of interest.\n\n0:27:24\tSPEAKER_03\n But that's... I mean, this... this function... so has the current object being mentioned in... with...\n\n0:27:33\tSPEAKER_01\n No, no, no. It goes in the... it goes in the direction. Is... when the... this is mentioned the... probability of... let's say entering...\n\n0:27:47\tSPEAKER_01\n A change of objects.\n\n0:27:48\tSPEAKER_01\n Changes.\n\n0:27:50\tSPEAKER_04\n You could just... basically, it... it observes and... that's the... a node for...\n\n0:27:56\tSPEAKER_01\n Enter to... but I think... Robert's right that to determine that...\n\n0:28:03\tSPEAKER_01\n Okay, you may well want to go through a... the... the... so... if the issue is... if... so now this... this construction has been matched and you say, okay, does this actually have any implications for our decisions? Then there's another piece of code that presumably... does that computation?\n\n0:28:22\tSPEAKER_05\n So sort of forward-changing in a way... rather than... yeah.\n\n0:28:27\tSPEAKER_01\n But what Robert's saying is... is... and I think he's right... is you don't want to try to build into the construction itself...\n\n0:28:36\tSPEAKER_01\n all the synonyms and all the... maybe. I have to think about that.\n\n0:28:46\tSPEAKER_01\n I don't know. I mean, I can think... I can think of arguments in either direction on that. But somehow you want to do it.\n\n0:28:53\tSPEAKER_03\n It's just another sort of construction side. It's... how to get the possible inferences we can draw from the discourse history...\n\n0:29:06\tSPEAKER_03\n or changing of the probabilities and... or...\n\n0:29:12\tSPEAKER_05\n I guess it's like... the other thing is whether you have a user model that has, you know, whatever, a current plan...\n\n0:29:21\tSPEAKER_05\n whatever... plans I have been discussed and... I don't think.\n\n0:29:26\tSPEAKER_04\n What's the argument for putting it in the construction? Is it just that the synonyms selection is better?\n\n0:29:32\tSPEAKER_01\n Well, the argument is that... you're going to have the... if you recognize the word...\n\n0:29:41\tSPEAKER_01\n you recognize the word which means you have a electrical construction for it...\n\n0:29:45\tSPEAKER_01\n so you could just as well tag the electrical construction with the fact that it's a...\n\n0:29:52\tSPEAKER_01\n you know, 30% increase in probability of entering. So you could... you could invert the whole thing...\n\n0:30:00\tSPEAKER_01\n so you... you tagged that information onto the lexicon since you... had to recognize it anyway.\n\n0:30:08\tSPEAKER_01\n That's the argument in the other direction.\n\n0:30:12\tSPEAKER_03\n Even though the lexical construction itself or the other context won't do it.\n\n0:30:19\tSPEAKER_03\n You have to keep track of what the person is. But I'm not interested in the opening times...\n\n0:30:24\tSPEAKER_03\n is sort of more a V time.\n\n0:30:26\tSPEAKER_01\n Yeah, there's that as well.\n\n0:30:31\tSPEAKER_03\n But we'll... we have time to... just a sidetrack.\n\n0:30:38\tSPEAKER_03\n But I think it's also something that people have not done before is...\n\n0:30:43\tSPEAKER_03\n sort of abuse and autology for these kinds of inferences on whether anything relevant to the current...\n\n0:30:52\tSPEAKER_03\n something has been... has crept up in the data history already or not.\n\n0:30:58\tSPEAKER_03\n And I have the... if we wanted to have that function in the dialog...\n\n0:31:04\tSPEAKER_03\n dialog module of SmartCom, I have the written consent of Jan to put it in there.\n\n0:31:09\tSPEAKER_01\n Good. Okay. Well, this is highly relevant to someone's thesis.\n\n0:31:14\tSPEAKER_03\n Yes. You've noticed that.\n\n0:31:17\tSPEAKER_03\n That's... I'm keeping on good terms with Jan.\n\n0:31:21\tSPEAKER_01\n So the point is, it's very likely that Robert's thesis is going to be along these lines.\n\n0:31:25\tSPEAKER_01\n And the local rules are... if it's your thesis, you get to decide how it's done.\n\n0:31:32\tSPEAKER_01\n Okay. So if you know... if this is... seriously, if this becomes part of your thesis, you say, hey, we're going to do it this way. That's the way it's done.\n\n0:31:40\tSPEAKER_05\n Yeah, it's not me. It's always me when it's someone's thesis.\n\n0:31:44\tSPEAKER_01\n No, no, no. No, no. We got a lot of thesis.\n\n0:31:47\tSPEAKER_01\n It's going to be nice right now. Yeah.\n\n0:31:49\tSPEAKER_05\n So nice.\n\n0:31:50\tSPEAKER_03\n Well, let's talk after Friday the 29th, then we'll see you all.\n\n0:31:55\tSPEAKER_03\n Right. So he's got a...\n\n0:31:58\tSPEAKER_03\n He's got a... meeting a company with a thesis advisor.\n\n0:32:01\tSPEAKER_03\n I should try to finish it by then, yeah.\n\n0:32:04\tSPEAKER_01\n Yeah. So I think, in fact, that's the other thing.\n\n0:32:32\tSPEAKER_01\n This is... speaking of heart problems, it's a very good time to start trying to make explicit where construal comes in and where the construction per se ends and where construal comes in.\n\n0:32:49\tSPEAKER_01\n Because this is clearly part of...\n\n0:32:51\tSPEAKER_01\n I've never been to that.\n\n0:32:52\tSPEAKER_01\n We've been doing quite a bit of that.\n\n0:32:53\tSPEAKER_01\n That's part of what the...\n\n0:32:54\tSPEAKER_01\n Many jobs for you, Robert.\n\n0:32:55\tSPEAKER_01\n Yeah. Well, he's going to need you.\n\n0:32:56\tSPEAKER_01\n He's always landing your camera in your line.\n\n0:32:58\tSPEAKER_01\n Yeah. Right. So...\n\n0:32:59\tSPEAKER_01\n So that's why we want the formalism.\n\n0:33:02\tSPEAKER_01\n It's because it is going to have implicit in it.\n\n0:33:05\tSPEAKER_05\n No, you weren't there on purpose.\n\n0:33:08\tSPEAKER_05\n Maybe my thesis decision.\n\n0:33:10\tSPEAKER_01\n Right. Well, that's...\n\n0:33:12\tSPEAKER_01\n Ten of... they aren't decisions. They're just proposals.\n\n0:33:15\tSPEAKER_01\n Decisions.\n\n0:33:16\tSPEAKER_01\n Okay.\n\n0:33:17\tSPEAKER_01\n That's the point.\n\n0:33:18\tSPEAKER_03\n It's constraints.\n\n0:33:19\tSPEAKER_03\n That's kind of constraints that Robert's going to do.\n\n0:33:21\tSPEAKER_01\n Yeah.\n\n0:33:22\tSPEAKER_04\n Yeah, but the decisions I made were headed to with my thesis.\n\n0:33:25\tSPEAKER_04\n So consequently, don't I get to decide then that it's Robert's job?\n\n0:33:28\tSPEAKER_04\n No.\n\n0:33:30\tSPEAKER_05\n I'll just pick a piece of the problem and then push the hard stuff into the center and say it's Robert's.\n\n0:33:38\tSPEAKER_03\n I've always been completely in favor of consensus decisions.\n\n0:33:41\tSPEAKER_03\n So we'll...\n\n0:33:42\tSPEAKER_03\n We'll find a way.\n\n0:33:43\tSPEAKER_01\n We will.\n\n0:33:44\tSPEAKER_01\n But...\n\n0:33:46\tSPEAKER_01\n I haven't.\n\n0:33:47\tSPEAKER_03\n It might even be interesting then to say that I should be forced to sort of pull some of the ideas that if we're floating in my head out of the top head.\n\n0:34:01\tSPEAKER_03\n Yes.\n\n0:34:02\tSPEAKER_03\n And...\n\n0:34:03\tSPEAKER_03\n That's better for us, that's good.\n\n0:34:07\tSPEAKER_03\n Anyway.\n\n0:34:08\tSPEAKER_01\n No, absolutely.\n\n0:34:09\tSPEAKER_01\n So you had done one draft.\n\n0:34:13\tSPEAKER_03\n Yes.\n\n0:34:14\tSPEAKER_03\n And...\n\n0:34:15\tSPEAKER_01\n And another draft.\n\n0:34:16\tSPEAKER_03\n None of that is basically still around, but...\n\n0:34:19\tSPEAKER_03\n I guess it's not around.\n\n0:34:21\tSPEAKER_01\n I didn't read it.\n\n0:34:22\tSPEAKER_01\n I'm shocked.\n\n0:34:23\tSPEAKER_01\n This is the first time I've seen a thesis proposal change.\n\n0:34:26\tSPEAKER_01\n Anyway.\n\n0:34:27\tSPEAKER_01\n But yeah, second...\n\n0:34:28\tSPEAKER_01\n That would be great.\n\n0:34:29\tSPEAKER_01\n I mean, you're going to need it anyway.\n\n0:34:32\tSPEAKER_03\n Yeah, and I would like to discuss it and get your guys' input and make it sort of bomb-proof.\n\n0:34:39\tSPEAKER_01\n Yep.\n\n0:34:40\tSPEAKER_01\n Bomb-proof.\n\n0:34:41\tSPEAKER_01\n Put it proof.\n\n0:34:42\tSPEAKER_01\n That's what I was searching for.\n\n0:34:43\tSPEAKER_01\n Anyway.\n\n0:34:44\tSPEAKER_01\n Good luck.\n\n0:34:45\tNone\n So that...\n\n0:34:46\tSPEAKER_01\n I mean, so this is the point is we're going to have to cycle through this.\n\n0:34:51\tSPEAKER_01\n But the draft of the proposal on construction is going to tell us a lot about what we think needs to be done by Construro.\n\n0:35:03\tSPEAKER_01\n And we've got to be doing it.\n\n0:35:06\tSPEAKER_03\n Yeah, we need some...\n\n0:35:08\tSPEAKER_03\n Then we need to make some dates.\n\n0:35:13\tSPEAKER_03\n Meeting...\n\n0:35:14\tSPEAKER_03\n Regular meeting time for the summer.\n\n0:35:15\tSPEAKER_03\n We really haven't found what we did.\n\n0:35:17\tSPEAKER_03\n Thursday is one for a while.\n\n0:35:19\tSPEAKER_03\n I just talked to ARMY.\n\n0:35:21\tSPEAKER_03\n It's a coincidence that he can't do...\n\n0:35:23\tSPEAKER_03\n Couldn't do today here.\n\n0:35:25\tSPEAKER_03\n Usually he can.\n\n0:35:26\tSPEAKER_03\n Usually he has no real constraints.\n\n0:35:28\tSPEAKER_01\n And the...\n\n0:35:29\tSPEAKER_01\n The NTL meeting moved to Wednesday because of...\n\n0:35:32\tSPEAKER_01\n There was just...\n\n0:35:33\tSPEAKER_01\n Yeah, you wanted to put...\n\n0:35:34\tSPEAKER_01\n But...\n\n0:35:35\tSPEAKER_01\n So if that's okay with you, you...\n\n0:35:37\tSPEAKER_02\n Is it staying basically at that Wednesday noon?\n\n0:35:39\tSPEAKER_02\n Yeah, it was...\n\n0:35:40\tSPEAKER_02\n I thought it was staying.\n\n0:35:41\tSPEAKER_05\n Right.\n\n0:35:42\tSPEAKER_05\n I thought it was just a week that we were changing.\n\n0:35:44\tSPEAKER_03\n Okay.\n\n0:35:45\tSPEAKER_03\n And how do we feel about doing it Wednesday?\n\n0:35:49\tSPEAKER_03\n Because it seems to me that this is sort of a time where when we...\n\n0:35:52\tSPEAKER_03\n Have things to discuss with other people, they seem to be tons of people around.\n\n0:35:57\tSPEAKER_01\n The only disadvantage is that it may interfere with other...\n\n0:36:02\tSPEAKER_01\n Subgroup meetings.\n\n0:36:04\tSPEAKER_01\n You know, other...\n\n0:36:05\tSPEAKER_01\n No, people in this group connecting with...\n\n0:36:07\tSPEAKER_01\n Those people...\n\n0:36:08\tSPEAKER_01\n Those people...\n\n0:36:09\tSPEAKER_01\n Who might not be around so much.\n\n0:36:12\tSPEAKER_01\n I don't care.\n\n0:36:15\tSPEAKER_01\n You know, I have no fix.\n\n0:36:17\tSPEAKER_02\n I would like to avoid more than one ICSI meeting per day.\n\n0:36:21\tSPEAKER_02\n And passing over.\n\n0:36:22\tSPEAKER_01\n Okay.\n\n0:36:23\tSPEAKER_02\n I mean, I don't know.\n\n0:36:24\tSPEAKER_03\n No, that's fine.\n\n0:36:25\tSPEAKER_03\n I mean...\n\n0:36:26\tSPEAKER_03\n I'd like to have them all in one day.\n\n0:36:27\tSPEAKER_03\n Yeah.\n\n0:36:28\tSPEAKER_01\n I get to them often then.\n\n0:36:29\tSPEAKER_01\n People different their tastes in this matter.\n\n0:36:31\tSPEAKER_01\n I'm neutral.\n\n0:36:32\tSPEAKER_01\n Yeah.\n\n0:36:33\tSPEAKER_00\n Who's here anyways?\n\n0:36:35\tSPEAKER_01\n Yeah, but...\n\n0:36:36\tSPEAKER_01\n That's me too.\n\n0:36:37\tSPEAKER_03\n I'm basically I'm here.\n\n0:36:38\tSPEAKER_03\n One sort of thing is this room is taken after 3.30, pretty much every day by the data collection.\n\n0:36:46\tSPEAKER_03\n So we have subjects in here except for this week we have subjects in here.\n\n0:36:49\tSPEAKER_03\n That's why it was 1.\n\n0:36:50\tSPEAKER_03\n Okay.\n\n0:36:51\tSPEAKER_03\n So we just knew...\n\n0:36:52\tSPEAKER_05\n Do you say that Ami can't make 1 o'clock?\n\n0:36:54\tSPEAKER_03\n No, he can.\n\n0:36:55\tSPEAKER_03\n Okay.\n\n0:36:56\tSPEAKER_03\n So let's say Thursday 1.\n\n0:36:57\tSPEAKER_03\n But for next week this is a bit late.\n\n0:37:00\tSPEAKER_03\n So I would suggest that we need to talk...\n\n0:37:04\tSPEAKER_03\n Oh, okay.\n\n0:37:05\tSPEAKER_05\n We do Thursday at 1.30 with that...\n\n0:37:08\tSPEAKER_05\n No.\n\n0:37:09\tSPEAKER_03\n No.\n\n0:37:10\tSPEAKER_03\n Yes.\n\n0:37:11\tSPEAKER_03\n Oh, really?\n\n0:37:12\tSPEAKER_03\n Because this room is again taken at 2.30 by Morgan.\n\n0:37:14\tSPEAKER_05\n Okay.\n\n0:37:15\tSPEAKER_05\n Okay, that's fine.\n\n0:37:16\tSPEAKER_03\n And the meeting recording meeting...\n\n0:37:19\tSPEAKER_03\n Okay.\n\n0:37:20\tSPEAKER_03\n Meeting recording on meeting meetings.\n\n0:37:23\tSPEAKER_03\n So...\n\n0:37:24\tSPEAKER_01\n So you propose that we meet Tuesday.\n\n0:37:27\tSPEAKER_01\n How about that?\n\n0:37:28\tSPEAKER_05\n I think...\n\n0:37:29\tSPEAKER_05\n We are meeting Tuesday.\n\n0:37:30\tSPEAKER_05\n I mean we usually meet Tuesday for...\n\n0:37:32\tSPEAKER_05\n I think we have a link list at 2.\n\n0:37:35\tSPEAKER_05\n So...\n\n0:37:36\tSPEAKER_05\n Do you want to meet again here?\n\n0:37:38\tSPEAKER_04\n Is the speech gen meeting still at on Tuesdays?\n\n0:37:40\tSPEAKER_03\n Well, actually we did scrap our Monday time just because...\n\n0:37:43\tSPEAKER_03\n Maybe I didn't need a scrap.\n\n0:37:45\tSPEAKER_03\n Come Monday.\n\n0:37:46\tSPEAKER_03\n So there is nothing synceding Monday anymore either.\n\n0:37:49\tSPEAKER_04\n Although I thought you wanted to go camping on Monday...\n\n0:37:52\tSPEAKER_04\n Or take off Mondays a lot so you could go camping.\n\n0:37:54\tSPEAKER_03\n That's another thing.\n\n0:37:56\tSPEAKER_03\n But I mean those are usually the holidays anyways.\n\n0:38:01\tSPEAKER_03\n Like usually.\n\n0:38:02\tSPEAKER_03\n Sometimes.\n\n0:38:03\tSPEAKER_03\n It works out that way.\n\n0:38:06\tSPEAKER_03\n So...\n\n0:38:07\tSPEAKER_05\n Well, I mean the linguist meeting happens to be at 2.\n\n0:38:11\tSPEAKER_05\n But I think that's...\n\n0:38:12\tSPEAKER_02\n It should be relatively flexible.\n\n0:38:19\tSPEAKER_05\n It's pretty flexible I think.\n\n0:38:20\tSPEAKER_02\n Yeah.\n\n0:38:21\tSPEAKER_02\n There's just sort of the...\n\n0:38:23\tSPEAKER_02\n The multiple-error meetings.\n\n0:38:25\tSPEAKER_02\n Yeah.\n\n0:38:26\tSPEAKER_02\n And you know, of course Nancy and I are just sort of always talking anyway.\n\n0:38:29\tSPEAKER_02\n Yeah.\n\n0:38:31\tSPEAKER_02\n You do it in that room.\n\n0:38:32\tSPEAKER_03\n You know, I mean...\n\n0:38:33\tSPEAKER_03\n Okay, so forget about the camping thing.\n\n0:38:36\tSPEAKER_03\n So...\n\n0:38:37\tSPEAKER_03\n Any other problems?\n\n0:38:39\tSPEAKER_03\n I suggest that Monday.\n\n0:38:40\tSPEAKER_03\n If that's a problem for me then I shouldn't suggest it.\n\n0:38:43\tSPEAKER_03\n So...\n\n0:38:45\tSPEAKER_02\n All of the proposed times I'm trying to...\n\n0:38:48\tSPEAKER_01\n One day...\n\n0:38:49\tSPEAKER_01\n Okay, what I mean...\n\n0:38:50\tSPEAKER_01\n What I think we're just saying is that...\n\n0:38:53\tSPEAKER_01\n Early...\n\n0:38:54\tSPEAKER_01\n At least for next week there's a lot of stuff we want to get done.\n\n0:38:56\tSPEAKER_01\n So why don't we find the meet Monday and...\n\n0:38:58\tSPEAKER_01\n We'll see if we want to meet any more than that.\n\n0:39:01\tSPEAKER_00\n Okay.\n\n0:39:02\tSPEAKER_00\n What time?\n\n0:39:03\tSPEAKER_00\n At...\n\n0:39:04\tSPEAKER_03\n One, two, three.\n\n0:39:05\tSPEAKER_03\n Three is too late.\n\n0:39:06\tSPEAKER_03\n Two third time.\n\n0:39:07\tSPEAKER_01\n Oh, I...\n\n0:39:08\tSPEAKER_01\n Yeah, I actually...\n\n0:39:09\tSPEAKER_01\n Two is the earliest I can meet on Monday.\n\n0:39:11\tNone\n Okay, two.\n\n0:39:14\tSPEAKER_01\n You're I'm blissfully agreeing to things in realizing that I actually do have some scuffle schedule on Monday's.\n\n0:39:21\tSPEAKER_05\n You guys look streamlined, right?\n\n0:39:23\tSPEAKER_04\n No way.\n\n0:39:25\tSPEAKER_05\n You'll come and take all the headphone first.\n\n0:39:29\tSPEAKER_05\n I'm a dead memory mind.\n\n0:39:30\tSPEAKER_03\n And...\n\n0:39:31\tSPEAKER_03\n Thank you.\n\n0:39:32\tSPEAKER_03\n Why do I have this and those I'm getting?\n\n0:39:33\tSPEAKER_03\n Do I get to see your formalism before that?\n\n0:39:37\tSPEAKER_05\n Uh...\n\n0:39:38\tSPEAKER_05\n Would you like to?\n\n0:39:39\tNone\n Mm-hmm.\n\n0:39:40\tNone\n Okay.\n\n0:39:42\tSPEAKER_03\n I was actually going to work on it for tomorrow.\n\n0:39:44\tSPEAKER_03\n Get a notion of what you guys have been told for me.\n\n0:39:47\tSPEAKER_01\n Maybe we can put this part of what we can do Monday if we want.\n\n0:39:50\tSPEAKER_01\n Okay.\n\n0:39:51\tSPEAKER_01\n I mean, I...\n\n0:39:52\tSPEAKER_05\n Some version.\n\n0:39:53\tSPEAKER_05\n Yeah, so there was like, you know, in my head the goal to have like an intermediate version, like, everything I know.\n\n0:39:59\tSPEAKER_05\n And then I would talk to you and figure out everything you know.\n\n0:40:02\tSPEAKER_05\n Okay.\n\n0:40:03\tSPEAKER_02\n But, you know, see if they're consistent.\n\n0:40:04\tSPEAKER_02\n Maybe you and I should meet sort of formalized first thing Monday.\n\n0:40:06\tSPEAKER_02\n Yeah.\n\n0:40:07\tSPEAKER_05\n That's fine with me, sir.\n\n0:40:09\tSPEAKER_05\n You said you're busy over until the weekend, right?\n\n0:40:13\tSPEAKER_02\n Yeah, sort of through the weekend because Kate has a photography.\n\n0:40:15\tSPEAKER_02\n That's fine.\n\n0:40:16\tSPEAKER_05\n So we might continue our email thing that might be fine to you, sir.\n\n0:40:20\tSPEAKER_02\n Yeah, if there's time after this, I'll show you the number.\n\n0:40:23\tSPEAKER_05\n Okay, that would be cool.\n\n0:40:24\tSPEAKER_05\n Okay.\n\n0:40:25\tSPEAKER_05\n And we'll...\n\n0:40:26\tSPEAKER_03\n So the ideas on Monday and Tuesday will see an intermediate version of the formalism for the construction.\n\n0:40:32\tSPEAKER_03\n So that's okay for you.\n\n0:40:33\tSPEAKER_03\n And do an online merging with my Constoral ideas.\n\n0:40:38\tSPEAKER_03\n Sure.\n\n0:40:39\tSPEAKER_03\n Okay.\n\n0:40:40\tSPEAKER_03\n Sure.\n\n0:40:41\tSPEAKER_03\n So it won't be like a, say my formal presentation of my proposal, it'll be more like towards finalizing that proposal.\n\n0:40:47\tSPEAKER_03\n Okay.\n\n0:40:50\tSPEAKER_05\n Because then you'll find out more about what we're making you do.\n\n0:40:53\tSPEAKER_05\n Yeah.\n\n0:40:54\tSPEAKER_05\n Yeah.\n\n0:40:55\tSPEAKER_05\n And then we'll make a presentation of your proposal.\n\n0:40:57\tSPEAKER_03\n Perfect.\n\n0:40:58\tSPEAKER_03\n Can you also write it up?\n\n0:40:59\tSPEAKER_03\n So what we're doing and the complement is Robert.\n\n0:41:01\tSPEAKER_03\n I send you a staff file, right?\n\n0:41:03\tSPEAKER_03\n It's just...\n\n0:41:04\tSPEAKER_03\n I always send you my, my, my new files.\n\n0:41:07\tSPEAKER_03\n Okay.\n\n0:41:08\tSPEAKER_03\n And...\n\n0:41:11\tSPEAKER_03\n So it's good.\n\n0:41:13\tSPEAKER_02\n So we should probably talk about the other side of the, where is X construction, which is the issue of, how do you simulate questions?\n\n0:41:21\tSPEAKER_02\n Yeah.\n\n0:41:22\tSPEAKER_02\n Does SimSpec look like for questions?\n\n0:41:23\tSPEAKER_02\n Mm-hmm.\n\n0:41:24\tSPEAKER_02\n Because...\n\n0:41:25\tSPEAKER_02\n Yeah.\n\n0:41:26\tSPEAKER_02\n Yeah.\n\n0:41:27\tSPEAKER_02\n Now we had an idea for this, which seems like a problem.\n\n0:41:28\tSPEAKER_01\n Great.\n\n0:41:29\tSPEAKER_01\n Okay.\n\n0:41:30\tSPEAKER_01\n Yeah.\n\n0:41:31\tSPEAKER_01\n SimSpec may need, we may need to rename that.\n\n0:41:32\tSPEAKER_01\n Oh yeah.\n\n0:41:33\tSPEAKER_01\n Okay.\n\n0:41:34\tSPEAKER_01\n So let's think of a name for whatever the, his intermediate structure is.\n\n0:41:37\tSPEAKER_01\n Oh, we talked about SimSpec for some unexpected specification.\n\n0:41:41\tSPEAKER_01\n And that seems...\n\n0:41:43\tSPEAKER_01\n Uh...\n\n0:41:44\tSPEAKER_01\n You know...\n\n0:41:45\tSPEAKER_01\n You know, it's a minimal change.\n\n0:41:47\tSPEAKER_05\n When you change one vowel, it's great.\n\n0:41:49\tSPEAKER_05\n All the old like...\n\n0:41:51\tSPEAKER_05\n Right.\n\n0:41:52\tSPEAKER_05\n...crabs just changed the...\n\n0:41:53\tSPEAKER_01\n Right.\n\n0:41:54\tSPEAKER_01\n You're a little substance to substance.\n\n0:41:55\tSPEAKER_01\n That's what text substitutes in Macros or for.\n\n0:41:57\tSPEAKER_01\n Anyway.\n\n0:41:58\tSPEAKER_01\n So let's, let's, for the moment, call it that until we think of something better.\n\n0:42:02\tSPEAKER_01\n And yeah, we absolutely need to find part of what was missing were markings of all sorts that weren't in there.\n\n0:42:09\tSPEAKER_01\n Including questions.\n\n0:42:11\tSPEAKER_01\n We never did figure out how we were going to do emphasis in...\n\n0:42:15\tSPEAKER_01\n In the SimSpec.\n\n0:42:17\tSPEAKER_05\n Yeah, we talked a little bit about that too, which...\n\n0:42:20\tSPEAKER_05\n It's hard for me to figure out that sort of general linguistic issues, how they map onto this particular one, but...\n\n0:42:27\tSPEAKER_05\n Okay.\n\n0:42:28\tSPEAKER_01\n That's part of the formalism has got to be...\n\n0:42:31\tSPEAKER_01\n How things like that get marked.\n\n0:42:34\tSPEAKER_05\n Do you have data like the... you have preliminary data?\n\n0:42:39\tSPEAKER_05\n Because I know, you know, we've been using this one, you see, sentence, and I'm sure you guys have...\n\n0:42:43\tSPEAKER_05\n Maybe you're the one who's been looking at the rest of it.\n\n0:42:45\tSPEAKER_05\n It'd be unusual for me if we wanted to have it a little bit more.\n\n0:42:48\tSPEAKER_02\n What I've been looking at...\n\n0:42:49\tSPEAKER_02\n No, it's not been the data so far.\n\n0:42:50\tSPEAKER_02\n I just sort of said, all right, let's see if I can get noun phrases and...\n\n0:42:54\tSPEAKER_02\n Major verb constructions out of the way first.\n\n0:42:57\tSPEAKER_02\n And I have not gotten them out of the way yet.\n\n0:42:59\tSPEAKER_02\n Yeah, I've not really approached a lot of the data, but I mean, obviously, like the question one, since we have this idea about the indefinite pronouncing and all that, you know, like, can try and run with that, you know, try and do some of the question constructions now.\n\n0:43:16\tSPEAKER_03\n You want to run the indefinite pronoun idea past Jerry?\n\n0:43:19\tSPEAKER_02\n Oh, yeah.\n\n0:43:20\tSPEAKER_02\n The basic idea is that, you know, I would see...\n\n0:43:25\tSPEAKER_03\n So, very fixed the car with a wrench. So you're following me.\n\n0:43:30\tSPEAKER_03\n And then, who fixed the car with a wrench?\n\n0:43:32\tSPEAKER_03\n You basically are told to do this.\n\n0:43:36\tSPEAKER_03\n And elegantly, to the way you would do someone fixed the car with a wrench.\n\n0:43:41\tSPEAKER_03\n And then you hand it back to your hippocampus and find out what that means.\n\n0:43:47\tSPEAKER_03\n And then come up with that, who that someone was.\n\n0:43:50\tSPEAKER_02\n So, the WHO question has this sort of extra thing which says, and when you're done, tell me who fills that slot.\n\n0:43:57\tSPEAKER_02\n And, you know, this is sort of a nice way to do it.\n\n0:43:59\tSPEAKER_02\n The idea of sort of saying that you treat from the simulation point of view or whatever, you treat WHO constructions similarly to indefinite pronouns like someone fixed the car because lots of languages have WHO questions with an indefinite pronoun in CQ or whatever, and you just get an intonation to tell you that it's a question.\n\n0:44:18\tSPEAKER_01\n So, which is, school amazation.\n\n0:44:22\tSPEAKER_01\n In logic, it's, yeah.\n\n0:44:25\tSPEAKER_05\n It's a problem.\n\n0:44:27\tSPEAKER_05\n It's a problem constant in, yeah.\n\n0:44:29\tSPEAKER_01\n Sure.\n\n0:44:30\tSPEAKER_01\n Okay.\n\n0:44:31\tSPEAKER_01\n There's nothing that's bad.\n\n0:44:32\tSPEAKER_01\n Right, no.\n\n0:44:33\tSPEAKER_01\n The logicians have...\n\n0:44:36\tSPEAKER_01\n That's right.\n\n0:44:37\tSPEAKER_02\n It makes sense from that point of view too, which is actually better.\n\n0:44:41\tSPEAKER_02\n Anyway, but just that kind of thing, and we'll figure out exactly how to write that up and so on.\n\n0:44:45\tSPEAKER_02\n I know all the focus stuff.\n\n0:44:51\tSPEAKER_02\n You sort of just dropped that because it was too weird, and we didn't even know like when we were talking about it.\n\n0:44:57\tSPEAKER_02\n That's the top of it.\n\n0:44:58\tSPEAKER_02\n Yeah.\n\n0:44:59\tSPEAKER_01\n Well, part of what the exercise is, but in the next week, you say, what are the things that we just don't have answers for yet?\n\n0:45:07\tSPEAKER_01\n That's fine.\n\n0:45:08\tSPEAKER_03\n Well, if you do want to discuss focus background, then get me into that because I mean, I've scientifically worked on that for almost two years.\n\n0:45:22\tSPEAKER_02\n Okay.\n\n0:45:23\tSPEAKER_02\n And certainly...\n\n0:45:24\tSPEAKER_05\n Yeah, you should definitely be on that.\n\n0:45:26\tSPEAKER_05\n Maybe by after Monday, you could see what things we...\n\n0:45:30\tSPEAKER_02\n I think we'll figure out what our questions are, for example.\n\n0:45:32\tSPEAKER_02\n Yeah.\n\n0:45:33\tSPEAKER_02\n To ask you.\n\n0:45:34\tSPEAKER_02\n Okay.\n\n0:45:43\tSPEAKER_01\n Then, Hans.\n\n0:45:45\tSPEAKER_01\n I haven't seen Hans, but...\n\n0:45:47\tSPEAKER_01\n It's been around.\n\n0:45:48\tSPEAKER_01\n Yeah.\n\n0:45:49\tSPEAKER_01\n Okay.\n\n0:45:50\tSPEAKER_01\n So has he been involved with this or...?\n\n0:45:51\tSPEAKER_01\n With us?\n\n0:45:52\tSPEAKER_05\n Yeah.\n\n0:45:53\tSPEAKER_05\n I would say that those discussions have been primarily Keith and me, but...\n\n0:46:00\tSPEAKER_05\n I mean, he sort of... the last meeting we had, I think we were all very much part of it.\n\n0:46:06\tSPEAKER_02\n But...\n\n0:46:07\tSPEAKER_02\n Sometimes, Hans has been sort of coming in there as sort of like a devil's advocate, like role or something like this.\n\n0:46:12\tSPEAKER_02\n I'm going to pretend I'm a linguist who has nothing to do with this.\n\n0:46:14\tSPEAKER_02\n This makes no sense, and he'll just go off on parts of it, which definitely need fixing, but aren't where we're at right now.\n\n0:46:20\tSPEAKER_05\n Like, what you call certain things, which we decided along, go, we don't care that much right now.\n\n0:46:24\tSPEAKER_05\n But in the sense, it's good to know that he, of all people, like maybe a lot of people would have...\n\n0:46:29\tSPEAKER_05\n He's a stronger reaction, so he's like a relatively friendly linguist, and yet, word like constraint, because there are a lot of problems.\n\n0:46:36\tSPEAKER_01\n Okay.\n\n0:46:37\tSPEAKER_01\n This is consistent with the role I had suggested that he play, which was that...\n\n0:46:51\tSPEAKER_01\n One of the things I would like to see happen is a paper that was tentatively called, towards a formal cognitive semantics, which was addressed to these linguists who haven't been following this stuff at all.\n\n0:47:10\tSPEAKER_01\n So, it could be that he's actually, at some level, thinking about how am I going to communicate this story?\n\n0:47:18\tSPEAKER_01\n So, internally, we should just do whatever works, because it's hard enough.\n\n0:47:24\tSPEAKER_01\n But if he is really going to turn around and help to write this version that does connect with as many as possible of the other linguists in the world, then it becomes important to use terminology that doesn't...\n\n0:47:47\tSPEAKER_01\n Make it hard... I mean, it's going to be plenty hard for people to understand that his idea is...\n\n0:47:53\tSPEAKER_01\n But you don't want to make it worse.\n\n0:47:56\tSPEAKER_02\n Right, I mean, that role is indispensable, but that's not where sort of our heads were at in this meeting.\n\n0:48:03\tSPEAKER_01\n Yeah, yeah, no, that's fine. I just wanted to...\n\n0:48:05\tSPEAKER_01\n I have to catch up with him, and I wanted to get a feeling from that.\n\n0:48:09\tSPEAKER_02\n Okay.\n\n0:48:10\tSPEAKER_02\n So, I don't know what his take will be on these meetings.\n\n0:48:12\tSPEAKER_02\n Exactly.\n\n0:48:13\tSPEAKER_00\n Okay.\n\n0:48:15\tSPEAKER_02\n I think it's good to know that we're talking about your govily.\n\n0:48:18\tSPEAKER_05\n When we're into data and looking at the some specific linguistic phenomenon in English, or in German, particular word effort, that's great.\n\n0:48:26\tSPEAKER_05\n And Hans, if anything, they have more say than I'd say I would about these things.\n\n0:48:31\tSPEAKER_05\n But when it's like, well, how do we capture these things?\n\n0:48:34\tSPEAKER_05\n I think it's definitely been Keith and I have...\n\n0:48:37\tSPEAKER_05\n Well, that's good.\n\n0:48:38\tSPEAKER_01\n I think that should be the court group, and that's, you know, I think very close to the maximum number of people working together that you've got.\n\n0:48:51\tSPEAKER_05\n We actually have... I think we have been making progress.\n\n0:48:53\tSPEAKER_05\n I definitely get the impression.\n\n0:48:55\tSPEAKER_01\n Yeah, that's great.\n\n0:48:56\tSPEAKER_01\n Yeah.\n\n0:48:57\tSPEAKER_05\n So, anyone else?\n\n0:48:59\tSPEAKER_05\n We're in the balance, anyway.\n\n0:49:02\tSPEAKER_01\n Well, then we have to come back to the bigger group.\n\n0:49:06\tSPEAKER_01\n Right.\n\n0:49:08\tSPEAKER_01\n Right.\n\n0:49:09\tSPEAKER_01\n And we're going to...\n\n0:49:10\tSPEAKER_01\n Because this other big thing we haven't talked about is actually implementing this stuff.\n\n0:49:15\tSPEAKER_01\n So they guess the three of us are going to connect tomorrow.\n\n0:49:17\tSPEAKER_05\n I was just going to say that, for instance, there was, you know, out of a meeting with John O.\n\n0:49:21\tSPEAKER_05\n Came the suggestion that, oh, could it be that the meaning constraints really aren't used for selection, which has sort of been implicit in the parsing strategy we talked about.\n\n0:49:31\tSPEAKER_05\n In which case, we can just say that they're the effects or the bindings, which, so far, in terms of like putting up all the constraints as, you know, pushing them into type constraints, when I then propose it to the linguist who haven't yet given me, you know, we haven't yet thought of a reason why that wouldn't work.\n\n0:49:47\tSPEAKER_05\n Right.\n\n0:49:48\tSPEAKER_05\n As long as we allow our type constraints to be reasonably complex.\n\n0:49:51\tSPEAKER_05\n Well, anyway.\n\n0:49:52\tSPEAKER_01\n Yeah, it has to, in the sense that you're going to use them eventually. So, you know, it's sort of a generating test kind of thing.\n\n0:50:03\tSPEAKER_01\n And if you over-generate, then you'll have to do more.\n\n0:50:06\tSPEAKER_01\n I mean, if there are some constraints that you hold back and don't use in your initial matching, and you'll match some things.\n\n0:50:15\tSPEAKER_01\n I mean, I don't think there's any way that it could completely fail. It could be that you wind up many.\n\n0:50:22\tSPEAKER_01\n The original bad idea of purely context free grammars died because there were just vastly too many parses, you know, exponentially number many parses.\n\n0:50:34\tSPEAKER_01\n And so that the concern might be that nothing would totally fail that that would still generate too many.\n\n0:50:41\tSPEAKER_05\n Right. So, Joe, by just having semantic, bringing semantics in, for matching just in the form of semantic types.\n\n0:50:48\tSPEAKER_05\n Like, conceptually, these have to be construed as this, this, and this.\n\n0:50:51\tSPEAKER_05\n Yeah.\n\n0:50:52\tSPEAKER_05\n Might still give us quite a few possibilities.\n\n0:50:54\tSPEAKER_05\n We don't know.\n\n0:50:55\tSPEAKER_05\n And it certainly helps a lot.\n\n0:50:57\tSPEAKER_01\n No question.\n\n0:50:58\tSPEAKER_01\n And I think it's a perfectly fine place to start, you know, and say, let's see how far we can go this way.\n\n0:51:06\tSPEAKER_01\n And, uh, well, it definitely makes the problem easier.\n\n0:51:11\tSPEAKER_01\n I'm, I'm, I'm, I'm, I'm into that.\n\n0:51:12\tSPEAKER_01\n Because I think, I think it's, as you know, I think it's real hard and if we, if, all right.\n\n0:51:24\tSPEAKER_05\n So, Friday, Monday, Monday.\n\n0:51:28\tSPEAKER_05\n Yeah.\n\n0:51:29\tSPEAKER_05\n Okay. That's Tuesday.\n\n0:51:31\tSPEAKER_05\n That's the, here, question.\n\n0:51:33\tSPEAKER_03\n So, you, your dance card is, you did it.\n\n0:51:38\tSPEAKER_05\n Yeah. And I've nothing to do this weekend, but work.\n\n0:51:42\tSPEAKER_04\n Yeah.\n\n0:51:43\tSPEAKER_05\n What about, what about DDR?\n\n0:51:44\tSPEAKER_05\n Uh, I don't have it this weekend, so don't have to worry about that.\n\n0:51:48\tSPEAKER_05\n DDR.\n\n0:51:49\tSPEAKER_05\n Yeah.\n\n0:51:50\tSPEAKER_05\n Dancing, dance revolution.\n\n0:51:52\tSPEAKER_05\n It's a, it's like a game, but it's for like dancing.\n\n0:51:57\tSPEAKER_05\n It's hard to, it's like karaoke, but for dancing.\n\n0:52:00\tSPEAKER_05\n And they tell you what.\n\n0:52:02\tSPEAKER_05\n It's amazing.\n\n0:52:03\tSPEAKER_05\n It's so much fun.\n\n0:52:04\tSPEAKER_05\n Oh, yeah.\n\n0:52:05\tSPEAKER_05\n Yeah.\n\n0:52:06\tSPEAKER_05\n So, my friend has a home version.\n\n0:52:07\tSPEAKER_05\n He brought it over and we are so into it.\n\n0:52:10\tSPEAKER_05\n It's so amazing.\n\n0:52:11\tSPEAKER_05\n Oh, yeah.\n\n0:52:12\tSPEAKER_05\n Now, this, what you, you know of it?\n\n0:52:15\tSPEAKER_05\n It's, it's one of your hobbies.\n\n0:52:17\tSPEAKER_01\n Although, I, God knows I could do something.\n\n0:52:20\tSPEAKER_05\n It's great exercise, I must say.\n\n0:52:22\tSPEAKER_01\n But, uh, no, I, I can't wait to hear.\n\n0:52:29\tSPEAKER_01\n Yeah.\n\n0:52:32\tSPEAKER_01\n Apparently, always the hottest thing in Tokyo.\n\n0:52:35\tSPEAKER_05\n Oh, definitely.\n\n0:52:36\tSPEAKER_05\n They have like places instead of like, instead of karaoke bars, now they have like DDR.\n\n0:52:39\tSPEAKER_05\n Yeah, I didn't until I started hanging out with this friend who was like, oh, I can bring over the DDR if you want.\n\n0:52:46\tSPEAKER_05\n Oh, dance, dance revolution.\n\n0:52:47\tSPEAKER_05\n Okay.\n\n0:52:48\tSPEAKER_05\n He actually brought a clone called stepping selection, but it's just as good.\n\n0:52:52\tSPEAKER_05\n Hey.\n\n0:53:22\tNone\n You You You You You You You You You You You You\n\n", "summary": [{"summary_text": "Keith will be at the meeting with George at 4. It will be just the five of them. Speaker's paper is off by one error, but his paper is correct. Keith is talking with George right now. Keith will probably get rid of George. "}]}