{"filename": "./data/Bed004.txt", "transcript": "0:00:00\tSPEAKER_01\n You're not supposed to be drinking it here, did?\n\n0:00:07\tSPEAKER_02\n Transcript number three, two, seven, one, three, two, nine, oh.\n\n0:00:20\tSPEAKER_02\n Three, two, nine, oh.\n\n0:00:32\tSPEAKER_02\n Three, two, six, seven, six, four.\n\n0:00:46\tSPEAKER_02\n Seven, eight, nine, zero, one, zero, one, one, eight, one, three, one, two, three, oh, one.\n\n0:00:59\tSPEAKER_02\n Two, seven, five, three, four, nine, nine, five, six, oh, nine, eight, two, nine, five, four, two, one.\n\n0:01:13\tSPEAKER_01\n We have to read them that slowly.\n\n0:01:16\tSPEAKER_01\n Okay. Sound like a robot.\n\n0:01:20\tSPEAKER_01\n This is transcript three, eight, nine, one, three, nine, one, zero.\n\n0:01:25\tSPEAKER_01\n Three, three, six, zero, zero.\n\n0:01:28\tSPEAKER_01\n Four, two, zero, zero, one, one, seven.\n\n0:01:31\tSPEAKER_01\n Five, six, six, nine, seven, eight, oh, three.\n\n0:01:37\tSPEAKER_01\n Zero, five, three, one, five, six, six, two, eight, seven, six, five, three, four, five, zero.\n\n0:01:46\tSPEAKER_01\n Seven, two, seven, nine, oh, three, eight, eight, three, nine, nine, nine, oh, eight, eight, nine, two.\n\n0:01:54\tSPEAKER_01\n Zero, eight, two, eight, one, two, zero, seven, three.\n\n0:02:06\tSPEAKER_00\n This is transcript three, nine, five, one, three, nine, seven, oh.\n\n0:02:15\tSPEAKER_00\n Five, six, zero, five, one, one, eight, one, eight, nine, five, oh, five, seven, oh, seven, oh, seven, zero.\n\n0:02:22\tSPEAKER_00\n One, two, three, zero.\n\n0:02:25\tSPEAKER_00\n Five, one, two, three, four, six, five, two, five, eight, six, oh, seven, six, six, six, zero.\n\n0:02:31\tSPEAKER_00\n Eight, nine, one, seven, nine, oh, zero, zero, seven, two, two, one, four, three, three, zero, two, two, four, three, five, eight, zero, three, seven, four, five.\n\n0:02:43\tSPEAKER_06\n So I think the one thing that you had in the start is the data that you met, talked to you, but it's so useful in your college practice. It's recording now, so just keep it pointing.\n\n0:02:55\tSPEAKER_06\n And then it's one, two, a big favor, thinking about how to do it as a thing, where the black gear will be done, but make sure not to be under recording anymore.\n\n0:03:06\tNone\n Because if I turn it straight, I'm going to be at the meeting at night, when I was on the board, and then when you leave, just turn off the microphone, and the battery will be set to be down, and it's great.\n\n0:03:18\tSPEAKER_06\n And if Jerry and Anne start rolling, three of the numbers, that would be very best of all.\n\n0:03:24\tSPEAKER_00\n So you think how would you do that?\n\n0:03:26\tSPEAKER_01\n When you read the numbers, it kind of reminded me of beat poetry.\n\n0:03:36\tSPEAKER_02\n It's a practical for the coming sort of feeling, but.\n\n0:03:40\tSPEAKER_01\n 3, 3, 6, zero, zero, four, two, zero, zero, one, seven.\n\n0:03:46\tSPEAKER_01\n That's what I think of when I think of beat poetry.\n\n0:03:50\tSPEAKER_01\n You ever seen so I married an axe murderer?\n\n0:03:56\tSPEAKER_01\n Bought to it.\n\n0:03:58\tSPEAKER_01\n There's parts when he's doing beat poetry.\n\n0:04:00\tSPEAKER_01\n Yeah.\n\n0:04:01\tSPEAKER_01\n He talks like that.\n\n0:04:02\tSPEAKER_01\n That's why I think.\n\n0:04:04\tSPEAKER_01\n That probably is why I think of it that way.\n\n0:04:08\tSPEAKER_02\n I didn't see that movie.\n\n0:04:10\tSPEAKER_02\n Who didn't? Who made that?\n\n0:04:11\tSPEAKER_01\n Mike Myers is the guy.\n\n0:04:13\tSPEAKER_01\n It's his cute romantic comedy.\n\n0:04:16\tSPEAKER_01\n That's his cute romantic comedy.\n\n0:04:21\tNone\n Yeah.\n\n0:04:24\tSPEAKER_01\n I'm feeling this real funny.\n\n0:04:31\tSPEAKER_01\n I'll spoil it for you.\n\n0:04:33\tSPEAKER_01\n He works in a coffee shop in San Francisco.\n\n0:04:38\tSPEAKER_01\n And he's sitting there on this couch and they bring him this massive cup of espresso.\n\n0:04:43\tSPEAKER_01\n Like, excuse me, I ordered the largest espresso.\n\n0:04:50\tSPEAKER_02\n We're having...\n\n0:04:59\tSPEAKER_02\n Tiramisu tasting contest this weekend?\n\n0:05:04\tSPEAKER_01\n Are you trying to decide who's the best taste or of tiramisu?\n\n0:05:08\tSPEAKER_02\n No. There was a fierce argument that broke out over who's tiramisu might be the best.\n\n0:05:15\tSPEAKER_02\n We decided to have a contest where those people who claimed to make good tiramisu make them.\n\n0:05:21\tSPEAKER_02\n Then we got a panel of impartial judges that were faced to a blind taste.\n\n0:05:27\tSPEAKER_02\n And then vote.\n\n0:05:30\tSPEAKER_02\n Should be fun.\n\n0:05:35\tSPEAKER_01\n It seems like you could put a magic special ingredient in so that everyone would know which one was yours.\n\n0:05:44\tSPEAKER_01\n Then if you were to bribe them, you could...\n\n0:05:48\tSPEAKER_02\n Well, I was thinking, if you guys have plans for Sunday, we're not...\n\n0:05:53\tSPEAKER_02\n It's probably going to be this Sunday, but we're sort of working with the weather here, because we also want to combine it with some barbecue activity where we just fire it up and whoever brings whatever...\n\n0:06:07\tSPEAKER_02\n You can throw it on there.\n\n0:06:09\tSPEAKER_02\n So only that tiramisu is free.\n\n0:06:14\tSPEAKER_01\n I'm going back to visit my parents this weekend, so I'll be out of town.\n\n0:06:19\tSPEAKER_02\n So you're going to the West Bay then?\n\n0:06:22\tSPEAKER_01\n It's half Bay, yeah.\n\n0:06:25\tSPEAKER_00\n I should be free.\n\n0:06:28\tSPEAKER_02\n I'm sorry I was looking for you guys down the stairs.\n\n0:06:37\tSPEAKER_04\n So are we recording that song?\n\n0:06:39\tSPEAKER_03\n We are.\n\n0:06:46\tSPEAKER_01\n Is Nancy going to show up?\n\n0:06:49\tSPEAKER_04\n She's got a student like in that, probably not.\n\n0:06:58\tSPEAKER_01\n These things ever emit a very...\n\n0:07:01\tSPEAKER_01\n Like piercing screeds right in your ear.\n\n0:07:10\tSPEAKER_02\n They are going to get more comfortable headsets.\n\n0:07:14\tSPEAKER_02\n Or the other...\n\n0:07:20\tSPEAKER_02\n Okay, let's get started.\n\n0:07:23\tSPEAKER_02\n The...\n\n0:07:25\tSPEAKER_02\n Should I go first with the...\n\n0:07:34\tSPEAKER_02\n Data, can I have the remote control?\n\n0:07:43\tSPEAKER_05\n Okay.\n\n0:07:53\tSPEAKER_02\n So on Friday we had our wizard test, data test, and these are some of the results.\n\n0:08:06\tSPEAKER_02\n This was the introduction.\n\n0:08:08\tSPEAKER_02\n I actually, even though this was kind enough to offer to be the first subject, I felt that she knew too much.\n\n0:08:18\tSPEAKER_02\n So I asked Latonya just on the spur of the moment and she was kind enough to serve as the first subject.\n\n0:08:28\tSPEAKER_02\n So this is what she saw as part of...\n\n0:08:32\tSPEAKER_02\n Introduction. This is what she had to read aloud.\n\n0:08:38\tSPEAKER_02\n That was really difficult for her.\n\n0:08:42\tSPEAKER_02\n And...\n\n0:08:43\tSPEAKER_00\n All the names, you mean?\n\n0:08:45\tSPEAKER_02\n The names.\n\n0:08:48\tSPEAKER_02\n This was the first three tasks she had to master after she called the system.\n\n0:08:57\tSPEAKER_02\n And then of course the system broke down and those were...\n\n0:09:06\tSPEAKER_02\n I should say the system was supposed to break down and then these were the remaining three tasks that she was going to solve with a human.\n\n0:09:16\tSPEAKER_02\n There are the results.\n\n0:09:27\tSPEAKER_02\n And I will not...\n\n0:09:31\tSPEAKER_07\n We will skip the reading now.\n\n0:09:36\tSPEAKER_07\n The five playhouses, city theater, the two are three.\n\n0:09:40\tSPEAKER_07\n Is it our part of the city?\n\n0:09:43\tSPEAKER_02\n And the reading was five minutes exactly and now comes the...\n\n0:09:49\tSPEAKER_02\n This is the phone and face office.\n\n0:09:51\tSPEAKER_06\n And if we're calling high to work to this information, I'm going to help you.\n\n0:09:55\tSPEAKER_00\n Great, now I have a question.\n\n0:09:56\tSPEAKER_00\n Hi.\n\n0:09:57\tSPEAKER_00\n So there is no system, right?\n\n0:10:01\tSPEAKER_00\n There was a wizard for both devices.\n\n0:10:04\tSPEAKER_02\n Yeah, it was both times the same person.\n\n0:10:08\tSPEAKER_02\n One time pretending to be a system, one time pretending to be a user, which is actually not pretending.\n\n0:10:12\tSPEAKER_00\n And she didn't...\n\n0:10:13\tSPEAKER_00\n I mean, isn't this kind of obvious when it says, okay, now you're talking to a human and the human is the same voice?\n\n0:10:19\tSPEAKER_02\n No, no, no, you wait.\n\n0:10:21\tSPEAKER_02\n Okay, good question, but you just wait and see.\n\n0:10:24\tSPEAKER_02\n You're going to learn.\n\n0:10:27\tSPEAKER_02\n And the wizard sometimes will not be audible because she was actually...\n\n0:10:33\tSPEAKER_02\n There were some laps in the wireless.\n\n0:10:37\tSPEAKER_02\n We have to move her closer.\n\n0:10:39\tSPEAKER_07\n We'll be deciding on going to the concert or the Hendobergs, or the Hendobergs, especially the orchestra.\n\n0:10:45\tSPEAKER_07\n I want to buy some elegant, a wireless redesign or new piece, which is located on February's rebirth.\n\n0:10:56\tSPEAKER_07\n Out.\n\n0:10:57\tSPEAKER_06\n In order to get to the Friedrich-erbott-Anlanger, we're going around and go towards the church.\n\n0:11:09\tSPEAKER_06\n Next, you have to add the church into the Friedrich-erbott-Anlanger.\n\n0:11:21\tSPEAKER_01\n Is she mispronouncing Anlaga?\n\n0:11:23\tSPEAKER_01\n Is it Anlaga or Anlanger?\n\n0:11:25\tSPEAKER_02\n They're mispronouncing everything but the church.\n\n0:11:34\tSPEAKER_06\n And some can castle differs from the regular sort of castle in that it is built in a flat region rather than on a mountain.\n\n0:11:42\tSPEAKER_07\n Oh, I don't know if you could tell me about the stories of Fidi and the old Stunian prison.\n\n0:11:54\tSPEAKER_07\n And I want to know how to get there.\n\n0:12:01\tSPEAKER_06\n In order to get to the Stunian prison from the University Square, turn right and walk one block.\n\n0:12:24\tSPEAKER_02\n This is the sister-breaking doughnut, actually.\n\n0:12:26\tSPEAKER_06\n Hello?\n\n0:12:32\tNone\n Yes.\n\n0:12:33\tSPEAKER_06\n I'm sorry, something seems to have happened to the system.\n\n0:12:37\tNone\n See if I can help you.\n\n0:12:40\tSPEAKER_07\n Are you a live person?\n\n0:12:43\tSPEAKER_07\n I'm a live person.\n\n0:12:45\tSPEAKER_07\n Okay.\n\n0:12:48\tSPEAKER_06\n No, I'm a live person.\n\n0:12:51\tSPEAKER_06\n I need to know where you are, first of all.\n\n0:12:55\tNone\n Where am I?\n\n0:12:58\tSPEAKER_07\n I don't know.\n\n0:13:04\tSPEAKER_06\n See, you're at Aus?\n\n0:13:07\tSPEAKER_07\n I see a building that's under construction.\n\n0:13:13\tSPEAKER_06\n Okay.\n\n0:13:16\tSPEAKER_06\n That's probably the University Square.\n\n0:13:21\tSPEAKER_06\n Okay. So what do you need to do?\n\n0:13:26\tSPEAKER_07\n Can you give me a description of the powder tower of the Hengelburn Castle?\n\n0:13:33\tSPEAKER_06\n Yeah, in order to get there you have to take a bus.\n\n0:13:36\tSPEAKER_06\n You've got to take the number 42 to the Town Hall station.\n\n0:13:40\tSPEAKER_06\n And then you have to transfer to the Venezuelan train and take the castle exit and turn right.\n\n0:13:46\tSPEAKER_06\n And after about half a mile you'll see the powder tower on your right hand side.\n\n0:13:53\tNone\n Okay.\n\n0:13:54\tSPEAKER_06\n How much is it for the train?\n\n0:13:59\tSPEAKER_06\n You can get a transfer on the bus for the train for about four miles.\n\n0:14:10\tSPEAKER_06\n Okay. That's all I need to do?\n\n0:14:13\tSPEAKER_06\n Sure. Bye-bye.\n\n0:14:17\tSPEAKER_07\n I don't know, recording.\n\n0:14:20\tSPEAKER_07\n I heard that there was a recording that you could go with the thing.\n\n0:14:24\tSPEAKER_07\n You could use the right hand.\n\n0:14:28\tSPEAKER_07\n Did I call Europe?\n\n0:14:32\tSPEAKER_02\n Did I call Europe?\n\n0:14:35\tSPEAKER_02\n This is it.\n\n0:14:38\tSPEAKER_02\n So if we have heard Putin's recommendation,\n\n0:14:45\tSPEAKER_04\n maybe she had two hours later on when the first person was recording on us. So are you trying to record this meeting?\n\n0:14:57\tSPEAKER_02\n There was a strange reflex.\n\n0:15:00\tSPEAKER_02\n I have a headache. I'm really stiff out of it.\n\n0:15:03\tSPEAKER_02\n The lessons learned, the reading needs to be short of five minutes.\n\n0:15:09\tSPEAKER_02\n That was already anticipated by some people suggested that if we just have bullets here, they're going to not, there are subjects are probably not going to go into follow the order.\n\n0:15:21\tSPEAKER_02\n And she did not.\n\n0:15:23\tSPEAKER_02\n She jumped around quite a bit.\n\n0:15:26\tSPEAKER_04\n So if you just number them one, two, three, it's...\n\n0:15:30\tSPEAKER_02\n We need a better introduction for the wizard that is something that Faye actually thought of in the last second that the system should introduce itself when it's called.\n\n0:15:44\tSPEAKER_02\n And another suggestion by Liz was that we, through subjects, switched the tasks.\n\n0:15:54\tSPEAKER_02\n So when they have tasks one with a computer, the next person should have tasks one with a human and so forth.\n\n0:16:01\tSPEAKER_02\n So we get nice data for that.\n\n0:16:05\tSPEAKER_02\n We have to refine the tasks more and more, which of course we haven't done it all so far, in order to avoid this rephrasing.\n\n0:16:13\tSPEAKER_02\n So even though we don't tell the person ask blah, blah, blah, blah, blah, they still try, or these, the Tanya try to repeat.\n\n0:16:22\tSPEAKER_02\n It's much of that text as possible.\n\n0:16:26\tSPEAKER_02\n And my suggestion is, of course, we keep the wizard because I think she did a wonderful job.\n\n0:16:31\tSPEAKER_02\n Great.\n\n0:16:32\tSPEAKER_02\n In the sense that she responded quite nicely to things that were not asked for, how much is it passed ticket and the transfer.\n\n0:16:40\tSPEAKER_02\n So this is going to happen all the time.\n\n0:16:42\tSPEAKER_02\n You can never be sure.\n\n0:16:44\tSPEAKER_02\n Jono pointed out that we have maybe a grammatical gender problem there with wizard.\n\n0:16:49\tSPEAKER_01\n So I wasn't sure whether wizard was the correct term for not a man.\n\n0:16:57\tSPEAKER_00\n But there's no female equivalent of, are you sure?\n\n0:17:01\tSPEAKER_01\n No, I don't know.\n\n0:17:03\tSPEAKER_02\n Well, there is Richard Warlock.\n\n0:17:05\tSPEAKER_02\n Yes, I was thinking with.\n\n0:17:07\tSPEAKER_02\n Right.\n\n0:17:10\tSPEAKER_02\n And so some work needs to be done, but I think we can, and this, in case you hadn't seen it, this is what Littonia looked at during the year, while taking the data collection.\n\n0:17:32\tSPEAKER_04\n Okay, great.\n\n0:17:34\tSPEAKER_04\n So first of all, I agree that we should hire, say, and start paying her, probably pay her for the time she's already put in as well.\n\n0:17:46\tSPEAKER_04\n You know exactly how to do that, or is Lila, I mean, you know, what exactly do we do to put her on a payroll in some way?\n\n0:17:56\tSPEAKER_02\n I'm completely clueless.\n\n0:17:58\tSPEAKER_04\n Okay.\n\n0:17:59\tSPEAKER_04\n I would like to learn.\n\n0:18:00\tSPEAKER_04\n Well, you have to, right.\n\n0:18:01\tSPEAKER_04\n So anyways, so why don't you ask Lila and see what she says about, you know, exactly what we do for someone in the student type worker?\n\n0:18:14\tSPEAKER_04\n Well, yeah, she's not a student she just graduated, but anyway.\n\n0:18:20\tSPEAKER_04\n So if, yeah, I agree, she sounded fine.\n\n0:18:22\tSPEAKER_04\n She actually was more present and stuff than she was in conversation.\n\n0:18:33\tSPEAKER_04\n So she did a better job than I would have guessed from just talking to her.\n\n0:18:37\tSPEAKER_04\n So I think that's great.\n\n0:18:38\tSPEAKER_02\n This is sort of what I gave her.\n\n0:18:40\tSPEAKER_02\n So this is, for example, how to get to the student prison.\n\n0:18:43\tSPEAKER_02\n Yeah.\n\n0:18:44\tSPEAKER_02\n And I didn't student spell it out here.\n\n0:18:46\tSPEAKER_02\n And in some cases, I spell it out a little bit more thoroughly.\n\n0:18:51\tSPEAKER_02\n This is the information on the Sunk and Castle and the M5 theater that never came up.\n\n0:18:57\tSPEAKER_02\n And so if we give her even more instruments to work with, I think, the results are going to be...\n\n0:19:05\tSPEAKER_02\n Oh, yeah.\n\n0:19:06\tSPEAKER_04\n And of course, as she does it, she'll learn this.\n\n0:19:08\tSPEAKER_04\n So that's great.\n\n0:19:12\tSPEAKER_04\n And also if she's willing to take on the job of organizing all the subjects and stuff, that would be wonderful.\n\n0:19:22\tSPEAKER_04\n And she's actually... she's going to graduate school in kind of an experimental paradigm.\n\n0:19:27\tSPEAKER_04\n So I think this is all just fine in terms of her learning, things she's going to need to know to do her career.\n\n0:19:36\tSPEAKER_04\n So my guess is she'll be quite happy to take on that job.\n\n0:19:42\tSPEAKER_02\n Yeah, she did explicitly state that.\n\n0:19:46\tSPEAKER_02\n Great. And I told her that we're going to figure out a meeting time in the near future to refine the tasks and look for the potential sources to find people.\n\n0:19:58\tSPEAKER_02\n She also agrees that if it's all just going to be students, the data is going to be less valuable because of that.\n\n0:20:04\tSPEAKER_04\n Well, I was going to say there's this set of people next door.\n\n0:20:07\tSPEAKER_02\n It's not hard to...\n\n0:20:09\tSPEAKER_02\n However, we may run into a problem with a reading task there.\n\n0:20:13\tSPEAKER_02\n And we'll see.\n\n0:20:15\tSPEAKER_04\n Yeah, we could talk to the people who run it and see if they have a way that they could easily tell people that there's a task, a base ten box or something, but you have to be comfortable reading relatively complicated stuff.\n\n0:20:35\tSPEAKER_04\n And they'll probably be self-selection to some extent.\n\n0:20:42\tSPEAKER_04\n So that's good.\n\n0:20:45\tSPEAKER_04\n Now, I signed us up for the Wednesday slot and part of what we should do is this.\n\n0:20:52\tSPEAKER_04\n So my idea on that was partly we'll talk about system stuff for the computer scientists.\n\n0:20:58\tSPEAKER_04\n Apparently I did want it to get the linguists involved in some of this issue about what the task is and what the dialogue is and what's going on linguistically.\n\n0:21:11\tSPEAKER_04\n Because to the extent that we can get them contributing, that'll be good.\n\n0:21:17\tSPEAKER_04\n So this issue about reformulating things.\n\n0:21:20\tSPEAKER_04\n Maybe we can get some of the linguists sufficiently interested that they will help us with it.\n\n0:21:25\tSPEAKER_04\n Other linguists, if you're a linguist, but any case.\n\n0:21:29\tSPEAKER_04\n The linguistic students and stuff.\n\n0:21:32\tSPEAKER_04\n So my idea on Wednesday is partly to...\n\n0:21:37\tSPEAKER_04\n I mean, what you did today is just fine. You just do this as we did and here's the thing and here's some of the dialogue and so forth.\n\n0:21:46\tSPEAKER_04\n But then the other thing, of course, is we should give the computer scientists some idea of what's going on with the system design and where we think the belief nets fit in and where the pieces are and stuff like that.\n\n0:22:01\tSPEAKER_04\n Does this make sense to everybody?\n\n0:22:05\tSPEAKER_04\n So I don't think it's worth a lot of work, particularly on your part to make a big presentation.\n\n0:22:11\tSPEAKER_04\n I don't think you should make any new PowerPoint or anything.\n\n0:22:16\tSPEAKER_04\n I think we've got plenty of stuff to talk about.\n\n0:22:20\tSPEAKER_04\n And then just see how the discussion goes.\n\n0:22:26\tSPEAKER_02\n Sounds good.\n\n0:22:28\tSPEAKER_02\n The other two things is we have Jon Oat.\n\n0:22:38\tSPEAKER_02\n He'll tell us a little bit about this.\n\n0:22:40\tSPEAKER_02\n Great.\n\n0:22:41\tSPEAKER_02\n And we also have a little bit on the interface, M3L enhancement.\n\n0:22:45\tSPEAKER_02\n And then that was it, I think.\n\n0:22:52\tSPEAKER_01\n And what I did for this is a pedagogical belief net because I was trying to conceptually do what you're talking about with the nodes that you could expand out.\n\n0:23:05\tSPEAKER_01\n So what I did was I took, I made these dummy nodes called detector and introductory out that would isolate the things related to the detector and then the things with the source and the path and the goal.\n\n0:23:15\tSPEAKER_01\n And I separated them out. And then I did similar things with the context and the discourse and whatnot.\n\n0:23:26\tSPEAKER_01\n So we could sort of isolate them or whatever in terms of the top layer.\n\n0:23:33\tSPEAKER_01\n And then the bottom layer is just the mode.\n\n0:23:36\tSPEAKER_04\n So let's, yeah, I don't understand it. Let's go slide all the way up to we see what the very bottom looks like. Is that it?\n\n0:23:45\tSPEAKER_01\n There's just one more node and it says mode, which is the decision between the.\n\n0:23:49\tSPEAKER_01\n Okay, great. All right.\n\n0:23:51\tSPEAKER_01\n So basically all it was I took the last belief net.\n\n0:23:54\tSPEAKER_01\n And I group things according to what how I thought they would fit into image scheme is they would be related.\n\n0:24:02\tSPEAKER_01\n So I did a projector landmark and a source path goal as initial ones.\n\n0:24:07\tSPEAKER_01\n And then I said, well, the projector would be the person in this case probably.\n\n0:24:12\tSPEAKER_01\n You know, we have, we had the concept of what their intention was whether they were trying to tour or do business or whatever.\n\n0:24:17\tSPEAKER_01\n They were hurried that's kind of related to that.\n\n0:24:19\tSPEAKER_01\n And then in terms of the source, the things, the only things that we had on there, I believe were whether.\n\n0:24:26\tSPEAKER_01\n I kind of, I might have added these because I don't think we talked too much about the source and the old one, but whether the where I'm currently at is a landmark might have a bearing on whether or the landmark is the where I currently at.\n\n0:24:35\tSPEAKER_01\n And usefulness is basically means is it an institutional facility like a town hall or something like that that's not something that you would visit for tourists tourism, say, or whatever travel constraints would be something like, you know, maybe they said they can they only want to take a bus or something like that.\n\n0:24:51\tSPEAKER_01\n So that would determine whether we could take, we would be telling to go to the bus stop or versus walking there directly.\n\n0:25:00\tSPEAKER_01\n Goal similar things as the source, we also added whether the entity was closed and whether they have somehow marked that it was the final destination.\n\n0:25:11\tSPEAKER_01\n And then if you go up.\n\n0:25:18\tSPEAKER_01\n Yeah, so in terms of context, what we currently said was whether they were a businessman or a tourist or some other person.\n\n0:25:32\tSPEAKER_01\n This course was related to whether they'd asked about open hours or whether they asked about where the entrance was or the admission fee or something along those lines.\n\n0:25:39\tSPEAKER_01\n I'm not really sure what the prosody means in this context, so I just made up, you know, whether what they say is or how they say it is that the parse would be what verb they chose and then maybe how they modified it in the sense of whether they said I need to get here quickly or whatever.\n\n0:25:59\tSPEAKER_01\n And in terms of world knowledge is just basically be like opening and closing times of things, the time of day it is and whatnot.\n\n0:26:09\tSPEAKER_01\n Tourbook that would be I don't know the landmarkiness of things.\n\n0:26:14\tSPEAKER_01\n Whether it's in the tourbook or not.\n\n0:26:19\tSPEAKER_04\n So I understand what you got. I don't yet understand how you would use it. So let me see if I can ask.\n\n0:26:33\tSPEAKER_01\n This is not a working Bayes net.\n\n0:26:36\tSPEAKER_04\n Now I understand that, but so what let's slide back up again and see it started at the bottom.\n\n0:26:49\tSPEAKER_04\n So you could imagine.\n\n0:26:54\tSPEAKER_04\n Go ahead, you were about to go up there and point of center.\n\n0:26:57\tSPEAKER_01\n Well, okay, just say what you're going to say.\n\n0:27:06\tSPEAKER_01\n I was going to wait until.\n\n0:27:08\tSPEAKER_04\n So if we want to make it into a real Bayes net that is, you know, we've filled, you know, actually fill it in, then.\n\n0:27:18\tSPEAKER_01\n So we have to get rid of this and connect these things directly to the mode.\n\n0:27:22\tSPEAKER_04\n Well, I don't that's an issue.\n\n0:27:25\tSPEAKER_01\n Because I don't understand how it would work otherwise.\n\n0:27:28\tSPEAKER_04\n Well, here's the problem.\n\n0:27:31\tSPEAKER_04\n And the bus guy I was talking about this a little earlier today is if we just do this, we could wind up with a huge.\n\n0:27:41\tSPEAKER_04\n Commentator input to the mode thing.\n\n0:27:45\tSPEAKER_04\n And.\n\n0:27:46\tSPEAKER_01\n Well, yeah, I understand that.\n\n0:27:48\tSPEAKER_01\n I just it's hard for me to imagine how we could get around that.\n\n0:27:51\tSPEAKER_04\n So that's what we have to do.\n\n0:27:58\tNone\n Okay.\n\n0:27:59\tSPEAKER_04\n Okay.\n\n0:28:00\tNone\n So.\n\n0:28:00\tSPEAKER_04\n There are a variety of ways of doing it.\n\n0:28:02\tSPEAKER_04\n Let me just mention something that I don't want to pursue today, which is there are technical ways of doing it.\n\n0:28:07\tSPEAKER_04\n I slipped the paper to buscarer about noisy ors and noisy maxes.\n\n0:28:13\tSPEAKER_04\n And there are ways to sort of back off on the purity of your Bayes net in this.\n\n0:28:20\tSPEAKER_04\n So if you could have met and now I don't know that any of those actually apply in this case.\n\n0:28:26\tSPEAKER_04\n But there is some technology you could try to apply.\n\n0:28:29\tSPEAKER_01\n So it's possible that we could do something like a summary note of some sort.\n\n0:28:32\tSPEAKER_01\n Yeah.\n\n0:28:33\tSPEAKER_04\n Okay.\n\n0:28:34\tNone\n Yeah.\n\n0:28:34\tSPEAKER_04\n And.\n\n0:28:38\tSPEAKER_04\n So.\n\n0:28:40\tSPEAKER_01\n So in that case, the summer we'd have we I mean these wouldn't be the summer knows we'd have summer knows like.\n\n0:28:44\tSPEAKER_01\n Whether things were I guess maybe think if things were related to business or.\n\n0:28:50\tSPEAKER_04\n So what I was going to say is maybe a good idea at this point is to try to informally.\n\n0:28:57\tSPEAKER_04\n I mean not necessarily in this meeting, but to try to informally think about what the decision variables are.\n\n0:29:05\tSPEAKER_04\n So if you had some bottom line decision about which mode, you know what are the most relevant things.\n\n0:29:12\tSPEAKER_04\n And the other trick, which is not a technical trick, it's kind of an all engineering trick is to make the.\n\n0:29:20\tSPEAKER_04\n Each node sufficiently narrow that you don't get this comment of torque.\n\n0:29:24\tSPEAKER_04\n So that if you decided that you could characterize.\n\n0:29:28\tSPEAKER_04\n The decision is a trade off between three factors, whatever they may be.\n\n0:29:32\tSPEAKER_04\n Okay, then you could say, aha, let's have these three factors.\n\n0:29:37\tSPEAKER_04\n Okay, and maybe a binary version for each or some relatively compact decision node just above the final one.\n\n0:29:45\tSPEAKER_04\n And then the question would be if those are the things that you care about.\n\n0:29:50\tSPEAKER_04\n Can you make a relatively compact way of getting from the various inputs to the things you care about.\n\n0:29:57\tSPEAKER_04\n So that you know you can sort of try to do a knowledge engineering thing given that we're not going to screw with the.\n\n0:30:04\tSPEAKER_04\n Technology and just always use sort of orthodox base nets.\n\n0:30:09\tSPEAKER_04\n Then we have a knowledge engineering problem of how do we do that.\n\n0:30:16\tSPEAKER_04\n And.\n\n0:30:19\tSPEAKER_01\n So what I kind of need to do is take this one and the old one and merge them together.\n\n0:30:24\tSPEAKER_04\n Well, something.\n\n0:30:26\tSPEAKER_04\n I mean, so Robert has thought about this problem for a long time because he's had these examples kicking around.\n\n0:30:33\tSPEAKER_04\n So he may have some good intuition about, you know, what are the crucial things.\n\n0:30:39\tSPEAKER_04\n And I understand where this, the.\n\n0:30:46\tSPEAKER_04\n This is a way of playing with this source of ethical trajectory abstraction and sort of displaying it in a particular way.\n\n0:30:59\tSPEAKER_04\n I don't think our friends on Wednesday are going to be able to.\n\n0:31:09\tSPEAKER_04\n Well, maybe they will let me think about whether whether I think we could present this to them or not.\n\n0:31:21\tSPEAKER_02\n Well, I think this is still I mean, I talk this is sort of the second version. And I look at this maybe just as a, you know, whatever you am, a diagram or, you know, just a screenshot, not really as based on.\n\n0:31:36\tSPEAKER_01\n We could actually get drawn a different way in the sense that we make it more abstract.\n\n0:31:42\tSPEAKER_02\n But the the nice thing is that you know, just is a visual aid for thinking about these things which has clearly have to be specified more carefully.\n\n0:31:56\tSPEAKER_04\n So, sorry, well, let me think about this more and see if we can find a way to present this to this language group that is helpful to them.\n\n0:32:13\tSPEAKER_02\n So, ultimately we may, we regard this as sort of an exercise in thinking about the problem and maybe a first version of a module, if you want to call it that, that you can ask, that you can give input and it will throw the dice for you, throw the die for you because I integrated this into the existing smart com system.\n\n0:32:42\tSPEAKER_02\n In the same way as much the same way we can sort of have this thing.\n\n0:32:53\tSPEAKER_02\n So, if this is what m3l will look like and what it will give us, the very simple thing we have an action that he wants to go from somewhere, which is some type of object to someplace.\n\n0:33:10\tSPEAKER_02\n And this change now only, it's doing it twice now because it already did it once, we'll add some action type, which in this case is approach and could be more refined in many ways or we can have something where the goal is a public place.\n\n0:33:39\tSPEAKER_02\n And it will give us then of course an action type of the type enter. So, this is just based on this one feature and that's about all you can do.\n\n0:33:52\tSPEAKER_02\n So, if this play, if the object type here is a landmark, of course it will be vista.\n\n0:34:03\tSPEAKER_02\n And this is about as much as we can do if we don't, if we want to avoid a huge combinatorial explosion where we specify, okay, if it's this and this but that is not the case and so forth, it just gets really really messy.\n\n0:34:19\tSPEAKER_04\n So, it was much too quick for me. Okay, so let me see if I understand what you're saying. So, I do understand that you can take the m3l and add not, and you need to do this for sure.\n\n0:34:35\tSPEAKER_04\n You have to add, you know, not too much about object types and stuff. And what I think you did is add some rules of the style that are already there that say if it's of type landmark, then you take, you're going to take a picture of it.\n\n0:34:53\tSPEAKER_04\n Exactly. Full stop. I mean, that's what you do. Every landmark, you take a picture of. Every public face, you enter. Every statue, you want to go as nearest possible. You approach.\n\n0:35:05\tSPEAKER_04\n And certainly you can add rules like that to the existing smartcom system and just did.\n\n0:35:14\tSPEAKER_04\n What do we know about that? Well, so, well, let's think about this. That's another kind of baseline case. It's another sort of thing. Okay, here's another kind of minimal way of tackling this.\n\n0:35:32\tSPEAKER_04\n Add extra properties, a deterministic rule for every property. You have an action. You do that.\n\n0:35:39\tSPEAKER_04\n Then the question would be, now, if that's all you're doing, then you can get the types from the ontology. Okay, because you're all you're using is this type of types in the ontology and you're done.\n\n0:35:55\tSPEAKER_04\n We don't use the discourse. We don't use the context. We don't do any of those things. That's okay. Again, one minimal extension of the existing things.\n\n0:36:12\tSPEAKER_04\n And that's something the smartcom people themselves with. That's a sure that's no problem. No problem to add types to the right.\n\n0:36:25\tSPEAKER_02\n And this is just in order to exemplify what we can do very, very easily is we have this silly interface. And we have the rules that are as banal as we just saw.\n\n0:36:44\tSPEAKER_02\n And we have our content. Now, the content, which is sort of what we see here, which is sort of the Mr. Schema, Stutt, Pascal, whatever.\n\n0:36:55\tSPEAKER_02\n This will be a job to find ways of writing down image schema, X schema constructions in some form and have this be in the content, loosely called constructicon.\n\n0:37:14\tSPEAKER_02\n And the rules we want to throw away completely. And here is exactly where what's going to be replaced with our base net, which is exactly getting the input feeding it here. This decides whether it's in whether action, the enter the vista or the whatever approach you call it.\n\n0:37:39\tSPEAKER_02\n That's what you said. Yeah, that's fine. Construction should be active rated, but it's not construction there. It's action. Construction is a different story.\n\n0:37:49\tSPEAKER_04\n This is a, to what we'd be generating would be a reference to a semantic like parameters for the, for the X schema. Yes. Okay. Yeah. So that that if you had the generalized go X schema, and you want to specialize into these three ones, then you'd have to supply the parameters.\n\n0:38:13\tSPEAKER_04\n And then, although we haven't worried about this yet, you might want to worry about something that would go to the GIS and use that to actually get detailed route planning.\n\n0:38:29\tSPEAKER_04\n So, you know, where do you go to take a picture of it and stuff like that. But that's not, it's not the immediate problem.\n\n0:38:37\tSPEAKER_04\n But presumably that's that that functional is there when, when the media problems just deciding which aspects of the X schema to add.\n\n0:38:47\tSPEAKER_04\n Yeah. So the problem, the media problem is is back to what you were, what you were doing with the belief net. You know, what are we going to use to make this decision?\n\n0:38:55\tSPEAKER_04\n Right. And then once we've made the decision, how do we put that into the content? Right. Well, that, that actually is relatively easy in this case.\n\n0:39:03\tSPEAKER_04\n The harder problem is we decide what we want to use. How do we going to get it? And that, that's the hardest problem.\n\n0:39:09\tSPEAKER_04\n So the hardest problem is how are you going to get this information from some combination of the what the person says in the context and the ontology.\n\n0:39:18\tSPEAKER_04\n So I think that's the hardest problem at the moment is, is where you're going to get this information.\n\n0:39:26\tSPEAKER_04\n And that's so getting back to here. We have a technical problem with the belief nets that we don't want all the factors.\n\n0:39:38\tSPEAKER_04\n Too many factors if we allow them just go combinatorially. So we want to think about which ones we really care about and what they really most depend on. And can we clean this, this up to the point where.\n\n0:39:52\tSPEAKER_01\n So what we really want to do is, because this is really just a three layer that we want to make it expanded out into more layers.\n\n0:39:59\tSPEAKER_04\n We might. I mean, that that's certainly one thing we can do. It's true that the way you have this, a lot of the times you have what you're having is the values rather than the variable.\n\n0:40:17\tSPEAKER_04\n So, right.\n\n0:40:23\tSPEAKER_01\n Okay. So it should really be just be intention as a node instead of intention business or intent.\n\n0:40:27\tSPEAKER_04\n Yeah. Right. And then it would have values to our business or heard. But then it's still some knowledge designed to do about how do you want to break this up? What really matters.\n\n0:40:39\tSPEAKER_01\n I mean, it's fine. We have this iterative. We're going to have to work with it some. I think what was going through my mind when I did it was someone could both have a business intention and a touring intention and the probabilities of both of them happening.\n\n0:40:51\tSPEAKER_04\n Well, you could do that. And it's perfectly okay to insist that you know, they add up to one. But that there's that it doesn't have to 100.\n\n0:41:05\tSPEAKER_04\n Okay. So you could have the conditional. So the each of these things is going to be a probability. So whenever there's a choice.\n\n0:41:15\tSPEAKER_04\n So like landmarkness and usefulness. I don't think those would be mutually. Seems like something could both be absolutely right.\n\n0:41:23\tSPEAKER_04\n And so that you might want to then have those then they may have to be separate. They may not be able to be values of the same very. So that's bidding and this is this is the sort of knowledge design you have to go through.\n\n0:41:40\tSPEAKER_01\n This is just more me taking the last the last one. Right. How can I pull it? It's great. It's is you know, it's one step toward.\n\n0:41:53\tSPEAKER_04\n To where we want to go.\n\n0:41:57\tSPEAKER_02\n It also strikes me that we we may want to approach the point where we can sort of try to find the specification for some interface here that takes the normal m3L looks at it.\n\n0:42:19\tSPEAKER_02\n And then we discussed in our pre-edu meeting how to ask the ontology what to ask the ontology.\n\n0:42:28\tSPEAKER_02\n The fact that we can pretend we have one make a dummy until we get the real one. And so we we way want to decide we can do this from here.\n\n0:42:38\tSPEAKER_02\n But we also could do it. You know if we have a belief net interface. So the belief net takes as input a vector right of stuff.\n\n0:42:50\tSPEAKER_01\n And it.\n\n0:42:53\tSPEAKER_02\n Yeah. And the output is whatever as well. But this information is just m3L and then we want to look up some more stuff in the ontology and we want to look up some more stuff in the maybe want to ask the real world.\n\n0:43:11\tSPEAKER_02\n Maybe want to look some up in the D.I.S. But also we definitely want to look up in the dialogue history. Some some stuff based on we we have.\n\n0:43:23\tSPEAKER_02\n I was just made some examples from the ontology. And so we have for example information there that the town hall is both a building.\n\n0:43:32\tSPEAKER_02\n And it has doors and stuff like this. It is also institutions. So it has a mayor and so forth and so forth. We get these relations out of it. And once we have them we can use that information to look in the dialogue history.\n\n0:43:43\tSPEAKER_02\n Were any of these things that are part of the town hall as an institution mentioned were any of these that make the town hall a building mentioned and so forth.\n\n0:43:53\tSPEAKER_02\n And maybe draw some inferences on that. So this may be a sort of a process of two to three steps before we get our vector that we feed into the belief net.\n\n0:44:05\tSPEAKER_04\n Yeah, I think that's I think that's exactly right. There will be rules that they aren't rules that come to final decisions.\n\n0:44:12\tSPEAKER_04\n There are rules that gather information for a decision process. Yeah, I think that's that's just fine. Yeah, so they'll presumably they'll be a threat of process or something that agent.\n\n0:44:32\tSPEAKER_04\n What everyone want to say, yeah, that is rule driven and can can can do things like that. And there's an issue about whether there will be that'll be the same agent is the one that then goes off and carries out the decisions. It probably will.\n\n0:44:55\tSPEAKER_04\n My guess is it'll be the same basic agent that can go off and get information running through this belief net that turn the crank into belief net that'll come out with more of another vector, okay, which can then be applied at what we would call the simulation or action end.\n\n0:45:18\tSPEAKER_04\n We now know what you're going to do and that may actually involve getting more information. So once you pull that out, it could be that that says, ah, now that we know that we're going to go ask the ontology something else.\n\n0:45:31\tSPEAKER_04\n Now that we know that it's a bus trip, okay, we didn't we didn't need to know beforehand how long the bus trip takes or whatever, but but now that we know that's the way it's coming out, then we got to go.\n\n0:45:43\tSPEAKER_04\n Find out more so I think that's okay.\n\n0:45:53\tSPEAKER_02\n So this is actually if we were to build something that is.\n\n0:46:01\tSPEAKER_02\n It needs to do. Yeah, I think we I can come up with a code for a module that we call the cognitive dispatcher, okay, which does nothing but it looks a complex object trees and decides how there's parts missing that need to be filled out.\n\n0:46:18\tSPEAKER_02\n There is this is maybe something that this module can do something that this module can do and then collect sub objects and then recombined them and put them together. So maybe this is actually some useful tool that we can use to rewrite it.\n\n0:46:36\tSPEAKER_04\n Okay, I confess I'm still not completely comfortable with the overall story.\n\n0:46:51\tSPEAKER_04\n I'm just not a complaint. This is a promise to do more work. So I'm going to have to think about it some more in particular. See what we'd like to do and this has been implicit in the discussion is to do this in such a way that you get a lot of reuse.\n\n0:47:11\tSPEAKER_04\n What you're trying to get out of this deep cognitive linguistics is the fact that if you know about source, so it's pathas and goals and all this sort of stuff that a lot of this is the same for different tasks and that there's some important generalities that you're getting so that you don't take each and every one of these tasks and have to redo it.\n\n0:47:32\tSPEAKER_04\n And I don't yet see how that goes.\n\n0:47:35\tSPEAKER_04\n What are the primitives and how do you bring this? I mean, just saying, I know how to do any individual case. Right, but I don't yet see what's the really interesting question is can you use a deep cognitive linguistics to get powerful generalizations.\n\n0:47:55\tSPEAKER_02\n And should we add them the what's this domain? How do I get to X? Then we also have the what's this domain? Could we get some slightly different.\n\n0:48:13\tSPEAKER_02\n And John actually does not allow us to call them intentions anymore. So he dislikes the term. Well, I don't like the term either. So I have.\n\n0:48:26\tSPEAKER_04\n But I'm sure the what is questions also create some interesting esquema aspects could be. I'm not I'm not particularly opposed to adding that or any other task. I mean, eventually we're going to want a whole range of them.\n\n0:48:43\tSPEAKER_04\n I just saying that I'm going to have to do some sort of first principles thinking about this. I just at the moment don't know.\n\n0:48:51\tSPEAKER_04\n Do you mean in terms of the way we can generalize the base. No, no, the base the base. The base. The base. That's what we just specific for each decision. But what I'd like to be able to do is to have the way that you extract properties that will go in the different base nets be general.\n\n0:49:11\tSPEAKER_04\n So that if you have sources of trajectors and stuff like that, and there's language for talking about trajectors, you shouldn't have to do that differently. For going to something then for circling it for telling someone else how to go there, whatever it is.\n\n0:49:31\tSPEAKER_04\n The decision processes are going to be different. What you really like of course is the standard thing you'd always like, which is that you have a kind of intermediate representation, which looks the same over a bunch of inputs and a bunch of outputs.\n\n0:49:48\tSPEAKER_04\n So all sorts of different tasks and all sorts of different ways of expressing them use a lot of the same mechanism for pulling out what are the fundamental things going on.\n\n0:50:01\tSPEAKER_04\n That would be the really pretty result. And pushing it one step further, when you get the construction grammar and stuff, what you'd like to be able to do is say you have this parser, which is much fancier than the parser that comes with smart com that actually uses constructions and is able to tell from this construction that there's something about the intent, you know, the actual what people want to do or what they're referring to and stuff.\n\n0:50:30\tSPEAKER_04\n So the independent of whether about what is this or where is it or something that you could tell from the construction, you could pull out deep semantic information, which you're going to use in a general way.\n\n0:50:44\tSPEAKER_04\n You might be able to say that this is the kind of construction in which the construction implies that this thing is being viewed as a container.\n\n0:51:06\tSPEAKER_04\n So just from this local construction, you know that you're going to have to treat it as a container and you might as well go off and get that information and that may affect the way you process everything else.\n\n0:51:17\tSPEAKER_04\n So you say how do I get into the castle.\n\n0:51:21\tSPEAKER_04\n Or, you know, what is there in the castle or so there's all sorts of things you might ask that involve the castle as a container and you'd like to have this orthogonal so that any time the castle is referred to as a container, you crank up the appropriate stuff.\n\n0:51:41\tSPEAKER_04\n Independent of what the goal is and independent of what the surrounding language is.\n\n0:51:46\tSPEAKER_04\n So that's the thesis level.\n\n0:51:51\tSPEAKER_02\n It's important also that English sort of get rid of most of its spatial adverbs because they're really fancy than for these kinds of analysis.\n\n0:52:01\tSPEAKER_02\n Well, they have a prepuditional phrases.\n\n0:52:04\tSPEAKER_02\n Yeah, but they're easier for parses.\n\n0:52:06\tSPEAKER_02\n Right.\n\n0:52:07\tSPEAKER_02\n Parses can pick those up with the spatial adverbs.\n\n0:52:10\tSPEAKER_02\n They have a tough time because the mathematics are very complex and that's right.\n\n0:52:16\tSPEAKER_02\n Okay.\n\n0:52:17\tSPEAKER_02\n I don't remember.\n\n0:52:21\tSPEAKER_02\n Just put that it again.\n\n0:52:24\tSPEAKER_02\n Oh, yeah, but an architecture like this would also enable us maybe to throw this way and replace it with something else or whatever so that we have.\n\n0:52:32\tSPEAKER_02\n So this is sort of the representational formats where we're talking about that are independent of the problem that generalize over those problems and are of a higher quality than any actual whatever.\n\n0:52:46\tSPEAKER_02\n Leave net or X that we may use for the decision making ultimately.\n\n0:52:55\tSPEAKER_02\n Should be decoupled.\n\n0:53:01\tSPEAKER_04\n Okay.\n\n0:53:04\tSPEAKER_04\n So are we going to be meeting here from now on?\n\n0:53:06\tSPEAKER_04\n I'm happy to do that.\n\n0:53:07\tSPEAKER_04\n We had talked about it because you have the display and everything.\n\n0:53:10\tSPEAKER_04\n That seems fine.\n\n0:53:11\tSPEAKER_02\n Yeah, and this also asks whether we're going to have presentations every time.\n\n0:53:15\tSPEAKER_02\n I don't think we will need to do that, but it's so far.\n\n0:53:18\tSPEAKER_02\n I think it was nice as a visual aid for some things.\n\n0:53:21\tSPEAKER_04\n Oh, yeah, no, I think it's worth it to meet here to bring this and assume that something may come up that we want to look at.\n\n0:53:28\tSPEAKER_04\n Yeah, why not?\n\n0:53:31\tSPEAKER_02\n And...\n\n0:53:34\tSPEAKER_01\n I think it would be presentation.\n\n0:53:45\tSPEAKER_01\n She was good.\n\n0:53:49\tSPEAKER_04\n She was good.\n\n0:53:50\tSPEAKER_04\n Latanya was good.\n\n0:53:54\tSPEAKER_02\n She was definitely good in the sense that she showed us some of the weaknesses.\n\n0:54:00\tSPEAKER_02\n Right.\n\n0:54:01\tSPEAKER_02\n And also the fact that she was a real subject.\n\n0:54:08\tSPEAKER_02\n Right.\n\n0:54:09\tSPEAKER_04\n And she took it seriously and...\n\n0:54:13\tSPEAKER_04\n No, I was great.\n\n0:54:15\tSPEAKER_02\n Yeah.\n\n0:54:16\tSPEAKER_02\n So I think that...\n\n0:54:18\tSPEAKER_02\n I mean, just looking at this data, listening to it, what can we get out of it in terms of our problem?\n\n0:54:23\tSPEAKER_02\n For example, she actually said...\n\n0:54:27\tSPEAKER_02\n She never spoke about entering.\n\n0:54:30\tSPEAKER_02\n She just wanted to get some place and she said for buying stuff.\n\n0:54:34\tSPEAKER_02\n So this is definitely interesting.\n\n0:54:37\tSPEAKER_02\n Yeah.\n\n0:54:39\tSPEAKER_02\n And in the other case, where she wanted to look at that stuff at the graffiti.\n\n0:54:43\tSPEAKER_02\n Also, of course, not in the sense how do you get there was pretty standard, except that there was nice enough for pointing at what she talked about before.\n\n0:54:52\tSPEAKER_02\n And there she was talking about looking at pictures that were painted inside a wall on walls.\n\n0:54:58\tSPEAKER_02\n Actually, you need a lot of word knowledge.\n\n0:55:00\tSPEAKER_02\n This would have been a classical tango, actually, because graffiti is usually found on the outside, not on the inside, but...\n\n0:55:09\tSPEAKER_02\n Okay.\n\n0:55:10\tSPEAKER_02\n So the mistake would have made a mistake.\n\n0:55:14\tSPEAKER_03\n This is the movie made a mistake.\n\n0:55:18\tSPEAKER_03\n Click.\n\n0:55:21\tSPEAKER_03\n Right.\n\n0:55:51\tNone\n Thanks for watching.\n\n0:56:21\tNone\n Thanks for watching.\n\n", "summary": [{"summary_text": "The transcript is recording now. Speaker is going to be at the meeting at night. If he's not there, the battery will be off the microphone and the black gear will be done. The data that Speaker met is useful in his college practice. "}]}