{"filename": "./data/Bed009.txt", "transcript": "0:00:00\tNone\n Okay.\n\n0:00:02\tSPEAKER_03\n Testing channel 2.\n\n0:00:04\tSPEAKER_03\n Two.\n\n0:00:06\tSPEAKER_03\n Two.\n\n0:00:08\tSPEAKER_02\n Oh.\n\n0:00:22\tSPEAKER_04\n Hmm?\n\n0:00:24\tSPEAKER_04\n There.\n\n0:00:32\tSPEAKER_04\n Wow.\n\n0:00:34\tSPEAKER_04\n So, rough and terminate here.\n\n0:00:36\tSPEAKER_04\n Great.\n\n0:00:38\tSPEAKER_04\n Great.\n\n0:00:40\tSPEAKER_03\n Made it safety.\n\n0:00:42\tSPEAKER_03\n So, what we have been doing is they would like us all to read these digits.\n\n0:00:46\tSPEAKER_03\n But we don't already.\n\n0:00:48\tSPEAKER_03\n A couple people read it.\n\n0:00:50\tSPEAKER_03\n When it gives them all German accents.\n\n0:00:52\tSPEAKER_04\n Okay.\n\n0:00:54\tSPEAKER_04\n The way you do it is you just read the numbers not as each single.\n\n0:01:00\tSPEAKER_04\n So, just like I do it.\n\n0:01:02\tSPEAKER_04\n First you read the transcript number.\n\n0:01:04\tSPEAKER_04\n My transcript number is L95.\n\n0:01:06\tSPEAKER_04\n 3230977352214082115160087096440 64404562850593 5261 358105 624 468 48551 4229 05756 07 32\n\n0:01:42\tSPEAKER_01\n Okay. What's my transcript number is L91 141628613157 0395 8 06622 0316143416171340652105 9821408492 126586666 866161311102066654159\n\n0:02:52\tSPEAKER_00\n Okay. My transcript number is L92 85034213760632 4970 6068 636 564 9306 641 8706 807 3 1770 7556 445660 4510 845 841 1037 1072 6774 1700\n\n0:03:34\tSPEAKER_02\n Okay. Let's be done with this. Okay. This is Mommy.\n\n0:03:38\tSPEAKER_02\n Come on in.\n\n0:03:40\tSPEAKER_02\n Okay. So, we're going to try to finish by five.\n\n0:03:43\tSPEAKER_03\n So, people who want to go here, Nancy Chang's talk downstairs.\n\n0:03:49\tSPEAKER_03\n And you guys are giving talks on tomorrow and Wednesday much.\n\n0:03:53\tSPEAKER_02\n That's great. Okay. So, you know what we're going to do?\n\n0:03:57\tSPEAKER_04\n I thought two things we'll introduce ourselves.\n\n0:04:01\tSPEAKER_04\n What we do. And we already talked with Andreas Tilo and David and some lines of code were already written today and almost tested.\n\n0:04:13\tSPEAKER_04\n And just going to say we have again the recognizer to pass the thing where we're working on and that should be no problem.\n\n0:04:23\tSPEAKER_04\n And then that can be sort of developed as needed when we enter the tourism domain.\n\n0:04:31\tSPEAKER_04\n We have talked this morning with Tillman about the generator.\n\n0:04:37\tSPEAKER_04\n And they are one of our diligent workers has to sort of volunteer to look over Tillman's shoulder while he is changing the grammar to English because we have we face two ways.\n\n0:04:52\tSPEAKER_04\n Either we do a simple concatenating grammar for the English generation which is sort of starting from scratch and doing it the easy way.\n\n0:05:02\tSPEAKER_04\n Always simply adopt the more in-depth style that is implemented in the German system.\n\n0:05:10\tSPEAKER_04\n And are then able not only to produce strings but also the syntactic parts, not parts in the syntactic tree that is underneath the syntactic structure.\n\n0:05:21\tSPEAKER_04\n Which is the way we decided we were going to go because it's easier in the beginning.\n\n0:05:26\tSPEAKER_04\n And that's required some knowledge of those grammars and some linguistic background.\n\n0:05:33\tSPEAKER_04\n But it shouldn't be a problem for anyone.\n\n0:05:37\tSPEAKER_02\n Okay, so that's the answer.\n\n0:05:41\tSPEAKER_02\n You're going to have some time to do that with these guys.\n\n0:05:44\tSPEAKER_04\n Sure.\n\n0:05:45\tSPEAKER_03\n Because you're the grammar major.\n\n0:05:50\tSPEAKER_03\n Okay.\n\n0:05:51\tSPEAKER_02\n I mean it makes sense doesn't it?\n\n0:05:52\tSPEAKER_03\n Yeah.\n\n0:05:53\tSPEAKER_03\n Okay, so I think that's probably the right way to do that.\n\n0:05:59\tSPEAKER_03\n And yeah, so I actually want to find out about it too but I may not have time to...\n\n0:06:06\tSPEAKER_04\n The ultimate goal is that before they leave we can run through the entire system input through output on at least one or two simple things.\n\n0:06:17\tSPEAKER_04\n And by virtue of doing that, then in this case, John will have acquired the knowledge of how to extend it at infinitum.\n\n0:06:27\tSPEAKER_04\n When needed, if needed, when wanted.\n\n0:06:30\tSPEAKER_04\n So for...\n\n0:06:36\tSPEAKER_02\n Okay, that sounds great.\n\n0:06:38\tSPEAKER_04\n And also, Ralph has hooked up with David and you're going to continue either all through tonight or tomorrow and whatever to get the password interface working.\n\n0:06:53\tSPEAKER_04\n They're sending out and ticking out lattices and doing this kind of stuff to see what works best.\n\n0:06:59\tSPEAKER_03\n So you guys enjoy your weekend?\n\n0:07:02\tSPEAKER_03\n Yes, yeah, I'm sorry.\n\n0:07:04\tSPEAKER_03\n You ever got to put the work?\n\n0:07:09\tSPEAKER_03\n Okay, so that's sort of one branch is to get us caught up on what's going on.\n\n0:07:17\tSPEAKER_03\n Also of course would be really nice to know what the plans are in addition to what's already in code.\n\n0:07:24\tNone\n And we can...\n\n0:07:25\tSPEAKER_03\n I don't know what was or the time when we were set up to do that.\n\n0:07:30\tSPEAKER_03\n It probably will work better if we do it later in the week after we actually understand better what's going on.\n\n0:07:37\tSPEAKER_03\n So when do you guys leave?\n\n0:07:39\tSPEAKER_00\n We're here through Sunday.\n\n0:07:41\tSPEAKER_00\n Oh, okay, so...\n\n0:07:42\tSPEAKER_03\n So we'll find a time later in the week to get together and talk about your understanding of what smart comp plans are and how we can change it.\n\n0:07:55\tSPEAKER_04\n So we already said a day for that.\n\n0:08:00\tSPEAKER_04\n Might be a bit official while we're all here.\n\n0:08:03\tSPEAKER_02\n Okay.\n\n0:08:05\tNone\n What does not work for me is Thursday afternoon.\n\n0:08:17\tSPEAKER_03\n I can do earlier than day on Thursday or most of the time on Friday.\n\n0:08:32\tSPEAKER_04\n Thursday morning sounds fine?\n\n0:08:35\tSPEAKER_04\n What are your constraints?\n\n0:08:38\tSPEAKER_04\n Thursday afternoon doesn't work for me, but...\n\n0:08:42\tSPEAKER_04\n It's either Thursday morning, no.\n\n0:08:49\tSPEAKER_02\n Thursday morning should be fine.\n\n0:08:55\tSPEAKER_02\n 11?\n\n0:08:58\tNone\n 11 on Thursday.\n\n0:09:00\tSPEAKER_02\n I was just thinking I will 11 by 11.\n\n0:09:05\tSPEAKER_03\n This is a different to our morning people.\n\n0:09:10\tSPEAKER_00\n So he's there.\n\n0:09:20\tSPEAKER_00\n Third Sunday live.\n\n0:09:23\tSPEAKER_03\n And actually we could invite Andreas as well.\n\n0:09:37\tSPEAKER_03\n He will be in Washington.\n\n0:09:39\tSPEAKER_03\n That's true.\n\n0:09:40\tSPEAKER_03\n He's off the office trip already.\n\n0:09:43\tSPEAKER_04\n But David is here and he's actually...\n\n0:09:50\tSPEAKER_04\n Those everything about the smart comp plans.\n\n0:09:53\tSPEAKER_02\n Okay, we'll see if David can make it out.\n\n0:10:01\tSPEAKER_04\n Okay, so facing to what we've been doing here.\n\n0:10:09\tSPEAKER_04\n One thing we're also using this room to collect data.\n\n0:10:14\tSPEAKER_04\n Not this type of data, not meeting data, but sort of our version of a wizard experiment, not like the ones in Munich, but pretty close to it.\n\n0:10:25\tSPEAKER_04\n The major difference to the Munich ones is that we do it...\n\n0:10:29\tSPEAKER_04\n We add the telephone, even all the recording is done here.\n\n0:10:33\tSPEAKER_04\n And so it's sort of a computer call system that gives you tourist information to get places.\n\n0:10:40\tSPEAKER_04\n And it breaks halfway through the experiment and a human operator comes on.\n\n0:10:44\tSPEAKER_04\n And part of that is sort of try to find out whether people change their linguistic verbal behavior when first thinking they speak to a machine or then to a human.\n\n0:10:55\tSPEAKER_04\n And we're setting it up so that we can...\n\n0:10:58\tSPEAKER_04\n We hope to implant certain intentions in people, for example.\n\n0:11:02\tSPEAKER_04\n We have first looked at a simple sentence that...\n\n0:11:08\tSPEAKER_04\n How do I get to the powder tower?\n\n0:11:11\tSPEAKER_04\n Okay, so you have that castle of idle work and there is a tower and it's called powder tower.\n\n0:11:16\tSPEAKER_04\n And so what do you parse out of that sentence?\n\n0:11:22\tSPEAKER_04\n Probably something that we specified in M3L that is...\n\n0:11:27\tSPEAKER_04\n Action, go to whatever domain object, whatever, powder tower.\n\n0:11:31\tSPEAKER_04\n And maybe some model will tell us some GPS module in a mobile scenario where the person is at the moment.\n\n0:11:38\tSPEAKER_04\n And we've sort of gone through that once before in the DeepMap project.\n\n0:11:41\tSPEAKER_04\n And we noticed that first of all, what are...\n\n0:11:44\tSPEAKER_04\n I should have brought some slides.\n\n0:11:47\tSPEAKER_04\n But what are...\n\n0:11:49\tSPEAKER_04\n So here's the tower.\n\n0:11:52\tSPEAKER_04\n Think of this as a two-dimensional representation of the tower.\n\n0:11:55\tSPEAKER_04\n And our system that people here, to a point where they were facing a wall from the tower, there's no entrance here.\n\n0:12:02\tSPEAKER_04\n But it just happens to be the closest point of the road network to the geometric center.\n\n0:12:07\tSPEAKER_04\n And it just says how the algorithm works.\n\n0:12:10\tSPEAKER_04\n So we took out that part of the road network as a heck, and then it followed actually the way to the entrance, which was now the closest point of the road network to geometric center.\n\n0:12:20\tSPEAKER_04\n But what we actually observed in idle work is that most people, when they want to go, they actually don't want to enter.\n\n0:12:26\tSPEAKER_04\n Because it's not really interesting.\n\n0:12:27\tSPEAKER_04\n They want to go to a completely different point where they can look at it and take a picture.\n\n0:12:32\tSPEAKER_04\n So, let's say a simple parse from an utterance won't really give us, is what the person actually wants.\n\n0:12:42\tSPEAKER_04\n Does he want to go there to see it?\n\n0:12:44\tSPEAKER_04\n Does he want to go there now?\n\n0:12:46\tSPEAKER_04\n Later?\n\n0:12:47\tSPEAKER_04\n How does the person want to go there?\n\n0:12:49\tSPEAKER_04\n Is that person more likely to want to walk there, walk a scenic route, and so forth?\n\n0:12:54\tSPEAKER_04\n There are all kinds of decisions that we have identified in terms of getting to places and in terms of finding information about things.\n\n0:13:02\tSPEAKER_04\n And we are constructing, and then we've identified more or less the extra linguistic parameters.\n\n0:13:08\tSPEAKER_04\n It may play role, information related to the user and information related to the situation.\n\n0:13:13\tSPEAKER_04\n And we also want to look closely on the linguistic information, what we can get from the utterance.\n\n0:13:21\tSPEAKER_04\n That's part of why we implant these intentions in the data collection to see whether people actually are facing differently, whether they want to enter in order to buy something, or whether they just want to go there to look at it.\n\n0:13:33\tSPEAKER_04\n And so, the idea is to construct suitable interfaces and a belief net for a module that actually tries to guess what the underlying intention was.\n\n0:13:48\tSPEAKER_04\n And then, enrich or augment the M3L structures with what I thought, what more it sort of got out of that utterance.\n\n0:13:57\tSPEAKER_04\n So, if it can make a good suggestion, hey, that person doesn't want to enter.\n\n0:14:02\tSPEAKER_04\n That person just wants to take a picture, because he just bought a film, or that person wants to enter, because he discussed the admission fee before, or that person wants to enter, because he wants to buy something, and that you usually do inside of buildings and so forth.\n\n0:14:15\tSPEAKER_04\n These types of additional information are going to be embedded into the M3L structure, in a sort of subfield that we have reserved.\n\n0:14:28\tSPEAKER_04\n And if the action planner does something with that grade, if not, then that's also something that we can't really, at least we want to offer the extra information, we don't really, we're not too worried.\n\n0:14:46\tSPEAKER_04\n I mean, ultimately, if you have, if you can offer that information, somebody's going to do something with it sooner or later, that's sort of part of our belief.\n\n0:14:54\tSPEAKER_04\n For example, right now, I know the GIS from email is not able to calculate these viewpoints.\n\n0:15:02\tSPEAKER_04\n So, that's a functionality that doesn't exist yet, to do that dynamically.\n\n0:15:06\tSPEAKER_04\n But if we can offer that distinction, maybe somebody will go ahead and implement it.\n\n0:15:12\tSPEAKER_04\n Surely nobody is going to go ahead and implement it, if it's never going to be used.\n\n0:15:17\tSPEAKER_04\n What have I forgotten about?\n\n0:15:20\tSPEAKER_03\n Yeah, I'm happy to do it.\n\n0:15:23\tSPEAKER_03\n It's a good time to pause.\n\n0:15:25\tSPEAKER_03\n I see questions on people's faces.\n\n0:15:29\tSPEAKER_00\n What would the office want to be if you envision this as a module within SmartCom?\n\n0:15:37\tSPEAKER_04\n So far, I've sort of it sort of adding it on to the model and knowledge module.\n\n0:15:43\tSPEAKER_04\n So, this is one that already adds additional information to the, but it could sit anywhere in the attention recognition.\n\n0:15:51\tSPEAKER_04\n I mean, basically, this is what attention recognition literally sort of can.\n\n0:15:56\tSPEAKER_04\n That's why it should be.\n\n0:16:00\tSPEAKER_00\n Well, from my understanding of what the people at TIPS were originally trying to do, doesn't seem to quite fit into SmartCom currently.\n\n0:16:09\tSPEAKER_00\n So what they're really doing right now is only selecting among the alternatives, the hypothesis that they're given and enriched by the domain knowledge and the dismalarist modeler and so on.\n\n0:16:21\tSPEAKER_00\n So if this is additional information, that could be merged in with them.\n\n0:16:25\tSPEAKER_00\n And then it wouldn't be available to action planning and others.\n\n0:16:32\tSPEAKER_03\n Okay, that was one question.\n\n0:16:39\tSPEAKER_03\n Are there other things that, because we want to not pass over any questions or concerns that you have?\n\n0:16:47\tSPEAKER_00\n Whether they're two levels of giving an answer, I guess on both levels.\n\n0:16:57\tSPEAKER_00\n I don't have any further questions. The two levels of being, as far as I'm concerned, is standing here for the generation module and the other is my understanding of what SmartCom is supposed to be.\n\n0:17:10\tSPEAKER_03\n So, let me explain that a little bit from the point of view of the generation.\n\n0:17:16\tSPEAKER_03\n So the idea is that we've actually got this all laid out and we could show it to you.\n\n0:17:21\tSPEAKER_03\n I think Robert didn't bring it today, but there's a belief net, which is, there's a first cut of the belief net that doesn't, isn't fully instantiated in particular.\n\n0:17:35\tSPEAKER_03\n Some of the combination rules and ways of getting additional probabilities aren't there.\n\n0:17:39\tSPEAKER_03\n But we believe that we have laid out the fundamental decisions in this little space and the things that influence them.\n\n0:17:47\tSPEAKER_03\n So, one of the decisions is what we call this ABE.\n\n0:17:51\tSPEAKER_03\n You want to access view or enter.\n\n0:17:58\tSPEAKER_03\n So that's a discrete decision. There are only three possibilities.\n\n0:18:02\tSPEAKER_03\n And what we would like is for this knowledge modeling collection to add which of those it is and give it to the player.\n\n0:18:15\tSPEAKER_03\n But the current design suggests that if it seems to be an important decision and if the belief net is equivocal so that it doesn't say that one of these is much more probable than the other, then an option is to go back and ask for the information you want.\n\n0:18:37\tSPEAKER_03\n There are two ways one can imagine doing that. For the debugging, we'll probably just have a drop down menu and while you're debugging, you're just mucking.\n\n0:18:46\tSPEAKER_03\n But for a full system, then one might very well formulate a query, give it to the dialogue planner and say, are you planning to enter or whatever it might be. So that's under that model, then there would be a loop in which this thing would formulate a query, presumably give it to you that would get expressed and hopefully you get an answer back.\n\n0:19:18\tSPEAKER_03\n And that would of course, the answer would have a harsh two. You probably won't do this early on because the current focus is more decision making and stuff like that.\n\n0:19:32\tSPEAKER_03\n But while we're on the subject, I just wanted to give you a heads up.\n\n0:19:38\tSPEAKER_03\n It could be that some months from now, we said, okay, we're now ready to try to close that loop in terms of querying about some of those decisions.\n\n0:19:50\tSPEAKER_00\n So my suggestion then is that you look into the currently ongoing discussion about how the action plans are supposed to look like.\n\n0:19:59\tSPEAKER_00\n And they're currently agreeing or in the process of agreeing on an exemplification of something like a state transition network of how dialogues would proceed.\n\n0:20:12\tSPEAKER_00\n And these transition networks will be what the action plan of the next interprets in a sense.\n\n0:20:19\tSPEAKER_02\n You know this, honey?\n\n0:20:21\tSPEAKER_00\n And Mikhail is doing that right? Well, Markus is actually implementing that stuff and Markus and Michele together are leading the discussion there.\n\n0:20:32\tSPEAKER_03\n Okay. So we have to get it on that because partly those are like excements, the transition backgrounds.\n\n0:20:42\tSPEAKER_03\n And it may be that we should early on make sure that they have flexibility to be weak.\n\n0:20:52\tSPEAKER_04\n But they have understood this right? They govern more or less the dialogue behavior or the action.\n\n0:21:00\tSPEAKER_04\n It's not really what you do with the content of the dialogue, but it's.\n\n0:21:07\tSPEAKER_03\n I mean, there is this nice. So there's a. So the word action. Okay. Is what's ambiguous here. So one thing is there's an actual planner that tells the person first of me.\n\n0:21:24\tSPEAKER_03\n Where it tells the person how to go first go here first go there. Take a bus, whatever it is. So that's that form of planning and action and a round planner and GIS also to stuff.\n\n0:21:39\tSPEAKER_00\n But I think that isn't what you know. No, no, in smart home terminology that's called a function that's modeled by a function modeler.\n\n0:21:48\tSPEAKER_00\n And it's that that's completely encapsulated from the dialogue system. That's simply a functionality that you give data is in a query.\n\n0:21:56\tSPEAKER_00\n And then you get back from that functioning model, which might be a planner or a VCR or whatever. Some result. And that's then.\n\n0:22:05\tSPEAKER_03\n Okay. So that's what I thought. So action action here means that I have speech. Yeah. Dialogue.\n\n0:22:12\tSPEAKER_03\n Okay. I think that I think it's not going to. I think it's not going to be good enough. I don't know what I meant by that.\n\n0:22:22\tSPEAKER_03\n So I think the idea of having a transition diagram or the grammar of conversations is a good idea.\n\n0:22:32\tSPEAKER_03\n Okay. And I think we do have to get in on it. But I think that when so when you get to the tourist domain.\n\n0:22:45\tSPEAKER_03\n It's not just an information retrieval system. Right. So this is where I think people are going to have to think this to a bit more carefully.\n\n0:22:53\tSPEAKER_03\n So if it's only like in the film and TV thing, okay, you can do this. You just get information and give it to people.\n\n0:23:02\tSPEAKER_03\n But what happens when you actually get them moving and so forth and so on.\n\n0:23:09\tSPEAKER_03\n I think the notion of this is a self contained module. The functional module that interacts with where the tourist domain is.\n\n0:23:23\tSPEAKER_03\n Probably is too restrictive. I don't know how much people have thought ahead to the tourist domain.\n\n0:23:32\tSPEAKER_00\n Probably not another. Another more basic point there is that the current tasks and therefore the concepts of this.\n\n0:23:41\tSPEAKER_00\n What's called the action plan. It's really a dialogue manager is based on slots that have to be filled.\n\n0:23:47\tSPEAKER_00\n The kind of values in these slots would be fixed things like a time or a movie time setting like this.\n\n0:23:54\tSPEAKER_00\n Whereas in the tourist domain might be an entire route.\n\n0:23:57\tSPEAKER_00\n It's a very complex structure information in these slots. Not sure if complex slots of that type are really being taken into consideration.\n\n0:24:09\tSPEAKER_00\n So that's really something.\n\n0:24:19\tSPEAKER_00\n We need to be settled there. So this is really an ongoing discussion.\n\n0:24:28\tSPEAKER_04\n We have faced and implemented those problems once already.\n\n0:24:33\tSPEAKER_04\n Maybe we can even shovel some know-how from there to Markus and Micheal.\n\n0:24:44\tSPEAKER_04\n I'll talk to Micheal. How far is the M3L specification for the natural language input gone?\n\n0:24:59\tSPEAKER_04\n I haven't seen anything for the tourist path.\n\n0:25:04\tSPEAKER_01\n It's not defined yet.\n\n0:25:07\tSPEAKER_04\n You are probably also involved in that.\n\n0:25:16\tSPEAKER_01\n We'll meet next week.\n\n0:25:22\tSPEAKER_04\n Those are the two key issues. How does the input pipeline look like and what the action planner does with it?\n\n0:25:39\tSPEAKER_04\n I think of the internal working of the action planner and the function model as relevant.\n\n0:25:54\tSPEAKER_04\n That can be as detailed or as crude as you want it to be.\n\n0:26:00\tSPEAKER_04\n The internal workings of the action planner and the work with the state.\n\n0:26:09\tSPEAKER_04\n That shouldn't really matter too much.\n\n0:26:12\tSPEAKER_04\n It does have to keep track of your bare-on-part six of a route that consists of eight steps.\n\n0:26:18\tSPEAKER_03\n I think there are a lot of reasons why it matters.\n\n0:26:30\tSPEAKER_03\n The user says that the action planner told it if the parser and the language end doesn't know what the person has been told.\n\n0:26:53\tSPEAKER_03\n The person says that the planner says that the planner doesn't know that.\n\n0:27:03\tSPEAKER_03\n There are all sorts of dialogues that won't make any sense.\n\n0:27:14\tSPEAKER_00\n The point has been realized that it's not really defined yet.\n\n0:27:24\tSPEAKER_00\n There's going to be some kind of feedback from the action planner into all the analysis modules telling them what to expect, what the current state of the discourse is beyond what's currently being implemented.\n\n0:27:38\tSPEAKER_03\n This is not just the state of the discourse, this is actually the state of the plan.\n\n0:27:49\tSPEAKER_03\n It's great if people are already taking that into account.\n\n0:27:55\tSPEAKER_03\n The specifics are in this room.\n\n0:28:10\tSPEAKER_03\n The question is, can you put in this need a fair amount of feedback from planning it in these things which are much more continuous than the dialogue over movies and stuff?\n\n0:28:25\tSPEAKER_00\n The action planner needs to be able to have an expressive power that can deal with these structures.\n\n0:28:40\tSPEAKER_03\n The next question is, can you put in a fair amount of feedback from the action planner?\n\n0:29:03\tSPEAKER_03\n It ought to be called a dialogue manager.\n\n0:29:13\tSPEAKER_03\n What would happen if we said, we've talked about this and we've changed this.\n\n0:29:22\tSPEAKER_00\n Probably the most impossible.\n\n0:29:26\tSPEAKER_00\n Who you talk to, how we'll see.\n\n0:29:36\tSPEAKER_00\n I think this is just for historical reasons within the preparation phase of the project and not because somebody actually believes it ought to be action funded.\n\n0:29:49\tSPEAKER_03\n If that persists, then we're going to need another term for the thing that actually does the planning of the routes and whatever we're doing for the tourist.\n\n0:30:01\tSPEAKER_04\n That's external services.\n\n0:30:06\tSPEAKER_03\n That has all the wrong connotations.\n\n0:30:09\tSPEAKER_03\n It sounds like it's standalone, it does interact, it doesn't.\n\n0:30:15\tSPEAKER_03\n That's something I think you can't. It's fine for looking up when the show is on TV.\n\n0:30:22\tSPEAKER_03\n I think it's really wrong headed for something that has a lot of state it's going to interact in a complicated way with understanding the board.\n\n0:30:35\tSPEAKER_04\n I think just the spatial planner and the route planner, I showed you once the interaction between them among them in the deep map system.\n\n0:30:45\tSPEAKER_04\n A printout of the communication between those two fills up how many pages.\n\n0:30:48\tSPEAKER_04\n That's just part of how do I get to one place.\n\n0:30:56\tSPEAKER_04\n So this is definitely a good point to get into the discussion or to enter his discussion actually.\n\n0:31:08\tSPEAKER_04\n Is he new in the...\n\n0:31:11\tSPEAKER_00\n Yes.\n\n0:31:13\tSPEAKER_00\n He started, like, January.\n\n0:31:16\tSPEAKER_00\n He's going to be responsible for the interpretation of this action plan.\n\n0:31:23\tSPEAKER_04\n He's going to continue with the old thing.\n\n0:31:30\tSPEAKER_04\n Yes, I was just wondering the next question, we're going to stick to ProLoc or not.\n\n0:31:40\tSPEAKER_04\n But I do think the function modeling concept has a certain...\n\n0:31:44\tSPEAKER_04\n It makes sense in a certain light because the action planner should not be or the dialogue manager in that case should not...\n\n0:31:52\tSPEAKER_04\n We have to worry about whether it's interfacing with something that does route planning in this way or that way.\n\n0:32:00\tSPEAKER_03\n I agree. There is a logic to dialogue which is separable.\n\n0:32:06\tSPEAKER_04\n And it can sort of formulate what it wants in a rather abstract way.\n\n0:32:15\tSPEAKER_04\n Find me a good route for this. It doesn't really have to worry about how route planner AO or route planner B actually wants it.\n\n0:32:23\tSPEAKER_04\n So this seems like a good idea.\n\n0:32:29\tSPEAKER_03\n It's tricky because one could well imagine, I think it will turn out to be the case that this thing we're talking about, and the extended knowledge modeler will fill in some parameters about what the person wants.\n\n0:32:45\tSPEAKER_03\n One could well imagine that the next thing that's trying to fill out the detailed route planning, let's say, will also have questions that it would like to ask the user.\n\n0:32:56\tSPEAKER_03\n You could well imagine you get to a point where it's got a choice to make and it just doesn't know something.\n\n0:33:04\tSPEAKER_03\n So you would like it also be able to formulate a query and to run that back through the dialogue manager and to the output module and back around.\n\n0:33:21\tSPEAKER_03\n And a good design would allow that if you can't make it happen.\n\n0:33:28\tSPEAKER_00\n So that doesn't necessarily contradict an architecture where there really is a person that you will define the interface.\n\n0:33:34\tSPEAKER_03\n I totally agree. But what it needs, the point is, in that case the dialogue manager is sort of a vent driven.\n\n0:33:41\tSPEAKER_03\n So dialogue manager may think it's in a dialogue state of one sort.\n\n0:33:46\tSPEAKER_03\n And this one of these planning modules comes along and says, hey, right now we need to ask a question.\n\n0:33:51\tSPEAKER_03\n So that forces the dialogue manager to change state.\n\n0:33:55\tSPEAKER_00\n Okay, it can be true. Yeah, yeah, I think that's the concept of people.\n\n0:34:05\tSPEAKER_00\n And then the underlying idea, of course, is that there is something like kernel modules with kernel functionality that can pluck certain applications like tourist information or the whole scenario of controlling a VCR install.\n\n0:34:20\tSPEAKER_00\n And then extend it to arbitrary number of publications.\n\n0:34:25\tSPEAKER_00\n So that's an additional reason to have this well defined interface.\n\n0:34:30\tSPEAKER_00\n Keep these things like tourist information external.\n\n0:34:36\tSPEAKER_04\n Of course, there is another philosophical issue that I think you can debate.\n\n0:34:47\tSPEAKER_04\n But this makes sense to me that sooner or later a service is going to come and describe itself to you.\n\n0:34:55\tSPEAKER_04\n And that's sort of what Srini is working on in the Dumbled project where you find a GIS about that gives you information on Berkeley.\n\n0:35:05\tSPEAKER_04\n And it's going to be there and tell you what it can do and how it wants to do things.\n\n0:35:10\tSPEAKER_04\n And so you can actually interface to such a system without ever having met it before.\n\n0:35:14\tSPEAKER_04\n And the function modeler and the self description of the external service, handle it out.\n\n0:35:21\tSPEAKER_04\n And you can use the same language core understanding core to interface with planner a planner B planner C and so forth, which is, you know, a utopian completely utopian at the moment.\n\n0:35:33\tSPEAKER_04\n But slowly getting into the realm of the contingent.\n\n0:35:44\tSPEAKER_04\n But we are facing, of course, much more realistic problems and language input, for example, is of course crucial.\n\n0:35:54\tSPEAKER_04\n And also when you do the sort of deep understanding analysis that we envision, then of course, the, you know, what is the property of the stimulus, the last we get of that, the better.\n\n0:36:09\tSPEAKER_04\n And so we were thinking, for example, how much syntactic analysis actually happens already in the parser and whether one could interface to that potentially.\n\n0:36:19\tSPEAKER_01\n Currently, it's no syntactic analysis. But in the next release, and it's kind of, so we looked at the current pattern matching.\n\n0:36:38\tSPEAKER_03\n And as you say, it's just the surface pattern matching. So what are the plans roughly?\n\n0:36:45\tSPEAKER_01\n To integrate and syntactic analysis and some more features like segmentation. So then more than one utterance is there.\n\n0:37:00\tSPEAKER_03\n And this is all done, a pause between it, segmentation across. So the idea is to have a particular, particular parser in mind.\n\n0:37:23\tSPEAKER_03\n And if you thought through, is it an HBSG parser? Is it a, whatever? No, no, I think it's complicated for.\n\n0:37:33\tSPEAKER_01\n Okay. One person has to. Oh, you have to do it. Yeah. So things must be simple. I see. So.\n\n0:37:42\tSPEAKER_03\n But yeah, the syntactic analysis. People in finite state trans-susers. People at DFK, I have written a fair number of parsers. Other people over the years have written various parsers in DFK. None of them are suitable. I'm asking.\n\n0:37:59\tSPEAKER_01\n Yeah, the problem is that it has to be very fast because if you want to for more than one path and what's in the lattice from a speed track or not, so it's speed is crucial.\n\n0:38:16\tSPEAKER_01\n Not fast enough. It also has to be very robust cause of speed track recognition. I don't know. So there was a chunk parser in verbobile.\n\n0:38:33\tSPEAKER_03\n There was one of the branches. You know, I do, there were these various competing syntax modules. And I know one of them was a chunk parser. And I don't remember who did that.\n\n0:38:51\tSPEAKER_01\n I think that a tubing and I thought. I didn't know. Well, do you know something about it? Tubing was at least involved in putting the chunks together.\n\n0:39:05\tSPEAKER_00\n I can't quite recall whether they actually produced the chunks in the first place.\n\n0:39:11\tSPEAKER_03\n That's right. They had just done with a two-phase thing where the chunk parser itself was pretty stupid. And then there was a kind of trying to fit them together that used more context.\n\n0:39:26\tSPEAKER_00\n And especially you did some, was a learning based approach, which you learned from a big corpus of trees. And yes, the chunk parser was a financial machine that Mark Leidritch worked on and wasn't tubing them.\n\n0:39:43\tSPEAKER_00\n And somebody else was tubing that up, so it was done and tubing.\n\n0:39:46\tSPEAKER_01\n But is that the kind of thing you were thinking of? Yeah. It sounds like the star action. What? It's in this direction.\n\n0:40:00\tSPEAKER_04\n From Micheal Stubach, I've heard very good stuff about the chunk parser that is done by four-vice riches in embassy doing the parsing. So this sort of came as a surprise to me that embassy is featuring a nice parser.\n\n0:40:21\tSPEAKER_04\n But it's what I hear one could also look at that and see whether there is some synergy possible. And they're doing chunk parsing.\n\n0:40:32\tSPEAKER_04\n I can give you the names of the people who do it there. But then there's of course more ways of parsing things.\n\n0:40:44\tSPEAKER_03\n Of course, but given the constraints that you wanted to be small and fast and so forth, my guess is you're probably into some kind of chunk parsing.\n\n0:40:56\tSPEAKER_03\n And I'm not a big believer in this statistical cleaning up. That seems to be kind of a last resort if you can't do it any other way.\n\n0:41:20\tSPEAKER_03\n But I don't know. Maybe that's what you guys finally decided to do.\n\n0:41:27\tSPEAKER_03\n And if you looked just again for context, there's this one that they did at SRI some years ago, fastest pace.\n\n0:41:36\tSPEAKER_01\n Yeah, I've looked at that. But there's not much information available. But it's also finance Tetrance. It is. Yeah, it was pretty ambitious.\n\n0:41:47\tSPEAKER_01\n And of course it was English oriented. And fully finance Tetrance, I'm not so good for German.\n\n0:41:57\tSPEAKER_03\n Yeah, I guess that's the point is all the morphology and stuff. In English is all word order and it makes a lot more sense.\n\n0:42:05\tSPEAKER_01\n Yeah, okay. Good point. So in German, you've got most of this. So it's a choice between risk processing and set processing and template.\n\n0:42:20\tSPEAKER_01\n So what about like morphics? You've got stemmers or is that something? Yeah, but all in the in the lexicon.\n\n0:42:35\tSPEAKER_01\n But you have that. Yeah, information is a lot of that.\n\n0:42:40\tSPEAKER_03\n Okay, I see. So, but so you just connect to the lexicon. Yeah, at least for German, you have all of the stemming information.\n\n0:42:52\tSPEAKER_01\n Yeah, we can. We have knowledge passes from from RappmÃ¶kels. Yeah.\n\n0:42:58\tSPEAKER_03\n But it doesn't look like it you're using it. I didn't see it being used in the current template parser. I didn't see any.\n\n0:43:17\tSPEAKER_01\n Which we actually only look at the English. But it's used for stem forms.\n\n0:43:28\tSPEAKER_00\n I think there's some misunderstanding. Morphics is not used online. So the lexicon might be derived by morphics, but what's happening online is just retrieving from the lexicon, which we call the stemming information.\n\n0:43:43\tSPEAKER_00\n So it will be a full form lexicon. That's what you have. Yeah.\n\n0:43:49\tSPEAKER_04\n We threw out all the forms. We threw out all the forms because English.\n\n0:43:54\tSPEAKER_03\n Oh, okay. So, yeah, so I thought I so in German, then you actually do case matching and things like that in the in the pattern matcher or not.\n\n0:44:02\tSPEAKER_03\n Not yet. I didn't. Okay.\n\n0:44:06\tSPEAKER_03\n I didn't think I saw it. Yeah. Getting it from the lexicon is just fine.\n\n0:44:15\tSPEAKER_02\n Yeah.\n\n0:44:21\tSPEAKER_03\n Yeah. Here's the case where the English and the German might really be significantly different in terms of if you're trying to build some fast parser and so forth. You really might want to do it in a significantly different way.\n\n0:44:42\tSPEAKER_03\n So you guys have looked at this also in terms of, you know, if you're doing this for English as well as Germans, you think now that it would be this similar way?\n\n0:45:00\tSPEAKER_01\n Yeah. I think it's possible to do list processing. And maybe it's more adequate for English and German set processing.\n\n0:45:20\tSPEAKER_01\n Maybe some extensions have to be made for English version.\n\n0:45:39\tSPEAKER_04\n I'm sure there's going to be more discussion on that after your talk. We're just going to foreshadow.\n\n0:45:54\tSPEAKER_03\n Now actually, are you guys three of five? Do you have to go somewhere at five o'clock tonight? No. I think I was just talking.\n\n0:46:10\tSPEAKER_03\n I'm just going to practice talk. Great. So you're going to. Yeah. That's good. Because that will tell you a fair amount about the form of semantic construction grammar that we're using.\n\n0:46:25\tSPEAKER_03\n So I think that's probably as good an introduction as you get to the form of conceptual grammar that will be having mind.\n\n0:46:40\tSPEAKER_03\n So I won't talk particularly about how that relates to what Robert was saying at the beginning. Let me give you a very short version of this. So we talked about the fact that they're going to be a certain number of decisions that you want the knowledge modeler to make that we then fed to the function module.\n\n0:47:09\tSPEAKER_03\n So they're these decisions. And then one half of this we talked about a little bit is how if you had the right information, if you knew something about what was said and about something about was the agent, a tourist or a native or a business person or a younger role, whatever.\n\n0:47:35\tSPEAKER_03\n So we're also about the what we're calling the entity is that a castle is it a bank is it a town square is a statue, whatever. So all that kind of information could be combined into decision networks and decisions.\n\n0:47:52\tSPEAKER_03\n So the other half of the problem is how would you get that kind of information from the parsed input. So what you might try to do is just build more templates saying we're trying to build a template, you know, build a template somehow would capture the fact that you want to take a picture.\n\n0:48:18\tSPEAKER_03\n And we could you could do this and it's a small enough domain that probably.\n\n0:48:24\tSPEAKER_03\n But from our point of view, this is also a research project and there are a couple of people not here. The various reasons we're doing Dr. of the citations on this. And the idea that we're really after is a very deep semantics based on cognitive linguistics and the notion that there are a relatively small number of primitive conceptual schemas that characterize a lot of activity.\n\n0:48:53\tSPEAKER_03\n So a typical one in this formulation is a container.\n\n0:48:59\tSPEAKER_03\n And the notion is that all sorts of physical situations are characterized in terms of container point in and out of portals.\n\n0:49:11\tSPEAKER_03\n But also importantly for lay coffin these guys is also a metaphorical picture also characters this way you get in trouble.\n\n0:49:22\tSPEAKER_03\n So what we're really trying to do is to map from the discourse to the conceptual semantics level and from there to the appropriate decisions.\n\n0:49:35\tSPEAKER_03\n So another one of these primitive what are called image schemas is goal seeking.\n\n0:49:43\tSPEAKER_03\n There's an ocean of the source, path goal, trajectory possibly obstacles. The idea is this is another conceptual primitive.\n\n0:49:52\tSPEAKER_03\n And that all sorts of things particularly in the tourist domain can be represented in terms of source, path goal. So the idea would be could we build and analyze it, we'd take an utterance and say, aha, this utterance is talking about an attempt to reach a goal.\n\n0:50:11\tSPEAKER_03\n The goal is this, the person, the traveler is that, the sort we are now is this, they've mentioned possible obstacles, et cetera.\n\n0:50:22\tSPEAKER_03\n And this is an attempt to get very wide coverage. So if you can do this then the notion would be that across a very large range of domains you could use this deep conceptual basis as the interface.\n\n0:50:39\tSPEAKER_03\n And then the processing of that both on the input end recognizing that certain words in a language talk about containers or goals, et cetera.\n\n0:50:53\tSPEAKER_03\n And on the output end given this kind of information you can then make decisions about what actions to take provides they claim a very powerful general notion of deep semantics.\n\n0:51:11\tSPEAKER_03\n And we're really, Nancy is going to her talk is going to be not about using this in applications, but about modeling how children might learn this kind of deep semantic grammar.\n\n0:51:32\tSPEAKER_00\n And how do you envision the deep semantic to be worked with would it be highly ambiguous. And then there would be another module that takes that highly underspecified deep semantic construction and map it onto the current context to find out what the person really was talking about in that context.\n\n0:51:52\tSPEAKER_03\n Well, that's that's where the belief that comes in. So the idea is let's take this business not going to the powder tower. So part of what you'll get out of this will be the fact that if it works right.\n\n0:52:06\tSPEAKER_03\n Okay, that this is an agent that wants to go to this place and that's their goal. And there'll be additional situational information.\n\n0:52:13\tSPEAKER_03\n Okay, part of comes to the ontology the tower is this kind of part of it comes with the user. And the idea of the belief that is it combines the information from the dialogue which comes across in this general way.\n\n0:52:28\tSPEAKER_03\n You know, this is this is a goal seeking behavior along with specific information from the ontology about the kinds of objects involved about the situation about is raining. I don't know, whatever it is. And so that's the belief that we've laid out.\n\n0:52:45\tSPEAKER_03\n And so the coupling to the situation comes in this model from at the at the belief net company evidence from the dialogue with the ontology with the situation.\n\n0:52:58\tSPEAKER_03\n Nancy isn't going to talk about that just about the first steps. Right, the construction grammar.\n\n0:53:11\tSPEAKER_04\n And she's going to start in a minute.\n\n0:53:16\tNone\n Yeah, I didn't want to give you a little.\n\n0:53:43\tNone\n Okay.\n\n", "summary": [{"summary_text": "They are going to introduce themselves and explain to people what it is they do. They will try to finish by five and then they will go to Nancy Chang's talk downstairs. They are starting from scratch for the grammar generator and they are doing a simple concatenation for the English generation."}]}