{"filename": "./data/Bed015.txt", "transcript": "0:00:00\tSPEAKER_06\n what things to talk about.\n\n0:00:02\tSPEAKER_06\n Really?\n\n0:00:03\tSPEAKER_06\n Oh, it was horrible.\n\n0:00:04\tSPEAKER_06\n It was incentive.\n\n0:00:06\tSPEAKER_06\n You recorded it?\n\n0:00:08\tSPEAKER_00\n Hello?\n\n0:00:09\tSPEAKER_00\n Hello?\n\n0:00:10\tSPEAKER_00\n Yeah.\n\n0:00:11\tSPEAKER_00\n Which one?\n\n0:00:12\tSPEAKER_03\n All right, good.\n\n0:00:13\tSPEAKER_03\n OK.\n\n0:00:14\tSPEAKER_03\n OK.\n\n0:00:23\tNone\n Did you do something?\n\n0:00:25\tNone\n OK.\n\n0:00:26\tSPEAKER_06\n And I guess I'm doing something.\n\n0:00:27\tSPEAKER_06\n So basically, the result of much thinking since the last time we met, but not as much writing, is a sheet that I have a lot of thoughts and justification to comment on.\n\n0:00:39\tSPEAKER_06\n But I'll just pass out as is right now.\n\n0:00:41\tSPEAKER_06\n So here's what's around.\n\n0:00:43\tSPEAKER_06\n And there's two things.\n\n0:00:44\tSPEAKER_06\n So one on one side is a revised, updated semantics\n\n0:00:50\tNone\n specification. The other side is revised.\n\n0:00:53\tSPEAKER_05\n This is just one sheet, right?\n\n0:00:54\tSPEAKER_00\n No, just one sheet.\n\n0:00:55\tSPEAKER_00\n OK.\n\n0:00:56\tSPEAKER_00\n So this thing also.\n\n0:01:00\tSPEAKER_06\n And it's very similar to the reverse.\n\n0:01:04\tSPEAKER_06\n If you change it, it's always more.\n\n0:01:07\tSPEAKER_06\n But before I don't think everyone here is seen all of this.\n\n0:01:10\tSPEAKER_06\n So sure, here, begin.\n\n0:01:17\tSPEAKER_06\n As usual, the disclaimers are there.\n\n0:01:18\tSPEAKER_06\n All these things are, it's only slightly worse people than it was before.\n\n0:01:21\tSPEAKER_06\n And after a little bit more discussion, especially that people that I have formerly missed at all in the next release, probably changing that so far.\n\n0:01:30\tSPEAKER_06\n Maybe I will, let's start with number two, actually, on the notation.\n\n0:01:35\tSPEAKER_06\n Because that's thinking possible, and there are more familiar to people.\n\n0:01:42\tSPEAKER_06\n OK.\n\n0:01:42\tSPEAKER_06\n So the top block is just sort of a abstract technique, sort of like those things are the kinds of things that we can have.\n\n0:01:50\tSPEAKER_06\n And certain things that have changed, to have changed back to this, that there's been a little bit of going back and forth.\n\n0:01:56\tSPEAKER_06\n But basically, obviously, all the constructions have some kind of name.\n\n0:01:59\tSPEAKER_06\n I forgot to include that you could have a type included in this line, so it's like, well, there's an example.\n\n0:02:05\tSPEAKER_06\n The text for example, the end, it has a causal construction.\n\n0:02:07\tSPEAKER_06\n So just to show it doesn't have to be a beautiful way to get people to be able to send text as well.\n\n0:02:13\tSPEAKER_06\n These three have various ways of doing certain things.\n\n0:02:16\tSPEAKER_06\n I'll just try to go through them.\n\n0:02:17\tSPEAKER_06\n So they could all have a type at the beginning.\n\n0:02:19\tSPEAKER_06\n And then they say the keyword construction.\n\n0:02:21\tSPEAKER_02\n Oh, I see.\n\n0:02:22\tSPEAKER_02\n So the current syntax is, if there's a type, it's before construct.\n\n0:02:26\tSPEAKER_02\n OK, that's fine.\n\n0:02:28\tSPEAKER_06\n OK.\n\n0:02:28\tSPEAKER_06\n And then it has a block that is constituents.\n\n0:02:30\tSPEAKER_06\n And as usual, I guess all the constructions here, all the examples here have only one type of constituent that is a constructional constituent.\n\n0:02:39\tSPEAKER_06\n I think that's actually going to turn out to be certainly the most common kind.\n\n0:02:42\tSPEAKER_06\n But in general, instead of the word construct, there are clear who might have meaning or form as well.\n\n0:02:48\tSPEAKER_06\n So there's some element that isn't yet constructional, and this is the maps one and meaning.\n\n0:02:53\tSPEAKER_06\n OK.\n\n0:02:55\tSPEAKER_06\n The main change with the constructs, which each of which has a keyword construct, and then some name, and then some type of classification, is that it's often, sometimes the case in the first case here that you know what kind of construction is.\n\n0:03:09\tSPEAKER_06\n So for example, whatever I have here, it's going to be a form of the word throw, or it's going to be a word, you know, happy, or something like that.\n\n0:03:16\tSPEAKER_06\n Some people may be a specific word, or maybe you'll have the type, you'll say, I need a spatial relation for easier.\n\n0:03:23\tSPEAKER_06\n I need a directional decimal right here.\n\n0:03:25\tSPEAKER_06\n You could have an actual type here.\n\n0:03:29\tSPEAKER_06\n Or you could just say, in the same case, that you only know the meaning of type.\n\n0:03:32\tSPEAKER_06\n So a very common example is this one that, you know, in directed motion, the first person to do some nature of being agent of some kind, often a human, right?\n\n0:03:41\tSPEAKER_06\n So if I run down the street, then I, I run as a chief, it's type, I mean, the category is what's there.\n\n0:03:49\tSPEAKER_06\n But the new kind is this one is sort of a pair.\n\n0:03:53\tSPEAKER_06\n And sort of skipping the moths and whatever.\n\n0:03:57\tSPEAKER_06\n The idea is that sometimes there are general constructors that you know that you're going to be equivalent of a noun phrase, or a noun phrase, or something like that.\n\n0:04:07\tSPEAKER_06\n And usually it has a whole consideration that I don't want with it.\n\n0:04:11\tSPEAKER_06\n And then you might know something much more specific, depending on what construction you're going to go about, what meaning, what specific you want.\n\n0:04:18\tSPEAKER_06\n So the example, again, at the bottom of a directed motion, you might need a nominal expression to take the place of, you know, the big,\n\n0:04:26\tNone\n the big, the tall, dark man walked into the room. But because of the nature of this particular construction, you know, not just that it's nominal or some kind, but in particular it's some kind of anemone, nominal, like usual, like just as well as a light.\n\n0:04:42\tSPEAKER_06\n So for now, I know we're just having complicated expression.\n\n0:04:47\tSPEAKER_06\n So I don't know if this is textable, but something that gives you a way to go with the structural and the new types.\n\n0:04:53\tSPEAKER_06\n OK, then I don't think the, at least, yeah, none of these examples have anything different for formal constraints, but you've been referred to any of the available elements in scope, which here are the constructs, to say something about the relation.\n\n0:05:12\tSPEAKER_06\n And I think, if you know if you compare the top block and the textual block, we dropped like the little F subscript.\n\n0:05:20\tSPEAKER_06\n F subscript 3, 4, 2, the form piece of the construct.\n\n0:05:23\tSPEAKER_06\n Good.\n\n0:05:24\tSPEAKER_06\n And I think that the general will be unended US.\n\n0:05:26\tSPEAKER_06\n Like if you're giving a formal constraint, then you're referring to the normal pull of that.\n\n0:05:30\tSPEAKER_06\n So by saying, if I just said name one, then that means name one, formal, full time level, which makes sense.\n\n0:05:36\tSPEAKER_06\n There are certain times when we're having a discussion to that, which case you could just communicate here, I think, meaningful for some reason, right?\n\n0:05:42\tSPEAKER_06\n Or actually, as we're often that, only to handle this, one special case of George and Jerry walking to the room in that order.\n\n0:05:49\tSPEAKER_06\n So we have a few funny things where something in the meaning might refer to something in the form.\n\n0:05:54\tSPEAKER_06\n But we're not going to really worry about that from right now.\n\n0:05:56\tSPEAKER_06\n And there are ways we can be more specific if we have to use later on.\n\n0:06:01\tSPEAKER_06\n OK.\n\n0:06:01\tSPEAKER_06\n And so in terms of the relations, as usual in every four, and I should have put in a couple of things in something that isn't an interval relation, but in four, you might also have a value binding.\n\n0:06:11\tSPEAKER_06\n You know, you can say that name one dot number of goals, plural or something like that.\n\n0:06:19\tSPEAKER_06\n There are certain things that are actually value similar to the bindings below.\n\n0:06:23\tSPEAKER_06\n But usually, they're going to be value and the alert, right?\n\n0:06:29\tSPEAKER_06\n OK.\n\n0:06:30\tSPEAKER_06\n And then again, semantic constraints here are just bindings.\n\n0:06:32\tSPEAKER_06\n There was talk of changing the name of that.\n\n0:06:35\tSPEAKER_06\n John, you're not going to be like, fight about that.\n\n0:06:37\tSPEAKER_06\n You like about changing it to semantic effects, which I thought in a little bit to order bias and semantic bindings, which I thought might be too restrictive in case we don't have only binding.\n\n0:06:50\tSPEAKER_06\n And so it was an issue whether constraints, there were some linguists who reacted against constraints saying, oh, it is not used for matching, then it shouldn't be called a constraint.\n\n0:07:00\tSPEAKER_06\n But I think we want to be uncommitted about whether it's used for matching or not, because I think we thought it was some situations where it was useful to use whatever bindings are for actually modified constraints.\n\n0:07:11\tSPEAKER_02\n Well, you definitely want to decouple the formalism from the parsing strategy.\n\n0:07:17\tSPEAKER_02\n So whether or not it's used for matching or only for verification, for sure.\n\n0:07:24\tSPEAKER_02\n I don't know what term we want to use, but we don't want to.\n\n0:07:27\tSPEAKER_06\n There was one time when the context explained why constraints wasn't misleading or it's in.\n\n0:07:32\tSPEAKER_06\n And I think the reason that he gave was similar to the reason why John thought it was like, the record was just an interesting coincidence.\n\n0:07:39\tSPEAKER_06\n But until I was like, OK, well, both of you don't like it.\n\n0:07:42\tSPEAKER_06\n I'm going to change it.\n\n0:07:43\tSPEAKER_06\n But I'm starting to like it again.\n\n0:07:46\tSPEAKER_06\n So I'm going to be like, what?\n\n0:07:48\tSPEAKER_04\n Well, you know what?\n\n0:07:49\tSPEAKER_04\n If then-trace.\n\n0:07:52\tSPEAKER_04\n You're what the then-trace is called?\n\n0:07:53\tSPEAKER_06\n What?\n\n0:07:54\tSPEAKER_06\n Concument?\n\n0:07:56\tSPEAKER_06\n Yeah.\n\n0:07:57\tSPEAKER_06\n Yeah, but it's not if then.\n\n0:07:59\tSPEAKER_02\n Anyway, so the other strategy you guys can consider is when you don't know what word you could put no word, just meaning.\n\n0:08:09\tSPEAKER_02\n OK, and let-\n\n0:08:10\tSPEAKER_06\n Yeah, that's true.\n\n0:08:12\tSPEAKER_03\n So that's why you put semantic constraints up top and meaning bindings done here.\n\n0:08:16\tSPEAKER_06\n Oh, oops, nope.\n\n0:08:17\tSPEAKER_06\n That was a mistake of cutting paste.\n\n0:08:19\tSPEAKER_06\n OK.\n\n0:08:21\tSPEAKER_06\n I'm sorry.\n\n0:08:22\tSPEAKER_06\n That one's an unintentional.\n\n0:08:23\tSPEAKER_03\n So there should be semitic.\n\n0:08:24\tSPEAKER_06\n And unintentional, because it's not Jordan.\n\n0:08:26\tSPEAKER_06\n You're actually-\n\n0:08:28\tSPEAKER_03\n So there should be semitic constraints down at the bottom?\n\n0:08:30\tSPEAKER_06\n Yeah.\n\n0:08:31\tSPEAKER_06\n OK.\n\n0:08:32\tSPEAKER_06\n Well, unless I go with meaning, whatever.\n\n0:08:34\tSPEAKER_06\n Or whatever.\n\n0:08:35\tSPEAKER_06\n I'm going to be good at semantic, but I think the best is of other people's biases.\n\n0:08:40\tSPEAKER_02\n Right.\n\n0:08:41\tSPEAKER_02\n Minor pros.\n\n0:08:42\tSPEAKER_02\n Miner pros.\n\n0:08:43\tSPEAKER_06\n OK.\n\n0:08:44\tSPEAKER_06\n So I think the middle block doesn't really give you any more information next to the top block.\n\n0:08:48\tSPEAKER_06\n And the bottom block similarly, only just illicit- so all it does is illustrate that you can drop the subscripts and that you can drop the- that you can give dual types.\n\n0:08:57\tSPEAKER_06\n One thing I should mention about designates, I think, actually assistant cross-leads as well.\n\n0:09:02\tSPEAKER_06\n So strike out the M subscript on the middle block.\n\n0:09:06\tSPEAKER_06\n So basically now, this little change actually goes along with a big linguistic change, which is that designates isn't only something for this and mandates to worry about now.\n\n0:09:16\tSPEAKER_06\n So we want designates to actually- one of the constituents, which acts like a head and some respect, but is sort of really important for a composition later on.\n\n0:09:25\tSPEAKER_06\n So for instance, if some other construction says, argue of type, is this part of type whatever, the designate tells you which sort of part is the minimum part.\n\n0:09:34\tSPEAKER_06\n So if you have the big red ball, you want to know if this object's where noun, but ball is going to be the designated element of that kind of phrase.\n\n0:09:44\tSPEAKER_06\n There is a slight complication here, which is that when we talk about form, it's useful sometimes to talk about- to talk about there also being a designated object.\n\n0:09:53\tSPEAKER_06\n And we think that there will be the same one.\n\n0:09:54\tSPEAKER_06\n So the ball is the head of the phrase, the big red ball, and the entity, to know if it's by the word ball, is sort of the semantic head in some ways.\n\n0:10:04\tSPEAKER_02\n And there's some cases where the grammar depends on some form property of the head.\n\n0:10:13\tSPEAKER_02\n And this enables you to get that.\n\n0:10:14\tSPEAKER_02\n If I understand your right side, yeah, yeah.\n\n0:10:16\tSPEAKER_06\n And you might be able to say things like if the head has to go last and the head final language, you can refer to the head as a formal head as opposed to the rest of the form having to be at the end of that.\n\n0:10:27\tSPEAKER_06\n Right.\n\n0:10:27\tSPEAKER_06\n So that's a useful thing to get some general structure.\n\n0:10:30\tSPEAKER_02\n OK, so that all looks good.\n\n0:10:31\tSPEAKER_02\n Let me- oh, I don't know.\n\n0:10:34\tSPEAKER_06\n Are you finished?\n\n0:10:36\tSPEAKER_06\n There is a list of things that isn't included, but you can ask questions that might.\n\n0:10:40\tSPEAKER_02\n OK.\n\n0:10:41\tSPEAKER_02\n So if I understand this, aside from construde and all that sort of stuff, the differences are mainly that we've gone to the possibility of having form meaning pairs for a type, or we actually gone back to if we go back far enough.\n\n0:11:03\tSPEAKER_06\n It's a construction meeting.\n\n0:11:04\tSPEAKER_06\n So it's not clear that what now is a construction type\n\n0:11:09\tNone\n and the type. So I don't know what a form is.\n\n0:11:12\tSPEAKER_02\n Oh, I see.\n\n0:11:13\tSPEAKER_02\n Yeah, yeah, yeah.\n\n0:11:14\tSPEAKER_02\n I'm sorry.\n\n0:11:14\tSPEAKER_02\n You're right.\n\n0:11:15\tSPEAKER_02\n Construction type.\n\n0:11:17\tSPEAKER_02\n That's fine.\n\n0:11:18\tSPEAKER_02\n But it-\n\n0:11:20\tSPEAKER_06\n Well, and a previous version of the division certainly allowed you to single out the meaning bit by- so you could say constructs of type whatever does it mean something.\n\n0:11:30\tSPEAKER_06\n Yeah.\n\n0:11:30\tSPEAKER_06\n But that was mostly for reference purposes, just to refer to the mean pool.\n\n0:11:33\tSPEAKER_06\n I don't think that it was often used to give an extra meaning to type constraints on the meeting,\n\n0:11:38\tNone\n which is really what we want most of the time I think. Mm-hmm.\n\n0:11:43\tSPEAKER_06\n I don't know if we'll ever have a case where we actually- if there is a form category constraint, you could imagine having a triple there.\n\n0:11:50\tSPEAKER_02\n No, no, no, no.\n\n0:11:51\tSPEAKER_02\n I don't think so.\n\n0:11:51\tSPEAKER_02\n I think that you'll do fine.\n\n0:11:53\tSPEAKER_02\n In fact, these are as long as- as Mark is- these are form constraints.\n\n0:12:01\tSPEAKER_02\n So nominal expression is- the fact that this animate is- man, the fact that it's a nominal expression, I would say, on most people's notion of higher form types, this is one.\n\n0:12:16\tSPEAKER_02\n I think that's just fine.\n\n0:12:17\tSPEAKER_02\n Yeah.\n\n0:12:18\tSPEAKER_05\n Which is fine.\n\n0:12:19\tSPEAKER_05\n Yeah.\n\n0:12:19\tSPEAKER_05\n Now, I mentioned this.\n\n0:12:20\tSPEAKER_05\n I don't know if I ever explained this, but the point of- I mentioned in the last meeting, the point of having something called nominal expression is because it seems like having the verb subcategorized, for, you know, like, say, taking as its object, just some expression which designates an object, or designates a thing, or whatever.\n\n0:12:45\tSPEAKER_05\n That leads to some syntactic problems, basically.\n\n0:12:47\tSPEAKER_05\n So you want to, you know, sort of have this problem like, OK, well, I'll put the word, let's say the word dog.\n\n0:12:53\tSPEAKER_05\n You know, that has to come right after the verb, because we know verb meets its object.\n\n0:12:56\tSPEAKER_05\n And then we have a construction that says, oh, you can have the proceeding a noun.\n\n0:13:00\tSPEAKER_05\n And so you have this sort of problem that the verb has to meet that does it not come in.\n\n0:13:05\tSPEAKER_05\n And you can get, you know, the kicked dog or something like that meaning kicked the dog.\n\n0:13:11\tSPEAKER_05\n So you kind of have to let this phrase idea in there.\n\n0:13:14\tSPEAKER_02\n But I have no problem with what I think it's fine.\n\n0:13:17\tSPEAKER_06\n Right.\n\n0:13:19\tSPEAKER_06\n You may not be like everyone else in Berkeley.\n\n0:13:22\tSPEAKER_05\n Yeah.\n\n0:13:22\tSPEAKER_05\n But that's OK.\n\n0:13:23\tSPEAKER_05\n I mean, we sort of thought we were getting away with, I mean, this is not reverting to the X-bar theory of phrase structure, but I just know that this is, like we didn't originally have in mind that verbs would subcategorize for a particular sort of form.\n\n0:13:44\tSPEAKER_06\n Well, there's no arrangement to this.\n\n0:13:46\tSPEAKER_06\n The question was, did we want directed motion, which is an argument structure construction?\n\n0:13:51\tSPEAKER_06\n Did we want it to worry about anything more than the fact that it has semantic, you know, it's sort of a frame-based construction?\n\n0:13:58\tSPEAKER_06\n So one option that Keith had mentioned also was like, well, if you have more abstract construction, such as subject predicate, basically things like grammatical relations, those could intersect with these in such a way that subject predicate or subject predicate verb object, would require that those things fill subject object are non-expressions.\n\n0:14:16\tSPEAKER_06\n And that would be a little bit cleaner in some way.\n\n0:14:19\tSPEAKER_06\n But for now, I mean.\n\n0:14:21\tSPEAKER_02\n But it's just moving it.\n\n0:14:23\tSPEAKER_02\n Moving it differently.\n\n0:14:25\tSPEAKER_02\n It constraints around.\n\n0:14:26\tSPEAKER_06\n OK, so that's.\n\n0:14:27\tSPEAKER_06\n Basically, the point is there has to be that constraint somewhere.\n\n0:14:29\tSPEAKER_06\n Right.\n\n0:14:30\tSPEAKER_02\n Yeah.\n\n0:14:31\tSPEAKER_02\n And so that was the.\n\n0:14:34\tSPEAKER_06\n Reverb is not having now.\n\n0:14:36\tSPEAKER_02\n OK.\n\n0:14:36\tSPEAKER_02\n OK.\n\n0:14:37\tSPEAKER_02\n And sort of going with that is that the designatim also now is a pair instead of just the meaning.\n\n0:14:45\tSPEAKER_02\n And aside from some terminology, that's basically yet.\n\n0:14:52\tSPEAKER_02\n I'm asking.\n\n0:14:54\tSPEAKER_06\n Yeah.\n\n0:14:55\tSPEAKER_06\n Yeah.\n\n0:14:56\tSPEAKER_06\n The unaddressed questions in this definitely would, for instance, be semantic constraints we talked about.\n\n0:15:04\tSPEAKER_06\n Here are just bindings.\n\n0:15:05\tSPEAKER_06\n But we might want to introduce mental spaces.\n\n0:15:08\tSPEAKER_06\n There's all these things.\n\n0:15:09\tSPEAKER_02\n The mental spacing is clearly not.\n\n0:15:10\tNone\n Right.\n\n0:15:10\tSPEAKER_06\n So there's going to be some extra definitely other notation only for that, which we skip for now.\n\n0:15:15\tSPEAKER_02\n By the way, I do want to get on that as soon as rubber gets back.\n\n0:15:19\tSPEAKER_02\n So the mental space thing.\n\n0:15:24\tSPEAKER_02\n Obviously, constroul is a big component of that.\n\n0:15:29\tSPEAKER_02\n So there's probably not worth trying to do anything till it gets back.\n\n0:15:31\tSPEAKER_02\n But sort of as soon as it gets back, I think we ought to.\n\n0:15:37\tSPEAKER_05\n So what's the time frame I forgot again when you're going away for a lot?\n\n0:15:42\tSPEAKER_04\n As a mental bridge, I'm skipping forth of July.\n\n0:15:46\tSPEAKER_04\n OK.\n\n0:15:48\tSPEAKER_04\n Right afterwards.\n\n0:15:49\tSPEAKER_04\n OK.\n\n0:15:50\tSPEAKER_06\n What?\n\n0:15:52\tSPEAKER_06\n You're missing the premiering America.\n\n0:15:55\tSPEAKER_06\n It's a point of spending a year here.\n\n0:15:57\tSPEAKER_03\n Well, he went to college here.\n\n0:15:58\tSPEAKER_03\n Oh, yeah, I forgot.\n\n0:16:01\tSPEAKER_02\n It furthermore, it's well worth missing.\n\n0:16:03\tSPEAKER_02\n Yes.\n\n0:16:03\tSPEAKER_02\n Thank you.\n\n0:16:04\tSPEAKER_06\n I like spending forth of July in other countries.\n\n0:16:06\tSPEAKER_06\n Winner, right?\n\n0:16:08\tSPEAKER_06\n OK.\n\n0:16:09\tSPEAKER_06\n So that's great.\n\n0:16:10\tSPEAKER_06\n Construct, OK, so there was one question that came out.\n\n0:16:14\tSPEAKER_06\n I hate this thing.\n\n0:16:15\tSPEAKER_06\n This is right.\n\n0:16:17\tSPEAKER_06\n So something like past, which we think is a very simple.\n\n0:16:21\tSPEAKER_06\n We've often just stuck in it as a feature.\n\n0:16:24\tSPEAKER_06\n This event takes place before it's each time.\n\n0:16:26\tSPEAKER_06\n OK, it's what this means.\n\n0:16:27\tSPEAKER_06\n It's often thought of as it is also considered a mental space by lots of people around.\n\n0:16:33\tSPEAKER_06\n So there's issue of well, sometimes there are really exotic, explicit space builders that say in France blah, blah, blah.\n\n0:16:39\tSPEAKER_06\n And you have to build up.\n\n0:16:40\tSPEAKER_06\n You would imagine that would require you be very specific about machinery.\n\n0:16:44\tSPEAKER_06\n Whereas past is a very conventionalized one.\n\n0:16:46\tSPEAKER_06\n We sort of know what it means.\n\n0:16:47\tSPEAKER_06\n But we don't necessarily want to unload all the notation every time we see that it's past tense.\n\n0:16:52\tSPEAKER_06\n So we can think of our, just like X-Siem of walk, we first do this kind of thing.\n\n0:16:57\tSPEAKER_02\n I think it's exactly right.\n\n0:16:58\tSPEAKER_06\n Past refers to a certain configuration of this thing with respect to it.\n\n0:17:01\tSPEAKER_06\n So we're kind of like having an arcade.\n\n0:17:04\tSPEAKER_06\n Yeah, in both ways.\n\n0:17:05\tSPEAKER_06\n Right?\n\n0:17:05\tSPEAKER_02\n So I think that we'll have to see how it works out when we do the details.\n\n0:17:08\tSPEAKER_02\n But my intuition would be that that's right.\n\n0:17:10\tSPEAKER_02\n Yeah.\n\n0:17:11\tSPEAKER_04\n OK.\n\n0:17:12\tSPEAKER_04\n You want to do the same for space?\n\n0:17:13\tSPEAKER_04\n Sorry?\n\n0:17:15\tSPEAKER_04\n Space?\n\n0:17:16\tSPEAKER_06\n Space?\n\n0:17:17\tSPEAKER_04\n Here?\n\n0:17:18\tSPEAKER_04\n No?\n\n0:17:18\tSPEAKER_06\n Oh, oh, oh, oh, instead of just time?\n\n0:17:21\tSPEAKER_06\n Yeah, yeah.\n\n0:17:21\tSPEAKER_06\n Yeah, same thing.\n\n0:17:22\tSPEAKER_06\n So there are very conventionalized like dakedic ones, right?\n\n0:17:25\tSPEAKER_06\n And then I think for other spaces that you introduce, you could just attach whatever you could build up and appropriately structure according to them.\n\n0:17:35\tSPEAKER_04\n Now, this basically would involve everything you can imagine to fit under your seat, thought to something.\n\n0:17:40\tSPEAKER_04\n Yeah.\n\n0:17:41\tSPEAKER_04\n Where it's actually dependent on us now, what was passed, what is in the future, versus what is here, what is there, what is.\n\n0:17:47\tSPEAKER_06\n Yeah.\n\n0:17:48\tSPEAKER_06\n So time and space, we'll get that on the other side a little, like very minimally.\n\n0:17:52\tSPEAKER_06\n There's a slot for setting time and setting place.\n\n0:17:55\tSPEAKER_06\n And you know, you can imagine for both of those, there are absolute things you could say about the time and place.\n\n0:18:00\tSPEAKER_06\n And then there are many more interestingly, linguistically, anyway, there are relative things that you relate the event in time and space to where you are now.\n\n0:18:08\tSPEAKER_06\n If there's something a lot more complicated, like hypothetical, whatever, then you have to do your job.\n\n0:18:14\tSPEAKER_06\n Or somebody's job, and then get up like this.\n\n0:18:16\tSPEAKER_05\n Yeah, I mean, I'm curious about how much of the mental, I mean, I'm not sure that the formalism, sort of the grammatical side of things, is going to have that much going on in terms of the mental space stuff.\n\n0:18:32\tSPEAKER_05\n Basically, all of the so-called space builders that are in the sentence are going to sort of, I think of it as sort of giving you the coordinates of, you know, assuming that at any point in discourse there's the possibility that we could be sort of talking about a bunch of different world scenarios, whatever.\n\n0:18:48\tSPEAKER_05\n And the speaker is supposed to be keeping track of those.\n\n0:18:51\tSPEAKER_05\n The construction that you actually get is just going to sort of give you a cue as to which one of those that you've already got going.\n\n0:18:59\tSPEAKER_05\n You're supposed to add structure to.\n\n0:19:01\tSPEAKER_05\n So in France, Watergate wouldn't have heard Nixon or something like that.\n\n0:19:06\tSPEAKER_05\n Well, you say, all right, I'm supposed to add some structure to my model of this hypothetical past France universe or something like that.\n\n0:19:13\tSPEAKER_05\n The information in the sentence tells you that much, but it doesn't tell you exactly what the point of doing so is.\n\n0:19:22\tSPEAKER_05\n So for example, depending on the linguist context, it could be like the question is, for example, what does Watergate refer to there?\n\n0:19:30\tSPEAKER_05\n Does it refer to, if you just hear that sentence cold, the assumption is that when you say Watergate, you're referring to a Watergate-like scandal, as we might imagine it happening in France, but in a different context, oh, you know, if Nixon had apologized right away, I wouldn't, you know, Watergate wouldn't have heard him so badly in the US and in France, it wouldn't have heard him at all.\n\n0:19:48\tSPEAKER_05\n Now that Watergate, we're now talking about the real one and the wood, sort of, it's a sort of different dimension of hypotheticality.\n\n0:19:58\tSPEAKER_05\n I mean, we're not saying what's hypothetical about this world.\n\n0:20:01\tSPEAKER_05\n In the first case, hypothetically, we're imagining that Watergate happened in France.\n\n0:20:05\tSPEAKER_05\n In the second case, we're imagining hypothetically that Nixon had apologized right away or something, right?\n\n0:20:10\tSPEAKER_05\n So a lot of this isn't happening at the grammatical level.\n\n0:20:14\tSPEAKER_05\n And so I don't know where that sits then, sort of the idea of sorting out what the person meant.\n\n0:20:21\tSPEAKER_06\n The grammatical things, such as the acceleraries that introduce these conditions, whatever, give you sort of the most basic, those we, I think we can figure out what the possibilities are, right?\n\n0:20:30\tSPEAKER_06\n They're sort of relatively limited number.\n\n0:20:32\tSPEAKER_06\n And then how they interact with some extra thing like in France, or if such and such, that's like there are certain ways that they can, you know, one is a more specific version of the general pattern that the grammatical grammar gives you.\n\n0:20:44\tSPEAKER_06\n Yeah.\n\n0:20:44\tSPEAKER_06\n But, you know, whatever.\n\n0:20:46\tSPEAKER_02\n Yeah, in the short run, all we need is enough mechanism on the form side to get things going.\n\n0:20:56\tSPEAKER_05\n But the whole point of what Focundian Turner have to say about mental spaces and blending and all that stuff is that you don't really get that much out of the sentence.\n\n0:21:04\tSPEAKER_05\n You know, there's not that much information contained in the sentence that just says here, add the structure to the space.\n\n0:21:09\tSPEAKER_05\n And exactly what that means for the overall ongoing interpretation is quite open.\n\n0:21:14\tSPEAKER_05\n An individual sentence could mean a hundred different things depending on quote what the space configuration is at the time of utterance.\n\n0:21:20\tSPEAKER_05\n And so somebody's going to have to be doing a whole lot of work, but not me, I think.\n\n0:21:25\tSPEAKER_02\n I think that's not, I don't think it's completely right.\n\n0:21:31\tSPEAKER_02\n I mean, in fact, the sentence examples you gave, it did constrain the meaning, the form did constrain the meaning.\n\n0:21:40\tSPEAKER_02\n Yeah.\n\n0:21:41\tSPEAKER_02\n And so it isn't sure, but like what was the point of saying\n\n0:21:47\tSPEAKER_05\n that sentence about Nixon and France? That is not, there's nothing about that in the sentence.\n\n0:21:53\tSPEAKER_05\n That's like it usually don't know the point of it.\n\n0:21:54\tSPEAKER_06\n Yeah.\n\n0:21:55\tSPEAKER_06\n The sentence is all, but we know what it's trying to say.\n\n0:21:57\tSPEAKER_06\n We know what what predication is sending out.\n\n0:21:59\tSPEAKER_02\n But bottom line I agree with you that we're not expecting much out of the purely linguistic cues, right?\n\n0:22:07\tSPEAKER_02\n The purely formed cues.\n\n0:22:09\tSPEAKER_02\n And I mean, you're the linguist, but it seems to me that these, you know, we've talked about maybe half a dozen linguistics these these in the last few minutes or something.\n\n0:22:20\tSPEAKER_02\n Yeah.\n\n0:22:21\tSPEAKER_02\n Yeah.\n\n0:22:22\tSPEAKER_02\n Oh yeah.\n\n0:22:23\tSPEAKER_02\n And that's my feeling that these are really hard problems that decide exactly what's going on.\n\n0:22:32\tSPEAKER_02\n Yeah.\n\n0:22:34\tSPEAKER_06\n OK.\n\n0:22:35\tSPEAKER_06\n OK.\n\n0:22:36\tSPEAKER_06\n One other thing I just want to point out is there's a lot of confusion about the terms like profile, designate, focus, etc.\n\n0:22:42\tSPEAKER_06\n Right, right, right.\n\n0:22:43\tSPEAKER_06\n For now, I'm going to say like profiles often use like two uses that come to mind immediately.\n\n0:22:48\tSPEAKER_06\n One is in the traditional like semantic highlight of one element with respect to everything else.\n\n0:22:53\tSPEAKER_06\n So hypotenuse, you profile this guy against the background of the right triangle.\n\n0:22:58\tSPEAKER_06\n OK.\n\n0:22:58\tSPEAKER_06\n And the second use is in frame met.\n\n0:23:01\tSPEAKER_06\n It's slightly different.\n\n0:23:02\tSPEAKER_06\n And I was asking tons about this.\n\n0:23:03\tSPEAKER_06\n They use it to really mean this in a frame.\n\n0:23:07\tSPEAKER_06\n This is the profile element.\n\n0:23:08\tSPEAKER_06\n These are the ones that are required.\n\n0:23:09\tSPEAKER_06\n So they have to be there or expressed in some way, which, which nothing one and two are mutually exclusive, but they're different meanings.\n\n0:23:18\tSPEAKER_06\n So the closest thing, so I was thinking about how it relates to this notation for us.\n\n0:23:24\tSPEAKER_06\n OK, so how is it?\n\n0:23:25\tSPEAKER_02\n So does it really what they mean in frame met?\n\n0:23:28\tSPEAKER_02\n Yeah, I didn't know that.\n\n0:23:29\tSPEAKER_06\n Yeah.\n\n0:23:30\tSPEAKER_06\n I mean, I was a little bit surprised about it.\n\n0:23:32\tSPEAKER_06\n I knew that I thought that that would be something like, there's another term that I've heard for that.\n\n0:23:37\tSPEAKER_02\n Right.\n\n0:23:38\tSPEAKER_06\n Well, at least Hans does use it that way.\n\n0:23:40\tSPEAKER_06\n Well, I'll check.\n\n0:23:41\tSPEAKER_06\n Anyway, so I think the designate that we have in terms of meaning is really the highlight this thing with respect to everything else.\n\n0:23:50\tSPEAKER_06\n OK, so this is what it means.\n\n0:23:51\tSPEAKER_06\n But the second one seems to be useful, but we might not need a notation for it.\n\n0:23:56\tSPEAKER_06\n We don't have a notation for it, but we might want one.\n\n0:23:58\tSPEAKER_06\n So for example, we've talked about, if you're talking about the electrical item walk, it's an action.\n\n0:24:04\tSPEAKER_06\n Well, it also has this idea.\n\n0:24:06\tSPEAKER_06\n Carries along with it the idea of an actor.\n\n0:24:08\tSPEAKER_06\n Everybody's going to do the walking.\n\n0:24:10\tSPEAKER_06\n Or if you talk about an adjective red, it carries along the idea of the thing that has a property of having color red.\n\n0:24:15\tSPEAKER_06\n So we used to use the notation with for this.\n\n0:24:18\tSPEAKER_06\n And I think that's closest to the second one.\n\n0:24:19\tSPEAKER_06\n So I don't yet know I have no commitment as to whether we need it.\n\n0:24:22\tSPEAKER_06\n It might be, it's kind of thing that parser might want to think about whether we require.\n\n0:24:28\tSPEAKER_06\n These things are like, it's semantically.\n\n0:24:30\tSPEAKER_02\n No, no, no.\n\n0:24:31\tSPEAKER_02\n Critically, they're not required syntactically.\n\n0:24:34\tSPEAKER_02\n Often they're presuppose than all that sort of stuff.\n\n0:24:37\tSPEAKER_06\n Definitely.\n\n0:24:38\tSPEAKER_06\n So in, was a good example.\n\n0:24:40\tSPEAKER_06\n If you walk in, like, well, in what?\n\n0:24:43\tSPEAKER_06\n You know, like, what is that?\n\n0:24:43\tSPEAKER_06\n So it's only semantically is it?\n\n0:24:45\tSPEAKER_06\n It is still required, say, by simulation time, though, to have something.\n\n0:24:49\tSPEAKER_06\n So I meant the idea of that the semantic value is filled in by some, similar.\n\n0:24:53\tSPEAKER_06\n I don't know if that's something we need to say ever as part of the requirement, or the construction, or not, what will again, do for it.\n\n0:25:00\tSPEAKER_02\n I mean, or have it construed, is that the point?\n\n0:25:04\tSPEAKER_06\n Point it, Robert.\n\n0:25:05\tSPEAKER_06\n Have you ever had a views of this point?\n\n0:25:07\tSPEAKER_04\n It's his thesis, right?\n\n0:25:09\tSPEAKER_02\n Anyway, right.\n\n0:25:10\tSPEAKER_02\n Yeah, this is going to be a good example of this a bit of the mess.\n\n0:25:13\tSPEAKER_02\n And we still have emphasis as well, or stress, or whatever.\n\n0:25:16\tSPEAKER_06\n OK, well, we'll get, we have thoughts about those, as well.\n\n0:25:20\tSPEAKER_06\n I would just say, some of this is just like my, you know, by feet, I'm going to say, this is how we use these terms.\n\n0:25:26\tSPEAKER_06\n I don't, you know, there's lots of these stories in the world that people use it.\n\n0:25:29\tSPEAKER_06\n I think that the other terms that are related are like focus and stress.\n\n0:25:33\tSPEAKER_06\n So I think that the way we would like to think about, I think, is focus is something that comes up in, I mean, lots of basic information structure.\n\n0:25:42\tSPEAKER_06\n OK, it's like, it's not.\n\n0:25:43\tSPEAKER_06\n It might be that there's a syntactic device that you use to indicate focus, or that there are things like, you know, I think you've been telling me things toward the end of the sentence, post-verbal, tend to be the focused, focused on the new information.\n\n0:25:55\tSPEAKER_06\n You know, if I, you know, I walked into the room, you tend to think that whatever into the room is sort of like the more focused kind of thing.\n\n0:26:01\tSPEAKER_06\n And when you, you have stress on something that might be, you know, a cue that the stressed element, or for instance, the negated element, is kind of related to information structure.\n\n0:26:12\tSPEAKER_06\n So that's like the new, the sort of like, import whatever of this thing.\n\n0:26:16\tSPEAKER_06\n So I think that's kind of nice to keep focused on being an information structure term.\n\n0:26:21\tSPEAKER_06\n Stress, I think, and then there are different kinds of focus that you can bring to it.\n\n0:26:24\tSPEAKER_06\n So like stress, the stress is kind of a pun on, and you might have like whatever, like accent kind of stress.\n\n0:26:31\tSPEAKER_06\n And that's just a, we want to stinger stress as a form device, you know, like, oh, high volume, or whatever.\n\n0:26:40\tSPEAKER_06\n And to stinger that from its effect, which is, oh, the kind of focus we have is we're emphasizing this value often as opposed to other values, right?\n\n0:26:48\tSPEAKER_06\n So focus carries along a scope.\n\n0:26:50\tSPEAKER_06\n Like if you're going to focus on this thing, and you want to know, it sort of evokes all the other possibilities that it wasn't.\n\n0:26:55\tSPEAKER_06\n So my classic, my now classic example of saying, oh, he did go to the meeting.\n\n0:27:00\tSPEAKER_06\n That was my way of saying, as opposed to, you know, oh, he didn't, or there was a meeting, I think that was the example it was caught on by the link with the immediate, and so the, like, if you said he, you know, there's all these different things that, if you put stress on different part of it, then you're focusing, whatever, on depending.\n\n0:27:16\tSPEAKER_06\n He walked to the meeting as opposed to he ran, or he did walk to the meeting as opposed to he didn't walk.\n\n0:27:20\tSPEAKER_06\n You know, so we need to have a notation for that, which I think that's still in progress, so it's sort of still working it out.\n\n0:27:28\tSPEAKER_06\n But it did, one implication it does have for the other side, which we'll get to in a minute, is that I couldn't think of a good way to say, here are the possible things that you could focus on, because it seems like any entity in any sentence, or any meaning component of anything, you know, all the possible meaning you could have, any of them could be the subject of focus.\n\n0:27:48\tSPEAKER_06\n But I think one thing you can't skimitize is the kind of focus, right?\n\n0:27:51\tSPEAKER_06\n So for instance, you could say it's the tense on this as opposed to the action, okay?\n\n0:27:57\tSPEAKER_06\n Or it's an identity thing, or contrast with other things, or stress as value as opposed to other things.\n\n0:28:03\tSPEAKER_06\n So it is sort of like profile background thing, but I can't think of like the limited set of possible meanings that you would, that you would, highlight, as opposed to other ones.\n\n0:28:18\tSPEAKER_06\n So it has some sort of complications for the later on.\n\n0:28:24\tSPEAKER_06\n I mean, the best thing I come up with is that information structure has a list of focused elements.\n\n0:28:28\tSPEAKER_06\n For instance, one other type that I've mentioned is like query elements, and that's probably relevant for the, like where is, you know, the castle kind of thing, because you might wanna say that location, or certain WH words, bring, you know, sort of automatically, focus, you know, I don't know the identity of this thing kind of way on certain elements.\n\n0:28:49\tSPEAKER_06\n So, okay, anyway, so that's only, there are many more things that are, there's sort of like a little bit on stable other notation, but it's mostly, I think this is, you know, the current form, other things we didn't totally deal with.\n\n0:29:03\tSPEAKER_06\n Well, we have a lot of other stuff that you can have in working on in terms of like, how you deal with an adjective, you know, a nominal expression.\n\n0:29:11\tSPEAKER_06\n I mean, we should put an example of this, and we could do that later.\n\n0:29:14\tSPEAKER_06\n But I think then, inherently, like the general principle still work though, that we can have constructions that have sort of constituent structure in that there is like, you know, for instance, one, you know, they have constituents, right?\n\n0:29:28\tSPEAKER_06\n So you can like nest things when you need to, but they can also overlap in a sort of flatter way.\n\n0:29:33\tSPEAKER_06\n So if you don't have like a lot of grammar extracts, like this might, you know, be a little, okay, but, you know, we have the properties of dependency grammars and some properties of constituents constituent based grammar.\n\n0:29:44\tSPEAKER_06\n So that's, I think that's the main thing we wanted to aim for.\n\n0:29:46\tSPEAKER_06\n And so far, it's worked out, okay.\n\n0:29:48\tSPEAKER_06\n Good.\n\n0:29:49\tSPEAKER_06\n Okay.\n\n0:29:51\tSPEAKER_04\n I can say two things.\n\n0:29:52\tSPEAKER_04\n Yes.\n\n0:29:54\tSPEAKER_04\n Maybe you want to forget stress.\n\n0:29:58\tSPEAKER_04\n As a word?\n\n0:29:59\tSPEAKER_04\n No, as, as, just don't think about it.\n\n0:30:02\tSPEAKER_04\n Sorry.\n\n0:30:04\tSPEAKER_04\n Canonically speaking, you can, if you look at a curve or a sentence, you can find out where it's a certain stress is, and say, hey, that's my focus exponent.\n\n0:30:14\tSPEAKER_04\n Right.\n\n0:30:15\tSPEAKER_04\n It doesn't tell you anything what the focus is.\n\n0:30:19\tSPEAKER_04\n If it's just that thing, or the constituent that it pulls it.\n\n0:30:21\tSPEAKER_04\n Or the whole phrase.\n\n0:30:24\tSPEAKER_06\n You mean to forget about stress the form?\n\n0:30:27\tSPEAKER_04\n Yeah, because as a form cue, not even trained experts can always, well, they can tell you where the focus exponent is sometimes.\n\n0:30:39\tSPEAKER_04\n And that's also mostly true for red speech.\n\n0:30:42\tSPEAKER_04\n And real speech, people may put stress.\n\n0:30:46\tSPEAKER_04\n It's so the context dependent on what was there before, phrase-based breaks, restarts.\n\n0:30:52\tSPEAKER_04\n It's just, it's absurd.\n\n0:30:56\tSPEAKER_04\n It's complicated.\n\n0:30:57\tSPEAKER_05\n Yeah, I mean, I'm sort of inclined to say, let's worry about specifying the information, the structure, focus of the sentence.\n\n0:31:06\tSPEAKER_05\n And then- Ways that you can get it.\n\n0:31:08\tSPEAKER_05\n The phonology component can handle actually assigning an intonation contour to that.\n\n0:31:13\tSPEAKER_05\n I mean, later on, we'll worry about it.\n\n0:31:14\tSPEAKER_04\n I don't really contour to what the focus exactly is.\n\n0:31:18\tSPEAKER_04\n I'll figure out how the, yeah.\n\n0:31:20\tSPEAKER_04\n But if you don't know what your focus is, then your focus, you lost anyways.\n\n0:31:26\tSPEAKER_04\n And the only way of figuring out what that is is by sort of generating all the possible alternatives to each focused element, decide which one in that context makes sense of which one doesn't.\n\n0:31:42\tSPEAKER_04\n And then you left with a couple of three.\n\n0:31:44\tSPEAKER_04\n So, you know, again, that's something that humans can do.\n\n0:31:50\tSPEAKER_04\n But, paracetoscope, anything.\n\n0:31:55\tSPEAKER_04\n So-\n\n0:31:58\tSPEAKER_06\n OK. Well, yeah, I wouldn't have assumed that it's an easy problem in absence of all the, you need all the other information,\n\n0:32:04\tSPEAKER_04\n I guess. But it's pretty easy to put it in the formalism, though.\n\n0:32:08\tSPEAKER_04\n I mean, because you can just say whatever stuff is the container being focused or the entire whatever, both, and so forth.\n\n0:32:18\tSPEAKER_06\n Yeah, exactly.\n\n0:32:19\tSPEAKER_06\n So the sort of effect of it is something we want to keep.\n\n0:32:22\tSPEAKER_02\n But I think, I'm not sure I understand, but here's what I think is going on.\n\n0:32:26\tSPEAKER_02\n That if we do the constructions right, when a particular construction matches, it, the fact that it matches does in fact specify the focus.\n\n0:32:40\tSPEAKER_06\n I'm not sure about that.\n\n0:32:42\tSPEAKER_02\n OK.\n\n0:32:42\tSPEAKER_06\n It certainly constrains the elements.\n\n0:32:45\tSPEAKER_06\n It's the very least.\n\n0:32:46\tSPEAKER_06\n That's certainly true.\n\n0:32:48\tSPEAKER_06\n And depending on the construction, it may or may not.\n\n0:32:50\tSPEAKER_02\n Oh, for sure.\n\n0:32:51\tSPEAKER_02\n Yes, there are, yeah, it's not every, but there are constructions where you explicitly take into account those considerations that you need to take into account in order to decide what is being focused.\n\n0:33:04\tSPEAKER_04\n So we talked about this morning.\n\n0:33:08\tSPEAKER_04\n John is on the bus.\n\n0:33:10\tSPEAKER_04\n Not Nancy.\n\n0:33:12\tSPEAKER_04\n Right.\n\n0:33:13\tSPEAKER_04\n Focus is on John.\n\n0:33:14\tSPEAKER_04\n John is on the bus and not on the train.\n\n0:33:17\tSPEAKER_04\n All right.\n\n0:33:18\tSPEAKER_04\n John is on the bus versus John is on the train.\n\n0:33:20\tSPEAKER_01\n John is on the bus.\n\n0:33:22\tSPEAKER_04\n John is on the bus.\n\n0:33:24\tSPEAKER_04\n Right.\n\n0:33:24\tSPEAKER_04\n All of those.\n\n0:33:25\tSPEAKER_04\n Right.\n\n0:33:26\tSPEAKER_04\n All of these.\n\n0:33:26\tSPEAKER_04\n And will we have, is it all the same constructions?\n\n0:33:31\tSPEAKER_04\n Just with a different one.\n\n0:33:32\tSPEAKER_06\n Yeah, I would say that argument structure, in terms of like the main, sort of, I don't know, the fact that you can get it without any stress and you have some, whatever is predicated anyway, should be the same set of constructions.\n\n0:33:43\tSPEAKER_06\n That's why I was talking about overlapping constructions.\n\n0:33:45\tSPEAKER_06\n So then you have a separate thing that picks out, you know, stress on something relative to everything else.\n\n0:33:50\tSPEAKER_06\n So the question is actually, I'm sorry, go ahead.\n\n0:33:52\tSPEAKER_06\n And that would have to, it might be ambiguous as whether it picks out that element or the phrase or so on that, but it still is limited possibility.\n\n0:33:59\tSPEAKER_06\n So that should, you know, interact with, it should overlap with whatever other construction is.\n\n0:34:04\tSPEAKER_02\n The question is, do we have a way on the other page, when we get to this semantic side of saying what the stressed element was or stressed phrase or something?\n\n0:34:16\tSPEAKER_06\n So that's why I was saying how, since I couldn't think of an easy, like, limited way of doing it, all I can say is that information structure has a focus slot and I think that should be a little inferred.\n\n0:34:27\tSPEAKER_02\n So that's down at the bottom here when we get up.\n\n0:34:28\tSPEAKER_06\n Yeah, and I don't have a, I don't have a great way or great examples, but I think that's something like that is probably going to be more, more what we have to do.\n\n0:34:37\tSPEAKER_06\n Okay.\n\n0:34:38\tSPEAKER_06\n Okay, that was one comment.\n\n0:34:39\tSPEAKER_04\n Yeah, well, once you know what the focus is, the everything else is background.\n\n0:34:44\tSPEAKER_04\n How about topic command, it's the other side of, how about what?\n\n0:34:47\tSPEAKER_04\n topic command?\n\n0:34:48\tSPEAKER_06\n Yeah, so that was the other thing.\n\n0:34:50\tSPEAKER_06\n So I didn't realize before, it's like, oh, I have a piphony that, you know, topic and focus are a contrast set.\n\n0:34:55\tSPEAKER_06\n So topic is, topic focus seems to me like background profile, okay, or landmark trajectory or something like that.\n\n0:35:04\tSPEAKER_06\n There's definitely that kind of thing going on.\n\n0:35:07\tSPEAKER_06\n I don't know whether, I don't have as many great examples of like topic indicating constructions on like focus, right?\n\n0:35:15\tSPEAKER_06\n Topic, it seems to kind of, you know, something that might be an ongoing kind of thing.\n\n0:35:18\tSPEAKER_05\n Japanese has this though, you know, yeah, that's what is, just to mark which thing is the topic, it doesn't always have to be the subject.\n\n0:35:26\tSPEAKER_06\n So again, information structure has a topics lot.\n\n0:35:28\tSPEAKER_06\n I stuck it in thinking that we might use it.\n\n0:35:31\tSPEAKER_06\n I guess I did.\n\n0:35:32\tSPEAKER_06\n Yep, it's there.\n\n0:35:34\tSPEAKER_06\n And one thing that I didn't do consistently is, when we get there, is like indicate what kind of thing fits into every role.\n\n0:35:42\tSPEAKER_06\n I think I have an idea of what should be, but there, you know, so far we've been getting away with like, either a type constraint or, you know, whatever, it'll be a frame, you know, it'll be, it'll be another predication or it'll be, I don't know, some value from something, some variable and scope or something like that.\n\n0:35:57\tSPEAKER_06\n Or a slot chain, please, not a variable.\n\n0:35:59\tSPEAKER_06\n Okay, so that's, should we flip over to the other side, officially then?\n\n0:36:02\tSPEAKER_06\n Okay, side one.\n\n0:36:03\tSPEAKER_06\n Pointing forward to it, yeah.\n\n0:36:05\tSPEAKER_06\n Now, flip back step.\n\n0:36:07\tSPEAKER_06\n Okay, so this doesn't include something which might, may have some effect on it, which is the, discourse situation context record.\n\n0:36:18\tSPEAKER_06\n Right, so I did, I meant just like draw line and like, you know, you also have some tracking of what was going on.\n\n0:36:25\tSPEAKER_06\n And sort of, this is a big spell comment before I, you know, look into the details of this.\n\n0:36:29\tSPEAKER_06\n But for instance, you can imagine instead of having, I changed the name of, I used to be entities, so you can see it's scenario, reference and discourse segment.\n\n0:36:36\tSPEAKER_06\n And scenario is essentially what kind of, what's the basic predication, what event happened?\n\n0:36:41\tSPEAKER_06\n And actually it's just a list of various slots from which you would draw, draw in order to paint your picture, bunch of frames by, and findings, right?\n\n0:36:49\tSPEAKER_06\n And obviously there are other ones that are not included here, general, cultural frames in general, like, other action, you know, specific X-key maverings, okay, whatever.\n\n0:36:57\tSPEAKER_06\n The middle thing used to be entities, because you could imagine it should be like, really a list where here was various information.\n\n0:37:04\tSPEAKER_06\n And this is intended to be grammatically specifiable information about a reference, you know, about some entity that you were going to talk about.\n\n0:37:12\tSPEAKER_06\n So Harry walked into the room, Harry and room, you know, the room, but they'd be represented in this list somehow.\n\n0:37:19\tSPEAKER_06\n And it could also have, for instance, has this category slot, should be either category in more instance, basically, could be a point or terminology, so that everything you know about this could be drawn.\n\n0:37:28\tSPEAKER_06\n But the important things for grammatical purposes are things like number, gender.\n\n0:37:35\tSPEAKER_06\n The ones I included here are slightly arbitrary, but you could imagine that you need to figure out whether, if it's a group, whether some event is happening linear time, linear space, is like, you know, are they doing something serially, or is it like, I'm not sure, this partly came from a Tommi's schema, I'm not sure we'll need all of these actually, but, and then the status I used was like, again, in some languages, you know, like, for instance, in the child language, you might distinguish between different status.\n\n0:38:04\tSPEAKER_06\n So the big, and finally, discourse segment is about, sort of, bejack the information structure, like utterance specific kinds of things.\n\n0:38:14\tSPEAKER_06\n So the common I was going to make about changing entity, the entity's block to reference is that, you can imagine your discourse, so like situation context, you have a set of entities that you're sort of referring to, and you might, that might be your general, I don't know, database of all the things in this discourse that you could refer to, and I changed a reference because I would say, for a particular utterance, you have particular referring expressions in it, and those are the ones that you get information about that you stick in here.\n\n0:38:40\tSPEAKER_06\n For instance, I know it's going to be plural, I know it's going to be feminine, or something like that.\n\n0:38:44\tSPEAKER_06\n And these could actually just point to, you know, the ID in my other list of active entities, right?\n\n0:38:53\tSPEAKER_06\n So there's all this stuff about discourse status, we've talked about, I almost listed discourse status as a slot where you could say it's active, you know, there's this hierarchy, there's a schemingization of, you know, things can be active, or they can be accessible, inaccessible, there's someone that, you know, keep email to us once, do some of us not a while.\n\n0:39:14\tSPEAKER_06\n And the thing is that that, I noticed that that list was sort of discourse dependence, like in this particular set instance, it has been referred to recently, or it hasn't been, or this is something that's left in my world knowledge, but not active.\n\n0:39:28\tSPEAKER_02\n Yeah, there seems to be context properties.\n\n0:39:30\tSPEAKER_06\n Yeah, and for instance, I used to have a location thing there, but actually that's a property of the situation, and again, at certain points, things are located near or far away.\n\n0:39:40\tSPEAKER_02\n Well, this is recursive, because until we do the mental space story, we're not quite sure, which is fine.\n\n0:39:48\tSPEAKER_02\n Yeah, so some of these are.\n\n0:39:50\tSPEAKER_06\n We just don't know yet.\n\n0:39:52\tSPEAKER_06\n So for now, I thought, well, maybe I'll just have in this list the things that are relevant to this particular utterance, right, everything else here is utterant specific.\n\n0:40:02\tSPEAKER_06\n And I left this slot, predications open, because you can have things like the guy I know from school, or you're referring a fashion might be constrained by certain unbounded amounts of predications that you might make.\n\n0:40:18\tSPEAKER_06\n And it's unclear whether, I mean, you could just have in your scenarios, here are some extra few things that are true, right?\n\n0:40:25\tSPEAKER_06\n And then you could just sort of not have this slot here.\n\n0:40:30\tSPEAKER_06\n But it's used for identification purposes.\n\n0:40:31\tSPEAKER_06\n It's a little bit different just saying all these things are true from my other.\n\n0:40:37\tSPEAKER_05\n Right, this guy I know from school came for dinner.\n\n0:40:39\tSPEAKER_05\n Does not mean there is a guy I know him from school and he came over for dinner.\n\n0:40:46\tSPEAKER_05\n It's not the same.\n\n0:40:47\tSPEAKER_06\n Yeah, it's a little bit different, right?\n\n0:40:49\tSPEAKER_06\n So maybe that's like the restrictive non-restrictive.\n\n0:40:52\tSPEAKER_06\n You know, it gets into that kind of thing.\n\n0:40:55\tSPEAKER_06\n But maybe I'm mixing, you know, this is kind of like the final result after parsing the sentence.\n\n0:41:01\tSPEAKER_06\n So you might imagine that the information you passed to, you know, identifying a particular reference would be, oh, it's a guy and it's someone I know from school.\n\n0:41:09\tSPEAKER_06\n So maybe that would be sort of intermediate structure that you would pass into the disc, to whatever a continual engine or whatever discos context to find, you know, either create this reference, in which case it would be created here.\n\n0:41:21\tSPEAKER_06\n And you know, so you can imagine that this might not.\n\n0:41:23\tSPEAKER_06\n So I uncommitted to a couple of these things.\n\n0:41:28\tSPEAKER_04\n I just make it pretty much at least in my mind, this is not too much.\n\n0:41:32\tSPEAKER_04\n So how is gender looter?\n\n0:41:37\tSPEAKER_02\n In reality?\n\n0:41:37\tSPEAKER_06\n It could be in semantically.\n\n0:41:40\tSPEAKER_06\n Semantically, yeah.\n\n0:41:42\tSPEAKER_06\n So a table, you know, I think.\n\n0:41:47\tSPEAKER_06\n It doesn't have a gender or so.\n\n0:41:49\tSPEAKER_06\n It could be that, I mean, maybe not all of these.\n\n0:41:53\tSPEAKER_06\n I mean, I would say that I tried to keep lots of you that were potentially relevant to most things.\n\n0:41:58\tSPEAKER_04\n Just to make sure that everybody that we read the question.\n\n0:42:01\tSPEAKER_04\n OK, that is semantic as opposed to.\n\n0:42:03\tSPEAKER_04\n It has nothing to do with warm.\n\n0:42:05\tSPEAKER_06\n Yeah, that's right.\n\n0:42:11\tSPEAKER_04\n So again, that purification makes sense to have it open before something like an extreme.\n\n0:42:16\tSPEAKER_04\n Yeah, not.\n\n0:42:19\tSPEAKER_06\n OK, so let's see.\n\n0:42:21\tSPEAKER_06\n So maybe having made that big scale, sort of like large scale comment, should I just go through each of these slots, each of these blocks a little bit.\n\n0:42:33\tSPEAKER_06\n Mostly the top one is sort of image schematic.\n\n0:42:36\tSPEAKER_06\n And just a note, which is that when we actually have some of them seem more inherently static, like a container or sort of support dish.\n\n0:42:50\tSPEAKER_06\n And others are a little bit seemingly inherently dynamic, like source path goal, is often thought of that way, or force or something like that.\n\n0:42:57\tSPEAKER_06\n But in actual fact, I think that they're intended to be sort of neutral with respect to that.\n\n0:43:03\tSPEAKER_06\n And different ex-chemists use them in a way that's either static or dynamic.\n\n0:43:07\tSPEAKER_06\n So path, you could just be talking about the path between this and this and container.\n\n0:43:11\tSPEAKER_06\n And then you go in and out all these things.\n\n0:43:12\tSPEAKER_06\n So I think this came up when Ben and I were working with the Spaniards on the other day.\n\n0:43:19\tSPEAKER_06\n Spaniards, this is what we built them, to decide how you want to split up image schematic contributions versus ex-chematic contributions and how you link them up.\n\n0:43:28\tSPEAKER_06\n And I think again, it's going to be something in the ex-chemist that tells you is a static or a system.\n\n0:43:33\tSPEAKER_06\n So we definitely need that sort of a spectral type gives you some of that.\n\n0:43:38\tSPEAKER_06\n Is it a state or is it a change of state or is it an action of some kind?\n\n0:43:45\tSPEAKER_04\n Is there any meaning to where you have sort of parameters behind it and when you don't?\n\n0:43:51\tSPEAKER_06\n Oh, you mean in the slot?\n\n0:43:53\tSPEAKER_06\n No, it's like I was thinking of type constraints.\n\n0:43:56\tSPEAKER_06\n But ex-chemist obviously has been ex-chemist.\n\n0:43:58\tSPEAKER_06\n Agents, I mean, the performer of the ex-chemist, that depends on the ex-chemist.\n\n0:44:02\tSPEAKER_06\n In general, probably, the...\n\n0:44:04\tSPEAKER_05\n So the difference is basically whether you thought it was obvious what the possible filler is for.\n\n0:44:08\tSPEAKER_06\n Basically, as a spectral type probably isn't obvious, but I should have.\n\n0:44:10\tSPEAKER_06\n So I just neglected the sticks and things.\n\n0:44:12\tSPEAKER_06\n Perspective actor, underwear, observer.\n\n0:44:15\tSPEAKER_06\n I think we've often used...\n\n0:44:16\tSPEAKER_06\n Wee!\n\n0:44:17\tSPEAKER_06\n That's that one, right?\n\n0:44:19\tSPEAKER_06\n Exactly.\n\n0:44:20\tSPEAKER_06\n And so one nice thing that we had talked about is this example.\n\n0:44:24\tSPEAKER_06\n If you have a passive construction, then one thing it does is definitely, it is one way for you to specifically take the perspective of the undergoing kind of object.\n\n0:44:35\tSPEAKER_06\n And so then we talked about whether, well, does that specify a topic as well?\n\n0:44:40\tSPEAKER_06\n Well, maybe there are other things.\n\n0:44:41\tSPEAKER_06\n Now that it's subject, it's more like a topic.\n\n0:44:43\tSPEAKER_06\n And now that...\n\n0:44:44\tSPEAKER_06\n Anyway, so I'm going to trail off on that one so it's not that important right now.\n\n0:44:48\tSPEAKER_02\n No, for the moment, we just need the ability to write it down.\n\n0:44:53\tSPEAKER_02\n If somebody figured out what the rules were.\n\n0:44:55\tSPEAKER_06\n Yeah, exactly.\n\n0:44:57\tSPEAKER_06\n Some of these other ones, let's see.\n\n0:44:58\tSPEAKER_06\n So one thing I'm uncertain about is how polarity interacts.\n\n0:45:03\tSPEAKER_06\n So polarity is using...\n\n0:45:04\tSPEAKER_06\n For like action did not take place, for instance.\n\n0:45:07\tSPEAKER_06\n So by default, it'll be like true, I guess.\n\n0:45:10\tSPEAKER_06\n If you're specifying events, it did happen.\n\n0:45:13\tSPEAKER_06\n You could imagine that you skip out this.\n\n0:45:15\tSPEAKER_06\n Leave off this polarity, don't have it here.\n\n0:45:19\tSPEAKER_06\n And then have it part of the speech act in some way, in some negation.\n\n0:45:22\tSPEAKER_06\n But the reason why I left it is, because you might have a change of state, let's say, where some state holds and then some state doesn't hold.\n\n0:45:29\tSPEAKER_06\n And you're just talking, you know, if you're trying to have the nuts bolt of simulation, you need to know that whatever.\n\n0:45:33\tSPEAKER_06\n No, I think this level, which is where you have it.\n\n0:45:37\tSPEAKER_06\n OK, so it's fine where it is.\n\n0:45:39\tSPEAKER_06\n So how do you get it?\n\n0:45:40\tSPEAKER_02\n It may blow off and involve the discourse.\n\n0:45:43\tSPEAKER_02\n But by the time you're simulating, you should know that.\n\n0:45:47\tSPEAKER_05\n So I'm still just really not clear on what I'm looking at, the scenario box.\n\n0:45:53\tSPEAKER_05\n Like, what does that look like for an example?\n\n0:45:56\tSPEAKER_05\n Like, not all of these things are going to be here.\n\n0:45:58\tSPEAKER_05\n This is just basically says...\n\n0:46:00\tSPEAKER_05\n It's a grab bag.\n\n0:46:01\tSPEAKER_05\n Part of what I'm going to hand you is a whole bunch of schemas, image and ex schemas.\n\n0:46:08\tSPEAKER_05\n Here are some examples of the sorts of things you might have in there.\n\n0:46:11\tSPEAKER_06\n So that's exactly what it is.\n\n0:46:12\tSPEAKER_06\n OK.\n\n0:46:13\tSPEAKER_06\n And for a particular instance, which I make an example of that, is that you might have an instance of container and path, let's say, as part of your into definition.\n\n0:46:26\tSPEAKER_06\n So you would eventually have instances filled in with various values for all the different slots.\n\n0:46:32\tSPEAKER_06\n And they're bound up.\n\n0:46:33\tSPEAKER_06\n And yeah, they're bindings.\n\n0:46:34\tSPEAKER_05\n OK.\n\n0:46:35\tSPEAKER_05\n Do you have to say about the binding in your...\n\n0:46:37\tSPEAKER_05\n Is there a slot in here for the tells you how the bindings are done?\n\n0:46:40\tSPEAKER_02\n No, no, no.\n\n0:46:41\tSPEAKER_02\n Let's say I think we're not... another way of quite right yet.\n\n0:46:43\tSPEAKER_02\n So what this is, let's suppose for the moment it's complete.\n\n0:46:49\tSPEAKER_02\n OK.\n\n0:46:49\tSPEAKER_02\n OK.\n\n0:46:50\tSPEAKER_02\n Then this says that when an analysis is finished, the whole analysis is finished, you'll have, as a result, some spec for that utterance and context, which is made up entirely of these things and bindings among them and bindings to ontology items.\n\n0:47:19\tSPEAKER_02\n So that this is the toolkit out of which you can make a semantic specification.\n\n0:47:30\tSPEAKER_02\n So that's A. But D, which is more relevant to your life, is this is also the toolkit that is used in the semantic side of constructions.\n\n0:47:41\tSPEAKER_02\n So this is...\n\n0:47:43\tSPEAKER_02\n And anything you have in the party line, anything you have a semantic side of construction comes from pieces this, ignoring a lot...\n\n0:47:52\tSPEAKER_02\n I mean, in general, you ignore lots of it.\n\n0:47:54\tSPEAKER_02\n But it's got to be pieces of this along with constraints among them so that the goal of the...\n\n0:48:03\tSPEAKER_02\n a sort of that goal has to be the landmark of the interior, the container, or whatever.\n\n0:48:10\tSPEAKER_02\n So those constraints appear in constructions.\n\n0:48:15\tSPEAKER_02\n But pretty much this is the full range of semantic structures available to you.\n\n0:48:24\tSPEAKER_02\n OK.\n\n0:48:25\tSPEAKER_02\n For a cause.\n\n0:48:26\tSPEAKER_06\n Thank you.\n\n0:48:26\tSPEAKER_06\n Anyway, some kind of causal structure.\n\n0:48:29\tSPEAKER_02\n OK, good.\n\n0:48:29\tSPEAKER_02\n Let's mark that.\n\n0:48:31\tSPEAKER_02\n So we need to...\n\n0:48:32\tSPEAKER_06\n I mean, so it gets a little bit funny.\n\n0:48:34\tSPEAKER_06\n These are all so far with these structures, especially from path and on down.\n\n0:48:37\tSPEAKER_06\n These are sort of relatively familiar image schematic kind of slots.\n\n0:48:42\tSPEAKER_06\n Now, with cause, the fillers will actually be the cell strings.\n\n0:48:46\tSPEAKER_06\n So you'll say event one causes meant B.\n\n0:48:49\tSPEAKER_02\n And this again may get...\n\n0:48:53\tSPEAKER_02\n And of course, worlds.\n\n0:48:55\tSPEAKER_06\n Yeah.\n\n0:48:55\tSPEAKER_06\n So these are all implicitly within one role, even though saying that place takes place, whatever, if I said time is passed, that would say set this world somewhere before the world that corresponds to a current speech time.\n\n0:49:11\tSPEAKER_06\n So that's sort of OK.\n\n0:49:14\tSPEAKER_06\n Within the event, it's still one role.\n\n0:49:18\tSPEAKER_06\n Yeah, so cause and other frames that could come in.\n\n0:49:21\tSPEAKER_06\n I mean, unfortunately, you could bring in, say, for instance, a desire or something that I kind of want.\n\n0:49:27\tSPEAKER_06\n And actually, there is right now under discourse segment that's attitude, volition, could fill that.\n\n0:49:35\tSPEAKER_06\n There are a couple things where I'm like, oh, not sure if I want to have there.\n\n0:49:39\tSPEAKER_06\n Or basically, there was a whole list of possible speaker attitudes that, say, told me listed.\n\n0:49:44\tSPEAKER_06\n I'm like, well, I don't know.\n\n0:49:45\tSPEAKER_06\n It was like hope, wish, desire, blah, blah, blah.\n\n0:49:49\tSPEAKER_06\n And so I'm like, well, I feel like if I wanted to have an extra meaning, I don't know if those are grammatically marked in the first place.\n\n0:49:54\tSPEAKER_06\n They're more lexically marked, right?\n\n0:49:56\tSPEAKER_06\n At least in English.\n\n0:49:57\tSPEAKER_06\n So if I wanted to, I would stick in an extra frame, in my meaning saying, so there would be a hierarchical frame that, you know, like Naomi wants such a certain situation.\n\n0:50:06\tSPEAKER_06\n And that situation itself is a state of affairs.\n\n0:50:09\tSPEAKER_02\n Right.\n\n0:50:09\tSPEAKER_02\n So want itself can be.\n\n0:50:11\tSPEAKER_02\n It can be just another frame.\n\n0:50:13\tSPEAKER_02\n Well, basically, it's an action in our situation.\n\n0:50:18\tSPEAKER_02\n In our terminology, one could be an action in what you want is a world.\n\n0:50:24\tSPEAKER_02\n So that's, I mean, it's certainly one way to do it.\n\n0:50:26\tSPEAKER_02\n Yeah, there are other things, causal stuff we absolutely need, the mental space we need, the context we need.\n\n0:50:34\tSPEAKER_02\n So anyway, Keith, so is this comfortable to you that once we have this defined, it is your toolkit for building the semantic part of constructions.\n\n0:50:51\tSPEAKER_02\n And then when we combine constructions semantically, the goal is going to be to fill out more and more of the bindings needed in order to come up with the final one.\n\n0:51:02\tSPEAKER_02\n Yeah.\n\n0:51:02\tSPEAKER_02\n And that's the, I mean, according to the party line, that's the whole story.\n\n0:51:08\tSPEAKER_05\n Yeah.\n\n0:51:10\tSPEAKER_05\n Right.\n\n0:51:11\tSPEAKER_05\n That makes sense.\n\n0:51:11\tSPEAKER_05\n So I mean, there's this stuff in the, up in the scenario, which just tells you how various what's gave us you're using in our Heather bound together.\n\n0:51:18\tSPEAKER_05\n And I guess that some of the discourse segment stuff, is that where you would, I mean, that's, OK, that's where the information structure is, which sort of is a kind of profiling on different parts of this.\n\n0:51:32\tSPEAKER_05\n I mean, what's interesting is that the information structure is stuff.\n\n0:51:38\tSPEAKER_05\n There's almost, I mean, we keep coming back to how focus is like this, this trajectory landmark thing.\n\n0:51:44\tSPEAKER_05\n So if I say, in France, it's like this.\n\n0:51:49\tSPEAKER_05\n Great.\n\n0:51:49\tSPEAKER_05\n We've learned something about France, but the fact is that utterances of that sort are generally used to help you draw conclusion also about some implicit contrast.\n\n0:51:59\tSPEAKER_05\n Like in France, it's like this.\n\n0:52:00\tSPEAKER_05\n And therefore, you're supposed to say, boy, like sure, you know, in France, kids are allowed to drink at age three.\n\n0:52:04\tSPEAKER_05\n And that's not just the fact about France.\n\n0:52:07\tSPEAKER_05\n You also can do something about how boring it is here in the US.\n\n0:52:10\tSPEAKER_05\n Right.\n\n0:52:10\tSPEAKER_05\n And so.\n\n0:52:12\tSPEAKER_06\n So I would prefer not to worry about that for right now.\n\n0:52:15\tSPEAKER_06\n OK.\n\n0:52:15\tSPEAKER_06\n And to think that there are, that comes in.\n\n0:52:18\tSPEAKER_06\n This first level constructions, in a sense, topic, focus constructions that would say, oh, when you focus something, then just in the same way, just actually, in the same way, it's the lower level.\n\n0:52:27\tSPEAKER_06\n If you stressed, you know, John went to the bar, whatever.\n\n0:52:31\tSPEAKER_06\n You're focusing that and it's possible in France is in contrast to other things.\n\n0:52:34\tSPEAKER_06\n So similarly, for a whole sentence, in France, such and such happens.\n\n0:52:38\tSPEAKER_06\n So the whole thing is sort of like, again, implicitly, as opposed to other things that are possible.\n\n0:52:43\tSPEAKER_04\n So just look at the same formal maths route.\n\n0:52:49\tSPEAKER_04\n It's nice to just pick any paper on alternatively.\n\n0:52:54\tSPEAKER_04\n OK.\n\n0:52:55\tSPEAKER_04\n So that's the best way of talking about focus.\n\n0:52:59\tSPEAKER_04\n I think it's the way.\n\n0:53:01\tSPEAKER_05\n OK.\n\n0:53:02\tSPEAKER_05\n What was the name?\n\n0:53:03\tSPEAKER_04\n M-A-T-S.\n\n0:53:06\tSPEAKER_04\n OK.\n\n0:53:06\tSPEAKER_04\n Rooft.\n\n0:53:08\tSPEAKER_04\n T2O.\n\n0:53:09\tSPEAKER_04\n OK.\n\n0:53:09\tSPEAKER_04\n T-H.\n\n0:53:11\tSPEAKER_04\n I never know what you're going to know, so it's not.\n\n0:53:13\tSPEAKER_04\n Because it's sweet.\n\n0:53:16\tSPEAKER_04\n E-Dutch.\n\n0:53:17\tSPEAKER_04\n Dutch?\n\n0:53:18\tSPEAKER_04\n Yeah.\n\n0:53:19\tSPEAKER_04\n And very confused by the way.\n\n0:53:23\tNone\n So.\n\n0:53:24\tSPEAKER_05\n And maths route.\n\n0:53:26\tSPEAKER_04\n It's had enough.\n\n0:53:27\tSPEAKER_04\n You also just left the IMS in Stuttgart.\n\n0:53:29\tSPEAKER_04\n So it's not there anymore.\n\n0:53:32\tSPEAKER_04\n But I don't know where you said now.\n\n0:53:34\tSPEAKER_04\n But alternative semantics.\n\n0:53:36\tSPEAKER_04\n So you type that into a browser search list.\n\n0:53:39\tSPEAKER_04\n OK.\n\n0:53:39\tSPEAKER_04\n And you get that.\n\n0:53:41\tSPEAKER_05\n OK.\n\n0:53:41\tSPEAKER_05\n Thanks.\n\n0:53:46\tSPEAKER_04\n And what I'm kind of confused about is this.\n\n0:53:48\tSPEAKER_04\n What's the speaker and the hearers?\n\n0:53:50\tSPEAKER_04\n This is what I'm doing here.\n\n0:53:53\tSPEAKER_06\n So for a particular segment, it's really just a reference to some other entity, again, in the situation.\n\n0:54:01\tSPEAKER_06\n So for a particular segment, the speaker might be you or might be me.\n\n0:54:05\tSPEAKER_06\n Here is a little bit harder.\n\n0:54:07\tSPEAKER_06\n It could be like multiple people.\n\n0:54:08\tSPEAKER_06\n I guess that that's not very clear for me.\n\n0:54:11\tSPEAKER_06\n I mean, that's not clear.\n\n0:54:12\tSPEAKER_04\n Don't we ultimately want to handle that analogously in the way we handle time and space?\n\n0:54:19\tSPEAKER_04\n Because you, me, he, they, these guys, all these expressions are much, say, we're contextually dependent as here and now and there.\n\n0:54:30\tSPEAKER_02\n You know, this is assuming you've already solved that.\n\n0:54:32\tSPEAKER_02\n So it's Fred and Mary.\n\n0:54:34\tSPEAKER_02\n So the speaker would be Fred and the.\n\n0:54:38\tSPEAKER_06\n Right.\n\n0:54:38\tSPEAKER_06\n So the constructions, of course, will refer using pronouns or whatever.\n\n0:54:43\tSPEAKER_06\n In which case, they have to check to see who the speaker in here would in order to resolve those.\n\n0:54:49\tSPEAKER_06\n But when you actually say that he walked into whatever, he will refer to a particular.\n\n0:54:55\tSPEAKER_06\n You will already figure out who he or you or I, maybe a better example, who I refers to.\n\n0:55:02\tSPEAKER_06\n And then you just be able to refer to Harry, in wherever that person, whatever role that person was playing in the event.\n\n0:55:08\tSPEAKER_06\n That's up at the reference.\n\n0:55:09\tSPEAKER_04\n Yeah.\n\n0:55:09\tSPEAKER_04\n Yeah.\n\n0:55:10\tSPEAKER_04\n And don't there in this speaker here apart?\n\n0:55:13\tSPEAKER_06\n So that's, I think that's just, for instance, speaker is known from the situation.\n\n0:55:21\tSPEAKER_06\n Right.\n\n0:55:21\tSPEAKER_06\n When you hear something, you're told that the speaker is.\n\n0:55:24\tSPEAKER_06\n I mean, you know who the speaker is.\n\n0:55:25\tSPEAKER_06\n In fact, that's kind of constraining how, in some ways, you know this before you get to the, you feel in all the rest of it.\n\n0:55:33\tSPEAKER_06\n I think.\n\n0:55:35\tSPEAKER_06\n All right.\n\n0:55:36\tSPEAKER_06\n How else would you?\n\n0:55:37\tSPEAKER_06\n Very.\n\n0:55:38\tSPEAKER_04\n Yeah.\n\n0:55:39\tSPEAKER_04\n Well, I hear.\n\n0:55:40\tSPEAKER_04\n In the English, it's about to say, I.\n\n0:55:42\tSPEAKER_04\n Yeah.\n\n0:55:43\tSPEAKER_04\n I'm on the 25% level.\n\n0:55:45\tSPEAKER_04\n I mean, wouldn't the eye then set up the reference?\n\n0:55:50\tSPEAKER_04\n It happens to be the speaker of the type of number.\n\n0:55:52\tSPEAKER_04\n Right.\n\n0:55:53\tSPEAKER_04\n They, whoever they are, you.\n\n0:55:55\tSPEAKER_04\n Much like the you.\n\n0:55:57\tSPEAKER_06\n So, OK.\n\n0:55:57\tSPEAKER_06\n So I would say, under reference would be something that corresponds to eye.\n\n0:56:00\tSPEAKER_06\n And maybe each reference should probably have a list of whatever the way it was referred to.\n\n0:56:04\tSPEAKER_06\n So that's eye, but it should be say, it refers to what?\n\n0:56:10\tSPEAKER_06\n If it were Harry, it would refer to like some ontology thing.\n\n0:56:11\tSPEAKER_06\n If it were, if it's eye, it would refer to the current speaker, OK, which is given to be like, you know, whatever it is.\n\n0:56:19\tSPEAKER_04\n Not always.\n\n0:56:21\tSPEAKER_04\n And then he said, I.\n\n0:56:22\tSPEAKER_06\n Within the current world.\n\n0:56:23\tSPEAKER_06\n Yeah.\n\n0:56:24\tSPEAKER_02\n Yeah.\n\n0:56:25\tSPEAKER_02\n So, again, this is going to get us into the mental space stuff.\n\n0:56:28\tSPEAKER_02\n And because Fred said that Mary said in whatever.\n\n0:56:32\tSPEAKER_02\n And so we're going to have to chain those as well.\n\n0:56:40\tSPEAKER_06\n So this entire thing is inside a world.\n\n0:56:46\tSPEAKER_06\n Not just like the top part.\n\n0:56:48\tSPEAKER_02\n I think it's a bit of a problem.\n\n0:56:54\tSPEAKER_02\n Except it's trickier than that because the reference, for example, is where it gets really tricky.\n\n0:57:05\tNone\n Yeah.\n\n0:57:05\tSPEAKER_02\n Is there some things, and this is where blends and all terapathy, you know, some things which really are meant to be identified in some things which aren't.\n\n0:57:15\tSPEAKER_02\n And again, all we need for the moment is some way to say that.\n\n0:57:21\tSPEAKER_06\n So I thought I'd have like for each referendum having the list of other things, which is identified.\n\n0:57:27\tSPEAKER_06\n You know, which you could do that.\n\n0:57:28\tSPEAKER_06\n You, for instance.\n\n0:57:30\tSPEAKER_06\n So I guess it sort of depends on if it is referring to the fits identifiable already or if it's a new thing.\n\n0:57:37\tSPEAKER_06\n If it's a new thing, you have to create a structure or whatever.\n\n0:57:40\tSPEAKER_06\n If it's old thing, it could be referring to usually something in a situation or something in ontology.\n\n0:57:46\tSPEAKER_06\n So there's a, you know, whatever.\n\n0:57:49\tSPEAKER_02\n I just had an idea that would be very nice if it works.\n\n0:57:53\tSPEAKER_02\n Or what?\n\n0:57:53\tSPEAKER_02\n It works.\n\n0:57:54\tSPEAKER_02\n I even told you what it is.\n\n0:57:55\tSPEAKER_02\n It just was mine.\n\n0:57:57\tSPEAKER_02\n Build up.\n\n0:57:58\tSPEAKER_02\n An idea that would be nice.\n\n0:57:59\tSPEAKER_02\n We're crossing our fingers.\n\n0:58:00\tSPEAKER_03\n If it works.\n\n0:58:01\tSPEAKER_03\n The billion mental space.\n\n0:58:02\tSPEAKER_03\n Good.\n\n0:58:03\tSPEAKER_03\n Right.\n\n0:58:03\tSPEAKER_03\n It was a space builder.\n\n0:58:07\tSPEAKER_02\n We might be able to handle context in the same way that we handle mental spaces.\n\n0:58:14\tSPEAKER_02\n Because you have somewhat the same things going on of things being accessible or not.\n\n0:58:22\tSPEAKER_02\n And so I think if we did it right, we might be able to get at least a lot of the same structure.\n\n0:58:32\tSPEAKER_02\n So pulling something out of a discourse context is, I think, similar to other kinds of mental space.\n\n0:58:44\tSPEAKER_02\n Well, I've never seen anybody write that up.\n\n0:58:48\tSPEAKER_02\n And maybe they did.\n\n0:58:48\tSPEAKER_02\n I don't know.\n\n0:58:49\tSPEAKER_02\n Maybe all of the literature.\n\n0:58:51\tSPEAKER_05\n So there's things like, there's all kinds of stuff like in, I think I mentioned last time, in check if you have a verb of saying, then you say something like, or of thinking you can say something like, oh, I thought you are a Republican or something like that.\n\n0:59:10\tSPEAKER_05\n Whereas in English, you would say, I thought you were.\n\n0:59:13\tSPEAKER_05\n Sort of the past tense being copied onto the lower verb doesn't happen there.\n\n0:59:17\tSPEAKER_05\n So you have to say something about tense is determined relative to current blah, blah, blah.\n\n0:59:22\tSPEAKER_05\n The same thing happens with pronouns.\n\n0:59:24\tSPEAKER_05\n There's languages where if you have a verb of saying, then OK, so a situation like Bob said he was going to the movies where that lower subject is the same as the person who is saying or thinking.\n\n0:59:39\tSPEAKER_05\n You're actually required to have I there.\n\n0:59:43\tSPEAKER_05\n And it's sort of an extended approach.\n\n0:59:45\tSPEAKER_05\n Yeah.\n\n0:59:45\tSPEAKER_05\n But it's not perceived as a quotative construction.\n\n0:59:48\tSPEAKER_05\n I mean, it's been analyzed by the formalist as being a logophoric pronoun, which means a pronoun which refers back to the person who is speaking, or that sort of thing.\n\n0:59:59\tSPEAKER_05\n But that happens to sound like the word for I, but is actually semantically unrelated to it.\n\n1:00:04\tSPEAKER_05\n Oh, good.\n\n1:00:05\tSPEAKER_05\n I love the formalist.\n\n1:00:06\tSPEAKER_02\n Yeah.\n\n1:00:07\tSPEAKER_02\n Yeah.\n\n1:00:08\tSPEAKER_05\n Kidding.\n\n1:00:09\tSPEAKER_05\n There's a whole book which basically operates on this assumption, Mary Del Rinpoel, this book, 93 book on pronouns stuff.\n\n1:00:19\tSPEAKER_05\n Well, yeah.\n\n1:00:20\tSPEAKER_05\n And then same thing for ASL, where you're signing.\n\n1:00:22\tSPEAKER_05\n And someone says something.\n\n1:00:23\tSPEAKER_05\n And then so he say, and then you sort of do a role shift.\n\n1:00:27\tSPEAKER_05\n And then you sign, I, this, that, and the other.\n\n1:00:30\tSPEAKER_05\n I did this.\n\n1:00:31\tSPEAKER_05\n That's also been analyzed as logophoric and having nothing to do with I.\n\n1:00:35\tSPEAKER_05\n And the role shift thing has completely left out and so on.\n\n1:00:38\tSPEAKER_05\n I mean, the point is that pronoun reference is sort of ties in with all this mental space stuff and so on and so forth.\n\n1:00:45\tSPEAKER_02\n So yeah.\n\n1:00:46\tSPEAKER_02\n So that does sound like consistent with what we're saying.\n\n1:00:49\tSPEAKER_02\n Yeah.\n\n1:00:50\tSPEAKER_06\n OK.\n\n1:00:51\tSPEAKER_06\n So it's kind of like the unspecified mental spaces just are current context.\n\n1:00:54\tSPEAKER_06\n And then when you embed them, sometimes you have to pop up to the, you know, depending on the construction or whatever.\n\n1:01:01\tSPEAKER_06\n Your scope might re-extend out to the base one.\n\n1:01:05\tSPEAKER_06\n It would be nice to actually use the same mechanism.\n\n1:01:08\tSPEAKER_06\n Since there are so many cases where you actually need, it'll be one or the other.\n\n1:01:12\tSPEAKER_06\n It's like, oh, actually it's the same.\n\n1:01:13\tSPEAKER_05\n OK.\n\n1:01:13\tSPEAKER_05\n So this is where it's like what's happening.\n\n1:01:16\tSPEAKER_05\n Yeah.\n\n1:01:16\tSPEAKER_05\n What's happening there is that you're moving the base space, something like that, right?\n\n1:01:20\tSPEAKER_05\n So that's how we're going to talk about it.\n\n1:01:22\tSPEAKER_05\n And it happens under different circumstances and different languages.\n\n1:01:25\tSPEAKER_05\n So things like pronoun reference and tense, which we're thinking of as being these discoursey things, actually, are relative to a base space, which can change.\n\n1:01:32\tSPEAKER_05\n And we need all the same machinery.\n\n1:01:34\tSPEAKER_05\n OK.\n\n1:01:35\tNone\n OK.\n\n1:01:36\tSPEAKER_02\n Well, this is very good, actually, because it's an extent that it works.\n\n1:01:43\tSPEAKER_02\n Ties together several of these things.\n\n1:01:46\tSPEAKER_04\n And I'm sure going to read the transcript of this one.\n\n1:01:50\tSPEAKER_04\n But the, let's comment that we don't have a camera.\n\n1:01:54\tSPEAKER_04\n You know, all the partings.\n\n1:01:55\tSPEAKER_04\n Oh, yeah.\n\n1:01:57\tSPEAKER_03\n Yeah.\n\n1:01:58\tSPEAKER_03\n Every time Nancy giggles it means that it's your job.\n\n1:02:03\tSPEAKER_04\n Listen, I mean, I was sort of dubious why he even introduces this sort of reality as your basic space in Androidism.\n\n1:02:15\tSPEAKER_04\n Doesn't start with something because it's so obvious.\n\n1:02:18\tSPEAKER_04\n It should be so obvious.\n\n1:02:19\tSPEAKER_04\n It's to me that whenever I say something, I could grab this that with, I think.\n\n1:02:23\tSPEAKER_04\n Yeah.\n\n1:02:25\tSPEAKER_04\n So there should be no pedagogical difference between you.\n\n1:02:29\tSPEAKER_04\n Yeah.\n\n1:02:30\tSPEAKER_04\n And all the others.\n\n1:02:32\tSPEAKER_02\n But there's a grisly thing going on there that when you say, I think you're actually hedging.\n\n1:02:38\tSPEAKER_02\n Yeah.\n\n1:02:38\tSPEAKER_06\n I mean, I don't totally think.\n\n1:02:40\tSPEAKER_06\n Yeah.\n\n1:02:42\tSPEAKER_06\n Yeah, I usually think.\n\n1:02:44\tSPEAKER_05\n Yeah, it's an evidential.\n\n1:02:46\tSPEAKER_05\n It's sort of semi-grammaticalized.\n\n1:02:47\tSPEAKER_05\n People have talked about it this way.\n\n1:02:49\tSPEAKER_05\n And you can do sort of special things.\n\n1:02:51\tSPEAKER_05\n You can put just the phrase, I think, as a parenthetical in the middle of sense and so on.\n\n1:02:55\tSPEAKER_05\n I actually wanted the child on the researchers who\n\n1:02:57\tSPEAKER_06\n worked with Homosolo study a bunch of these constructions. And it was like, it's not using any kind of interesting embedded ways just to mark uncertainty or something like that.\n\n1:03:06\tSPEAKER_04\n So.\n\n1:03:07\tSPEAKER_04\n About linguistic hedges, I mean, those tend to be quite the anyways because we don't have that in here either doing.\n\n1:03:16\tSPEAKER_02\n Hedges?\n\n1:03:17\tSPEAKER_06\n Yeah.\n\n1:03:19\tSPEAKER_06\n There used to be a slot for speaker.\n\n1:03:22\tSPEAKER_06\n There's something like activity.\n\n1:03:24\tSPEAKER_06\n I couldn't remember what it meant.\n\n1:03:25\tSPEAKER_06\n So it took me.\n\n1:03:25\tSPEAKER_05\n Yeah.\n\n1:03:26\tSPEAKER_05\n Well, we were just talking about this sort of evidentiality and stuff like that, right?\n\n1:03:30\tSPEAKER_05\n I mean, that's what I think is sort of telling you.\n\n1:03:34\tSPEAKER_05\n So we probably should have the scent reality or should give this or, you know, confidence or something.\n\n1:03:40\tSPEAKER_05\n Yeah.\n\n1:03:40\tSPEAKER_05\n And the fact that I'm, you know, the fact maybe if I think it versus key things that might, you know, depend on how much you trust the two of us or whatever.\n\n1:03:48\tSPEAKER_04\n You know, you're right.\n\n1:03:49\tSPEAKER_04\n We're in the English language, but about what the study help people use it.\n\n1:03:53\tSPEAKER_04\n What's the word about?\n\n1:03:54\tSPEAKER_04\n About.\n\n1:03:55\tSPEAKER_04\n It's about.\n\n1:03:57\tSPEAKER_02\n Oh, that use of about that.\n\n1:04:00\tSPEAKER_02\n I think I think if you want to spend the plus and six or seven hours, you can get George started on that.\n\n1:04:08\tSPEAKER_05\n You wrote a paper about 35 years ago on that one.\n\n1:04:10\tSPEAKER_03\n I read that paper.\n\n1:04:11\tSPEAKER_03\n The head just paper.\n\n1:04:12\tSPEAKER_03\n Yeah.\n\n1:04:12\tSPEAKER_03\n I read some of that paper, actually.\n\n1:04:14\tSPEAKER_05\n Would you believe that paper led directly to the development of anti-lock breaks?\n\n1:04:19\tSPEAKER_05\n No.\n\n1:04:20\tSPEAKER_05\n Ask me about it later.\n\n1:04:22\tSPEAKER_05\n I'll tell you how.\n\n1:04:23\tSPEAKER_05\n When we're not on time.\n\n1:04:27\tSPEAKER_05\n I'd love to know.\n\n1:04:31\tSPEAKER_03\n Oh, man.\n\n1:04:32\tSPEAKER_06\n So I think someone had raised like sarcasm.\n\n1:04:36\tSPEAKER_02\n It was all that stuff.\n\n1:04:38\tSPEAKER_02\n I don't think.\n\n1:04:38\tSPEAKER_06\n I think we just won't deal with sarcasm.\n\n1:04:41\tSPEAKER_05\n I don't really know why.\n\n1:04:44\tSPEAKER_05\n We don't have to care too much about the speaker attitude, right?\n\n1:04:46\tSPEAKER_05\n Like there's not so many different.\n\n1:04:50\tSPEAKER_06\n I know.\n\n1:04:51\tSPEAKER_06\n Well, there are international markers, I think,\n\n1:04:53\tSPEAKER_05\n that was part. I don't know.\n\n1:04:55\tSPEAKER_05\n I just mean.\n\n1:04:55\tSPEAKER_06\n So much about the grammatical.\n\n1:04:58\tSPEAKER_05\n There's lots of different attitudes that the speaker could have, and then we can clearly identify and tone and so forth.\n\n1:05:03\tSPEAKER_05\n But what are the distinctions among those that we actually care about for our current purposes?\n\n1:05:09\tSPEAKER_02\n Right.\n\n1:05:09\tSPEAKER_02\n So this was the first question of what are our current purposes.\n\n1:05:13\tSPEAKER_05\n Oh, shoot.\n\n1:05:14\tSPEAKER_05\n Here it is 315 already.\n\n1:05:18\tSPEAKER_02\n So I don't know the answer, but it does seem that this is coming along.\n\n1:05:27\tSPEAKER_02\n I think it's as far as I can tell, there's one major thing we have to do, which is the mental whole, spindle space thing.\n\n1:05:34\tSPEAKER_02\n And then there's some other minor things.\n\n1:05:37\tSPEAKER_02\n And we're going to have to sort of bound the complexity.\n\n1:05:40\tSPEAKER_02\n I mean, if you get everything that anybody ever thought about, you know, we're going to have to.\n\n1:05:43\tSPEAKER_02\n So we had started with the idea that the actual constraint was related to this tourist domain.\n\n1:05:57\tSPEAKER_02\n And the kinds of interactions that might occur in the tourist domain, assuming that people were being helpful and weren't trying to do.\n\n1:06:05\tSPEAKER_02\n You know, there's all sorts of cognitive irony.\n\n1:06:08\tSPEAKER_02\n And so like what you mean, isn't probably as much use in dealing with a tourist guide.\n\n1:06:14\tNone\n Lockery.\n\n1:06:15\tSPEAKER_02\n So no end of things that we don't deal with.\n\n1:06:21\tSPEAKER_02\n And go ahead.\n\n1:06:22\tSPEAKER_04\n This is not easy, though, because in terms of the sum figure, which is mean you put one more set of brackets around it, just to sort of negate whatever.\n\n1:06:31\tSPEAKER_04\n Yeah.\n\n1:06:32\tSPEAKER_04\n I'm going to have to see if I can go around your.\n\n1:06:34\tSPEAKER_06\n Right.\n\n1:06:35\tSPEAKER_06\n Maybe.\n\n1:06:35\tSPEAKER_06\n Yeah.\n\n1:06:36\tSPEAKER_06\n In model theory, semantic is always like speaker, believe it's not P. You know, like speakers is P.\n\n1:06:40\tSPEAKER_05\n We have a theoretical model of sarcasm now.\n\n1:06:43\tSPEAKER_05\n Right.\n\n1:06:44\tSPEAKER_05\n Now.\n\n1:06:45\tSPEAKER_02\n Anyway.\n\n1:06:46\tSPEAKER_02\n So I guess let me make a proposal on how to proceed on that, which is that it was Keith's sort of job over the summer to come up with this set of constructions.\n\n1:07:10\tSPEAKER_02\n And the most interesting Keith is that you over the next couple of weeks.\n\n1:07:17\tSPEAKER_02\n Don't try to do them in detail or formerly, but just try to describe which ones you think we ought to have.\n\n1:07:27\tSPEAKER_02\n And then when Robert gets back, we'll look at this set of them.\n\n1:07:32\tSPEAKER_02\n Just sort of define your space.\n\n1:07:34\tSPEAKER_02\n Yeah.\n\n1:07:34\tSPEAKER_02\n OK.\n\n1:07:35\tSPEAKER_02\n And so these are the set of things that I think we ought to deal with.\n\n1:07:42\tSPEAKER_02\n And then we'll go back over it.\n\n1:07:45\tSPEAKER_02\n OK.\n\n1:07:46\tSPEAKER_02\n We'll give feedback.\n\n1:07:47\tSPEAKER_02\n And then we'll have a, at least, initial speck of what we're actually trying to do.\n\n1:07:57\tSPEAKER_02\n And that'll also be useful for anybody who's trying to write a parser.\n\n1:08:02\tSPEAKER_02\n Kisses in your mouth.\n\n1:08:05\tSPEAKER_02\n Right.\n\n1:08:06\tSPEAKER_02\n Who might want it, et cetera.\n\n1:08:07\tSPEAKER_02\n So you know, we get this four-tooled fixed.\n\n1:08:14\tSPEAKER_02\n And then we have an idea of the initial range.\n\n1:08:19\tSPEAKER_02\n And then of course, Nancy, you're going to have to do your set of, but you don't have to do that anyway.\n\n1:08:27\tSPEAKER_02\n So we're going to get, they're basically dealing with two domains, the first domain in the child language learning.\n\n1:08:34\tSPEAKER_02\n And we'll see what we need for those two.\n\n1:08:39\tSPEAKER_02\n And then my proposal would be to not totally cut off more general discussion, but to focus really detailed work on the subset of things that we really want to get done.\n\n1:08:57\tSPEAKER_02\n And then as a kind of separate thread, think about the more general things and all that.\n\n1:09:04\tSPEAKER_04\n Well, I also think the detailed discussion would bring us to problems that are all for general information.\n\n1:09:09\tSPEAKER_02\n Without doubt.\n\n1:09:10\tSPEAKER_02\n Yeah.\n\n1:09:11\tSPEAKER_02\n But what I want to do is to constrain the things that we really feel responsible for.\n\n1:09:18\tSPEAKER_02\n So that we said, these are the things we're really going to try to do by the end of the summer.\n\n1:09:22\tSPEAKER_02\n And other things we'll put on a list of research problems or something, because you can easily get the point where nothing gets done because every time you start to do something, you say, oh, yeah, but what about this case?\n\n1:09:37\tSPEAKER_02\n This is called being a linguist.\n\n1:09:40\tNone\n Yeah.\n\n1:09:41\tSPEAKER_06\n And that's what I want to do.\n\n1:09:46\tSPEAKER_06\n For me.\n\n1:09:48\tSPEAKER_03\n As I quote in Dr. Schumer, where some guy goes, every time I fire a linguist, the performance other recognize her goes up.\n\n1:09:55\tSPEAKER_02\n Exactly.\n\n1:09:58\tSPEAKER_02\n But anyway, is that make sense as a general way to proceed?\n\n1:10:03\tSPEAKER_05\n Yeah, we'll start with that just figuring out what needs to be done.\n\n1:10:07\tSPEAKER_05\n Then actually, the next step is to start trying to do it.\n\n1:10:10\tSPEAKER_05\n Exactly right, right?\n\n1:10:13\tSPEAKER_05\n OK.\n\n1:10:15\tSPEAKER_04\n We have a little bit of news with this minor stuff.\n\n1:10:18\tSPEAKER_03\n Who can I add out of power?\n\n1:10:20\tSPEAKER_03\n Can I ask a quick question about this?\n\n1:10:22\tSPEAKER_03\n Is this, was it intentional to leave off things like inherits and?\n\n1:10:27\tSPEAKER_03\n Oops.\n\n1:10:29\tSPEAKER_05\n No.\n\n1:10:30\tSPEAKER_06\n No, really?\n\n1:10:31\tSPEAKER_06\n Just on the construction, right?\n\n1:10:32\tSPEAKER_03\n Yeah.\n\n1:10:33\tSPEAKER_03\n Like, construction's going to hurt from other things in my right.\n\n1:10:36\tSPEAKER_06\n Yeah.\n\n1:10:37\tSPEAKER_06\n I didn't want to think too much about that for now.\n\n1:10:40\tSPEAKER_06\n So maybe it was subconsciously intentional.\n\n1:10:42\tSPEAKER_05\n Yeah.\n\n1:10:44\tSPEAKER_05\n Yeah, there should be.\n\n1:10:45\tSPEAKER_05\n I wanted to find out someday if there was going to be some way of dealing with, if this is the right term, multiple inheritance, where one corporation is inheriting from both parents or different ones, or three or four different ones.\n\n1:11:00\tSPEAKER_05\n Yeah.\n\n1:11:00\tSPEAKER_05\n The problem is that then you have to reach of how they're getting bound together.\n\n1:11:05\tSPEAKER_06\n Yeah.\n\n1:11:06\tSPEAKER_06\n And there are certainly cases like that, even, just semantics chemos we have, some examples.\n\n1:11:10\tSPEAKER_06\n Right.\n\n1:11:11\tSPEAKER_06\n And we've been talking a little bit about that.\n\n1:11:12\tSPEAKER_02\n So what I would like to do is separate that problem out.\n\n1:11:16\tSPEAKER_02\n So my argument is there's nothing you can do with that that you can't do by just having more construction.\n\n1:11:27\tSPEAKER_02\n It's like we're in, doesn't have the deep linguistic insights and stuff.\n\n1:11:31\tSPEAKER_02\n Ah, whatever.\n\n1:11:32\tSPEAKER_02\n Yeah, no, no, no, no, by all means.\n\n1:11:34\tSPEAKER_05\n Right.\n\n1:11:34\tSPEAKER_02\n And so what I'd like to do is in the short run, focus on getting it right.\n\n1:11:40\tSPEAKER_02\n And when we think we have it right, then saying, ah-ha, can we make it more elegant?\n\n1:11:45\tSPEAKER_02\n Yeah.\n\n1:11:45\tSPEAKER_02\n Can we connect it?\n\n1:11:46\tSPEAKER_02\n What are the generalizations and stuff?\n\n1:11:48\tSPEAKER_02\n But rather than trying to guess a inheritance structure and all that sort of stuff before we know what we're doing.\n\n1:11:56\tSPEAKER_02\n So I would say in the short run, we're not going to, first of all, not doing them yet at all.\n\n1:12:02\tSPEAKER_02\n And it could be that halfway through we say, ah-ha, we now see how we want to clean it up.\n\n1:12:10\tSPEAKER_02\n And inheritance is only one, I mean, that's one way to organize it, but there are others.\n\n1:12:16\tSPEAKER_02\n And it may or may not be the best way.\n\n1:12:20\tSPEAKER_02\n I'm sorry, you had news.\n\n1:12:21\tSPEAKER_04\n Oh, just small stuff.\n\n1:12:24\tSPEAKER_04\n Thanks to Eva.\n\n1:12:25\tSPEAKER_04\n On our website, we can know if you want to run Java based, you can see, download these classes.\n\n1:12:34\tSPEAKER_04\n And then it will enable you.\n\n1:12:36\tSPEAKER_04\n She modified the query so it has no button menu item or saving it into the embedded Java based.\n\n1:12:45\tSPEAKER_04\n So that's wonderful.\n\n1:12:47\tSPEAKER_04\n Great.\n\n1:12:47\tSPEAKER_04\n And you tested it out.\n\n1:12:51\tSPEAKER_04\n Do you want to say something about that?\n\n1:12:53\tSPEAKER_00\n I was just checking like, when we want to get the posterior probability of variables, you know how you ask whether we can just observe all the variables in the same way so you can't have to make separate queries every time.\n\n1:13:07\tSPEAKER_01\n So yeah.\n\n1:13:09\tSPEAKER_01\n What's the purpose?\n\n1:13:12\tSPEAKER_00\n For the time being, it's very important.\n\n1:13:13\tSPEAKER_00\n You just have a long list of all the variables.\n\n1:13:16\tSPEAKER_06\n All the things you want to query.\n\n1:13:18\tSPEAKER_06\n Yeah, you just have to pass it to them.\n\n1:13:19\tSPEAKER_06\n Yeah.\n\n1:13:20\tSPEAKER_04\n Other, maybe in a long term, that's good news because of course, that's the thinking.\n\n1:13:25\tSPEAKER_04\n I don't know how we can do that at all.\n\n1:13:28\tSPEAKER_04\n That's a pretty good discussion for it.\n\n1:13:31\tSPEAKER_04\n And they're running late, so I had an idea yesterday, but I don't know what the machine can start.\n\n1:13:48\tSPEAKER_02\n What do you mean, sure, tell us what it is.\n\n1:13:49\tSPEAKER_04\n The construal that has been pointed to, but this may be made precise by any means, may work as follows.\n\n1:14:08\tSPEAKER_04\n I thought that we would, the problem I think would be a little bit nice, and I've no clue whether it's work or nothing so it's just a pattern.\n\n1:14:18\tSPEAKER_04\n A couple of matters, this is a famous here.\n\n1:14:22\tSPEAKER_04\n Imagine you write a base net.\n\n1:14:26\tNone\n Base?\n\n1:14:27\tSPEAKER_04\n Base netting.\n\n1:14:30\tSPEAKER_04\n Completely from scratch.\n\n1:14:31\tSPEAKER_04\n Every time you do a construal.\n\n1:14:33\tSPEAKER_04\n So you have nothing.\n\n1:14:36\tSPEAKER_04\n This is quite a piece of paper.\n\n1:14:39\tSPEAKER_04\n You consult your ontology, which will tell you a bunch of stuff and parts of the product.\n\n1:14:44\tSPEAKER_04\n Grab out the things that you need.\n\n1:14:47\tSPEAKER_04\n Right.\n\n1:14:47\tSPEAKER_04\n Then you simply write a piece into your real white piece of paper.\n\n1:14:54\tSPEAKER_04\n And you will get a lot of notes and stuff out of there.\n\n1:14:58\tSPEAKER_04\n You won't really get any CPTs.\n\n1:15:00\tSPEAKER_04\n Therefore, we need everything that triggers to what the situation is.\n\n1:15:05\tSPEAKER_04\n I need the context in this stuff.\n\n1:15:06\tSPEAKER_04\n So you get whatever comes from discourse.\n\n1:15:09\tSPEAKER_04\n I've also filtered.\n\n1:15:11\tSPEAKER_04\n So only the ontology relevance stuff from the discourse does the situation in the user model.\n\n1:15:17\tSPEAKER_04\n And that fills in your CPTs with which you can then query the net that you just wrote and find out how the X is construed as in utterance, U.\n\n1:15:31\tSPEAKER_04\n And the embedded Java base works exactly like that.\n\n1:15:34\tSPEAKER_04\n But once you have the precise form it in which to write it, so we write it down, you query.\n\n1:15:40\tSPEAKER_04\n You get the result, you get thrown away.\n\n1:15:43\tSPEAKER_04\n And the nice thing about this idea is that you don't ever have to sit down and think about it or write about it.\n\n1:15:48\tSPEAKER_04\n You may have some general rules as to how things will be equals to this.\n\n1:15:52\tSPEAKER_04\n What so that will allow you to craft the initial notes.\n\n1:15:56\tSPEAKER_04\n But in that respect, it's completely scalable, because it doesn't have any prior configuration.\n\n1:16:05\tSPEAKER_04\n It's just you need an ontology of the domain, and you need the context to pen modules.\n\n1:16:11\tSPEAKER_04\n And if this can be made to work at all,\n\n1:16:15\tSPEAKER_02\n let me kind of thank you. It sounds to me like you want PRM's.\n\n1:16:21\tSPEAKER_02\n PRM's?\n\n1:16:22\tSPEAKER_04\n PRM?\n\n1:16:23\tSPEAKER_04\n I think it's a great forward thing.\n\n1:16:27\tSPEAKER_02\n No, no, you can't.\n\n1:16:28\tSPEAKER_02\n See, the critical thing about the PRM is it gives these relations in general form.\n\n1:16:34\tSPEAKER_02\n So once you have instantiated the PRM with the instances, and then you can unfold it.\n\n1:16:44\tSPEAKER_04\n No, I was using a generic.\n\n1:16:46\tSPEAKER_04\n So probabilistic whatever additional models, whatever you write at it.\n\n1:16:52\tSPEAKER_02\n What matters a lot?\n\n1:16:54\tSPEAKER_02\n Because what you want are these generalized rules about the way things relate that you then instantiate in each case.\n\n1:17:03\tSPEAKER_02\n Yeah.\n\n1:17:03\tSPEAKER_04\n Maybe the way it works.\n\n1:17:06\tSPEAKER_02\n Yeah, that's the only way it could work.\n\n1:17:08\tSPEAKER_02\n We have our local expert on PRM's.\n\n1:17:12\tSPEAKER_02\n My guess is that they're not currently good enough to do that.\n\n1:17:15\tSPEAKER_02\n But we will have to see.\n\n1:17:22\tSPEAKER_02\n Yeah, that would be a good thing to try.\n\n1:17:26\tSPEAKER_02\n It's related to the Hobbes abduction story.\n\n1:17:34\tSPEAKER_02\n In that, you throw everything into a pot and you try to come up with the.\n\n1:17:39\tSPEAKER_02\n That's the question.\n\n1:17:40\tSPEAKER_02\n There's no theorem.\n\n1:17:41\tSPEAKER_02\n No, there isn't a theorem proofer.\n\n1:17:43\tSPEAKER_02\n But the PRMs are like rules of inference.\n\n1:17:54\tSPEAKER_02\n And you're coupling a bunch of them together.\n\n1:17:56\tSPEAKER_02\n And then instead of proving you're trying to compute the most likely.\n\n1:18:00\tSPEAKER_02\n Trick.\n\n1:18:04\tSPEAKER_02\n Yeah, it's a good thing to put in your thesis proposal.\n\n1:18:13\tSPEAKER_02\n So you're going to write something for us before you go?\n\n1:18:17\tSPEAKER_02\n You have something.\n\n1:18:19\tSPEAKER_04\n In the process of.\n\n1:18:20\tSPEAKER_02\n So what are we going to meet again?\n\n1:18:24\tSPEAKER_00\n When are you leaving?\n\n1:18:25\tSPEAKER_04\n There's it, right?\n\n1:18:26\tSPEAKER_04\n Persons my last day here.\n\n1:18:29\tSPEAKER_04\n So I would suggest this one as a puzzle.\n\n1:18:33\tSPEAKER_02\n Do you mean where we the whole thing?\n\n1:18:36\tSPEAKER_02\n I didn't mean you just two of us.\n\n1:18:38\tSPEAKER_02\n Obviously we can do this.\n\n1:18:39\tSPEAKER_02\n But the question is, do you want to, for example, send a little group a draft your thesis proposal and get another session on feedback on that?\n\n1:18:50\tSPEAKER_02\n Or.\n\n1:18:52\tSPEAKER_04\n We can go through Thursday again.\n\n1:18:57\tSPEAKER_05\n Find anything?\n\n1:19:01\tSPEAKER_05\n Should we do the 1vm time for Thursday since we were on that before?\n\n1:19:05\tSPEAKER_05\n Sure.\n\n1:19:06\tSPEAKER_04\n OK.\n\n1:19:08\tSPEAKER_04\n All right.\n\n1:19:09\tSPEAKER_04\n First, then one.\n\n1:19:11\tSPEAKER_04\n I can also maybe then run through the talk I have to give as email, which highlights all of our work.\n\n1:19:20\tSPEAKER_02\n OK.\n\n1:19:21\tSPEAKER_04\n And we can make some last few changes on that.\n\n1:19:25\tSPEAKER_02\n OK.\n\n1:19:26\tSPEAKER_03\n You can just give them the abstract that we wrote for the paper.\n\n1:19:28\tSPEAKER_02\n That'll tell them exactly what's going on.\n\n1:19:30\tSPEAKER_02\n Yeah.\n\n1:19:33\tSPEAKER_06\n All right.\n\n1:19:33\tSPEAKER_06\n Can we do 130?\n\n1:19:35\tSPEAKER_06\n No.\n\n1:19:36\tSPEAKER_06\n Oh, you already told me no.\n\n1:19:37\tSPEAKER_06\n One.\n\n1:19:38\tSPEAKER_00\n It's fine.\n\n1:19:39\tSPEAKER_00\n We can do one.\n\n1:19:40\tSPEAKER_00\n It's fine.\n\n1:19:44\tSPEAKER_05\n To me, this is equal.\n\n1:19:47\tSPEAKER_05\n I don't care.\n\n1:19:48\tSPEAKER_05\n For all?\n\n1:19:50\tSPEAKER_06\n Yeah, it's fine.\n\n1:19:50\tNone\n For?\n\n1:19:51\tNone\n Yeah.\n\n1:19:51\tSPEAKER_04\n No, no.\n\n1:19:53\tSPEAKER_04\n I don't care.\n\n1:19:54\tSPEAKER_04\n It's equal to all of us.\n\n1:19:56\tSPEAKER_04\n You can decide one or four.\n\n1:19:58\tSPEAKER_03\n The person is ununancy.\n\n1:19:59\tSPEAKER_04\n This actually is actually what she likes for, because it forces the meeting record of people to put discussion to vote.\n\n1:20:06\tSPEAKER_00\n OK.\n\n1:20:06\tSPEAKER_00\n Four.\n\n1:20:08\tSPEAKER_05\n Well, if you insist, then.\n\n1:20:09\tSPEAKER_05\n Thank you.\n\n1:20:10\tNone\n Sorry.\n\n1:20:11\tNone\n Sorry.\n\n1:20:17\tNone\n Sorry.\n\n1:20:18\tNone\n You can't call that.\n\n1:20:20\tNone\n PrÄ\u0081nir Hell, msra.\n\n1:20:50\tNone\n You\n\n", "summary": [{"summary_text": "SPEAKER recorded a sheet that he has a lot of thoughts and justification to comment on. It's the result of much thinking since the last time they met, but not as much writing as before. There's a revised semantics on one side and a revised specification on the other side."}]}