{"filename": "./data/Bmr006.txt", "transcript": "0:00:00\tSPEAKER_05\n Okay, now we're on it. It seems to be working.\n\n0:00:03\tSPEAKER_04\n So it seems like it's been sitting for a long time.\n\n0:00:08\tSPEAKER_05\n I don't know what it is, but all I know is that it seems like every time I am up here after a meeting and I start it, it works fine.\n\n0:00:18\tSPEAKER_05\n And if I'm up here and I start it and we're all sitting here waiting to have a meeting, it gives me that error message and I have not yet sat down with being able to get that error message at a point where I can sit down and find out where it's occurring in the code.\n\n0:00:29\tSPEAKER_05\n Yeah, we will.\n\n0:00:30\tSPEAKER_05\n One of these days.\n\n0:00:31\tSPEAKER_05\n Was it on pause or something?\n\n0:00:33\tSPEAKER_03\n No.\n\n0:00:34\tSPEAKER_03\n So the new procedural change that Scott suggested, I think is a good idea, is that we do the digit recording at the end.\n\n0:00:45\tSPEAKER_03\n And that way, if we're recording somebody else's meeting and the number of participants have to run off to some other meeting who don't have the time, then they can run off.\n\n0:00:55\tSPEAKER_03\n Then we'll get somewhat fewer sets of digits, but I think that way we'll cut into people's time.\n\n0:01:02\tSPEAKER_03\n There's someone's on strict time.\n\n0:01:04\tSPEAKER_03\n Less.\n\n0:01:06\tSPEAKER_03\n So I think we should start doing that.\n\n0:01:11\tSPEAKER_03\n So let's see, we were having discussion the other day.\n\n0:01:14\tSPEAKER_03\n I mean, we should bring that up.\n\n0:01:16\tSPEAKER_03\n The nature of the data that we're collecting.\n\n0:01:20\tSPEAKER_03\n That we should have a fair amount of data that is collected for the same meeting so that we can.\n\n0:01:30\tSPEAKER_03\n I know.\n\n0:01:31\tSPEAKER_03\n What was on the point again about that?\n\n0:01:34\tNone\n Well, okay.\n\n0:01:35\tSPEAKER_00\n I'll back up.\n\n0:01:36\tSPEAKER_00\n Yeah.\n\n0:01:37\tSPEAKER_00\n At the previous, at last week's meeting, this meeting, I was brave.\n\n0:01:42\tNone\n I didn't have about wanting to get more data.\n\n0:01:45\tSPEAKER_00\n I talked about this with Jane and Adam, and was thinking of this mostly just so that we could do research on this data since we'll have a new student, does want to work with us.\n\n0:01:59\tSPEAKER_00\n That was at the last meeting.\n\n0:02:00\tSPEAKER_00\n Great.\n\n0:02:01\tSPEAKER_00\n And he's already funded part time, so we'll be paying him only for half of the normal part time.\n\n0:02:06\tSPEAKER_05\n What did he?\n\n0:02:07\tSPEAKER_05\n Yeah.\n\n0:02:08\tSPEAKER_05\n And what's he interested in specifically?\n\n0:02:09\tSPEAKER_00\n He comes from a signal processing background, but I like to unlock because he's very interested in higher level things like language and disfluencies and all kinds of, maybe, positive.\n\n0:02:20\tSPEAKER_00\n So he's just getting his feedback in that.\n\n0:02:22\tSPEAKER_00\n Anyway, I thought, okay, maybe we should have enough data so that he starts, he'd be starting in January next semester, that we'd have enough data to work with.\n\n0:02:31\tSPEAKER_00\n But Jane and Adam brought up a lot of good points that just posting a note to Berkeley\n\n0:02:38\tNone\n people that have them come down here has some problems in that. We need to make sure that the speakers are who you want and that the meeting type is what you want and so forth.\n\n0:02:47\tSPEAKER_00\n So I thought about that and I think it's still possible.\n\n0:02:51\tSPEAKER_00\n But I'd rather try to get more regular meetings of types that we know about in here than sort of a mishmash of a bunch of one time.\n\n0:03:01\tSPEAKER_00\n Yeah, just because it would be very hard to process the data in all senses, both to get the figure out what type of meeting it is and to do any kind of higher level work on it like while I was talking to Morgan about things like summarization or what's this meeting about.\n\n0:03:17\tSPEAKER_00\n I mean, it's very different if you have a group that's just giving a report on what they did that week versus coming to a decision and so forth.\n\n0:03:25\tSPEAKER_00\n So then I was talking to Morgan about some new proposed work in this area sort of a separate issue from one student would be working on where I was thinking of doing some kind of summarization of meetings or trying to find cues in both the utterances and in the utterance patterns like in numbers of overlaps and amount of speech sort of raw cues from the interaction that can be measured from the signals and from the different microphones that point to\n\n0:03:58\tNone\n sort of hotspots in the meeting or things where stuff is going on that might be important for someone who didn't attend to listen to.\n\n0:04:05\tSPEAKER_00\n And in that regard, I thought we definitely will need, it'd be nice for us to have a bunch of data from a few different domains or a few different kinds of meetings.\n\n0:04:17\tSPEAKER_00\n So this meeting is one of them, although I'm not sure I could participate if I would feel very strange being part of a meeting that you were then analyzing later for things like summarization.\n\n0:04:28\tSPEAKER_00\n And then there are some others that Morgan mentioned, like the front end meeting, maybe a networking group meeting.\n\n0:04:35\tSPEAKER_05\n We're hoping that they'll let us start recording regularly.\n\n0:04:37\tSPEAKER_00\n So if that were the case, then I think we'd have enough.\n\n0:04:41\tSPEAKER_00\n But basically for anything where you're trying to get a summarization or some kind of meeting out of the meeting, it would be too hard to have 50 different kinds of meetings where we didn't really have a good grasp of what does it mean to summarize, but rather we should have different meetings by the same group, but hopefully that have different summaries.\n\n0:05:04\tSPEAKER_00\n And then we need a couple of, we don't want to just have one group because that might be very specific to that particular group.\n\n0:05:11\tNone\n But three more times.\n\n0:05:12\tSPEAKER_05\n Here we have a overlap between this meeting and the morning meeting.\n\n0:05:17\tSPEAKER_00\n See, that I've never listened to the data for the front end meeting.\n\n0:05:21\tSPEAKER_05\n We've only had three.\n\n0:05:22\tSPEAKER_00\n But maybe that's enough.\n\n0:05:24\tSPEAKER_00\n So in general, I was thinking more data, but also data where we hold some parameters, constant or fairly similar like a meeting about people doing a certain kind of work where at least have to participate in each time or the same.\n\n0:05:40\tSPEAKER_03\n Now let me just give the other side to that because I don't disagree with that.\n\n0:05:45\tSPEAKER_03\n But I think there is a complimentary piece to it too.\n\n0:05:49\tSPEAKER_03\n For other kinds of research, particularly the acoustic oriented research, I actually feel the opposite need.\n\n0:05:56\tSPEAKER_03\n I'd like to have lots of different people.\n\n0:05:58\tSPEAKER_03\n As many people here and talking about the kind of thing that you're just talking about, it would have too few people from my point of view.\n\n0:06:06\tSPEAKER_03\n I'd like to have many different speakers.\n\n0:06:08\tSPEAKER_03\n So I think I would also very much like us to have a fair amount of really random scattered meetings or somebody coming down from campus.\n\n0:06:17\tSPEAKER_03\n And I mean, sure, if we can get more from them fine, but if we only get one or two from each group, it still could be useful acoustically just because we have close and distant microphones with different people.\n\n0:06:28\tSPEAKER_01\n Okay, can I say about that?\n\n0:06:30\tSPEAKER_01\n The issues that I think Adam and I raised were more a matter of advertising so that you get more native speakers.\n\n0:06:36\tSPEAKER_01\n Because I think if you just say, and in particular, my suggestion was to advertise to linguistics grad students because there you have people who would have proficiency enough in English that it would be useful for purposes.\n\n0:06:49\tSPEAKER_01\n But I think I've gathered data from undergrad students at an on campus.\n\n0:06:54\tSPEAKER_01\n You just post randomly to undergrad students.\n\n0:06:56\tSPEAKER_01\n I think you'd get such a mix back.\n\n0:06:57\tSPEAKER_01\n It would be hard to know how much conversation you'd have at all.\n\n0:07:00\tSPEAKER_01\n Well, you want- The English you'd have with the language models would be really hard to build because it would not really be- it would be an inner language with that.\n\n0:07:07\tSPEAKER_03\n Well, okay.\n\n0:07:08\tSPEAKER_03\n First place, I don't think we just want to have random people come down and talk to one another.\n\n0:07:13\tSPEAKER_03\n There should be a meeting that has some goal and point because I think that's what we're\n\n0:07:17\tSPEAKER_00\n investigating. It needs to be a pre-existing meeting.\n\n0:07:19\tSPEAKER_00\n Yeah.\n\n0:07:20\tSPEAKER_00\n Right.\n\n0:07:21\tSPEAKER_00\n That would always happen.\n\n0:07:22\tSPEAKER_03\n So I was thinking more in terms of talking to professors and senior doctoral students who are leading projects and offering to them that they have the whole their meeting down here.\n\n0:07:37\tSPEAKER_03\n That's the first point.\n\n0:07:38\tSPEAKER_03\n One point is I think that for some time now going back through birth, I think that we have had speakers that we've worked with who had non-native access.\n\n0:07:49\tSPEAKER_01\n Oh, I'm not saying access.\n\n0:07:50\tSPEAKER_01\n I think that- The access is not the problem.\n\n0:07:52\tSPEAKER_01\n Okay.\n\n0:07:53\tSPEAKER_01\n No, it's more a matter of proficiency, just simply fluency.\n\n0:07:56\tSPEAKER_01\n I mean, ideal for people on campus who I think sometimes people undergraduates in computer science have language skills that make, you know, they're balancing the writing skills.\n\n0:08:09\tSPEAKER_01\n Oh, you're not talking about the poor language at all.\n\n0:08:13\tSPEAKER_01\n Yeah, I just think- I just think- But, you know, it's like when you get into the graduate level, no problem.\n\n0:08:17\tSPEAKER_01\n I mean, I'm not saying access.\n\n0:08:18\tSPEAKER_01\n Yeah, that's what we're saying.\n\n0:08:19\tSPEAKER_01\n It's the same.\n\n0:08:20\tSPEAKER_03\n It's the same.\n\n0:08:21\tSPEAKER_03\n It's the same.\n\n0:08:22\tSPEAKER_03\n So that the habits are already burnt in.\n\n0:08:24\tSPEAKER_05\n Well, I think that- I think the only thing that we should say in the advertisement is that the meeting should be held in English.\n\n0:08:32\tSPEAKER_05\n Yeah.\n\n0:08:33\tSPEAKER_05\n And I think if it's a pre-existing meeting and it's held in English, I think it's probably okay if a few of the people don't have particularly good English skills.\n\n0:08:43\tSPEAKER_05\n Can I-\n\n0:08:44\tSPEAKER_01\n Can I say the other aspect of this from my perspective, which is that there's this- This issue you have a corpus out there it should be used for- for multiple things because it's so expensive to put together.\n\n0:08:54\tSPEAKER_01\n Right.\n\n0:08:55\tSPEAKER_01\n And if people want to approach- So I know- you know, this is the idea of computational linguistics and probabilistic grammars and all may not be the folks in this group.\n\n0:09:06\tSPEAKER_01\n But the idea of language models, which are fun, you know, generally speaking, you know, in terms of like the amount of benefit per dollar spent on our invested in preparing the data, if you have a choice between people who are more proficient in- more fluent, more close to being academic English, then it would seem to be a good thing.\n\n0:09:31\tSPEAKER_03\n I guess- Maybe.\n\n0:09:33\tSPEAKER_01\n Because otherwise you don't have the ability to have- so if you have a bunch of media like- that's the worst possible case.\n\n0:09:39\tSPEAKER_01\n If you have people who are using English as an interlanguage, because they don't- they can't speak in their native languages, but their interlanguage isn't really a match to any existing language model.\n\n0:09:52\tSPEAKER_01\n This is the worst case scenario.\n\n0:09:54\tSPEAKER_03\n Well, that's pretty much what you're going to have in the networking group.\n\n0:09:57\tSPEAKER_03\n Right?\n\n0:09:58\tSPEAKER_03\n Because the network group is almost entirely Germans and Spaniards.\n\n0:10:02\tSPEAKER_01\n But the thing is, I think that these people are of high enough level in their language proficiency.\n\n0:10:08\tSPEAKER_01\n And I'm not objecting to accents.\n\n0:10:09\tSPEAKER_01\n I'm just thinking that we have to think at a higher level view, could we have a language model, a grammar, a grammar basically, that would be a possibility?\n\n0:10:21\tSPEAKER_01\n So if you wanted to bring in a model like Dandjer asks you to model and do some top-down stuff to help up the bottom of the merge of the things or whatever, it seems like I don't see that there's an argument.\n\n0:10:33\tSPEAKER_01\n What I think is that why not have the corpus since it's so expensive to put together useful for the widest range of central corp things that people generally use corp-brough for and which are used in computational linguistics.\n\n0:10:47\tSPEAKER_01\n That's my point.\n\n0:10:48\tSPEAKER_01\n Okay.\n\n0:10:49\tSPEAKER_01\n So you include both top-down and bottom-up.\n\n0:10:51\tSPEAKER_01\n Okay.\n\n0:10:52\tSPEAKER_03\n Well, let's see what we can get.\n\n0:10:55\tSPEAKER_03\n I mean, I think that if we're aiming at groups of graduate students and professors, if they were talking about things together, and it's from the Berkeley campus, probably most of it.\n\n0:11:05\tSPEAKER_03\n Exactly.\n\n0:11:06\tSPEAKER_01\n And my point in my note to Liz was, I think, under graduate, are any iffy pocket-related for me to agree with that?\n\n0:11:12\tSPEAKER_00\n I mean, for this person.\n\n0:11:13\tSPEAKER_05\n Well, not to mention the fact that I would be hesitant, certainly, to take anyone under 18, probably even in anyone under 21.\n\n0:11:22\tSPEAKER_05\n So, what's that?\n\n0:11:23\tSPEAKER_05\n What's that?\n\n0:11:24\tSPEAKER_05\n Well, the 18 is because of the consent form.\n\n0:11:27\tSPEAKER_05\n We have to get to find their parent to sign for them.\n\n0:11:30\tSPEAKER_00\n That's true.\n\n0:11:31\tSPEAKER_00\n Yeah.\n\n0:11:32\tSPEAKER_00\n I have a question.\n\n0:11:33\tSPEAKER_00\n Well, Morgan, you were mentioning that Murray may not use the equipment from IBM if they found something else because...\n\n0:11:41\tSPEAKER_03\n Yeah, they're assessing whether they should do that or you do something else, hopefully, with the next few weeks.\n\n0:11:48\tSPEAKER_00\n Because I mean, one remote possibility is that if we inherited that equipment, if she weren't using it, could we set up a room in the linguistics department?\n\n0:11:57\tSPEAKER_00\n And maybe a lot more or in psych, or wherever, in another building where we could record people there.\n\n0:12:08\tSPEAKER_00\n I think we'd have a better chance with it.\n\n0:12:09\tSPEAKER_05\n I think we'd need a real motivated partner to do that.\n\n0:12:13\tSPEAKER_00\n Right.\n\n0:12:14\tSPEAKER_00\n We need to find someone on campus who is interested in this.\n\n0:12:16\tSPEAKER_00\n If there were such a...\n\n0:12:17\tSPEAKER_00\n I mean, it's a remote possibility, then one of us could go out there and record the media or something, rather than bring all of them down here.\n\n0:12:25\tSPEAKER_00\n So this is the...\n\n0:12:26\tSPEAKER_00\n Well, the other thing...\n\n0:12:27\tSPEAKER_00\n The end of not using.\n\n0:12:28\tSPEAKER_03\n Yeah, and the other thing that I was hoping to do in the first place was to turn it into some kind of portable thing.\n\n0:12:33\tSPEAKER_03\n Right.\n\n0:12:34\tSPEAKER_03\n So you could wheel it around.\n\n0:12:36\tNone\n But...\n\n0:12:37\tSPEAKER_05\n I know that space is really scarce on at least NCS, to actually find a room that we could use regularly might be very difficult.\n\n0:12:46\tSPEAKER_00\n You may not need a separate room.\n\n0:12:47\tSPEAKER_00\n That's true.\n\n0:12:48\tSPEAKER_00\n You know, if they have a meeting room and they can guarantee that the equipment will be safe and so forth, and if one of us is up there to record the meeting once a week,\n\n0:12:55\tSPEAKER_03\n or something. Yeah.\n\n0:12:57\tSPEAKER_03\n Well, maybe Janu, that is pretty good for now with the other person.\n\n0:12:59\tSPEAKER_00\n Yeah.\n\n0:13:00\tSPEAKER_00\n I think it's not out of the question.\n\n0:13:01\tSPEAKER_05\n Yeah.\n\n0:13:02\tSPEAKER_05\n Yeah, I think it would be interesting because then we could regularly get another meeting, another type of meeting.\n\n0:13:07\tSPEAKER_05\n Right.\n\n0:13:08\tSPEAKER_02\n Right.\n\n0:13:09\tSPEAKER_02\n I think you need another portable team, another portable equipment to do...\n\n0:13:15\tSPEAKER_02\n More easier the recording process out from next thing.\n\n0:13:21\tSPEAKER_02\n Right.\n\n0:13:22\tSPEAKER_02\n And probably I don't know.\n\n0:13:25\tSPEAKER_02\n If you want to record a seminar or a class in the university, it could be very difficult to put a lot of headphones.\n\n0:13:39\tSPEAKER_02\n Yeah, but...\n\n0:13:40\tSPEAKER_02\n If you want to record a recording with this kind of...\n\n0:13:45\tSPEAKER_05\n If we want to just record with the tabletop microphones, that's easy.\n\n0:13:49\tSPEAKER_05\n Right.\n\n0:13:50\tSPEAKER_05\n That's very easy, but that's not the corpus that we're collecting.\n\n0:13:53\tSPEAKER_03\n Actually, that's an interesting point that came up in our discussions.\n\n0:13:56\tSPEAKER_03\n Maybe we're through a meeting.\n\n0:13:58\tSPEAKER_03\n We realized that when we're talking about this, that, okay, there's these different things we want to do with it.\n\n0:14:03\tSPEAKER_03\n So it's true that we want to be selective in some ways, the way that you're speaking about with not having an interlingua and these other issues.\n\n0:14:13\tSPEAKER_03\n But on the other hand, it's not necessarily true that we need all of the corpus to satisfy all of it.\n\n0:14:19\tSPEAKER_03\n So, as for the example, that we want to have a fair amount that's done with a small...\n\n0:14:23\tSPEAKER_03\n We recorded with a small...\n\n0:14:25\tSPEAKER_03\n Tight number of types of meetings.\n\n0:14:27\tSPEAKER_03\n But we can also have another part that's just one or two meetings of each of a range of them.\n\n0:14:32\tSPEAKER_03\n That's okay, too.\n\n0:14:34\tSPEAKER_03\n We realized in discussion that the other thing is, what about this business of distant and close microphones?\n\n0:14:41\tSPEAKER_03\n I mean, we really want to have a substantial amount recorded this way.\n\n0:14:44\tSPEAKER_03\n That's what we did it.\n\n0:14:46\tSPEAKER_03\n But what about for these issues of summarization, a lot of these higher level things, you don't really need the distant microphone.\n\n0:14:53\tSPEAKER_00\n Right.\n\n0:14:54\tSPEAKER_00\n I mean, I don't really need the close microphone.\n\n0:14:56\tSPEAKER_00\n You actually don't really need any.\n\n0:14:58\tSPEAKER_00\n You just need some microphone somewhere.\n\n0:15:00\tSPEAKER_00\n You can use a found data.\n\n0:15:02\tSPEAKER_00\n You can.\n\n0:15:03\tSPEAKER_00\n I mean, I can use a found data.\n\n0:15:05\tSPEAKER_00\n But I think that any data that we spend a lot of effort to collect, each person who's interested, we have a bunch of different slants and perspectives on what it's useful for, they need to be taking charge and making sure they're getting enough of the kind of data that they want.\n\n0:15:23\tSPEAKER_00\n Right.\n\n0:15:24\tSPEAKER_00\n And so, in my case, I think there's enough data for some kinds of projects and not enough of any other projects.\n\n0:15:30\tSPEAKER_00\n So I'm looking and thinking, well, I'd be glad to walk over and record people and go forward to help my interest.\n\n0:15:36\tSPEAKER_00\n And other people need to do that for themselves.\n\n0:15:39\tSPEAKER_00\n Right.\n\n0:15:40\tSPEAKER_00\n So that discusses that we can find some optimal.\n\n0:15:42\tSPEAKER_03\n But I think I'm raising that because I think it's relevant exactly for this idea up there that if you think about, well, gee, we have this really complicated setup to do.\n\n0:15:48\tSPEAKER_03\n Well, maybe you don't.\n\n0:15:50\tSPEAKER_03\n Maybe if really all you want is to have a recording that's good enough to get a transcription from later, you just need to grab a tape recorder and go up and make a recording.\n\n0:16:01\tSPEAKER_03\n I mean, we could have a fairly, we could just go to that machine.\n\n0:16:04\tSPEAKER_00\n Well, I agree with Jane, though on the other hand, that that may be true.\n\n0:16:07\tSPEAKER_00\n You may say, for instance, summarization or something that sounds very language oriented.\n\n0:16:13\tSPEAKER_00\n You may say, well, oh yeah, you just do that from transcripts of a radio show.\n\n0:16:16\tSPEAKER_00\n I mean, you don't even need to miss speech.\n\n0:16:18\tSPEAKER_00\n But what I was thinking is long-term, what would be needed to be able to pick up on, I suppose you just had a distant microphone there and you really wanted to be able to determine this.\n\n0:16:30\tSPEAKER_00\n There's lots of cues you're not going to have.\n\n0:16:32\tSPEAKER_00\n So I do think that long-term, you should always try to satisfy the greatest number of interest and have this parallel information, which is really what makes this special powerful.\n\n0:16:42\tSPEAKER_00\n Otherwise, you know, lots of other sites can propose.\n\n0:16:45\tSPEAKER_03\n I agree.\n\n0:16:46\tSPEAKER_03\n So.\n\n0:16:47\tSPEAKER_03\n But I think that the, we can't really underestimate the difficulty.\n\n0:16:52\tSPEAKER_03\n It shouldn't really underestimate the difficulty of getting a set of like this up.\n\n0:16:57\tSPEAKER_03\n And so it took quite a while to get that together and to say, oh, we'll just do it up there.\n\n0:17:01\tSPEAKER_03\n If you're talking about something simple, we throw away a lot of these dimensions, then you can do that right away.\n\n0:17:06\tSPEAKER_03\n I'm talking about something that has all of these different facets that we have here.\n\n0:17:10\tSPEAKER_03\n It won't happen quickly.\n\n0:17:11\tSPEAKER_03\n It won't be easy.\n\n0:17:12\tSPEAKER_03\n And there's all sorts of issues about keeping the equipment safe or else, hauling it around and all sorts of things.\n\n0:17:17\tSPEAKER_00\n So then we'll try to bring people here.\n\n0:17:19\tSPEAKER_03\n I think your first priority should be to try to get people to come here.\n\n0:17:23\tSPEAKER_03\n We're set up for it.\n\n0:17:24\tSPEAKER_03\n The room is really underused.\n\n0:17:26\tSPEAKER_03\n I thought the free lunch idea was a great idea.\n\n0:17:30\tSPEAKER_05\n Yeah, I felt so too.\n\n0:17:31\tSPEAKER_00\n Free lunch is good.\n\n0:17:32\tSPEAKER_00\n I think we can get people to come here, but the issue is you definitely want to make sure that the kind of group that you're getting is the right groups that you don't waste a lot of your time in the overhead of bringing people down.\n\n0:17:42\tSPEAKER_04\n No crunchy food.\n\n0:17:43\tSPEAKER_00\n Well, I was thinking lunch afterwards, right?\n\n0:17:46\tSPEAKER_00\n And they have to do their digits.\n\n0:17:47\tSPEAKER_03\n Yeah, they have to do their digits or they don't get their food.\n\n0:17:52\tSPEAKER_05\n I spoke with some people up at Hoss Business School who volunteered.\n\n0:17:55\tSPEAKER_05\n Should I pursue that?\n\n0:17:56\tSPEAKER_00\n Oh, definitely.\n\n0:17:57\tSPEAKER_05\n Yeah.\n\n0:17:58\tSPEAKER_05\n So they originally, they've decided not to go into speech.\n\n0:18:02\tSPEAKER_05\n So I'm not sure whether they'll still be so willing to volunteer, but all of a sudden we're about the free lunch.\n\n0:18:06\tSPEAKER_05\n I'll tell them about the free lunch.\n\n0:18:07\tSPEAKER_05\n And they'll say there's no such thing.\n\n0:18:09\tSPEAKER_00\n I'd love to get people that are not linguists or engineers.\n\n0:18:12\tSPEAKER_00\n Right.\n\n0:18:13\tSPEAKER_00\n They need a wider sampling.\n\n0:18:20\tSPEAKER_05\n The problem with engineers is be.\n\n0:18:28\tSPEAKER_03\n They make funny sounds.\n\n0:18:29\tSPEAKER_03\n The other thing is that we're talking about is giving them a burn and extra CD run and give them.\n\n0:18:37\tSPEAKER_00\n So if they want an audio record up there, I thought he meant giving them a music CD.\n\n0:18:42\tSPEAKER_00\n I guess it depends on what audience you're talking to.\n\n0:18:47\tSPEAKER_00\n I personally would not want to see my meeting.\n\n0:18:51\tSPEAKER_00\n But maybe.\n\n0:18:52\tSPEAKER_03\n If you're having some planning meeting of some sort, it would just be fun if nothing else.\n\n0:18:58\tSPEAKER_03\n But it also I think builds up towards the goal.\n\n0:19:02\tSPEAKER_03\n We're saying, look, you're going to get this.\n\n0:19:03\tSPEAKER_03\n Isn't that neat?\n\n0:19:04\tSPEAKER_03\n Then you're going to go home with it.\n\n0:19:05\tSPEAKER_03\n It's probably going to be pretty useless to do.\n\n0:19:08\tSPEAKER_03\n But you'll appreciate where it's useful and where it's useless.\n\n0:19:11\tSPEAKER_03\n And then we're going to move this technology so it'll become useful.\n\n0:19:14\tSPEAKER_00\n I think that's a great idea, actually.\n\n0:19:16\tSPEAKER_04\n What if you could tell in the award and send it to the transcripts when they come back?\n\n0:19:20\tSPEAKER_04\n Oh, yeah.\n\n0:19:21\tSPEAKER_05\n Really anyone can have the transcripts.\n\n0:19:23\tSPEAKER_05\n So I have to add a good point to that.\n\n0:19:25\tSPEAKER_01\n So you can see what's it concerned about doing, given the CD immediately, because of these issues of this kind of stuff.\n\n0:19:33\tSPEAKER_01\n Good point.\n\n0:19:35\tSPEAKER_01\n That's a very good point.\n\n0:19:36\tSPEAKER_01\n So we can.\n\n0:19:37\tSPEAKER_01\n So we can.\n\n0:19:38\tSPEAKER_01\n Right.\n\n0:19:42\tSPEAKER_00\n That's right.\n\n0:19:43\tSPEAKER_00\n That's the same thing that we just reviewed publicly, right?\n\n0:19:45\tSPEAKER_00\n Right.\n\n0:19:46\tSPEAKER_01\n Otherwise, you're not allowed to go or like you're not allowed to go up or anyone.\n\n0:19:48\tSPEAKER_01\n So after the transcripts screen phase.\n\n0:19:50\tSPEAKER_01\n Yeah, that's true.\n\n0:19:51\tSPEAKER_01\n Otherwise we need to do lawyer's day.\n\n0:19:52\tSPEAKER_01\n Yeah, it's right.\n\n0:19:53\tSPEAKER_01\n You say, yeah, I got the CD and your honor, I.\n\n0:19:59\tSPEAKER_00\n That's a good point.\n\n0:20:02\tSPEAKER_03\n Yeah, so let's start with Haaz.\n\n0:20:04\tSPEAKER_00\n Sorry, I have to leave.\n\n0:20:05\tSPEAKER_00\n I will be your full time.\n\n0:20:07\tSPEAKER_05\n Okay, see you.\n\n0:20:08\tNone\n Okay.\n\n0:20:09\tSPEAKER_06\n Yeah.\n\n0:20:10\tNone\n Sorry.\n\n0:20:11\tSPEAKER_06\n See you.\n\n0:20:12\tSPEAKER_06\n Okay.\n\n0:20:13\tSPEAKER_06\n So, let's see.\n\n0:20:14\tSPEAKER_03\n So that was that topic.\n\n0:20:18\tSPEAKER_03\n And then I guess another topic would be where are we in the whole disc resources question for?\n\n0:20:30\tSPEAKER_05\n We are slowly, slowly getting to the point where we have enough room to record meetings.\n\n0:20:36\tSPEAKER_05\n So I did a bunch of archiving and still doing a bunch of archiving.\n\n0:20:40\tSPEAKER_05\n I am in the midst of doing the P files from broadcast news and it took 11 hours to copy it and it will take another 11 to do the clone.\n\n0:20:51\tSPEAKER_05\n Well, it's Abbott.\n\n0:20:53\tSPEAKER_05\n It's Abbott, so it's just, but it's a lot of data.\n\n0:20:56\tSPEAKER_03\n It's copying from one place to another place to another place to another place.\n\n0:20:58\tSPEAKER_03\n Tape.\n\n0:20:59\tSPEAKER_03\n Oh, I did not want to tape.\n\n0:21:01\tSPEAKER_05\n So I'm archiving it and then I'm going to delete the files.\n\n0:21:03\tSPEAKER_05\n So that will give us 10 gigabytes of free space.\n\n0:21:06\tSPEAKER_05\n We are archiving for a long time.\n\n0:21:09\tSPEAKER_05\n And so that will be done in about two hours and so at that point we will be able to record five more meetings.\n\n0:21:17\tSPEAKER_05\n So.\n\n0:21:18\tSPEAKER_01\n One thing the good news about that is that once it's archived it's pretty quick to get back.\n\n0:21:22\tSPEAKER_01\n I mean, the other options fast, but the instructions are really slow.\n\n0:21:25\tSPEAKER_05\n Well, especially because I'm generating a clone also.\n\n0:21:27\tSPEAKER_05\n Yeah.\n\n0:21:28\tSPEAKER_05\n Okay.\n\n0:21:29\tSPEAKER_05\n And it takes a while.\n\n0:21:30\tSPEAKER_05\n Generating a clone?\n\n0:21:31\tSPEAKER_05\n Two copies.\n\n0:21:32\tSPEAKER_05\n Right.\n\n0:21:33\tSPEAKER_01\n Oh.\n\n0:21:34\tSPEAKER_01\n Now, what about is the plan to, so stuff will be saved.\n\n0:21:39\tSPEAKER_01\n It's just that you're relocating it.\n\n0:21:40\tSPEAKER_05\n I mean, so we're going to get more disk space or did I know that these are the P files from broadcast news, which are regeneratable, regeneratable, if we really need to, but we have a lot of them.\n\n0:21:52\tSPEAKER_05\n And for the full 140 hour sets.\n\n0:21:56\tSPEAKER_05\n And so they were two gigabytes per file and we had six of them or something.\n\n0:22:02\tSPEAKER_03\n We are getting my space.\n\n0:22:03\tSPEAKER_03\n We are getting another disk rack and 436 gigabyte disks.\n\n0:22:09\tSPEAKER_03\n So, but that's not going to happen in some time.\n\n0:22:13\tSPEAKER_03\n Or maybe six.\n\n0:22:14\tSPEAKER_05\n Maybe six?\n\n0:22:15\tSPEAKER_05\n The sun takes more disks than the Andataco one did.\n\n0:22:19\tSPEAKER_05\n The sun rack takes.\n\n0:22:23\tSPEAKER_05\n One took four and one took six or maybe it was eight and twelve.\n\n0:22:26\tSPEAKER_05\n Whatever it was, it was, you know, 50 percent more.\n\n0:22:28\tSPEAKER_05\n Was there a difference in price?\n\n0:22:30\tSPEAKER_05\n Well, what happened is that we bought all our racks and disks from Andataco for years according to Dave.\n\n0:22:35\tSPEAKER_05\n And Andataco got bought by another company and doubled their prices.\n\n0:22:39\tSPEAKER_05\n And so we're looking into other vendors.\n\n0:22:42\tSPEAKER_05\n By we, of course, I mean Dave.\n\n0:22:44\tSPEAKER_04\n So, I've been looking at the Aurora data.\n\n0:22:50\tSPEAKER_04\n And first, first look at it, there were basically three directories on there that could be moved.\n\n0:22:59\tSPEAKER_04\n One was called Aurora.\n\n0:23:00\tSPEAKER_04\n One was Spanish, which was Carmen Spanish stuff.\n\n0:23:03\tSPEAKER_04\n And the other one was Spine.\n\n0:23:06\tSPEAKER_04\n And so I wrote to Dan and he was very concerned that the Spine stuff was moving to a non-backed up disk.\n\n0:23:15\tSPEAKER_04\n So I realized that what probably not all of that should be moved just the CD-ROM type data, the static data.\n\n0:23:24\tSPEAKER_04\n So I moved that and then I asked him to check out and see if it was okay for I actually deleted the old stuff, but I haven't heard back.\n\n0:23:32\tSPEAKER_04\n I told him he could delete it if he wanted.\n\n0:23:33\tSPEAKER_04\n I haven't checked today to see if he's deleted it or not.\n\n0:23:36\tSPEAKER_04\n And then Carmen's stuff, I realized that when I had copied all of her stuff to XA, I had copied stuff there that was dynamic data.\n\n0:23:44\tSPEAKER_04\n And so I had to redo that one and just copy over the static data.\n\n0:23:48\tSPEAKER_04\n And so I need to get with her now and delete the old stuff off of the disk.\n\n0:23:51\tSPEAKER_04\n And then I looked, haven't done any of the Aurora stuff.\n\n0:23:53\tSPEAKER_04\n I have to meet with Stefan to do that.\n\n0:23:57\tSPEAKER_03\n So but you're figuring you can record in other five meetings or something with the space that you're clearing up from broadcast news.\n\n0:24:04\tSPEAKER_03\n But we have some other disks, some of which you're using for Aurora, but do we have some other?\n\n0:24:11\tSPEAKER_03\n Yep.\n\n0:24:12\tSPEAKER_05\n So we have space on the current disk right now where Meeting Recorder is.\n\n0:24:17\tSPEAKER_05\n And that's probably enough for about four meetings.\n\n0:24:19\tSPEAKER_05\n Yeah.\n\n0:24:20\tSPEAKER_05\n Is that the one that has, is that DC?\n\n0:24:21\tSPEAKER_05\n Yep.\n\n0:24:22\tSPEAKER_05\n Okay.\n\n0:24:23\tSPEAKER_05\n No, no.\n\n0:24:24\tSPEAKER_05\n Well, to wherever the Meeting Recorder currently is, I think it's DI.\n\n0:24:26\tSPEAKER_05\n Okay, but I don't remember.\n\n0:24:28\tSPEAKER_04\n I'm moving from Aurora's on the DC disk that we, I think it's DC.\n\n0:24:31\tSPEAKER_05\n It's whatever that one is.\n\n0:24:32\tSPEAKER_05\n Okay.\n\n0:24:33\tSPEAKER_05\n I just don't remember it.\n\n0:24:34\tSPEAKER_05\n It might be DC.\n\n0:24:35\tSPEAKER_05\n And that has enough room for about former meetings right now.\n\n0:24:37\tSPEAKER_05\n I mean, we were at 100% and then we dropped down to 86 for reasons I don't understand.\n\n0:24:43\tSPEAKER_05\n Someone deleted something somewhere.\n\n0:24:44\tSPEAKER_05\n And so we have some room again.\n\n0:24:46\tSPEAKER_05\n And then with the broadcast news, that's five or six more meetings.\n\n0:24:49\tSPEAKER_05\n So you know, we have a couple of weeks.\n\n0:24:52\tSPEAKER_05\n So I think we're okay until we get the new disk.\n\n0:24:55\tSPEAKER_04\n So should, one question I had for you was, we need, we probably should move the Aurora and all that other stuff off of the Meeting Recorder disk.\n\n0:25:08\tSPEAKER_04\n Is there another backed up disk that you know of?\n\n0:25:11\tSPEAKER_05\n We should put it onto the broadcast news one.\n\n0:25:13\tSPEAKER_05\n That's probably the best thing to do.\n\n0:25:15\tSPEAKER_05\n And that way we can solidate Meeting Recorder onto one disk rather than spreading the mic.\n\n0:25:18\tSPEAKER_04\n Do you know what happened to know what disk guy is on?\n\n0:25:20\tSPEAKER_05\n Nope.\n\n0:25:21\tSPEAKER_05\n I mean, I can tell you I just don't know off the top of my head.\n\n0:25:23\tSPEAKER_05\n I'll find out for that.\n\n0:25:24\tSPEAKER_05\n We could just do that at the end of today once the archive is complete and I verified it.\n\n0:25:29\tSPEAKER_05\n Okay.\n\n0:25:30\tSPEAKER_05\n Is that what gives us plenty of disk?\n\n0:25:33\tSPEAKER_03\n Okay.\n\n0:25:34\tSPEAKER_03\n So then I guess the last thing I had in my agenda was to just hear her not paid on what Jose has been doing.\n\n0:25:43\tSPEAKER_03\n Okay.\n\n0:25:44\tSPEAKER_02\n I have the result of my work during the last days.\n\n0:25:49\tSPEAKER_02\n Thank you for the information because I read the last days.\n\n0:25:54\tSPEAKER_02\n I work in my house in the database and thinking within a different thing about the Meeting Recorder project.\n\n0:26:03\tSPEAKER_02\n And I have some ideas.\n\n0:26:05\tSPEAKER_02\n This information is very useful because you have the distribution.\n\n0:26:10\tSPEAKER_02\n For me, it's interesting because here is the demonstration of the overlap problem.\n\n0:26:19\tSPEAKER_02\n It's a real problem, a frequently problem because you have overlapping sums all the time.\n\n0:26:29\tSPEAKER_02\n By the moment I have the IDETA mark all the overlap zone in the Meeting Recorder with a set mark.\n\n0:26:39\tSPEAKER_05\n Oh, you did that by hand.\n\n0:26:41\tSPEAKER_05\n That's a jet.\n\n0:26:43\tSPEAKER_02\n Can I see that?\n\n0:26:44\tSPEAKER_02\n Yeah, but I can't because why?\n\n0:26:48\tSPEAKER_02\n My idea is to work.\n\n0:26:50\tSPEAKER_02\n I don't know if it will be possible because I have enough time to work on this as you know.\n\n0:27:02\tSPEAKER_02\n But my idea is very interesting to work in the line of automatic segment.\n\n0:27:10\tSPEAKER_02\n But in my opinion, we need a reference session.\n\n0:27:16\tSPEAKER_05\n Yes, absolutely.\n\n0:27:17\tSPEAKER_05\n So are you planning to do that or have you done that already?\n\n0:27:21\tSPEAKER_05\n No, sorry.\n\n0:27:22\tSPEAKER_05\n Have you done that or are you planning to do that?\n\n0:27:25\tSPEAKER_02\n No, I plan to do that.\n\n0:27:27\tSPEAKER_02\n Okay, I plan.\n\n0:27:28\tSPEAKER_02\n I plan.\n\n0:27:29\tSPEAKER_02\n But the idea is the following.\n\n0:27:33\tSPEAKER_02\n Now I need to delete all the overlapping sums exactly.\n\n0:27:39\tSPEAKER_02\n I will talk about the in the in the lab.\n\n0:27:44\tSPEAKER_02\n This information with the exactly time marks for the overlapping sums.\n\n0:27:54\tSPEAKER_02\n Overlapping zone and speaker, pure speech, speaker, song.\n\n0:28:00\tSPEAKER_02\n I mean, songs of speech of one speaker without any noise, any acoustic event that is not speech.\n\n0:28:13\tSPEAKER_02\n I need to do a silence for that because my idea is to study the set of parameters.\n\n0:28:25\tSPEAKER_02\n What are more discriminant to classify the overlapping sounds in comparison with the speech sounds.\n\n0:28:35\tSPEAKER_02\n The idea is to use a not sure yet, but my idea is to use a cluster algorithms or a PerseStron neural nets to study what is the property of the different feature to classify speech and overlapping speech.\n\n0:28:59\tSPEAKER_02\n My idea is to have a control set.\n\n0:29:05\tSPEAKER_02\n My control set will be the silence, silent without any noise.\n\n0:29:11\tSPEAKER_01\n Which means that we still use the different sounds.\n\n0:29:14\tSPEAKER_01\n With the backgrounds.\n\n0:29:15\tSPEAKER_02\n I mean noise, clubs, tape, clips, the difference.\n\n0:29:24\tSPEAKER_02\n Which has a hard effect of the distortion in the.\n\n0:29:32\tSPEAKER_05\n So you intend to hand mark those and exclude them?\n\n0:29:36\tSPEAKER_02\n I have mark in that not in all the file.\n\n0:29:41\tSPEAKER_02\n Only I have a, I don't remember what is the quantity, but I have marked enough speech and all the overlapping sounds.\n\n0:29:55\tSPEAKER_02\n I have 230 more or less overlapping sounds and it is similar to this information.\n\n0:30:03\tSPEAKER_02\n Because with the problem I cross the information of the gene with my experimentation by hand.\n\n0:30:11\tSPEAKER_02\n And it is more similar.\n\n0:30:14\tSPEAKER_02\n Exactly.\n\n0:30:15\tSPEAKER_02\n But, sorry.\n\n0:30:25\tSPEAKER_02\n My idea is to.\n\n0:30:32\tSPEAKER_05\n I should get digital camera.\n\n0:30:35\tSPEAKER_02\n To classify.\n\n0:30:37\tSPEAKER_02\n I need the set mark of the different sound because I want to put for each frame a level indicating it's a supervised and a class in process.\n\n0:30:53\tSPEAKER_02\n I put for each frame a level indicating what is the type, what is the class which belong.\n\n0:31:07\tSPEAKER_02\n I mean the class overlapping speech, the class speech.\n\n0:31:22\tSPEAKER_04\n And the class will be assigned by hand based on the.\n\n0:31:28\tSPEAKER_02\n I put the mark by hand because my idea is in the first session.\n\n0:31:33\tSPEAKER_02\n I need to be sure that information can be in validation.\n\n0:31:41\tSPEAKER_02\n Sure.\n\n0:31:42\tSPEAKER_02\n It's right because if not I will return to the speech file to analyze what is the problem.\n\n0:31:51\tSPEAKER_02\n And I would prefer to have this level automatically.\n\n0:31:56\tSPEAKER_02\n You need to.\n\n0:31:58\tSPEAKER_01\n I ask you the difference between the top two.\n\n0:32:06\tSPEAKER_01\n By speech do you mean one person only?\n\n0:32:10\tSPEAKER_01\n One, two, three.\n\n0:32:12\tSPEAKER_01\n One, two, three.\n\n0:32:13\tSPEAKER_01\n One speaker in a breath overlapping.\n\n0:32:17\tSPEAKER_01\n Someone else in the back.\n\n0:32:19\tSPEAKER_01\n By the moment.\n\n0:32:20\tSPEAKER_01\n Clicking overlapping speech.\n\n0:32:21\tSPEAKER_02\n That's all those possibilities in the top.\n\n0:32:24\tSPEAKER_02\n In the first moment because I have information of the overlapping sounds.\n\n0:32:31\tSPEAKER_02\n Information about the overlapping sound is from speech, clear speech from a true speaker or three speaker.\n\n0:32:40\tSPEAKER_02\n It's a song where the impregnance of a speaker overlaps onto a speech.\n\n0:32:46\tSPEAKER_01\n A speech with something overlapping which could be speech but doesn't need to be.\n\n0:32:52\tSPEAKER_02\n You know, especially overlapping speech from different speakers.\n\n0:32:57\tSPEAKER_03\n No, but I think she's saying where do you in these three categories?\n\n0:33:01\tSPEAKER_03\n Where do you put the instances in which there is one person speaking and other sounds which are not speech?\n\n0:33:11\tSPEAKER_02\n Which category do you put that?\n\n0:33:14\tSPEAKER_02\n Here I put a speech from one speaker without any events.\n\n0:33:24\tSPEAKER_03\n So where do you put speech from one speaker that does have a non-speech event at the same time?\n\n0:33:30\tSPEAKER_02\n Which category?\n\n0:33:31\tSPEAKER_02\n Which category?\n\n0:33:32\tSPEAKER_02\n No, by the moment no.\n\n0:33:33\tSPEAKER_02\n Oh, you see, not marked.\n\n0:33:35\tSPEAKER_02\n No, not marked.\n\n0:33:36\tSPEAKER_02\n Because I want to meet the study.\n\n0:33:41\tSPEAKER_02\n Fine, so even for the all of the data.\n\n0:33:44\tSPEAKER_01\n So you're ignoring overlapping events unless their speech was speech.\n\n0:33:48\tSPEAKER_02\n Yeah, that's fine.\n\n0:33:49\tSPEAKER_02\n Why?\n\n0:33:50\tSPEAKER_02\n What's the reason?\n\n0:33:51\tSPEAKER_02\n Because it's the first study.\n\n0:33:53\tSPEAKER_02\n Oh, no, no.\n\n0:33:54\tSPEAKER_03\n It's perfectly sensible way to go.\n\n0:33:56\tSPEAKER_03\n We just wanted to try and understand what you're doing.\n\n0:33:58\tSPEAKER_01\n Because you've talked about other overlapping events in the past.\n\n0:34:00\tSPEAKER_02\n So in the future, the idea is to extend the class.\n\n0:34:06\tSPEAKER_02\n Is to consider all the information you mentioned.\n\n0:34:08\tSPEAKER_03\n Yeah, I don't think we're asking for that.\n\n0:34:10\tSPEAKER_02\n I don't know what we would have.\n\n0:34:16\tSPEAKER_04\n Is your silence category pure silence or?\n\n0:34:19\tSPEAKER_02\n Is there a door slammer?\n\n0:34:21\tSPEAKER_04\n No, no, it's pure silence.\n\n0:34:23\tSPEAKER_02\n Is the control set?\n\n0:34:24\tSPEAKER_02\n OK.\n\n0:34:24\tSPEAKER_02\n Is the control set?\n\n0:34:26\tSPEAKER_03\n What you will be silent with the majority of the world.\n\n0:34:30\tSPEAKER_03\n I think what you mean is that it's non-speech segments that don't have impulsive noises, right?\n\n0:34:36\tSPEAKER_03\n Because what you're calling a vent is somebody coughing or clicking a wrestling paper or hitting something, which are impulsive noises.\n\n0:34:45\tSPEAKER_03\n But steady state noises are part of the background, which it will be included in that.\n\n0:34:50\tSPEAKER_02\n Right?\n\n0:34:51\tSPEAKER_02\n Here.\n\n0:34:52\tSPEAKER_01\n Yeah.\n\n0:34:53\tSPEAKER_02\n So it's like a signal noise.\n\n0:34:54\tSPEAKER_02\n I think there are some kind of noises that don't water to be in that control set.\n\n0:35:02\tSPEAKER_02\n But I prefer the silence with this kind or the off.\n\n0:35:09\tSPEAKER_03\n Right.\n\n0:35:10\tSPEAKER_03\n It means background might be better word than silence.\n\n0:35:12\tSPEAKER_03\n It's just sort of the background of the acoustic.\n\n0:35:15\tSPEAKER_03\n Right.\n\n0:35:16\tSPEAKER_02\n So it's only going on.\n\n0:35:18\tSPEAKER_02\n OK.\n\n0:35:19\tSPEAKER_02\n And with this information, the idea is I have a level for each friend.\n\n0:35:29\tSPEAKER_02\n And with a cluster algorithms, I am sorry.\n\n0:35:35\tSPEAKER_02\n And I am going to prepare a set of features, a structure, molds.\n\n0:35:47\tSPEAKER_02\n Right.\n\n0:35:48\tSPEAKER_02\n And maybe it's, tell me whatever.\n\n0:36:00\tSPEAKER_02\n So I have a pitch structure yet.\n\n0:36:06\tSPEAKER_02\n I have to test.\n\n0:36:07\tSPEAKER_02\n But you have your own?\n\n0:36:08\tSPEAKER_02\n Yeah.\n\n0:36:09\tSPEAKER_02\n Yeah.\n\n0:36:10\tSPEAKER_02\n I have to prepare.\n\n0:36:11\tSPEAKER_02\n It's a modified version of a pitch tracker from a Stanford universe.\n\n0:36:16\tSPEAKER_02\n Stanford, no, from Cambridge.\n\n0:36:20\tSPEAKER_02\n Oh, what's it really?\n\n0:36:23\tSPEAKER_02\n I don't remember what is the name of the author.\n\n0:36:25\tSPEAKER_02\n Because I have several library tools from a festival, from Edinburgh, from Cambridge, and from our department.\n\n0:36:38\tSPEAKER_02\n And I have to, because in general, the pitch tracker, that's a waste.\n\n0:36:43\tSPEAKER_05\n Right.\n\n0:36:44\tSPEAKER_05\n Very well.\n\n0:36:45\tSPEAKER_05\n Because the feature it might be OK.\n\n0:36:47\tSPEAKER_05\n Yeah.\n\n0:36:48\tSPEAKER_02\n So we don't know.\n\n0:36:49\tSPEAKER_02\n This is an idea is to attain, for example, a different, a grid number of emphesies, for example, 25, 30, 30 parameter for each one.\n\n0:37:10\tSPEAKER_02\n In the first step in the research, my idea is try to prove what is the performance of the difference parameter to classify the difference, what is the performance approach to classify the difference frames of each class.\n\n0:37:34\tSPEAKER_02\n What is the error about it?\n\n0:37:40\tSPEAKER_02\n This is the first idea.\n\n0:37:42\tSPEAKER_02\n And the second is try to use some ideas similar to the linear discriminant analysis.\n\n0:37:54\tSPEAKER_02\n Similar.\n\n0:37:55\tSPEAKER_02\n Because the idea is to study what is the contribution of each parameter to the process of classify the different parameter.\n\n0:38:07\tSPEAKER_02\n What sort of classifier?\n\n0:38:09\tSPEAKER_02\n The classifier, by the moment, is a similar classifier used in Victoria, Quantified, is used to some distance to put a vector in a class difference.\n\n0:38:28\tSPEAKER_05\n Unimodal?\n\n0:38:29\tSPEAKER_05\n So is it just one cluster?\n\n0:38:30\tSPEAKER_02\n It's only two clusters using a Kinear SNF or similar.\n\n0:38:37\tSPEAKER_02\n Another possibility is to use a neural network.\n\n0:38:42\tSPEAKER_02\n But what is my idea?\n\n0:38:45\tSPEAKER_02\n What is the problem?\n\n0:38:46\tSPEAKER_02\n I see.\n\n0:38:47\tSPEAKER_02\n If you use the neural network.\n\n0:38:52\tSPEAKER_02\n And this kind of cluster inaugurated to can test to can a share of what happened.\n\n0:39:00\tSPEAKER_02\n You can't analyze it.\n\n0:39:03\tSPEAKER_02\n Right.\n\n0:39:04\tSPEAKER_02\n You can't analyze it.\n\n0:39:05\tSPEAKER_02\n You use a neural network, a good idea.\n\n0:39:08\tSPEAKER_02\n But you don't know what happened in the interior of the neural network.\n\n0:39:12\tSPEAKER_03\n Well, actually, you can do sensitivity analyses, which show you what the importance of different parts of pieces input are.\n\n0:39:22\tSPEAKER_03\n What's going on internally?\n\n0:39:25\tSPEAKER_03\n But it's actually not that hard to analyze it and figure out the effects of different inputs, especially if they're all normalized.\n\n0:39:32\tSPEAKER_05\n Well, using something simpler first, I think.\n\n0:39:35\tSPEAKER_03\n Well, if you really wonder what different...\n\n0:39:37\tSPEAKER_03\n Decision tree.\n\n0:39:38\tSPEAKER_03\n Yeah, then, it's decision tree is really good.\n\n0:39:40\tSPEAKER_03\n But the thing is, he's not like he has one, a bunch of very distinct variables like pitch and this, he's talking about all these capture all coefficients.\n\n0:39:48\tSPEAKER_03\n So for the much case, any reasonable classifier is going to be a mess.\n\n0:39:52\tSPEAKER_03\n Right.\n\n0:39:53\tSPEAKER_03\n It's going to be hard to figure out what...\n\n0:39:54\tSPEAKER_02\n I would include you to the differential.\n\n0:39:57\tSPEAKER_02\n Yeah, that would be...\n\n0:39:58\tSPEAKER_03\n I mean, I think the other thing, I mean, this is, I think, a good thing to do to sort of look at these things at least.\n\n0:40:03\tSPEAKER_03\n See what...\n\n0:40:04\tSPEAKER_03\n Let me tell you what I would do.\n\n0:40:05\tSPEAKER_03\n I would take just a few features.\n\n0:40:06\tSPEAKER_03\n Instead of taking all the MFCCs or all the EPLPs or whatever, I would just take a couple.\n\n0:40:12\tSPEAKER_03\n Okay, like C1, C2, something like that, so that you can visualize it.\n\n0:40:16\tSPEAKER_03\n And look at these different examples and look at scatter plots.\n\n0:40:19\tSPEAKER_03\n Okay, so before you build up any kind of fancy classifiers, just take a look in two dimensions at how these things are split apart.\n\n0:40:27\tSPEAKER_03\n That I think will give you a lot of insight of what is likely to be a useful feature when you put it to a more complicated classifier.\n\n0:40:33\tSPEAKER_03\n Yeah.\n\n0:40:34\tSPEAKER_03\n And the second thing is, once you actually get to the point of building these classifiers, what this lacks so far is the temporal properties.\n\n0:40:41\tSPEAKER_03\n So if you're just looking at a frame at a time, you don't know anything about the structure of it over time.\n\n0:40:46\tSPEAKER_03\n And so you may want to build a mark off a model of some sort or else have features that really are based on some bigger chunk of time.\n\n0:40:57\tSPEAKER_03\n But I think this is a good place to start.\n\n0:40:59\tSPEAKER_03\n But don't...\n\n0:41:00\tSPEAKER_03\n Anyway, this is my suggestion.\n\n0:41:01\tSPEAKER_03\n Don't just throw in 20 features at it, the delta is in the delta, and all that into some classifier, even if it's K-nearest neighbors, you still won't know what it's doing.\n\n0:41:10\tSPEAKER_03\n You know it's not an Earl Matt.\n\n0:41:12\tSPEAKER_03\n I think to know what it's...\n\n0:41:13\tSPEAKER_03\n Have a better feeling for what it's doing, you want to look at it.\n\n0:41:15\tSPEAKER_03\n So you want to look at some picture that shows you, here's these things are offered some separation.\n\n0:41:23\tSPEAKER_03\n And in LPC, the thing that particularly look at is, I think, is something like the residual, the energy and the residual.\n\n0:41:33\tSPEAKER_01\n Can I ask, it strikes me that there's another piece of information that might be useful, and that's simply the transition.\n\n0:41:41\tSPEAKER_01\n So if you go from a transition of silence to overlap versus transition from silence to speech, it's going to be a big informative area there, it seems to be.\n\n0:41:49\tSPEAKER_02\n But it's my ambition of the project.\n\n0:41:57\tSPEAKER_02\n The meeting record project for me has a two, several parts, an adjective because it's a good thing to do.\n\n0:42:06\tSPEAKER_02\n At the first, in the acoustic parts of the project, I think we have two main adjectives.\n\n0:42:16\tSPEAKER_02\n One of these is to detect the chain, the acoustic chain.\n\n0:42:22\tSPEAKER_02\n For that, if you don't use a speech recognizer, a pro-class or not pro-class, to try to level the different friends, I think the Ike criterion, or big criterion, will be enough to detect the chain.\n\n0:42:43\tSPEAKER_02\n And probably, I would like to prove.\n\n0:42:47\tSPEAKER_02\n Probably, when you have the transition of speech or silence to overlap song, this criterion is enough with probably with this kind of, the more use a regular parameter, NCC, you have to find, you can find the mark, you can find the good chain.\n\n0:43:17\tSPEAKER_02\n But I understand that your adjective is too classified, to know that that song is not only a new song in the file, but you have to know that it is an overlap song because in the future, you will try to process that song with a no-regular speech recognizer, you will pretend to process the overlapping song with another claim, because it is very difficult to obtain the trackition from using a regular, normal speech recognizer.\n\n0:44:04\tSPEAKER_02\n I think it is the idea, the system will have two models.\n\n0:44:18\tSPEAKER_02\n A model to detect, the most, the most, the most, the most, the mark, the chain, and another model, or several models, to try, but several models, rowing models, simple models, to try to classify the different class.\n\n0:44:46\tSPEAKER_05\n I am sorry, I didn't understand you, what model?\n\n0:44:49\tSPEAKER_02\n The classifies, to detect the different class to the different song before trying to recognize, to track life with a speech recognizer.\n\n0:45:02\tSPEAKER_02\n The idea is to use, for example, a neural net with the information we obtain from this stage, the parameter with the selected parameter to try to put a class of each frame for the different song, you have to obtain it in the first step with the, for example, BK, Heterium, Compere-Mole.\n\n0:45:46\tSPEAKER_03\n I think in any event we are great that the first step is, because what we had before for speaker change detection did not include these overlaps.\n\n0:45:58\tSPEAKER_03\n So the first thing is for you to build something, you will detect the overlaps.\n\n0:46:02\tSPEAKER_03\n So again, I think the first thing to do to detect the overlaps is to look at these, and in, well, again, the things that you have written up there, I think are way too big.\n\n0:46:14\tSPEAKER_03\n If you are talking about, say, 12th order NFCC or something like that, it is way too much, you will not be able to look at it.\n\n0:46:20\tSPEAKER_03\n All you will be able to do is put into a class of fire and see how well it does.\n\n0:46:24\tSPEAKER_03\n I think if you pick one or two dimensional things, or three, if you have some very fancy display, and look at how the different classes separate themselves out, you will have much more insight about what is going on.\n\n0:46:38\tSPEAKER_03\n What are you doing?\n\n0:46:39\tSPEAKER_03\n Well, you will get a feeling for what is happening.\n\n0:46:41\tSPEAKER_03\n So if you look at, suppose you look at first and second order, capture coefficients for some of these kinds of things, and you find that the first order is much more effective than the second, and then you look at the third and there is not too much there, you may just take first and second order capture coefficients.\n\n0:46:58\tSPEAKER_03\n With LPC, I think LPC per se isn't going to tell you much more than the other, maybe.\n\n0:47:05\tSPEAKER_03\n On the other hand, the LPC residual, the energy in the LPC residual, would say how well a loader LPC models fitting it, which should be pretty poorly for two or more people speaking at the same time, should be pretty well for one.\n\n0:47:20\tSPEAKER_03\n And so again, if you take a few of these things that are promising features, and look at them in pairs, I think you will have much more of a sense of, okay, I now have, doing a bunch of these analyses, I now have ten likely candidates, and then you can do decision\n\n0:47:39\tSPEAKER_02\n countries or whatever to see how they combine. I've got a question.\n\n0:47:51\tSPEAKER_02\n Sorry, but I don't know the first way to do that, and I would like to know what's the European Union.\n\n0:47:54\tSPEAKER_02\n All these studies in the first moment, I will pretend to do with the equalizes pitch.\n\n0:48:04\tSPEAKER_02\n The misses pitch, the mix, the mix, the mix, the mix, the speech.\n\n0:48:11\tSPEAKER_02\n Why?\n\n0:48:12\tSPEAKER_02\n Because the spectral distortion is a lot clearer, very much clearer if we compare with the PDA.\n\n0:48:19\tSPEAKER_02\n PDA is pitchfile, it will be difficult.\n\n0:48:23\tSPEAKER_01\n It's messier, the PDA is messier.\n\n0:48:25\tSPEAKER_02\n Because the signal to know is relation is slow.\n\n0:48:31\tSPEAKER_02\n I think that's a good way to start.\n\n0:48:34\tSPEAKER_02\n I don't know that the result of the study within this speech, the mix speech, would be interesting that sounds to see.\n\n0:48:47\tSPEAKER_02\n It's actually with the PDA file.\n\n0:48:50\tSPEAKER_02\n Well, I think that would be an interesting result.\n\n0:48:52\tSPEAKER_02\n I mean, what is the effect of the low signal to know is relation?\n\n0:48:58\tSPEAKER_03\n Well, I think it's not at all unreasonable, it makes sense to start with a simpler signal, because if you have features which aren't even helpful in the high signal noise ratio, then there's no point putting them into the low signal ratio, one would think.\n\n0:49:16\tSPEAKER_03\n And so if you can get, again, my prescription would be that you would with the mixed signal, you would take a collection of possible features, look at them, look at how these different classes that you've marked separate themselves, and then collect in pairs, and then collect ten of them or something, and then proceed with a bigger classifier.\n\n0:49:37\tSPEAKER_03\n And then if you can get that to work well, then you go to the other signal.\n\n0:49:41\tSPEAKER_03\n And you know, they won't work as well, but how much, and then you can re-optimize.\n\n0:49:47\tSPEAKER_05\n But I think it would be interesting to try a couple with both, because it might be interesting to see if some features work well with close mix.\n\n0:49:54\tSPEAKER_03\n And that's true, that it also could be useful to do this exploratory analysis where you're looking at scatter plots and so on in both cases.\n\n0:50:04\tSPEAKER_02\n Sure.\n\n0:50:05\tSPEAKER_02\n I think the parameter we found, the word with both speech file, but what is the relation of the performance when you use the speech file, the BDA, you speech file, you don't know, but I think it will be important, because people, different groups, have experience with this kind of problem, it's not easy to solve, because if you, I have seen the speech file from a PDA and some parts, but it's difficult because you don't see the spectra.\n\n0:50:46\tSPEAKER_02\n That's another reason why very simple features, things like energy and things like car\n\n0:50:59\tSPEAKER_03\n density and residual energy are you here? Yeah, are better to use than very complex ones because the marble libel, Chuck was going to ask something.\n\n0:51:10\tSPEAKER_04\n Yeah, maybe this is a dumb question, but I thought it would be easier if you use the PDA because, couldn't you like use beam forming or something to detect speaker overlaps?\n\n0:51:24\tSPEAKER_05\n I mean, well, if you use the array rather than the signal from just one.\n\n0:51:29\tSPEAKER_03\n Yeah, no, you're right, that in fact, if we made use of the fact that there are two microphones, you do have some location information, which we don't have with the one.\n\n0:51:39\tSPEAKER_03\n And so that's not allowed with this.\n\n0:51:42\tSPEAKER_03\n Well, no, I mean, we don't have any rules, really.\n\n0:51:45\tSPEAKER_04\n I mean, given the goal, I mean, is that the violation of that?\n\n0:51:50\tSPEAKER_03\n I think it's an additional interesting question.\n\n0:51:54\tSPEAKER_03\n I mean, I think you want to know whether you can do it with one because it's not necessarily true that every device that you're trying to do this with will have two.\n\n0:52:04\tSPEAKER_03\n If on the other hand, we show that there's a huge advantage with two, then that could be a real point.\n\n0:52:09\tSPEAKER_03\n But we don't even know yet what the effect of detecting, having the ability to detect overlaps is.\n\n0:52:14\tSPEAKER_03\n Maybe it doesn't matter too much.\n\n0:52:16\tSPEAKER_03\n So this is all pretty early stages.\n\n0:52:17\tSPEAKER_03\n But no, you're absolutely right.\n\n0:52:18\tSPEAKER_03\n That's a good thing to consider.\n\n0:52:19\tSPEAKER_01\n There's a correlation, though.\n\n0:52:20\tSPEAKER_01\n And that is, a person turns their back to the PD8, then some of the positional information goes away.\n\n0:52:26\tSPEAKER_01\n Well, it does not.\n\n0:52:27\tSPEAKER_01\n It does not.\n\n0:52:28\tSPEAKER_01\n That's so much.\n\n0:52:29\tSPEAKER_01\n The issue is that the...\n\n0:52:30\tSPEAKER_01\n And everyone on the axis, on the axis of it, that's the other thing I was saying.\n\n0:52:33\tSPEAKER_01\n You mentioned this last time.\n\n0:52:34\tSPEAKER_01\n Yeah, we had to put it on a little turn table.\n\n0:52:36\tSPEAKER_01\n If you just write down the midline, then the left right is going to be different.\n\n0:52:39\tSPEAKER_01\n And in his case, he's closer to it anyway.\n\n0:52:42\tSPEAKER_01\n It seems to me that it's not a...\n\n0:52:44\tSPEAKER_01\n But it's another source of information.\n\n0:52:46\tSPEAKER_01\n It's a topology of it is.\n\n0:52:47\tSPEAKER_01\n I don't know.\n\n0:52:48\tSPEAKER_02\n I think...\n\n0:52:49\tSPEAKER_02\n I think because the reason between the two microphones, microphone in the PDI's brain here, it's from my opinion, it's an interesting idea to try to study the brain role, a problem with the question.\n\n0:53:05\tSPEAKER_02\n Yes, because I found a difference between the speech from each microphone in the PDI.\n\n0:53:12\tSPEAKER_02\n Yeah, it's timing difference.\n\n0:53:13\tSPEAKER_03\n It's an important issue, right?\n\n0:53:14\tSPEAKER_01\n I mean, it means the cells.\n\n0:53:15\tSPEAKER_01\n I know, that's very important.\n\n0:53:16\tSPEAKER_01\n Right.\n\n0:53:17\tSPEAKER_01\n But I'm just saying that the way we're seated around the table is not the same with respect to each person with respect to the PDA.\n\n0:53:25\tSPEAKER_01\n So we're going to have a lot of differences with reference.\n\n0:53:27\tSPEAKER_01\n But that's fine.\n\n0:53:28\tSPEAKER_03\n That's fine.\n\n0:53:29\tSPEAKER_03\n That's...\n\n0:53:30\tSPEAKER_03\n So I think the issue is, is there a clean signal coming from only one direction?\n\n0:53:35\tSPEAKER_03\n If it's not coming from just one direction, if there's a broader pattern, it means there's more likely these multiple people speaking.\n\n0:53:43\tSPEAKER_03\n Wherever they are.\n\n0:53:44\tSPEAKER_03\n So it's sort of like how...\n\n0:53:45\tSPEAKER_03\n Is it a...\n\n0:53:46\tSPEAKER_03\n Is there a narrow beam pattern or is it a distributed beam pattern?\n\n0:53:52\tSPEAKER_03\n Does it distribute a beam pattern?\n\n0:53:53\tSPEAKER_03\n Then it looks more like it's multiple people.\n\n0:53:56\tSPEAKER_03\n Wherever you are, even if he moves around.\n\n0:53:58\tSPEAKER_01\n Okay.\n\n0:53:59\tSPEAKER_01\n It just seemed to me that this isn't the ideal type of separation.\n\n0:54:04\tSPEAKER_01\n I think it's...\n\n0:54:05\tSPEAKER_03\n Oh, ideal would be to have the wall filled with him.\n\n0:54:07\tSPEAKER_03\n But I mean, the thing is just having too much...\n\n0:54:09\tSPEAKER_03\n If you looked at that thing on Dan's page, it was when there were two people speaking, it looked really, really different.\n\n0:54:15\tSPEAKER_03\n Oh, yeah, yeah, yeah.\n\n0:54:16\tSPEAKER_03\n Okay.\n\n0:54:17\tSPEAKER_03\n What looked different?\n\n0:54:18\tSPEAKER_03\n Well, basically, he was looking at correlation.\n\n0:54:19\tSPEAKER_03\n Just cross-correlation between two sides.\n\n0:54:21\tSPEAKER_03\n So cross-correlation is very sensitive.\n\n0:54:23\tSPEAKER_04\n I'm not sure what Dan's page is.\n\n0:54:24\tSPEAKER_04\n If you mean he was looking at the...\n\n0:54:26\tSPEAKER_03\n He took a signal from the two microphones and he crossed...\n\n0:54:28\tSPEAKER_03\n And you cross-correlate them with different blacks.\n\n0:54:31\tSPEAKER_03\n Okay.\n\n0:54:32\tSPEAKER_03\n And one person is speaking, then wherever they happen to be at the point where they're speaking, then there's a pretty big maximum right around that point in the like.\n\n0:54:40\tSPEAKER_03\n So whatever angle you are...\n\n0:54:42\tSPEAKER_03\n So if there's two...\n\n0:54:43\tSPEAKER_03\n At some like corresponding to the time difference between the two there, you get this boost in the cross-correlation.\n\n0:54:48\tSPEAKER_05\n And if there are multiple people talking, you'll see two peaks.\n\n0:54:51\tSPEAKER_05\n It's spread out.\n\n0:54:52\tSPEAKER_01\n Let me ask you, if both people were over there...\n\n0:54:55\tSPEAKER_01\n Yeah.\n\n0:54:56\tSPEAKER_01\n It would be less effective than if one was there and one was across Catechord.\n\n0:54:59\tSPEAKER_01\n Oh, I'm sorry.\n\n0:55:00\tSPEAKER_03\n If they're right next to another one.\n\n0:55:01\tSPEAKER_04\n If I was here and Morgan was there and we're both talking right, it wouldn't work.\n\n0:55:05\tSPEAKER_01\n Yeah.\n\n0:55:06\tSPEAKER_01\n Versus you versus...\n\n0:55:07\tSPEAKER_01\n And we're Catechord across the table and I'm farther away from this one and you're farther away from the other one.\n\n0:55:11\tSPEAKER_01\n Or even if that would be strong.\n\n0:55:13\tSPEAKER_01\n If people were saying right across from each other, you could tell them from either.\n\n0:55:16\tSPEAKER_01\n Cross-correlate, same axis, you don't have as much difference.\n\n0:55:18\tSPEAKER_01\n Well, we don't have a third dimension there.\n\n0:55:20\tSPEAKER_01\n Yeah, so...\n\n0:55:21\tSPEAKER_01\n It's differentially very valuable.\n\n0:55:22\tSPEAKER_01\n I mean, it's not to say...\n\n0:55:23\tSPEAKER_01\n I mean, I certainly think it's extremely bad.\n\n0:55:25\tSPEAKER_01\n And we humans depend on...\n\n0:55:27\tSPEAKER_01\n Yeah, but it's almost...\n\n0:55:28\tSPEAKER_03\n It's almost... but it's almost a... I think what you're talking about is there's two things.\n\n0:55:33\tSPEAKER_03\n There's a sensitivity issue and then there's a pathological or issue.\n\n0:55:37\tSPEAKER_03\n So the one where someone is just right directly in line is sort of pathological here.\n\n0:55:41\tSPEAKER_03\n If someone just happens to be sitting right there, then we won't get good information from it.\n\n0:55:44\tSPEAKER_01\n Okay, and if they're close...\n\n0:55:45\tSPEAKER_01\n If they're close...\n\n0:55:46\tSPEAKER_03\n Same subject.\n\n0:55:47\tSPEAKER_03\n It's just a question of the sensitivity.\n\n0:55:49\tSPEAKER_03\n So if the sensitivity is good enough and we just don't have enough experience with it to know how...\n\n0:55:54\tSPEAKER_01\n Oh, I'm not trying to argue against using it by any means.\n\n0:55:57\tSPEAKER_01\n I just wanted to point out that weakness that it's top of the level.\n\n0:56:00\tSPEAKER_01\n And I think Dan is still working on it.\n\n0:56:02\tSPEAKER_05\n So he actually... he wrote me about it a little bit.\n\n0:56:06\tSPEAKER_05\n Great.\n\n0:56:07\tSPEAKER_03\n No, I don't understand.\n\n0:56:08\tSPEAKER_03\n I mean, the other thing you can do...\n\n0:56:09\tSPEAKER_03\n I mean, we're assuming that it would be a big deal just to get somebody...\n\n0:56:13\tSPEAKER_03\n Come in somebody to put two microphones on the PDA.\n\n0:56:15\tSPEAKER_03\n But if you have put a third in, you could put in the other axis and then you got to...\n\n0:56:19\tSPEAKER_03\n You've got to.\n\n0:56:20\tSPEAKER_03\n Yeah, then you pretty much could cover.\n\n0:56:22\tSPEAKER_04\n What about just doing it from these mics, you know?\n\n0:56:25\tSPEAKER_02\n Yeah.\n\n0:56:26\tSPEAKER_02\n I mean, it's actually more interesting to study the PCN because...\n\n0:56:29\tSPEAKER_02\n Say, Parisian, anything.\n\n0:56:31\tSPEAKER_03\n But that's...\n\n0:56:32\tSPEAKER_03\n And they're much broader.\n\n0:56:33\tSPEAKER_03\n I mean, we can...\n\n0:56:34\tSPEAKER_03\n We'll be...\n\n0:56:35\tSPEAKER_03\n All of this is there for us to study.\n\n0:56:36\tSPEAKER_03\n Yeah, we can do whatever we want.\n\n0:56:38\tSPEAKER_03\n But the thing is...\n\n0:56:39\tSPEAKER_03\n One of the...\n\n0:56:40\tSPEAKER_03\n At least one of the things I was hoping to get out of this is what can we do with what we think would be the normal situation if some people get together and one of them has a PDA.\n\n0:56:48\tSPEAKER_03\n That's what I was asking about.\n\n0:56:49\tSPEAKER_03\n What are the constraints?\n\n0:56:50\tSPEAKER_03\n Yeah.\n\n0:56:51\tSPEAKER_03\n Well, that's the constraint of one question and I think both Adam and I were interested in.\n\n0:56:56\tSPEAKER_03\n But, you know, if you can instrument a room, this is really minor league compared with what some people are doing.\n\n0:57:02\tSPEAKER_03\n Right?\n\n0:57:03\tSPEAKER_03\n Some people...\n\n0:57:04\tSPEAKER_03\n Eight micro-round.\n\n0:57:05\tSPEAKER_03\n Yeah, brown and...\n\n0:57:06\tSPEAKER_03\n And...\n\n0:57:07\tSPEAKER_03\n Didn't they have the main cape?\n\n0:57:08\tSPEAKER_03\n And...\n\n0:57:09\tSPEAKER_03\n And Cape...\n\n0:57:10\tSPEAKER_03\n They both have these, you know, bigger rays on the wall.\n\n0:57:12\tSPEAKER_03\n And, you know, if you can...\n\n0:57:13\tSPEAKER_03\n You've got microphones all over the place.\n\n0:57:15\tSPEAKER_03\n You know, tens of microphones.\n\n0:57:18\tSPEAKER_03\n Oh, I saw it.\n\n0:57:19\tSPEAKER_03\n I don't know.\n\n0:57:20\tSPEAKER_03\n And if you do that, then you can really get very nice...\n\n0:57:22\tSPEAKER_03\n Kind of selectivity.\n\n0:57:23\tSPEAKER_05\n So, I saw one that was like 100 microphones.\n\n0:57:26\tSPEAKER_04\n Yeah.\n\n0:57:27\tSPEAKER_04\n 10 by 10, right?\n\n0:57:28\tSPEAKER_04\n And you could...\n\n0:57:29\tSPEAKER_04\n And you could...\n\n0:57:30\tSPEAKER_04\n And you could...\n\n0:57:31\tSPEAKER_04\n And you could...\n\n0:57:32\tSPEAKER_05\n Very, very...\n\n0:57:33\tSPEAKER_05\n They could have all kinds of noises and you can zoom right in...\n\n0:57:34\tSPEAKER_05\n Pretty much.\n\n0:57:35\tSPEAKER_05\n It was all in software and you could pick out an individual beam and listen to it.\n\n0:57:36\tSPEAKER_05\n Yeah.\n\n0:57:37\tSPEAKER_03\n That's cool.\n\n0:57:38\tSPEAKER_03\n But, I was interested.\n\n0:57:39\tSPEAKER_03\n The reason why I haven't focused on that is the first concern is because I'm interested in what happens for people, random people out in some random place where they're having an improv to discussion.\n\n0:57:49\tSPEAKER_03\n And you can't just always go, well, let's go to this heavily instrumented room that we spent tens of thousand dollars to set up.\n\n0:57:54\tSPEAKER_04\n No, what you need to do is you have a little fabric thing that you enroll and hang on a wall.\n\n0:57:59\tSPEAKER_04\n It has all these mics and it has a plug-in jack to the PDA.\n\n0:58:04\tSPEAKER_03\n The other thing actually gets it this little bit of something else I'd like to do is what happens if you have two PDAs.\n\n0:58:08\tSPEAKER_03\n Yeah.\n\n0:58:09\tSPEAKER_03\n And they communicate with each other.\n\n0:58:10\tSPEAKER_03\n And then, you know, they're in random positions.\n\n0:58:11\tSPEAKER_03\n The likelihood, I mean, basically, there wouldn't be any...\n\n0:58:14\tSPEAKER_05\n That's likely to be any kind of network.\n\n0:58:16\tSPEAKER_05\n You have two.\n\n0:58:17\tSPEAKER_05\n If you're three or four.\n\n0:58:18\tSPEAKER_05\n All sorts of interesting things you can do with that.\n\n0:58:20\tSPEAKER_05\n I mean, not only can you do microphone arrays, but you can do all sorts of multi-band as well.\n\n0:58:26\tSPEAKER_04\n I still like my rug on the wall, I guess.\n\n0:58:29\tSPEAKER_04\n But it happens.\n\n0:58:30\tSPEAKER_01\n In terms of...\n\n0:58:31\tSPEAKER_01\n Yeah.\n\n0:58:32\tSPEAKER_05\n In terms of the research, it's really...\n\n0:58:35\tSPEAKER_05\n Whatever the person who is doing the research wants to do.\n\n0:58:37\tSPEAKER_05\n So if Jose is interested in that, that's great.\n\n0:58:40\tSPEAKER_05\n But if he's not, that's great, too.\n\n0:58:45\tSPEAKER_03\n I would actually kind of like us to wind it down, see if we can still get the end of the birthday thing there.\n\n0:58:51\tSPEAKER_05\n Well, I had a couple things that I didn't want to bring out.\n\n0:58:54\tSPEAKER_05\n One is, do we need to sign new...\n\n0:58:56\tSPEAKER_05\n Well, it's slightly different.\n\n0:58:57\tSPEAKER_01\n So I would say a big idea.\n\n0:58:59\tSPEAKER_01\n Oh, they need?\n\n0:59:00\tSPEAKER_01\n Yeah.\n\n0:59:01\tSPEAKER_03\n Oh, this morning we didn't sign anything because we said if anybody had signed it already, we have to.\n\n0:59:07\tSPEAKER_05\n I should have checked with Jane first, but the form has changed.\n\n0:59:10\tSPEAKER_05\n So we may want to have everyone sign the new form.\n\n0:59:14\tSPEAKER_05\n I had some things I wanted to talk about with the thresholding stuff I'm doing, but if we're in a hurry, we can put that off.\n\n0:59:22\tSPEAKER_05\n And then also anonymity, how we want to anonymize the data.\n\n0:59:25\tSPEAKER_05\n Well, should I...\n\n0:59:26\tSPEAKER_01\n I mean, I have some results to present, but I guess we'll have time to do that this time.\n\n0:59:31\tSPEAKER_01\n But it seems like the anonymization is also something that we might want to discuss and greatly.\n\n0:59:37\tNone\n I mean, what...\n\n0:59:38\tSPEAKER_03\n We're about to wind down.\n\n0:59:40\tSPEAKER_01\n I think what I would prefer is that we delay the anonymization thing to...\n\n0:59:44\tSPEAKER_01\n I think, until next week, and I would like to present the results that I have on the\n\n0:59:48\tSPEAKER_04\n overlap. We still have to do this, too, right?\n\n0:59:50\tSPEAKER_04\n Right.\n\n0:59:51\tSPEAKER_04\n Digits.\n\n0:59:52\tSPEAKER_05\n Right.\n\n0:59:53\tSPEAKER_05\n No, well, we don't have to do digits.\n\n0:59:56\tSPEAKER_03\n Well, I mean...\n\n1:00:03\tSPEAKER_03\n So, okay.\n\n1:00:04\tSPEAKER_03\n It sounds like there were a couple technical things people would like to talk about.\n\n1:00:08\tSPEAKER_03\n Why don't we just take a couple minutes to briefly do them?\n\n1:00:11\tSPEAKER_03\n And then...\n\n1:00:12\tSPEAKER_03\n Go ahead, Jane.\n\n1:00:13\tSPEAKER_01\n I would prefer to have more time for my results.\n\n1:00:15\tSPEAKER_01\n Could I do that next week, maybe?\n\n1:00:17\tSPEAKER_01\n Oh, yeah, sure.\n\n1:00:18\tSPEAKER_01\n That's what I'm asking.\n\n1:00:19\tSPEAKER_01\n Oh, yeah.\n\n1:00:20\tSPEAKER_01\n And I think the anonymization, if you want to proceed with that.\n\n1:00:21\tSPEAKER_01\n Now, I just think that that's a discussion, which also really deserves...\n\n1:00:25\tSPEAKER_01\n Because...\n\n1:00:26\tSPEAKER_01\n You know, more than just a minute, I really do think that because you raised a couple of possibilities yourself.\n\n1:00:30\tSPEAKER_01\n You and I have discussed it previously.\n\n1:00:32\tSPEAKER_01\n And there are different ways that people approach it.\n\n1:00:35\tSPEAKER_05\n Right.\n\n1:00:36\tSPEAKER_05\n We're just...\n\n1:00:37\tSPEAKER_05\n We're getting enough data now that I'd sort of like to do it now before I get overwhelmed with once we decide how to do it.\n\n1:00:41\tSPEAKER_05\n Well, okay.\n\n1:00:43\tSPEAKER_01\n It's just...\n\n1:00:44\tSPEAKER_01\n Okay, I'll give you the short version, but I do think that it's an issue that we can't resolve in five minutes.\n\n1:00:49\tSPEAKER_01\n Okay, so the short thing is we have...\n\n1:00:55\tSPEAKER_01\n Table recording...\n\n1:00:56\tSPEAKER_01\n Sorry, digitized recording.\n\n1:00:58\tSPEAKER_01\n Those we won't be able to change if someone says, hey Roger, or so and so.\n\n1:01:01\tSPEAKER_01\n So that's going to stay that person's name.\n\n1:01:03\tSPEAKER_01\n Now in terms of like the transcript, the question becomes, what's simpler?\n\n1:01:07\tSPEAKER_01\n Are you going to put in there for everybody's name?\n\n1:01:09\tSPEAKER_01\n And whether you're going to put it in the text where he says, hey Roger, are we going to put that person's anonymized name in instead?\n\n1:01:15\tSPEAKER_05\n No, because that would give you a mapping.\n\n1:01:17\tSPEAKER_05\n And you don't want to have a mapping.\n\n1:01:18\tSPEAKER_01\n So the first decision is we're going to anonymize the same name for the speaker identifier and also in the text whenever the speaker's name is mentioned.\n\n1:01:25\tSPEAKER_05\n No.\n\n1:01:26\tSPEAKER_05\n Because that would give you a mapping between the speaker's real name and the tag we're using.\n\n1:01:29\tSPEAKER_01\n And we don't want...\n\n1:01:30\tSPEAKER_01\n I think you're going to see what I said.\n\n1:01:31\tSPEAKER_01\n Okay.\n\n1:01:32\tSPEAKER_01\n So within the context of an utterance, someone says, so Roger, what do you think?\n\n1:01:38\tSPEAKER_01\n Okay.\n\n1:01:39\tSPEAKER_01\n And it seems to me that...\n\n1:01:42\tSPEAKER_01\n Well, maybe it seems to me that if you change the name, the transcript is going to disagree with the audio video.\n\n1:01:47\tSPEAKER_01\n We don't want to...\n\n1:01:48\tSPEAKER_05\n We don't want to...\n\n1:01:49\tSPEAKER_05\n We don't want to.\n\n1:01:50\tSPEAKER_05\n We want the transcript to be Roger.\n\n1:01:51\tSPEAKER_05\n Because if we made the transcript be the tag that we're using for Roger, someone who had the transcript and the audio would then have a mapping between the anonymized name and the real name.\n\n1:02:00\tSPEAKER_01\n And we want to avoid that.\n\n1:02:01\tSPEAKER_01\n Okay.\n\n1:02:02\tSPEAKER_01\n But then there's this issue of if we're going to use this for a discourse type of thing.\n\n1:02:05\tSPEAKER_01\n And you know, Liz is mentioning stuff in previous meeting about things like Gays direction and who's the address C and all.\n\n1:02:12\tSPEAKER_01\n Then to have Roger be the thing in the utterance and then actually have this speaker identify who was Roger be Frank, that's going to be really confusing and make it pretty much useless for discourse in those.\n\n1:02:22\tSPEAKER_01\n Yes.\n\n1:02:23\tSPEAKER_01\n It's a good point.\n\n1:02:24\tSPEAKER_01\n Now, if you want to, you know, I mean, in some cases, I know that Susan Irvingtrip and some of hers actually did do a filter of the signal-worth person's name was mentioned, and I saw, I mean, the question then becomes one level back.\n\n1:02:46\tSPEAKER_01\n How important is it for a person to be identified by first name versus full name?\n\n1:02:50\tSPEAKER_01\n Well, on the one hand, it's not a full identity.\n\n1:02:53\tSPEAKER_01\n We're taking all these precautions and they'll be taking precautions, which are probably even the more important ones to, they'll be reviewing the transcripts, see if there's something they don't like.\n\n1:03:02\tSPEAKER_01\n Okay.\n\n1:03:03\tSPEAKER_01\n So, maybe that's enough protection.\n\n1:03:05\tSPEAKER_01\n On the other hand, this is a small pool and people who say things about topic X who are researchers and well known in the field, they'll be identifiable simply from first name.\n\n1:03:17\tSPEAKER_01\n However, taking one step further back, they'd be identifiable anyway, even if we changed all the names.\n\n1:03:21\tSPEAKER_01\n Right.\n\n1:03:22\tSPEAKER_01\n So, is it really, you know, now in terms of like, so I did some results which I'll report on next time, which do mention individual speakers by name.\n\n1:03:30\tSPEAKER_01\n Now, there, the human subjects community is very precise.\n\n1:03:34\tSPEAKER_01\n You don't want to mention subjects by name and published reports.\n\n1:03:38\tSPEAKER_01\n Now, it'd be very possible for me to take those data, put them in a study and just change everybody's name for the purpose of the publication.\n\n1:03:44\tSPEAKER_03\n Yeah, once you get to the publication, you can certainly do that.\n\n1:03:47\tSPEAKER_03\n You know, Z.\n\n1:03:48\tSPEAKER_03\n Yeah, exactly.\n\n1:03:49\tSPEAKER_01\n Doesn't matter.\n\n1:03:50\tSPEAKER_03\n Yeah, I mean, it doesn't, I mean, I'm not knowledgeable about this, but it certainly just bother me to have someone's first name in the transcript.\n\n1:04:01\tSPEAKER_03\n I think you don't want their full name to be listed.\n\n1:04:04\tSPEAKER_01\n And in the form that they sign, it does say your first name may arise in the course of the meetings.\n\n1:04:08\tSPEAKER_01\n Yeah.\n\n1:04:09\tSPEAKER_03\n So again, the issue is if you're tracking discourse things, if someone says, Frank said this and then you want to connect it to something later, you've got to have this part where that's Frank going, right?\n\n1:04:19\tSPEAKER_01\n Yeah, and even more immediate than that, just being able to, well, it just seems like to track from one utterance to the next utterance, who's speaking and who's speaking to whom, because that can be important.\n\n1:04:34\tSPEAKER_01\n You raise the point so and so it's kind of nice to be able to know who you are.\n\n1:04:38\tSPEAKER_01\n I'm thinking too much.\n\n1:04:39\tSPEAKER_01\n I remember, you remember last time we had this discussion of how I was sort of avoiding mention people's names.\n\n1:04:44\tSPEAKER_01\n I was too.\n\n1:04:45\tSPEAKER_01\n And we made the decision that was kind of artificial.\n\n1:04:48\tSPEAKER_01\n So well, I mean, if we're going to step in after the fact and change people's names in the transcript, we've basically done something once to have worse.\n\n1:04:53\tSPEAKER_05\n Yeah.\n\n1:04:54\tSPEAKER_05\n Well, I don't want to change the name in the transcript, but that's because I'm focused so much on the acoustics instead of on the discourse.\n\n1:05:01\tSPEAKER_05\n And so I think that's a really good point.\n\n1:05:03\tSPEAKER_05\n You're right.\n\n1:05:04\tSPEAKER_05\n This is going to require more thought.\n\n1:05:05\tSPEAKER_03\n Yeah.\n\n1:05:06\tSPEAKER_03\n Let me just back up this to make a brief comment about the, what we're covering in the meeting.\n\n1:05:11\tSPEAKER_03\n I realized when you're doing this that I didn't realize that you had a bunch of things that you wanted to talk about.\n\n1:05:17\tSPEAKER_03\n And so I was proceeding somewhat of random, frankly.\n\n1:05:22\tSPEAKER_03\n So I think what would be helpful would be, you know, I'll mention this to Liz and Andreas too, that before the meeting, if anybody could send me any agenda items that they were interested in, and I'll take the role of organizing them into the agenda.\n\n1:05:41\tSPEAKER_03\n But I'd be very pleased if everyone else completely make up the agenda.\n\n1:05:45\tSPEAKER_03\n No, sorry to make it up, but if no one's told me things, then I'm just proceeding from my guesses.\n\n1:05:51\tSPEAKER_03\n And yeah, I'm sorry, and it's up with you in the out here.\n\n1:05:55\tSPEAKER_03\n Time to, I mean, I'm just always asking, you know what he's doing, you know what?\n\n1:05:59\tSPEAKER_03\n And so it's, there's a, there's a lot of other things going on.\n\n1:06:03\tSPEAKER_05\n How would the person who is doing the transcript even know who they're talking about?\n\n1:06:09\tSPEAKER_05\n Do you know what I'm saying?\n\n1:06:11\tSPEAKER_04\n The person who's doing the transcript, the IBM people?\n\n1:06:13\tSPEAKER_05\n Yeah.\n\n1:06:14\tSPEAKER_05\n I mean, so, so how is that information going to get labeled anyway?\n\n1:06:18\tSPEAKER_01\n How do you mean what they're talking about?\n\n1:06:20\tSPEAKER_05\n I mean, so if I'm saying in a meeting, oh and Bob, by the way, wanted to do so and so, they're just going to write Bob wanted to do so.\n\n1:06:28\tSPEAKER_05\n They're just going to write Bob.\n\n1:06:30\tSPEAKER_01\n And so they won't be able to change it themselves.\n\n1:06:32\tSPEAKER_05\n If you're, if you're doing discourse analysis, how are you going to do any of this?\n\n1:06:37\tSPEAKER_03\n Yeah, really.\n\n1:06:38\tSPEAKER_01\n I'm bet we're going to have huge chunks that are just totally un, I mean, they're going\n\n1:06:42\tSPEAKER_03\n to say speaker one or speaker two.\n\n1:06:43\tSPEAKER_05\n Do you speak, I mean, well, the current one, they don't do speaker identity because in naturally speaking or excuse me in via voice, it's only one person.\n\n1:06:52\tSPEAKER_05\n And so in their current conventions, there are no multiple speaker conventions.\n\n1:06:57\tSPEAKER_03\n So it may just be one long transcript of a bunch of words.\n\n1:06:59\tSPEAKER_01\n Yeah, I think that my understanding for me is it in Changs, how are you pronouncing\n\n1:07:03\tSPEAKER_03\n me? You change, you change.\n\n1:07:05\tSPEAKER_01\n You change, you change.\n\n1:07:06\tSPEAKER_01\n It was that they will adopt the part of the conventions that we discussed where they put speaker identifier down, but you know, they won't know these people.\n\n1:07:15\tSPEAKER_01\n So I think it's well, they'll adopt some convention, but we haven't specified to them.\n\n1:07:19\tSPEAKER_01\n So they'll do something like speaker one, speaker two is one of it.\n\n1:07:22\tSPEAKER_01\n But I'm betting there will be huge variations in the accuracy of their labeling of speakers.\n\n1:07:26\tSPEAKER_01\n We'll have to review the transcripts in any case.\n\n1:07:28\tSPEAKER_03\n And it may very well be, I mean, since they're not going to sit there and worry about it being the same speaker, they may very well go.\n\n1:07:37\tSPEAKER_03\n So the first time it changes to another speaker, that will be speaker two.\n\n1:07:41\tSPEAKER_03\n And the next time it will be speaker three, even if it's actually speaker one.\n\n1:07:44\tSPEAKER_01\n That would be a very practical solution on that part.\n\n1:07:47\tSPEAKER_01\n But then we need to label it.\n\n1:07:48\tSPEAKER_05\n Yeah, we could probably regenerate it pretty easily from the close talking mics.\n\n1:07:52\tSPEAKER_05\n I was thinking the attempt, the attempt, the attempt, the analysis, what changes.\n\n1:07:56\tSPEAKER_05\n That doesn't answer the question.\n\n1:07:58\tSPEAKER_05\n It's a good point.\n\n1:07:59\tSPEAKER_05\n Which is what you do for this course tracking.\n\n1:08:01\tSPEAKER_02\n You don't need to know what is the identification of the speaker.\n\n1:08:06\tSPEAKER_02\n You don't need to know.\n\n1:08:07\tSPEAKER_05\n For acoustics you don't, but for discourse you do.\n\n1:08:11\tSPEAKER_05\n For the question.\n\n1:08:12\tSPEAKER_03\n Yeah, if someone says what is Jose doing and then Jose says something, you need to know that that was Jose responding.\n\n1:08:20\tSPEAKER_01\n And let's be adopted different set of norms, which is to not to make a point of not identifying people by name, which then leads you to be more contextual explicit.\n\n1:08:31\tSPEAKER_04\n That would be hot.\n\n1:08:32\tSPEAKER_01\n Well, people are very flexible.\n\n1:08:34\tSPEAKER_01\n You know what I mean?\n\n1:08:35\tSPEAKER_01\n So when we did this last week, I think that's what I'm saying.\n\n1:08:36\tSPEAKER_01\n I felt that, you know, Andreas, he sometimes people think of something else at the same time and they miss a sentence or something.\n\n1:08:44\tSPEAKER_01\n And because he missed something, then he missed the initial introduction of who we were talking about and was unable to do the tracking.\n\n1:08:51\tSPEAKER_01\n But I felt like most of us were doing the tracking and knew who we were talking about and we just weren't mentioning the name.\n\n1:08:56\tSPEAKER_01\n So people are really flexible.\n\n1:08:58\tSPEAKER_04\n But you know, like at the beginning of this meeting or you, I think said, you know, Liz said something about, is Morgane used the equipment?\n\n1:09:07\tSPEAKER_04\n I mean, how would you say that?\n\n1:09:09\tSPEAKER_04\n I mean, you have to really think, you know, about what you're saying.\n\n1:09:14\tSPEAKER_03\n Does you know who up and you know where?\n\n1:09:16\tSPEAKER_03\n Yeah.\n\n1:09:17\tSPEAKER_04\n I think it would be really hard if we made a call for you and saying that.\n\n1:09:20\tSPEAKER_05\n I was going to say is that the other option is that we can't leave out the names.\n\n1:09:24\tSPEAKER_05\n But then again, that kills your discourse now.\n\n1:09:27\tSPEAKER_05\n Yeah.\n\n1:09:28\tSPEAKER_04\n I think the, I think, I don't know, my own two-sense worth is that you don't do anything about what's in the recordings.\n\n1:09:36\tSPEAKER_04\n You only anonymize to the extent you can.\n\n1:09:40\tSPEAKER_05\n Well, but that said, that works great for the acoustics, but it hurts you a lot for trying to do discourse.\n\n1:09:46\tSPEAKER_05\n Yeah, why?\n\n1:09:47\tSPEAKER_05\n Because you don't have a map of who's talking versus their name that they're being referred\n\n1:09:52\tSPEAKER_04\n to.\n\n1:09:53\tSPEAKER_05\n I thought we were going to be referred to. Sure, but then you have to know that Jose is Speaker One.\n\n1:09:56\tSPEAKER_03\n Then you have to know who's being referred to.\n\n1:09:57\tSPEAKER_03\n Okay, so suppose someone says, well, I don't know if I really heard what, what, what Jose said.\n\n1:10:05\tSPEAKER_03\n And then Jose responds.\n\n1:10:07\tSPEAKER_03\n And part of your learning about the dialogue is Jose responding to it, but it doesn't say Jose, it says Speaker Five.\n\n1:10:14\tSPEAKER_03\n Okay.\n\n1:10:15\tSPEAKER_04\n So, oh, I see you want to associate the word Jose in the dialogue with the fact that then he responded.\n\n1:10:22\tSPEAKER_03\n Right.\n\n1:10:23\tSPEAKER_03\n And so if we pass out the data to someone else and it says Speaker Five there, we also have to pass them this little guide that says Speaker Five is Jose.\n\n1:10:31\tSPEAKER_03\n And we're going to do that.\n\n1:10:33\tSPEAKER_05\n We might as well give them Jose, say, and that violates our privacy issue.\n\n1:10:37\tSPEAKER_01\n Now, I think that we have these two phases in the data, which is the one which is our US University of Washington's use, IBM SRI.\n\n1:10:44\tSPEAKER_01\n And within that, it may be that it's sufficient to not change the, to not incorporate an automatization yet, but always, always in the publications we have to.\n\n1:10:55\tSPEAKER_01\n And I think also when we take it that next step and distribute it to the world we have to.\n\n1:10:59\tSPEAKER_01\n I don't, that's a long way for now.\n\n1:11:01\tSPEAKER_01\n And it's a matter between now and then.\n\n1:11:03\tSPEAKER_01\n I have to say.\n\n1:11:04\tSPEAKER_01\n It makes a decision.\n\n1:11:05\tSPEAKER_01\n You know, it may be that we will need to do something like actually ex out that part of the, for the public one, the audio and just put in bracket speaker one.\n\n1:11:14\tSPEAKER_05\n You know, what we could do also is have more than one version of release, one that's public and one that requires licensing.\n\n1:11:21\tSPEAKER_05\n And so the license one would, we could, it would be a sticky limitation.\n\n1:11:25\tSPEAKER_05\n You know, like, well, we can talk about that later.\n\n1:11:27\tSPEAKER_01\n I think that the public should be the same.\n\n1:11:28\tSPEAKER_01\n I think that when we do that world release it should be the same.\n\n1:11:31\tSPEAKER_01\n I agree with Jane.\n\n1:11:32\tSPEAKER_03\n I think that we, we have a need to have a consistent licensing policy as I'm sort.\n\n1:11:37\tSPEAKER_01\n I also think it consists of licensing.\n\n1:11:39\tSPEAKER_04\n Well, one thing to, to take into consideration is, are there any, for example, the people who are funding this work, they want this work to get out and be useful for discourse?\n\n1:11:49\tSPEAKER_04\n If we all of a sudden do this and then release it to the public and it's no longer useful for discourse, you know.\n\n1:11:54\tSPEAKER_05\n Well, depending on how much editing we do, you might be able to still have it useful.\n\n1:11:58\tSPEAKER_05\n Because for discourse, you don't need the audio, right?\n\n1:12:02\tSPEAKER_05\n So you could bleep out the names in the audio and use the anonymized one through the transcript.\n\n1:12:06\tSPEAKER_05\n Excuse me.\n\n1:12:07\tSPEAKER_05\n But if you release the audio for discourse, but, excuse me, you could bleep out just the names.\n\n1:12:12\tSPEAKER_03\n No, but she's saying from the argument before she wants to be able to save someone said Jose in their, in their thing and then connect to, right?\n\n1:12:19\tSPEAKER_05\n But in the transcript, you could say everywhere they said Jose that you could replace it with speaker seven.\n\n1:12:26\tSPEAKER_05\n Oh, I see.\n\n1:12:27\tSPEAKER_01\n Yeah, but I also want to see you.\n\n1:12:30\tSPEAKER_05\n And then it wouldn't match the audio anymore, but it would be still useful.\n\n1:12:33\tSPEAKER_05\n But both of those are publicly available.\n\n1:12:36\tSPEAKER_03\n But they, right.\n\n1:12:39\tSPEAKER_03\n And the other thing is if Liz were here, what she might say is that she wants to look at things that cut across between the audio and the dialogue.\n\n1:12:46\tSPEAKER_01\n And so, yeah, I think we have to think about how, I think this can't be decided today.\n\n1:12:53\tSPEAKER_01\n Yeah, okay.\n\n1:12:54\tSPEAKER_01\n It was good to introduce the thing in.\n\n1:12:58\tSPEAKER_05\n When I wrote you that email, I wasn't thinking it was a big can of worms, but I guess it\n\n1:13:01\tSPEAKER_01\n is.\n\n1:13:02\tSPEAKER_05\n Yeah, a lot of discourse.\n\n1:13:03\tSPEAKER_01\n Well, discourse, you know, also, I'm going to make the point that discourse is going to be more than just looking at a transcript.\n\n1:13:08\tSPEAKER_01\n It's going to be interesting.\n\n1:13:09\tSPEAKER_01\n Oh, yeah, sure.\n\n1:13:10\tSPEAKER_01\n And prosoprosotic stuff is involved.\n\n1:13:12\tSPEAKER_01\n And that means you're going to be listening to the audio.\n\n1:13:14\tSPEAKER_01\n And then you come directly into this, confronting this problem.\n\n1:13:17\tSPEAKER_04\n Maybe we should just not allow anybody to do research on discourse.\n\n1:13:19\tSPEAKER_04\n I'm really glad.\n\n1:13:20\tSPEAKER_01\n I wish you just marketed to non-English speaking countries.\n\n1:13:26\tSPEAKER_03\n Maybe we should only have meetings between people who don't know one another and who are also amnesiax who don't know their own names.\n\n1:13:32\tSPEAKER_01\n Did you mean the paper and yours?\n\n1:13:34\tSPEAKER_01\n We have little labels.\n\n1:13:35\tSPEAKER_01\n I want to introduce my reservoir dog solution again.\n\n1:13:38\tSPEAKER_01\n Mr. White.\n\n1:13:39\tSPEAKER_01\n Mr. White, Mr. Pink.\n\n1:13:40\tSPEAKER_05\n Did you read the paper a few years ago where they were reversing the syllables?\n\n1:13:46\tSPEAKER_05\n They had utterances and they would extract out the syllables and they would play them backwards.\n\n1:13:52\tSPEAKER_04\n But the syllables were in the same order.\n\n1:13:56\tSPEAKER_04\n Everything was in the soil.\n\n1:13:57\tSPEAKER_05\n But the individual syllables were played backwards.\n\n1:14:00\tSPEAKER_05\n And you could listen to it.\n\n1:14:01\tSPEAKER_05\n And it would sound the same if people had no difficulty interpreting it.\n\n1:14:05\tSPEAKER_05\n So what we need is something that's the reverse.\n\n1:14:07\tSPEAKER_05\n That a speech recognizer works exactly the same on it, but people can't understand.\n\n1:14:11\tSPEAKER_05\n Oh, well, that's easy way to do that.\n\n1:14:15\tSPEAKER_03\n Just play it all backwards.\n\n1:14:17\tSPEAKER_03\n Oh, right.\n\n1:14:18\tSPEAKER_03\n That speech recognizer is totally symmetric.\n\n1:14:20\tSPEAKER_03\n Was the speech recognizer correct?\n\n1:14:21\tSPEAKER_03\n No, anyway.\n\n1:14:22\tSPEAKER_03\n How do we do digit zero?\n\n1:14:25\tSPEAKER_05\n We already missed the party.\n\n1:14:27\tSPEAKER_05\n Okay.\n\n1:14:28\tSPEAKER_05\n Reading 1471-1490-9015-2430-39425456084833936-03702-08348302 Strike that 086311823053900628375168729039989276\n\n1:15:03\tSPEAKER_03\n Transcript 1531-155012050830536778 9896 0 0 0 131 2 1 0 35 4 2914 5702 6 7 8 0 308 0 0 1 0 1 14 9 1 0 0 3\n\n1:15:41\tSPEAKER_04\n Transcript 1631-16505 0 7 2 8 5 9 8 6 8 7 0 8 3 0 9 1 1 0 8 4 1 2 0 4 3 5 2 6 5 8 7 7 2 7 8 9 0 0 8 0 3 1 3 1 2 6 3 3 4 7 1 5\n\n1:16:20\tSPEAKER_01\n Transcript 1331-1350305396804 6 2 7 6 8 8 9 0 9 7 6 9 9 4 6 0 0 0 3 2 1 0 5 3 4 4 2 7 5 0 4 6 7 3 5 8 9 5 7 2 9 8 2 3 6 7 8 8 0 8 8 0 2 9 0 4 7 1 8 0 9\n\n1:16:57\tSPEAKER_02\n 9 2 6 5 3 903. 7 9 7 6 3 0 0 7 0 0 4 0 8 6 8 7 1 3 1 2 3 0 3 0 5 3 3 0 6 6 5 8 7 8 2 0 7 0 0\n\n1:17:40\tSPEAKER_04\n Okay, go off here. I think it would be fun sometime to read them with different intonations, like is if you were talking like 9 8 6 8 7.\n\n1:17:52\tSPEAKER_01\n Well, you know, in the one I transcribed, I did find it, I found one instance of contrastive stress where it was like the string had a, so it was like 9 8 2 4 9 9 2 4.\n\n1:18:02\tSPEAKER_01\n Oh, really? So they were like looking ahead, huh?\n\n1:18:06\tSPEAKER_01\n I mean, they differed. I mean, at that, that session, I did feel like they did it more sentences, but sometimes people do it as phone numbers.\n\n1:18:13\tSPEAKER_01\n I mean, I, I'm interested in, and sometimes, you know, and I, I never, when I do it, I, I ask myself what I'm doing.\n\n1:18:20\tSPEAKER_04\n Yeah, well, I was thinking that it must get kind of boring for the people who are going to have to transcribe this.\n\n1:18:25\tSPEAKER_01\n Well, except Rowan's interesting information.\n\n1:18:27\tSPEAKER_01\n I like your question, that's very funny. I haven't heard that one.\n\n1:18:29\tSPEAKER_05\n We have the transcript. We have the actual numbers they're reading, so we're not necessarily depending on that.\n\n1:18:33\tSPEAKER_05\n Okay, I'm going to go off.\n\n", "summary": [{"summary_text": "The digit recording at the end of the meeting will cut down on the number of participants. Speaker wants to collect more data to do research on this data since a new student wants to work with them. He comes from a signal processing background and is interested in higher level things like language and disfluencies."}]}