{"filename": "./data/Bmr007.txt", "transcript": "0:00:00\tSPEAKER_06\n Yeah, yeah, okay.\n\n0:00:03\tSPEAKER_06\n We're on again, okay.\n\n0:00:05\tSPEAKER_06\n That is okay.\n\n0:00:06\tSPEAKER_07\n So if anyone hasn't signed the consent form, please do so.\n\n0:00:10\tSPEAKER_07\n The new consent form.\n\n0:00:11\tSPEAKER_07\n The new information form.\n\n0:00:12\tSPEAKER_07\n I mean, that's the one that we're going to bring to you back.\n\n0:00:14\tSPEAKER_07\n Okay.\n\n0:00:15\tSPEAKER_07\n And shall I go ahead and do some digits?\n\n0:00:16\tSPEAKER_06\n We're going to do that at the end, remember?\n\n0:00:18\tSPEAKER_06\n Okay, whatever you want.\n\n0:00:20\tSPEAKER_06\n Yeah, just to be consistent from you around and at least to the end.\n\n0:00:23\tSPEAKER_06\n It's a, yeah, it doesn't matter, okay.\n\n0:00:26\tSPEAKER_06\n Okay.\n\n0:00:27\tSPEAKER_06\n Well, it just, I mean, it might be that someone here has to go.\n\n0:00:30\tSPEAKER_06\n That was the other sort of the point.\n\n0:00:33\tSPEAKER_06\n So I had asked, actually, anybody who had any ideas for an agenda to send it to me and no one did.\n\n0:00:40\tSPEAKER_06\n So that was an over-guy.\n\n0:00:42\tSPEAKER_04\n From last time I wanted an issue.\n\n0:00:45\tSPEAKER_04\n Right.\n\n0:00:46\tSPEAKER_04\n From last time.\n\n0:00:47\tSPEAKER_06\n Okay, so one item for Denda is Jane has some, some research to talk about, research issues.\n\n0:00:54\tSPEAKER_06\n And I have some short research issues.\n\n0:00:58\tSPEAKER_06\n And I'm going to have some short research issues.\n\n0:01:01\tSPEAKER_06\n I have a list of things that I think were done over the last three months.\n\n0:01:07\tSPEAKER_06\n I was supposed to send off.\n\n0:01:10\tSPEAKER_06\n And I sent a note about it to Adam and Jane, but I think I'll just run through it also and see if someone thinks it's inaccurate or...\n\n0:01:20\tSPEAKER_06\n A list you have to send off to...\n\n0:01:24\tSPEAKER_06\n Oh.\n\n0:01:25\tSPEAKER_06\n Okay, you know.\n\n0:01:27\tSPEAKER_06\n So, so I'll go through that.\n\n0:01:34\tSPEAKER_06\n And...\n\n0:01:36\tSPEAKER_06\n Anything else?\n\n0:01:38\tSPEAKER_06\n Anything else to talk about?\n\n0:01:40\tSPEAKER_08\n No.\n\n0:01:41\tSPEAKER_08\n What about the new trip?\n\n0:01:42\tSPEAKER_06\n The next day.\n\n0:01:44\tSPEAKER_06\n Sort of off topic, I guess, because I was all about the...\n\n0:01:48\tSPEAKER_06\n I can chat with you about that.\n\n0:01:51\tSPEAKER_06\n Fine, that's another thing.\n\n0:01:54\tSPEAKER_06\n And...\n\n0:01:56\tSPEAKER_06\n Anything else?\n\n0:01:58\tSPEAKER_06\n Anything else?\n\n0:01:59\tSPEAKER_06\n There's a...\n\n0:02:00\tSPEAKER_06\n I mean, there is a...\n\n0:02:03\tSPEAKER_06\n A telephone call tomorrow, which would be a conference call.\n\n0:02:06\tSPEAKER_06\n Some of us are involved in...\n\n0:02:08\tSPEAKER_06\n For a possible proposal.\n\n0:02:11\tSPEAKER_06\n We'll talk about it next week.\n\n0:02:13\tSPEAKER_07\n Do you want me to give that?\n\n0:02:14\tSPEAKER_07\n I know you.\n\n0:02:15\tSPEAKER_07\n CC me, but I wasn't actually recipient.\n\n0:02:17\tSPEAKER_07\n I didn't quite know what to make of that.\n\n0:02:19\tSPEAKER_07\n Well, we'll talk about that after.\n\n0:02:21\tSPEAKER_06\n Okay.\n\n0:02:22\tSPEAKER_06\n Okay, so it sounds like the three main things that we have talked about are this list, Dean and Dean Adam have a series of items, and other than that, anything as usual, and if it goes beyond that.\n\n0:02:35\tSPEAKER_06\n Okay, Dean, since you were sort of cut off last time when we start with yours, make sure we get to it.\n\n0:02:40\tSPEAKER_04\n It's very brief.\n\n0:02:42\tSPEAKER_04\n I just want to just have these out.\n\n0:02:45\tSPEAKER_07\n This is the same as the email or different.\n\n0:02:48\tSPEAKER_04\n It's slightly just...\n\n0:02:50\tSPEAKER_04\n It's basically the same idea.\n\n0:02:52\tSPEAKER_04\n Same idea.\n\n0:02:53\tSPEAKER_04\n So I feel like that is using it before.\n\n0:02:54\tSPEAKER_04\n So basically, as you know, part of the encoding includes a mark that indicates that an overlap.\n\n0:03:02\tSPEAKER_04\n It's not indicated with a type precision.\n\n0:03:05\tSPEAKER_04\n It's just indicated that...\n\n0:03:07\tSPEAKER_04\n Okay, so...\n\n0:03:09\tSPEAKER_04\n It's indicated to some of the people know what parts of speech...\n\n0:03:13\tSPEAKER_04\n which stretches the speech were in the clear versus being overlap by others.\n\n0:03:17\tSPEAKER_04\n So I've used this mark and divided the enrol script, which divides things into individual minutes, which ended with 45 and a little bit.\n\n0:03:31\tSPEAKER_04\n And, you know, minute zero, of course, is the first minute up to 60 seconds.\n\n0:03:37\tSPEAKER_04\n And what you can see is the number of overlaps.\n\n0:03:40\tSPEAKER_04\n And then to the right, whether they involve two speakers, three speakers and one and three speakers.\n\n0:03:45\tSPEAKER_04\n And what I was looking for, specifically, was the question of...\n\n0:03:50\tSPEAKER_04\n whether they distributed evenly throughout or whether they're averse of them.\n\n0:03:54\tSPEAKER_04\n And it looked to me as though...\n\n0:03:57\tSPEAKER_04\n You know, this is just...\n\n0:04:00\tSPEAKER_04\n This is not specifically verified, but it did look to me as though they're averse throughout, rather than being unlocalized to a particular region.\n\n0:04:09\tSPEAKER_04\n So, part down there where the maximum number of overlaps is the area where we were discussing whether or not it was useful to code stress, set and stress as possible, indication of information and treatment.\n\n0:04:24\tSPEAKER_04\n So it's like, you know, rather lively discussion there.\n\n0:04:27\tSPEAKER_06\n What's the parenthesis stuff that says...\n\n0:04:29\tSPEAKER_06\n Like the first one says six overlaps and then 2.8?\n\n0:04:32\tSPEAKER_04\n That's the percent.\n\n0:04:33\tSPEAKER_04\n So, six is 2.8% of the total number of overlaps in that session.\n\n0:04:38\tSPEAKER_04\n So, here we end.\n\n0:04:39\tSPEAKER_04\n This is when people were, you know, packing up to go basically to this final stuff.\n\n0:04:43\tSPEAKER_04\n I don't remember where the digits felt.\n\n0:04:45\tSPEAKER_04\n I had to look at that.\n\n0:04:46\tSPEAKER_04\n But the final three there are no overlaps at all.\n\n0:04:49\tSPEAKER_04\n And a couple times there.\n\n0:04:51\tSPEAKER_04\n So it seems like it goes through verse.\n\n0:04:54\tSPEAKER_04\n That's going to be...\n\n0:04:55\tSPEAKER_04\n Now, another question is, are there individual differences in whether you're likely to be overlapped with or to overlap with others?\n\n0:05:02\tSPEAKER_04\n And again, I want to emphasize is just one particular meeting and also it's been a statistical testing involved.\n\n0:05:11\tSPEAKER_04\n But I took the coding of the...\n\n0:05:16\tSPEAKER_04\n You know, I had the script figure out who was the first speaker who was the second speaker involved in a two person overlap.\n\n0:05:23\tSPEAKER_04\n I didn't look at the ones involved in three or more.\n\n0:05:25\tSPEAKER_04\n And this is how it ranks down in the individual cells.\n\n0:05:30\tSPEAKER_04\n Who tended to be overlapping most often with who else?\n\n0:05:33\tSPEAKER_04\n And if you look at the marginal totals, which is the ones on the right side, across the bottom, you get the totals for an individual.\n\n0:05:39\tSPEAKER_04\n So, if you look at the bottom, those are the numbers overlaps in which Adam was involved as the person doing the overlap thing.\n\n0:05:50\tSPEAKER_04\n And if you look... I'm sorry, but you're alphabetical as my question is.\n\n0:05:53\tSPEAKER_04\n And then if you look across the right, then that's where he was the person who was the first speaker in the pair.\n\n0:05:58\tSPEAKER_04\n And he got overlapped with by somebody.\n\n0:06:01\tSPEAKER_04\n And then if you look down on that summary table, then you see that there are differences in whether a person overlap with or overlap.\n\n0:06:09\tSPEAKER_07\n Is this just raw counts or is it...?\n\n0:06:12\tSPEAKER_07\n Raw counts.\n\n0:06:13\tSPEAKER_07\n So it would be interesting to see how much each person spoke.\n\n0:06:16\tSPEAKER_04\n Yes, very true.\n\n0:06:17\tSPEAKER_04\n Very true.\n\n0:06:18\tSPEAKER_04\n We could normalize through that now in the table.\n\n0:06:20\tSPEAKER_04\n I did take one step toward away from the raw frequencies by putting percentages.\n\n0:06:24\tSPEAKER_04\n So the percentage of time, other times that the person spoke, what percentage...\n\n0:06:29\tSPEAKER_04\n Other times the person spoke and furthermore was involved in a two-person overlap.\n\n0:06:33\tSPEAKER_04\n What percentage of the time were they the overlap or what percent of the time were they the overlap be?\n\n0:06:38\tSPEAKER_04\n And there it looks like you see some differences.\n\n0:06:41\tSPEAKER_04\n That some people tend to be overlapped with more often than they're overlapped.\n\n0:06:47\tSPEAKER_04\n Of course, this is just one meeting. There's no statistical testing involved and that would be required for an in-line.\n\n0:06:56\tSPEAKER_06\n So it would be statistically incorrect to conclude from this that Adam talked too much?\n\n0:07:01\tNone\n No actually, it's still incorrect.\n\n0:07:04\tSPEAKER_04\n Yeah, that's right.\n\n0:07:05\tSPEAKER_04\n I don't see a point in signaling people out.\n\n0:07:07\tSPEAKER_04\n Now this is a kiss for obviously...\n\n0:07:09\tSPEAKER_04\n But the numbers for people themselves, that's right.\n\n0:07:11\tSPEAKER_04\n So I'm not saying on the tape who did better or worse because I think that...\n\n0:07:17\tSPEAKER_04\n And then here's a case where of course human subjects people would say, be sure that you anonymize results.\n\n0:07:20\tSPEAKER_04\n This is what...\n\n0:07:21\tSPEAKER_07\n This is actually when Jane sent this email first, it's what caused me to start thinking about anonymizing the data.\n\n0:07:27\tSPEAKER_07\n Well, fair enough.\n\n0:07:28\tSPEAKER_04\n And actually, the point is not about an individual. It's a point about tendencies toward different styles, different speakers.\n\n0:07:35\tSPEAKER_04\n Oh, sure.\n\n0:07:36\tSPEAKER_04\n It would be, you know, of course, there's also the question of what type of overlap was this and were they?\n\n0:07:41\tSPEAKER_04\n And I know that I can distinguish at least three types and probably more.\n\n0:07:46\tSPEAKER_04\n I mean, the general cultural idea, which the conversation analyst originally started with in the 70s, was that we had this strict model where politeness involves that you let person finish before you start talking.\n\n0:07:58\tSPEAKER_04\n And, you know, I mean, we know that...\n\n0:08:00\tSPEAKER_04\n And they've loosened up on that too, in the intermeaning time.\n\n0:08:03\tSPEAKER_04\n That that's viewed as being a culturally relative thing.\n\n0:08:07\tSPEAKER_04\n You have the high involvement style from the East Coast where people will overlap often as an indication of interest in what they are person saying.\n\n0:08:14\tSPEAKER_04\n And, you know, exactly, they're the same, fine?\n\n0:08:17\tSPEAKER_04\n And, you know, in contrast, and also, Divertannis, these, as she talked about differences in these types, that they're just different styles.\n\n0:08:24\tSPEAKER_04\n And you can impose a model of the ideal being, no overlaps in conversation.\n\n0:08:30\tSPEAKER_04\n And, you know, it's also bringing advances in the university, and I agree with that.\n\n0:08:34\tSPEAKER_04\n And, and also, I can't say university, but anyway, the people who used to say it was strict, now, don't.\n\n0:08:41\tSPEAKER_04\n I mean, they also acknowledge the influence of subcultural norms and cross cultural norms and things.\n\n0:08:49\tSPEAKER_04\n So, then it be kind of...\n\n0:08:52\tSPEAKER_04\n So, just superficially, you give a couple ideas of the types of overlaps involved.\n\n0:08:56\tSPEAKER_04\n I have the bottom several that I know. So, they're backchats, like, what I'm just now anticipating the end of a question.\n\n0:09:04\tSPEAKER_04\n And, simply answering it earlier. And, there are several of those in this in these days, where, because we're people who've talked to each other, we know basically what the topic is, what the possibilities are, and we've spoken with each other.\n\n0:09:16\tSPEAKER_04\n So, we know basically what the other person's style is likely to be.\n\n0:09:20\tSPEAKER_04\n And, so, and there are a number of places where someone just answered early.\n\n0:09:24\tSPEAKER_04\n And, places also, which I thought were interesting, where two or more people gave exactly the same answer in unison.\n\n0:09:30\tSPEAKER_04\n Different words, of course, but, you know, the basically, you know, everyone's saying yes, or, you know, or even more specific than that.\n\n0:09:37\tSPEAKER_04\n So, the point is that overlaps not necessarily bad thing, and that it would be useful to subdued by these further and see if their individual differences in styles, and respect the types involved.\n\n0:09:48\tSPEAKER_04\n And, that's all I want to say on that.\n\n0:09:50\tSPEAKER_06\n Thank you. Well, of course, the biggest result here, which is when we've talked about many times, and this is new to us, but I think would be interesting to show someone who isn't familiar with this.\n\n0:10:02\tSPEAKER_06\n It's just the sheer number of overlaps. See that, right? That, that, that, here's a relatively short meeting.\n\n0:10:09\tSPEAKER_06\n So, 40, 40 plus minute meeting, and not only were there 215 overlaps, but, I think there's one, one minute there.\n\n0:10:19\tSPEAKER_06\n Where, where, where there wasn't any overlap, I mean, it's throughout this thing.\n\n0:10:25\tSPEAKER_04\n Well, at the bottom, we have the bottom three. So, four, four minutes altogether.\n\n0:10:28\tSPEAKER_06\n Oh, so the bottom three did have stuff going on.\n\n0:10:31\tSPEAKER_06\n Yes, but just no overlaps.\n\n0:10:33\tSPEAKER_08\n Okay, so it's interesting to see what the total amount of time is in the overlap.\n\n0:10:36\tSPEAKER_08\n Yes, exactly. That's where Jose is.\n\n0:10:38\tSPEAKER_01\n I have this, that's where he comes in.\n\n0:10:40\tSPEAKER_01\n I have that information.\n\n0:10:42\tSPEAKER_01\n No. No, about how much is it?\n\n0:10:43\tSPEAKER_06\n Which is the duration of the, of each of the overlaps? What's the, what's the average?\n\n0:10:49\tSPEAKER_01\n I, I have in the average now, but I will, I will do the, the study of the, with the, with the, with the problem, with the, the, the different distribution of the duration of the overlap.\n\n0:11:01\tSPEAKER_06\n Okay, you, you don't have a feeling for roughly how much.\n\n0:11:05\tSPEAKER_01\n Because the budget is a good, the duration is the variation, the variation of the duration is the very, very...\n\n0:11:14\tSPEAKER_04\n I suspect that we'll also differ depending on the type of overlap.\n\n0:11:17\tSPEAKER_01\n Yeah, I'm sure.\n\n0:11:18\tSPEAKER_01\n Because are yourself a, a, a, a son of overlapping with duration, a, a, a, a overlap and another very, very short.\n\n0:11:28\tSPEAKER_01\n I probably is very difficult to, to speak, because the overlap is the only, the, the final S, the, the, the, the, the, the, the, the end, the end of the war, or the previous speaker, with the, the next word of the, the new speaker.\n\n0:11:46\tSPEAKER_01\n And I consider that son overlap, but it's very short, and X, with the, and the idea is probably, when, when we study the, that song, we have a, a, a, confusion with noise, with that, the effective sounds.\n\n0:12:09\tSPEAKER_01\n But, yeah, I have an information, but I have to,\n\n0:12:13\tSPEAKER_02\n use blip as by minute, sorry for the overlap, the strategy, the boundary between two minutes, that comes towards both of those.\n\n0:12:24\tSPEAKER_04\n Actually, actually not. So, it was, think about the case where A, start speaking, and then B, overlaps with A, and then the minute boundary happens. And let's say that, after that minute boundary, B is still speaking, and A overlaps with B, that would be a new overlap.\n\n0:12:48\tSPEAKER_04\n But otherwise, let's say B comes to the conclusion of that turn without anyone overlapping with him in which case, there would be no overlap counted in the second.\n\n0:12:58\tSPEAKER_02\n So most of them, talk simultaneously, both important moments, and one, and the other question to you.\n\n0:13:08\tSPEAKER_04\n Okay, in that case, my, the coding that I was using, since we haven't incorporated Adams coding on the lap, yes, the coding of, yes, not over.\n\n0:13:19\tSPEAKER_04\n So if we haven't incorporated Adams method of handling over, overlaps yet, then that would have fallen through the crack, cracks, it would be an underestimate of the number of overlaps, because I, I wouldn't be able to pick it up from the way it was encoding so far.\n\n0:13:33\tSPEAKER_04\n We just haven't done that. The precise second to second, you know, second to second coding.\n\n0:13:37\tSPEAKER_06\n I'm, I'm confused now. So, let me restate what I thought Andrew has been saying and, and see.\n\n0:13:43\tSPEAKER_06\n Let's say that in, in second, 57 of one minute, you start talking and I start talking, and we ignore each other and keep on talking for six seconds.\n\n0:13:53\tSPEAKER_06\n So we go over, so we were, we were talking over one another, and it's just, in each case, it's just sort of one interval, right?\n\n0:14:00\tSPEAKER_06\n So, we talked over the minute boundary. Is this considered, is one overlap in each of the minutes, the way you have done this?\n\n0:14:09\tSPEAKER_04\n No, it wouldn't. It would be considered as an overlap in the first one.\n\n0:14:13\tSPEAKER_06\n Okay, so that's good, I think, in the sense that I think Andrew has meant the rest of you.\n\n0:14:18\tSPEAKER_04\n I should also say I did a simplifying count in that, if A was speaking, B overlapped with A, and then A came back again, and overlapped with B again, I, I didn't count that as a three person overlap, I counted that as a two person overlap, and it was A being overlapped with by D.\n\n0:14:35\tSPEAKER_04\n Because the idea was the first speaker had the floor, and the second person started speaking, and then the first person re-ocerted the floor kind of thing.\n\n0:14:44\tSPEAKER_04\n These are simple, not an assumption. It didn't happen very often, there may be like three overlaps in that way in the long day.\n\n0:14:49\tSPEAKER_07\n I want to go back and listen to minute 41.\n\n0:14:51\tSPEAKER_07\n Yeah, yeah.\n\n0:14:52\tSPEAKER_07\n Because, yeah.\n\n0:14:53\tSPEAKER_07\n And I think that by interesting that there were a large number of overlaps and they were all two speaker. I mean, what I thought would have thought is that when there were a large number of overlaps, because everyone was talking at once, but apparently not, that's really neat.\n\n0:15:07\tSPEAKER_07\n Yeah, there's a lot of background.\n\n0:15:09\tSPEAKER_05\n Yeah, it is. I think it's really interesting though, before saying yes, meetings have a lot of overlaps, it's to actually find out how many more we have than two party.\n\n0:15:21\tSPEAKER_05\n And if you have a party conversation, like switchboard, does it offer a lot too? If you just look at the back channel, if you consider those overlaps, it's also very huge.\n\n0:15:29\tSPEAKER_05\n It's just that people haven't been looking at that because they've been doing single channel processing.\n\n0:15:34\tSPEAKER_05\n So the question is, how many more overlaps do you have of say the two person type by adding more people to a meeting?\n\n0:15:44\tSPEAKER_05\n And it may be a lot more, but it may not be.\n\n0:15:47\tSPEAKER_06\n Well, but see, I find it interesting, even if it wasn't anymore, because since we were dealing with this full duplex sort of thing in switchboard, where it was just all separated out, we just, everything was just nice.\n\n0:15:57\tSPEAKER_06\n So the issue is in a situation where that's...\n\n0:16:00\tSPEAKER_05\n It's really nice, it depends what you're doing.\n\n0:16:02\tSPEAKER_05\n So if you were actually having, depends what you're doing.\n\n0:16:07\tSPEAKER_05\n Right now, we're doing, we have individual mics on the people in this meeting.\n\n0:16:11\tSPEAKER_05\n And the question is, are there really more overlaps happening than there would be in a two person?\n\n0:16:17\tSPEAKER_06\n Let me rephrase what I'm saying, because I don't think I'm getting across.\n\n0:16:20\tSPEAKER_06\n But shouldn't these words like nice, because we're doing it precise.\n\n0:16:23\tSPEAKER_06\n What I mean is that in switchboard, despite the many other problems that we have, one problem that we're not considering is overlap.\n\n0:16:32\tSPEAKER_06\n And what we're doing now is, aside from the many other differences in the task, we are considering overlap.\n\n0:16:38\tSPEAKER_06\n And one of the reasons they were considering it, one of them, one of them is that, at least I'm very interested in the scenario in which both people talking here are pretty much equally audible in from a single microphone.\n\n0:16:55\tSPEAKER_06\n And so in that case, it does get mixed in, and it's pretty hard to just ignore it, to just do processing on one and on the other.\n\n0:17:03\tSPEAKER_05\n I agree that it's an issue here, but it's also an issue for switchboard. And if you think of meetings being recorded over the telephone, which I think, you know, this whole point of studying meetings isn't just at people in a room, but to also have meetings over different phone lines.\n\n0:17:17\tSPEAKER_05\n Maybe far, feel like people wouldn't be interested in that, but all the dialogue issues still have.\n\n0:17:21\tSPEAKER_05\n So each of us was calling and having a meeting that way, you know, a conference call.\n\n0:17:27\tSPEAKER_05\n And just the question is, you know, in switchboard, you would think that's the simplest case of a meeting, a more than one person.\n\n0:17:36\tSPEAKER_05\n I'm wondering how much more overlap of the types that, that you described happen with more people present. So it may be that having three people is very different from having two people or it may not be.\n\n0:17:49\tSPEAKER_06\n That's an important question to ask. I think what I'm certainly saying is that I don't think we were considering that switchboard. Not you, maybe.\n\n0:17:57\tSPEAKER_05\n Were you measuring it? I mean, there is actually to tell you the truth, the reason why it's hard to measure is because of, so from the point of view of studying dialogue, in which Dan Draskin and Dresden, I had some projects on.\n\n0:18:13\tSPEAKER_05\n I know the sequence of terms. So what happens is if you're talking and I have a back channel in the middle of your turn, and then you keep going, what it looks like in a dialogue model is your turn and then my back channel, even though my back channel occurred completely inside your turn.\n\n0:18:28\tSPEAKER_05\n Yeah.\n\n0:18:29\tSPEAKER_05\n So for things like language modeling or dialogue modeling, we know that that's wrong in real time. But because of the acoustic segmentations that were done and the fact that some of the acoustic data and switchboard were missing, people couldn't study it.\n\n0:18:45\tSPEAKER_05\n But that doesn't mean in the real world that people don't talk that way.\n\n0:18:48\tSPEAKER_06\n Yeah, I wasn't saying that. Right. I was just saying that now we're looking at it.\n\n0:18:53\tSPEAKER_06\n You maybe wanted to look at it before, but for these various technical reasons, in terms of how the data was, you weren't. So that's why it's coming to us as new, even though it may well be.\n\n0:19:03\tSPEAKER_06\n If you're hypothesis, you're offering, right, if it's the null hypothesis, and if actually you have as much overlap in the two person, we don't know the answer to that. The reason we don't know the answer to is because it wasn't studied and wasn't studied because it was a set of.\n\n0:19:16\tSPEAKER_05\n And if you're asking the question from the point of view of what's different from out of meeting, studying meetings of say more than two people versus what kinds of questions you can ask what the two person meeting.\n\n0:19:30\tSPEAKER_05\n It's important to distinguish that, you know, this project is getting a lot of overlap, but other projects for two, but we just couldn't study them.\n\n0:19:38\tSPEAKER_05\n May have been.\n\n0:19:39\tSPEAKER_05\n Well, there is a high rate, but I don't know how high. I have a question.\n\n0:19:46\tSPEAKER_06\n My point was just if you wanted to say to somebody, what do we learn about overlaps here? Just never mind comparison to something else.\n\n0:19:53\tSPEAKER_06\n What we've learned about is overlaps in this situation is that the first order thing I would say is that there's a lot of them.\n\n0:19:59\tSPEAKER_06\n In the sense that if you said, I guess what I'm comparing to is more the common sense notion of how much people overlap.\n\n0:20:09\tSPEAKER_06\n The fact that when Adam was looking for a stretch of speech before that didn't have any overlaps and he was having such a hard time.\n\n0:20:15\tSPEAKER_06\n And now I look at this and I go, well, I can see why he was having such a hard time.\n\n0:20:19\tSPEAKER_05\n That's also been a fish for.\n\n0:20:20\tSPEAKER_06\n I wasn't saying it wasn't. Right?\n\n0:20:22\tSPEAKER_06\n I was commenting about this.\n\n0:20:24\tSPEAKER_06\n I was saying if I have this complicated thing in front of me, which we're going to get much more sophisticated about when we get lots more data.\n\n0:20:32\tSPEAKER_06\n But then if I was going to describe somebody, what did you learn right here about the modest amount of data that was analyzed?\n\n0:20:38\tSPEAKER_06\n I'd say, well, the first order thing was there's a lot of overlaps. In fact, it's not just a bunch of overlap.\n\n0:20:43\tSPEAKER_06\n Second order thing is it's not just a bunch of overlaps in one particular point, but that there's overlaps throughout the thing.\n\n0:20:49\tSPEAKER_05\n And that's interesting. I agree with that. I'm just saying that the reason you get overlaps may or may not be due to the number of people in the meeting.\n\n0:20:58\tSPEAKER_05\n Yeah. Yeah. I wasn't making any statement about that.\n\n0:21:00\tSPEAKER_05\n And it would actually be interesting to find out because some of the data say switchboard, which is an exactly the same kind of contact.\n\n0:21:08\tSPEAKER_05\n And these are two people who don't know each other.\n\n0:21:10\tSPEAKER_05\n But we should still be able to somehow say what is the added contribution to the sort of overlap time of each additional person.\n\n0:21:22\tSPEAKER_05\n Yeah, that would be good to know, but we need the way.\n\n0:21:24\tSPEAKER_04\n Yeah, I agree with that. And the reason is because I think there's a limit.\n\n0:21:28\tSPEAKER_04\n There's an upper bound on how many you can have simply from the standpoint of audibility when we speak.\n\n0:21:33\tSPEAKER_04\n We do make a judgment as adults. I mean children don't adjust so well.\n\n0:21:37\tSPEAKER_04\n If a truck grows rolling past, adults will, depending, but mostly adults will hold off to what to finish the end of the sentence until the noise is passed.\n\n0:21:46\tSPEAKER_04\n And I think we generally do monitor things like that. Whether we, whether our utterance will be in the clear or not.\n\n0:21:51\tSPEAKER_04\n And partly it's related to rhythmic structure and conversation. So, you know, you, you, you, you, you, you, stop.\n\n0:21:56\tSPEAKER_04\n So people tend to time their, their, their, when they come into the conversation based on the overall rhythmic ambient thing.\n\n0:22:04\tSPEAKER_04\n So you don't want to be cross cutting and just to finish this that, that I think that there may be an upper bound on how many overlaps you can have simply from the standpoint of audibility and how loud the other people are who are already in the break.\n\n0:22:16\tSPEAKER_04\n But I, you know, I've certain types. Now, if it's just back channels, people may be doing that with less intention of being heard just sort of spontaneously doing back channels.\n\n0:22:25\tSPEAKER_04\n In which case that those might, there may be no upper bound.\n\n0:22:29\tSPEAKER_02\n I have this feeling that back channels which are the vast majority of overlaps in switchboard.\n\n0:22:35\tSPEAKER_02\n I didn't play it as big a role here because it's very unnatural.\n\n0:22:39\tSPEAKER_02\n I think to back channel in a multi audience, you know, in a multi person.\n\n0:22:43\tSPEAKER_05\n If you can see them actually. So if you watched people are going like, right, like this here, but they may not be the case.\n\n0:22:51\tSPEAKER_02\n But instead of audition, one person speaking and everybody's listening.\n\n0:22:55\tSPEAKER_06\n Actually, I think I've done it a fair number of times today.\n\n0:23:00\tSPEAKER_06\n I thought it had none.\n\n0:23:03\tSPEAKER_07\n Yeah, we need to put trackers on that.\n\n0:23:05\tSPEAKER_08\n In two person.\n\n0:23:07\tSPEAKER_02\n Yeah, so actually that's in part because the nodding, if you have very old contact, the nodding has the same function, but on the phone is switchboard.\n\n0:23:18\tSPEAKER_02\n You, that would work.\n\n0:23:20\tSPEAKER_02\n So you need to use the message here.\n\n0:23:22\tSPEAKER_08\n So in the two person conversations, when there's back channel, is there a great deal of overlap?\n\n0:23:30\tSPEAKER_08\n The speech or because I impression is sometimes it happens when there's a pause.\n\n0:23:35\tSPEAKER_08\n You know, like you get a lot of back channel when somebody's pausing.\n\n0:23:39\tSPEAKER_04\n She's doing that.\n\n0:23:41\tSPEAKER_08\n Sorry about what you're saying.\n\n0:23:43\tSPEAKER_08\n Talk to your both.\n\n0:23:45\tSPEAKER_08\n No, when there's back channel, I mean, just listening, when there's two people talking and there's back channel, it seems like the back channel happens when the pitch drops and the first person.\n\n0:23:56\tSPEAKER_08\n And a lot of times the first person actually stops talking and then there's a back channel and then they start up again.\n\n0:24:01\tSPEAKER_08\n So I'm wondering about, I just wonder how much overlap there is.\n\n0:24:04\tSPEAKER_08\n Is there a lot?\n\n0:24:06\tSPEAKER_05\n I think there's a lot of the kind that Jose was talking about where in the Scult position timing, conversation happens where they come in overlapping.\n\n0:24:14\tSPEAKER_05\n But at a point where the information is mostly complete.\n\n0:24:19\tSPEAKER_05\n So all you're missing is some last syllables or something, the last word, some highly predictable words.\n\n0:24:25\tSPEAKER_05\n So technically it's an overlap.\n\n0:24:28\tSPEAKER_08\n But maybe it's just a small overlap.\n\n0:24:30\tSPEAKER_05\n From the information flow point of view, it's not an overlapping.\n\n0:24:33\tSPEAKER_08\n I was just thinking more in terms of alignment overlap.\n\n0:24:37\tSPEAKER_07\n Language model prediction of overlap that would be really interesting.\n\n0:24:40\tSPEAKER_05\n Well, that's exactly why we wanted to study the pre-sized writing of overlapses in switchboard.\n\n0:24:47\tSPEAKER_02\n So here's a first interesting labeling task to distinguish between say back channels, precision timing, sort of, you know, benevolent overlaps and add, and pick it up and work for pants.\n\n0:25:01\tSPEAKER_02\n I don't know, I'll slide over to someone else's side over that before it's chaos.\n\n0:25:06\tSPEAKER_02\n That might be interesting from just to take over.\n\n0:25:11\tSPEAKER_04\n I think that in this meeting I really had the feeling that wasn't happening, that the hostile type.\n\n0:25:16\tSPEAKER_04\n These were benevolent types, as people finishing each other's sense.\n\n0:25:20\tSPEAKER_02\n I could imagine that there's a fair number of cases where this is not really hostile, but sort of competitive.\n\n0:25:28\tSPEAKER_02\n What person is finishing something and you have like two or three people trying to grab the next turn.\n\n0:25:37\tSPEAKER_02\n And so it's not against the person who talks first, because they're actually all waiting for that person to finish.\n\n0:25:43\tSPEAKER_06\n But they all are next.\n\n0:25:45\tSPEAKER_06\n I have a feeling most of these things that are not benevolent kind are competitive as opposed to really hostile.\n\n0:25:55\tSPEAKER_08\n I'm doing what determines who gets the floor.\n\n0:25:58\tSPEAKER_06\n I mean, vote in Florida.\n\n0:26:01\tSPEAKER_06\n What do you remember?\n\n0:26:03\tSPEAKER_06\n One thing I remember, or you can tell a good joke and then everybody's laughing and you get a chance to break in.\n\n0:26:08\tSPEAKER_06\n But the other thing I was thinking was that all these interesting questions are, of course, pretty hard to answer with a small amount of data.\n\n0:26:20\tSPEAKER_06\n So I wonder if what you're saying suggests that we should make a conscious attempt to have a fair number of meetings with a smaller number of people.\n\n0:26:33\tSPEAKER_06\n Most of our meetings are meetings currently with a 5, 6, 7, 8 people.\n\n0:26:40\tSPEAKER_06\n Should we really try to have some two person meetings or some three person meetings and record them just to beef up the statistics on that?\n\n0:26:51\tSPEAKER_04\n Well, it seems like there are two possibilities.\n\n0:26:54\tSPEAKER_04\n I mean, it seems like if you have just two people, it's not really like a meeting.\n\n0:27:00\tSPEAKER_04\n It's not as similar as the rest of the sample.\n\n0:27:04\tSPEAKER_04\n It depends on what you're after, of course. But it seems like that would be more in case of the control condition compared to an experimental condition with more than two.\n\n0:27:11\tSPEAKER_06\n Well, this was raising the question of whether it's the number.\n\n0:27:14\tSPEAKER_06\n There's a relationship between the number of people and the number of overlaps of type of overlaps.\n\n0:27:19\tSPEAKER_06\n And if you had two people meeting in this kind of circumstance, then you'd still have the visual.\n\n0:27:24\tSPEAKER_06\n So you wouldn't have that difference also that you have in the scenes which are poor data.\n\n0:27:29\tSPEAKER_04\n I'm just thinking that'd be more like a control condition.\n\n0:27:32\tSPEAKER_07\n But from the acoustic point of view, it's all good.\n\n0:27:35\tSPEAKER_07\n It's the same. The acoustic is fine.\n\n0:27:37\tSPEAKER_02\n If the goal were to just look at overlap view, what you could say of yourself saved yourself a lot of time, and not even transparent the words.\n\n0:27:46\tSPEAKER_05\n I was thinking you should be able to do this from the acoustic on the close track in my experience.\n\n0:27:51\tSPEAKER_07\n Well, that was my status for Florence.\n\n0:27:54\tSPEAKER_07\n I've never done with this type of discussion.\n\n0:27:56\tSPEAKER_05\n I don't think you would be able to have any kind of apology on the next one, but you get some rough statistics.\n\n0:28:02\tSPEAKER_06\n But what do you think about that? Do you think that would be useful?\n\n0:28:04\tSPEAKER_06\n I'm just thinking of as an action item, whether we should try to record some two words of meeting.\n\n0:28:07\tSPEAKER_05\n I guess my first comment was only that we should not attribute overlaps only to meetings, but maybe that's obvious.\n\n0:28:18\tSPEAKER_05\n Maybe anybody knew that.\n\n0:28:20\tSPEAKER_05\n In normal conversation with two people, there's an awful lot of the same kinds of overlap, and that it would be interesting to look at whether or there are these kinds of constraints that Jane mentioned, that maybe the additional people add to this competition that happens right after a turn.\n\n0:28:40\tSPEAKER_05\n You can have five people trying to grab a turn, but pretty quickly they back off and we go back to the sort of one person at a time with one person.\n\n0:28:51\tSPEAKER_05\n I don't know to answer your question.\n\n0:28:53\tSPEAKER_05\n I don't think it's crucial to have controls, but I think it's worth recording all the meetings we can.\n\n0:29:01\tSPEAKER_05\n I have a lot of that.\n\n0:29:03\tSPEAKER_05\n I would not record on the two person meeting because it only has a few.\n\n0:29:10\tSPEAKER_02\n Could we have the past and continue to have a fair number of phone calls?\n\n0:29:16\tSPEAKER_02\n We talked about this repeatedly.\n\n0:29:19\tSPEAKER_02\n We can see what happens in terms of role that way.\n\n0:29:34\tSPEAKER_02\n We have to set up for it.\n\n0:29:58\tSPEAKER_06\n We recorded this meeting so regularly.\n\n0:30:05\tSPEAKER_07\n We can look at each other.\n\n0:30:08\tSPEAKER_07\n Turn off the lights.\n\n0:30:10\tSPEAKER_06\n Let me take a picture.\n\n0:30:13\tSPEAKER_06\n That was the other thing.\n\n0:30:15\tSPEAKER_06\n Were we going to take a picture to the beginning of each of these meetings?\n\n0:30:19\tSPEAKER_07\n What I thought we were going to do was just take pictures of the whiteboards rather than take pictures of the meeting.\n\n0:30:27\tSPEAKER_04\n It's a head nodding here.\n\n0:30:30\tSPEAKER_04\n Why do we want to take pictures of the meeting?\n\n0:30:33\tSPEAKER_04\n Because you said the spatial relationship of the speech.\n\n0:30:36\tSPEAKER_07\n You could do that by just noting on the role.\n\n0:30:39\tSPEAKER_07\n I'll do that on the next set of forms.\n\n0:30:42\tSPEAKER_01\n I finally remembered to put the name of the speech.\n\n0:30:47\tSPEAKER_07\n We figured out from the mic.\n\n0:30:51\tSPEAKER_07\n No.\n\n0:30:52\tSPEAKER_07\n The wire was once.\n\n0:30:55\tSPEAKER_07\n I mean, I'm sitting here and the jack is over here.\n\n0:30:59\tSPEAKER_05\n Probably from the evening.\n\n0:31:02\tSPEAKER_07\n It would be another task.\n\n0:31:04\tSPEAKER_07\n Having ground to proof would be nice.\n\n0:31:06\tSPEAKER_07\n You could get it.\n\n0:31:07\tSPEAKER_07\n The game forming during the digit.\n\n0:31:10\tSPEAKER_07\n So I'm going to put the labels on all the chairs with the seat number.\n\n0:31:13\tSPEAKER_07\n That's a good idea.\n\n0:31:14\tSPEAKER_02\n But the chairs are in the same level.\n\n0:31:16\tSPEAKER_02\n Put them on the table.\n\n0:31:18\tSPEAKER_04\n But you know, the linguistic anthropologists would say it would be good to have a digital picture anyway.\n\n0:31:25\tSPEAKER_04\n Because you get a sense of a posture.\n\n0:31:27\tSPEAKER_04\n You could block out a person's face or whatever.\n\n0:31:30\tSPEAKER_04\n But these are important cues.\n\n0:31:33\tSPEAKER_06\n But from one picture, I don't know that you really get that.\n\n0:31:37\tSPEAKER_06\n You can be better than nothing.\n\n0:31:39\tSPEAKER_04\n You can just from a synch picture.\n\n0:31:41\tSPEAKER_04\n I think you can come up with some aspects.\n\n0:31:43\tSPEAKER_04\n I mean, I could tell you, if I'm in certain meetings, I really do the body language.\n\n0:31:49\tSPEAKER_04\n It's very interesting in terms of the dumbness.\n\n0:31:52\tSPEAKER_02\n That's funny.\n\n0:31:53\tSPEAKER_02\n Yeah.\n\n0:31:54\tNone\n I mean, you could block out the person's face.\n\n0:31:57\tSPEAKER_07\n You agree.\n\n0:31:59\tSPEAKER_07\n Of course, where we sit at the table, I find it's very interesting that we do tend to gravitate to the same place each time.\n\n0:32:07\tSPEAKER_07\n And it's somewhat coincidental.\n\n0:32:09\tSPEAKER_07\n I'm sitting here so I can run into the room if the hardware starts catching fire.\n\n0:32:13\tSPEAKER_07\n You'd like to be at charge.\n\n0:32:16\tSPEAKER_06\n I can start off at the head of the table.\n\n0:32:18\tSPEAKER_06\n Take control.\n\n0:32:19\tSPEAKER_06\n Speaking of taking control, you said you hid some research.\n\n0:32:22\tSPEAKER_07\n Yeah, I've been playing with using the close talking mic to try to figure out who's speaking.\n\n0:32:27\tSPEAKER_07\n So my first attempt was just using thresholding and filtering that we talked about about two weeks ago.\n\n0:32:32\tSPEAKER_07\n And so I play with that a little bit.\n\n0:32:34\tSPEAKER_07\n And it works okay, except that it's very sensitive to your choice of your filter width and your threshold.\n\n0:32:42\tSPEAKER_07\n So if you fiddle around with it a little bit and you get good numbers, you can actually do a pretty good job of segmenting when someone's talking and when they're not.\n\n0:32:48\tSPEAKER_07\n But if you try to use the same parameters on another speaker, it doesn't work anymore.\n\n0:32:52\tSPEAKER_07\n Even if you normalize it based on the absolute loudness.\n\n0:32:56\tSPEAKER_05\n It does work for that one's feature output meeting.\n\n0:32:59\tSPEAKER_07\n It does work for the one's feature output meeting.\n\n0:33:02\tSPEAKER_07\n Pretty well.\n\n0:33:03\tSPEAKER_07\n How did you do it then?\n\n0:33:04\tSPEAKER_07\n How did I do it?\n\n0:33:05\tSPEAKER_08\n What do you mean?\n\n0:33:06\tSPEAKER_07\n The algorithm was take every frame that's over the threshold and then median filter it and then look for runs.\n\n0:33:17\tSPEAKER_07\n So there was a minimum run length.\n\n0:33:18\tSPEAKER_07\n Every frame that's over what threshold?\n\n0:33:20\tSPEAKER_08\n A threshold that you pick.\n\n0:33:21\tSPEAKER_08\n In terms of energy?\n\n0:33:22\tSPEAKER_08\n Yeah.\n\n0:33:23\tSPEAKER_08\n Okay.\n\n0:33:24\tSPEAKER_04\n Say that again.\n\n0:33:25\tSPEAKER_07\n Okay.\n\n0:33:26\tSPEAKER_07\n So if you take each frame and you compute the energy and if it's over the threshold you set it to one.\n\n0:33:30\tSPEAKER_07\n And if it's under the threshold you set it to zero.\n\n0:33:32\tSPEAKER_07\n So now you have a bit stream.\n\n0:33:33\tSPEAKER_07\n That's zero's and once.\n\n0:33:34\tSPEAKER_07\n And then I median filtered that using a fairly long filter length.\n\n0:33:40\tSPEAKER_07\n Well, actually I guess it depends on what you mean by long.\n\n0:33:43\tSPEAKER_07\n You know, 10th of a second, source of numbers.\n\n0:33:45\tSPEAKER_07\n And that's to average out pitch, you know, the pitch converse and things like that.\n\n0:33:52\tSPEAKER_07\n And then look for long runs.\n\n0:33:58\tSPEAKER_07\n And that works okay if you filter if you tune the filter parameters, if you tune how long your median filter is and how high you're looking for your thresholds.\n\n0:34:07\tSPEAKER_08\n Did you ever try running the filter before you pick a threshold?\n\n0:34:11\tSPEAKER_07\n No.\n\n0:34:12\tSPEAKER_07\n Certainly could though.\n\n0:34:14\tSPEAKER_07\n But this was just I had the program mostly written already.\n\n0:34:17\tSPEAKER_07\n So it was easy to do.\n\n0:34:19\tSPEAKER_07\n Okay.\n\n0:34:20\tSPEAKER_07\n And then the other thing I did was I took, I took a few years speaker change detector, acoustic change detector and I implemented that with the closed talking mics.\n\n0:34:29\tSPEAKER_07\n And unfortunately that's not working real well and it looks like it's the problem is he does it in two passes.\n\n0:34:36\tSPEAKER_07\n The first pass is to find candidate places to do a break.\n\n0:34:40\tSPEAKER_07\n And he does that using a neural net doing broad phone classification and he has the one of the phone classes is silence.\n\n0:34:48\tSPEAKER_07\n And so the possible breaks are where silence starts and ends.\n\n0:34:52\tSPEAKER_07\n And then he has the second pass which is a modeling a Gaussian mixture model looking for whether it improves or degrades to split at one of those particular places.\n\n0:35:03\tSPEAKER_07\n And what looks like it's happening is that the even on the closed talking mic, the broad phone class classifiers doing a really bad job.\n\n0:35:12\tSPEAKER_07\n What was it trained on?\n\n0:35:14\tSPEAKER_07\n I have no idea. I don't remember. Does anyone do you remember Morgan? Was it broadcast news?\n\n0:35:18\tSPEAKER_07\n I think so, yeah.\n\n0:35:20\tSPEAKER_07\n So I didn't rate my next attempt which I am in the midst of and having quite finished yet was actually using the thresholding as the way of generating the candidates.\n\n0:35:30\tSPEAKER_07\n Because one of the things that definitely happens is if you put the threshold low, you get lots of breaks, all of which are definitely acoustic events.\n\n0:35:38\tSPEAKER_07\n They're definitely someone talking. Like it could be someone who isn't the person here, but the person over there or it could be the person breathing.\n\n0:35:46\tSPEAKER_07\n And then feeding that into the acoustic change detector.\n\n0:35:50\tSPEAKER_07\n And so I think that might work. I haven't gotten very far on that.\n\n0:35:55\tSPEAKER_07\n But all of this is closed talking mic.\n\n0:35:58\tSPEAKER_07\n Just trying to get some ground truth.\n\n0:36:08\tSPEAKER_01\n I think there is a good difference in the same thing.\n\n0:36:16\tSPEAKER_07\n Oh, absolutely. So my attention to this is as an aid for ground truth.\n\n0:36:22\tSPEAKER_01\n I mean that in the Mr. File you can find some with a great different level of energy.\n\n0:36:34\tSPEAKER_01\n I think for a minimum basic energy, more or less like a fair sign and detector.\n\n0:36:46\tSPEAKER_01\n Say it again. When you detect the fairs at the end of the detector of the name and the English, the detector of a war in the isolated war.\n\n0:37:06\tSPEAKER_01\n I'm not a launcher, but you're saying contract.\n\n0:37:10\tSPEAKER_07\n And you use an outside detector.\n\n0:37:16\tSPEAKER_01\n I think it's probably to war well because you have in the Mr. File it's a level of energy and a great difference between the speaker.\n\n0:37:26\tSPEAKER_01\n And probably it's not so easy when you use the PDA because the signal is the energy level in that speech file is more similar between the different speakers.\n\n0:37:42\tSPEAKER_01\n I think it will be in my opinion. It will be more difficult to detect basic energy, the chain.\n\n0:37:53\tSPEAKER_07\n In the PDA. Absolutely. No question. It will be much harder.\n\n0:37:59\tSPEAKER_01\n Another question. When I review the work of Javier, I think the idea of using neural network to get a broad class phonetic from the speaker.\n\n0:38:17\tSPEAKER_01\n If you have a, I'm considering only because Javier only consider like candidate the silence because this is the only model he used to detect the possibility of a chain between the speaker.\n\n0:38:39\tSPEAKER_01\n And another research in different groups working on broadcast news prefer to consider hypothesis between each 40 when the phone changes.\n\n0:38:55\tSPEAKER_01\n Because I think it's more realistic that only consider the silent between speaker. There is a seat silent between speaker is acoustic event important to consider.\n\n0:39:15\tSPEAKER_01\n I found that silent in many occasions in the speech file. But when you have to speak together with enough silent between the end, I think it's better to use the acoustic chain detector.\n\n0:39:34\tSPEAKER_01\n I, I, I, X or bike, the criteria for consider all the friends in my opinion.\n\n0:39:44\tSPEAKER_06\n The reason that he just used silence was not because he thought it was better. It was, it was the place he was starting. So I was trying to get something going. And as, as in your case, if you're here for on the amount of number of months, you try to get the holistic goal.\n\n0:40:02\tSPEAKER_01\n But his, his goal was always to proceed from there to then allow broad category change also. But do you think that if you consider all the friends to apply the, the bike, to the date, the different acoustic chain between speaker without and with silence or with overlapping.\n\n0:40:24\tSPEAKER_01\n I think like a general way of process the acoustic chain in the first step, I mean. And then with that, considering the, you, you can consider the energy like another parameter in the, in the future.\n\n0:40:44\tSPEAKER_01\n Absolutely. This is the idea. And if you do that with a bike, to tell you for example, or with another kind of a, of this time in the first step. And then you, you get the hypothesis to the, this chain acoustic.\n\n0:41:02\tSPEAKER_01\n Process, right. Because probably you, you can find the small gap of silence between speaker with a small duration less than 200 seconds. For example, and apply another, another algorithm, another approach like the texture of an, the texture, the basic energy to, to consider that, that, the sound of small silence between speaker or another algorithm to, to process the, the segment between marks, founded by the, the bike, the unit applied for, for each thing.\n\n0:41:46\tSPEAKER_01\n And it will be, and, and, and more general approach. That if we compare with use a neural net or another, a, a, a, a, a, a, a, a, a, with a broad class or, or not broad class because, in my opinion, it's, in my opinion.\n\n0:42:05\tSPEAKER_01\n If you, if you change the condition of the speech, I mean, if you adjust to your algorithm with the mr speech file and to, to, to, a, that, the neural net, you said by heavier with the mr file, with the, with the mix, mix, mix, sorry. And, and then you, you, you tried to, to apply that, a, a, a, a, a, speaker recognizer to that signal, to the pdA, a, a, a, a, a, a, I think you will have problems with the, a, a, the, a, a, a, you will need to, a, you will need to, to, to, to, retrain.\n\n0:42:48\tSPEAKER_06\n Look, I think this is a, once, I used to work like a voice, not voice silence detection young, this is this kind of thing.\n\n0:42:57\tSPEAKER_06\n If you have somebody who has some experience with this sort of thing and they work on it for a couple of months, they can come up with something that gets most of the cases fairly easily.\n\n0:43:06\tSPEAKER_06\n Then you say, okay, I don't want to just get most of the cases, I want it to be really accurate.\n\n0:43:09\tSPEAKER_06\n Then it gets really hard to measure what you do.\n\n0:43:12\tSPEAKER_06\n So the problem is, is that if you say, well, I have to use other data over here that I learn things from either explicit training of neural nets or Gaussian mixture models or whatever.\n\n0:43:22\tSPEAKER_06\n So, as you don't use any of those things, you say you have looked for acoustic change.\n\n0:43:26\tSPEAKER_06\n What does that mean?\n\n0:43:27\tSPEAKER_06\n That means you set some threshold somewhere or something, right?\n\n0:43:31\tSPEAKER_06\n And so, where do you get your thresholds from?\n\n0:43:34\tSPEAKER_06\n From something that you looked at.\n\n0:43:35\tSPEAKER_06\n So you always have this problem, you're going to new data.\n\n0:43:39\tSPEAKER_06\n How are you going to adapt to whatever you can very quickly learn about the new data if it's going to be different from old data that you have?\n\n0:43:46\tSPEAKER_06\n I think that's a problem.\n\n0:43:47\tSPEAKER_07\n Well, also, what I'm doing right now is not intended to be an acoustic change detector for far-field mics.\n\n0:43:53\tSPEAKER_07\n What I'm doing is trying to use the close talking mic and just use candidates.\n\n0:43:58\tSPEAKER_07\n Can't just get in and just try to get a first pass at some of the smart things.\n\n0:44:04\tSPEAKER_07\n And I haven't spent a lot of time on it.\n\n0:44:06\tSPEAKER_07\n And I'm not intending to spend a lot of time on it.\n\n0:44:09\tSPEAKER_02\n I'm unfortunately out to run, but I can imagine building a model of speaker change detection that takes into account both the far-field and actually not just the close talk mic for that speaker, but actually for all of the speakers.\n\n0:44:28\tSPEAKER_02\n If you model the effect that me speaking has on your microphone and everybody else's microphone as well as on that.\n\n0:44:36\tSPEAKER_02\n And you build basically, I think you would build an HMM that has a state space all of the possible speaker combinations.\n\n0:44:45\tSPEAKER_02\n And you can control it.\n\n0:44:49\tSPEAKER_07\n It's not that big actually.\n\n0:44:51\tSPEAKER_07\n Two to the end.\n\n0:44:52\tSPEAKER_07\n Two to the number of people in the meeting.\n\n0:44:55\tSPEAKER_06\n But actually, maybe just something simpler, but the long lines of what you're saying, I was just realizing, you know, the sky used to build mic mixers, automatic mic mixers where, you know, in order to be able to turn up the gain, you know, as much as you can, you lower the gain on the mics of people who aren't talking, right?\n\n0:45:12\tSPEAKER_06\n And you have some sort of reasonable way of doing that.\n\n0:45:15\tSPEAKER_06\n But what if you were just looking at very simple measures like energy measures, but you don't just compare it to some threshold overall, but you compare it to the energy in the other\n\n0:45:24\tSPEAKER_07\n microphones. I was thinking about doing that originally to find out who's the loudest in that person certainly talking, but I also wanted to find threshold, excuse me, overlap.\n\n0:45:35\tSPEAKER_07\n So not just just loudest.\n\n0:45:37\tSPEAKER_01\n Sorry.\n\n0:45:38\tSPEAKER_01\n I found it when I analyzed the speech file from the mic across microphone.\n\n0:45:48\tSPEAKER_01\n I found sound with a different level of energy, including overlap sound, including because the, depending on the position of the mic, or the feature speaker to get more or less energy in the signal.\n\n0:46:11\tSPEAKER_01\n And then if you consider energy to detect overlapping, and you process the speech file from the reset signals, the mic signals, I think it's difficult only to end with the energy to consider that in that zone we have a overlapping sound if you process only the energy of each frame.\n\n0:46:39\tSPEAKER_06\n Well, it's probably harder, but I think what I was noting just when he raised that was that there's other information to be gained from looking at all of the microphones and you may not need to look at very sophisticated things.\n\n0:46:52\tSPEAKER_06\n Because if most of the overlaps, this doesn't cover C3, but if most of the overlaps say are two, if the distribution looks like there's a couple high ones and an address down below, you know, I mean, there's some information there about the distribution even with very simple measures.\n\n0:47:06\tSPEAKER_06\n By the way, I had an idea that what I was watching Chuck nodding and a lot of these things is that we could all wear little bells in our heads.\n\n0:47:13\tSPEAKER_07\n You know that.\n\n0:47:20\tSPEAKER_07\n Sorry, I'm just going to sleep.\n\n0:47:28\tSPEAKER_08\n Yeah.\n\n0:47:29\tSPEAKER_08\n Actually, I saw a woman at the bus stop the other day who was talking on her cell phone speaking Japanese and was bowing, you know, profusely, just kept.\n\n0:47:37\tSPEAKER_05\n It's very difficult if you try while you're trying to say to convince somebody on the\n\n0:47:44\tSPEAKER_03\n phone, it's difficult not to move your hands.\n\n0:47:47\tSPEAKER_05\n If you watch the whole thing, you do things. I still think we should try a meeting or two with the blindfolds.\n\n0:47:51\tSPEAKER_05\n At least of this meeting that we have lots of recording though.\n\n0:47:54\tSPEAKER_05\n Yeah, I think.\n\n0:47:55\tSPEAKER_05\n Maybe for a part of the meeting, we're going to have to do it the whole evening.\n\n0:47:57\tSPEAKER_05\n I think it's a great idea.\n\n0:47:58\tSPEAKER_05\n It'll be too hard to make barriers that I was thinking because they have to go all the way.\n\n0:48:03\tSPEAKER_05\n I can see Chuck even if they're going to go to bed.\n\n0:48:05\tSPEAKER_07\n I can see that they're just turning out of lights.\n\n0:48:07\tSPEAKER_04\n I can say I made barriers so that the stuff I was doing was calling.\n\n0:48:11\tSPEAKER_04\n Which just used this kind of foam board, really inexpensive.\n\n0:48:15\tSPEAKER_04\n You can mask and tape it together.\n\n0:48:17\tSPEAKER_04\n These are very large.\n\n0:48:18\tSPEAKER_04\n We also have tissues.\n\n0:48:19\tSPEAKER_05\n These are the other things I think.\n\n0:48:21\tSPEAKER_05\n So we need a barrier that doesn't disturb the long range of life.\n\n0:48:26\tSPEAKER_06\n That would be good.\n\n0:48:27\tSPEAKER_06\n Probably we should wait until Adam set up the mics.\n\n0:48:30\tSPEAKER_05\n The interesting of the camera going.\n\n0:48:35\tSPEAKER_05\n I think we're going to have to work on the human subjects.\n\n0:48:39\tSPEAKER_03\n Yeah, that's right.\n\n0:48:40\tSPEAKER_03\n We did that one with people.\n\n0:48:41\tSPEAKER_04\n Do you mind being blindfolded while you're doing it?\n\n0:48:43\tSPEAKER_06\n That's the one that we videotape.\n\n0:48:45\tSPEAKER_06\n So I want to move this along.\n\n0:48:48\tSPEAKER_06\n I did have this other agenda item, which is a list which I sent to a couple folks but I wanted to get broader input on it.\n\n0:48:56\tSPEAKER_06\n So this is the things that I think we did in the last three months.\n\n0:49:00\tSPEAKER_06\n Obviously, not everything did, but sort of highlights that I can tell some outside person.\n\n0:49:06\tSPEAKER_06\n What were you actually working on?\n\n0:49:08\tSPEAKER_06\n In no particular order.\n\n0:49:10\tSPEAKER_06\n One, ten more hours of meetings recorded.\n\n0:49:14\tSPEAKER_06\n Something like that from three months ago.\n\n0:49:17\tSPEAKER_06\n XML formats and other transcription aspects sorted out.\n\n0:49:21\tSPEAKER_06\n Sent to IBM.\n\n0:49:22\tSPEAKER_06\n Pilot data put together.\n\n0:49:25\tSPEAKER_06\n Sent to IBM for transcription.\n\n0:49:28\tSPEAKER_06\n Next batch of recorded data put together on the CD-ROMs for shipment to IBM.\n\n0:49:33\tSPEAKER_06\n Hasn't been sent yet.\n\n0:49:34\tSPEAKER_06\n But it's getting ready.\n\n0:49:37\tSPEAKER_06\n Human subjects approval on campus and release forms worked out so the meeting participants have a chance to request audio pixelization of selected parts of the speech.\n\n0:49:49\tSPEAKER_06\n Audio pixelization software written and tested.\n\n0:49:54\tSPEAKER_06\n Eliminary analysis of overlaps in the pilot data we have transcribed.\n\n0:49:58\tSPEAKER_06\n And exploratory analysis of long distance inferences for topic coherence.\n\n0:50:03\tSPEAKER_06\n I was just sure if those were the right way.\n\n0:50:06\tSPEAKER_06\n That was the right way to describe that.\n\n0:50:08\tSPEAKER_06\n That was the lecture size that you and look under did.\n\n0:50:11\tSPEAKER_06\n What was that called?\n\n0:50:12\tSPEAKER_06\n Well, I'm probably saying this wrong.\n\n0:50:14\tSPEAKER_06\n But what I said was exploratory analysis of long distance inferences for topic coherence.\n\n0:50:19\tSPEAKER_06\n Something like that.\n\n0:50:22\tSPEAKER_06\n So a lot of that was from what you two were doing.\n\n0:50:28\tSPEAKER_06\n So I sent to you and please mail me corrections or suggestions for changing.\n\n0:50:33\tSPEAKER_06\n I don't want to make this twice its length, but just improve it.\n\n0:50:38\tSPEAKER_07\n Is there anything I need to do?\n\n0:50:39\tSPEAKER_07\n I did a bunch of stuff for supporting of digits.\n\n0:50:42\tSPEAKER_06\n A bunch of stuff for, okay, maybe send me a sentence.\n\n0:50:45\tSPEAKER_06\n That's a little bit of a sentence.\n\n0:50:46\tSPEAKER_06\n That doesn't just say a bunch of stuff.\n\n0:50:48\tSPEAKER_07\n Stuff is probably bad too.\n\n0:50:49\tSPEAKER_07\n It's not very technical.\n\n0:50:50\tSPEAKER_07\n I'll try to phrase it in passive voice.\n\n0:50:53\tSPEAKER_07\n Yeah, technical stuff.\n\n0:50:54\tSPEAKER_06\n A range of things.\n\n0:50:55\tSPEAKER_06\n Yeah.\n\n0:50:57\tSPEAKER_06\n And I sort of threw in what you did with what Jane did under the preliminary analysis for relapse.\n\n0:51:09\tSPEAKER_06\n Do you all can you tell us about all the work you've done on this slide?\n\n0:51:12\tSPEAKER_06\n Last three months.\n\n0:51:13\tSPEAKER_06\n It's really too complicated.\n\n0:51:16\tSPEAKER_00\n I didn't get what is audio pixelization.\n\n0:51:19\tSPEAKER_06\n Audio pixelization.\n\n0:51:20\tSPEAKER_06\n He did it.\n\n0:51:21\tSPEAKER_07\n So why don't you explain it quickly?\n\n0:51:22\tSPEAKER_07\n It's just beeping out parts that you don't want to include it in the meeting.\n\n0:51:26\tSPEAKER_07\n So you can say things like, well, they should probably not be on the record.\n\n0:51:30\tSPEAKER_06\n But we spent a fair amount of time early on just talking dealing with this issue about, we realized what people are speaking in an impromptu way.\n\n0:51:41\tSPEAKER_06\n And they might say something that would embarrass them or others later.\n\n0:51:44\tSPEAKER_06\n And how did you get around that?\n\n0:51:45\tSPEAKER_06\n So in the consent form it says, well, we'll look at the transcripts later and if there's something that you're unhappy with.\n\n0:51:51\tSPEAKER_06\n But you don't want to just totally excise it because, well, you have to be careful about excising how you excise it, keeping the timing right and so forth.\n\n0:52:01\tSPEAKER_06\n So the moment the idea we're running with is putting the beep.\n\n0:52:05\tSPEAKER_07\n You can either beep or it can be silence.\n\n0:52:08\tSPEAKER_07\n I couldn't decide which was the right way to do it.\n\n0:52:11\tSPEAKER_07\n It's good auditorily. If someone is listening to it, there's no mistake that it's been beeped out.\n\n0:52:16\tSPEAKER_07\n But for software, it's probably better for it to be silence.\n\n0:52:19\tSPEAKER_08\n You could make a model of that beep.\n\n0:52:24\tSPEAKER_07\n I like that.\n\n0:52:25\tSPEAKER_07\n It's an A low-poss.\n\n0:52:28\tSPEAKER_08\n It's more obvious that there was something there than it's just silence.\n\n0:52:32\tSPEAKER_08\n I mean, he's removing the old thing.\n\n0:52:35\tSPEAKER_08\n Right.\n\n0:52:36\tSPEAKER_08\n I mean, if you just replace it with silence, it's not clear whether that's really silence.\n\n0:52:41\tSPEAKER_04\n What question do you do it on all channels?\n\n0:52:43\tSPEAKER_04\n Of course.\n\n0:52:44\tSPEAKER_07\n Interesting. I like that.\n\n0:52:45\tSPEAKER_07\n You have to do it on all channels because it's audible.\n\n0:52:49\tSPEAKER_07\n It's potentially audible. You could potentially recover it.\n\n0:52:52\tSPEAKER_07\n You could keep it back door.\n\n0:52:54\tSPEAKER_07\n I haven't thrown away any of the meetings that I beeped.\n\n0:52:57\tSPEAKER_07\n Actually, yours is the only one that I beeped and then the ARP, the DARPA meeting.\n\n0:53:02\tSPEAKER_07\n Sorry.\n\n0:53:03\tSPEAKER_07\n It's the DARPA meeting I just excised completely.\n\n0:53:06\tSPEAKER_05\n It's some people who only have beeped their speed.\n\n0:53:11\tSPEAKER_06\n Very easy to find.\n\n0:53:12\tSPEAKER_06\n All right.\n\n0:53:13\tSPEAKER_06\n I think we should go on to the digits.\n\n0:53:16\tSPEAKER_04\n I have one concept.\n\n0:53:18\tSPEAKER_04\n I want to say, which is that I think it's nice that you're preserving the time relations.\n\n0:53:21\tSPEAKER_04\n So you're not just cutting, you're not doing scissors.\n\n0:53:24\tSPEAKER_04\n Right.\n\n0:53:25\tSPEAKER_04\n You're keeping the time duration that I've been in.\n\n0:53:28\tSPEAKER_04\n It's a deleted part.\n\n0:53:29\tSPEAKER_07\n Okay.\n\n0:53:34\tSPEAKER_05\n I think the other thing is that I'm saying something unbelievable.\n\n0:53:40\tSPEAKER_05\n You'll lose it.\n\n0:53:41\tSPEAKER_07\n There's no way around that.\n\n0:53:43\tSPEAKER_06\n Before we do the digit I did also want to remind people.\n\n0:53:48\tSPEAKER_06\n Please do send me thoughts for an agenda.\n\n0:53:51\tSPEAKER_06\n That would be good.\n\n0:53:53\tSPEAKER_06\n So that it's kind of stuck on me this week.\n\n0:53:56\tSPEAKER_06\n Yeah, well the screen.\n\n0:53:58\tSPEAKER_05\n Okay, and I wanted to say I think this is really interesting.\n\n0:54:01\tSPEAKER_05\n It's cool stuff.\n\n0:54:02\tSPEAKER_05\n I was going to say can you do that for the other meetings?\n\n0:54:05\tSPEAKER_07\n Can you do it for them?\n\n0:54:06\tSPEAKER_08\n No, actually I thought that's what you were given.\n\n0:54:09\tSPEAKER_08\n So it was another meeting.\n\n0:54:10\tSPEAKER_08\n I was like, oh cool.\n\n0:54:11\tSPEAKER_04\n How long did it take just briefly?\n\n0:54:13\tSPEAKER_04\n I have the script now.\n\n0:54:14\tSPEAKER_04\n So I mean it can work off the label.\n\n0:54:16\tSPEAKER_04\n Okay, so it has to be handled label first.\n\n0:54:18\tSPEAKER_04\n Well, yeah, because, well, I mean, once his is algorithm is that it works well enough.\n\n0:54:23\tSPEAKER_04\n Then we could do that way.\n\n0:54:25\tSPEAKER_04\n Okay, but it's really worked out with my things.\n\n0:54:27\tSPEAKER_04\n I'm not quite to the point where it was.\n\n0:54:29\tSPEAKER_04\n What this is caused me.\n\n0:54:30\tSPEAKER_04\n So this discussion caused me to want to subdivide these further.\n\n0:54:33\tSPEAKER_04\n I'm going to take a look at the back channel.\n\n0:54:35\tSPEAKER_04\n So much we have the panel.\n\n0:54:36\tSPEAKER_04\n I hope to have that.\n\n0:54:37\tSPEAKER_07\n And my algorithm worked great actually on these.\n\n0:54:40\tSPEAKER_07\n But when you wear it like that or with the lip hell, or if you have it very far from your face, that's when it starts failing.\n\n0:54:48\tSPEAKER_05\n Well, I can wear it.\n\n0:54:49\tSPEAKER_05\n It doesn't matter.\n\n0:54:50\tSPEAKER_07\n I mean, we wanted to wear it, right?\n\n0:54:52\tSPEAKER_07\n It's too late.\n\n0:54:53\tSPEAKER_07\n I don't want to change the way we do to be in it.\n\n0:54:55\tSPEAKER_07\n It's just a comment on the software, not a comment on the prescriptions on how you wear microphones.\n\n0:55:03\tSPEAKER_07\n Okay, let's get the bolts.\n\n0:55:05\tSPEAKER_07\n Let's do digits.\n\n0:55:07\tSPEAKER_07\n Transcript 16111630.\n\n0:55:10\tSPEAKER_07\n 5306185750.\n\n0:55:14\tSPEAKER_07\n Strike that.\n\n0:55:15\tSPEAKER_07\n 75108.\n\n0:55:17\tSPEAKER_07\n 8770980091392133442890597809869023857805094650207117529266007234.\n\n0:55:45\tSPEAKER_08\n Transcript 1851-187046055987681478054064016007000400400416004651222716634.\n\n0:56:14\tSPEAKER_08\n 5074-725448331-93421-00991241.\n\n0:56:30\tSPEAKER_05\n Transcript 18311850.\n\n0:56:36\tSPEAKER_05\n 3608456-83792-948150880301905625353527096520781298893623390060399024, I'm sorry, 2244340.\n\n0:57:05\tSPEAKER_06\n Transcript 1791-181012005843051665540890035840143692243724756.\n\n0:57:34\tSPEAKER_06\n 7056-911-0578703811729102.\n\n0:57:44\tSPEAKER_00\n Transcript 1811-1830230654066547067737890089529709649101032445606864706.\n\n0:58:13\tSPEAKER_01\n Transcript 1771-1790-005782021348358645205550678041060780410607706.\n\n0:58:42\tSPEAKER_01\n 41039-0230-C492-01543279340540403271345308258146955708909.\n\n0:59:10\tSPEAKER_04\n Transcript 1751-1770-011492887897354500604018120276.\n\n0:59:27\tSPEAKER_04\n 812-0276-923-1518-030-205-0123-0303184-524-64522-851-8900.\n\n0:59:49\tSPEAKER_04\n The only one that wasn't red is known, so we don't do it properly.\n\n", "summary": [{"summary_text": "SPEAKER and JANE are going on a trip. If anyone hasn't signed the consent form, please do so. Jane has some research issues to talk about and Speaker has some short research issues. Speaker sends a list of things that he thinks were done over the last three months to Adam and Jane."}]}