{"filename": "./data/Bmr001.txt", "transcript": "0:00:00\tSPEAKER_03\n Okay, so we're live.\n\n0:00:03\tSPEAKER_03\n Okay, are we live or are we memory X?\n\n0:00:05\tSPEAKER_02\n We're okay, somewhere in between.\n\n0:00:07\tSPEAKER_02\n Okay, so we have some sheets for some...\n\n0:00:10\tSPEAKER_02\n Right, so you're gonna set that?\n\n0:00:13\tSPEAKER_01\n Is that all right?\n\n0:00:14\tSPEAKER_01\n Yeah, kind of, put this thing in.\n\n0:00:15\tSPEAKER_02\n Okay, so this is February 2nd, 2000.\n\n0:00:19\tSPEAKER_02\n This is meeting number one with Adam and Dan and Morgan, about five o'clock in the afternoon.\n\n0:00:28\tSPEAKER_02\n Yeah.\n\n0:00:29\tSPEAKER_02\n Yeah, it's a microphone.\n\n0:00:30\tSPEAKER_02\n What's this one here?\n\n0:00:31\tSPEAKER_02\n This one has a couple of TV electrics.\n\n0:00:33\tSPEAKER_01\n That's the dummy PDA.\n\n0:00:35\tSPEAKER_02\n That's connected to?\n\n0:00:37\tSPEAKER_01\n Yep, yeah it is.\n\n0:00:38\tSPEAKER_02\n That's connected.\n\n0:00:39\tSPEAKER_02\n Two channels.\n\n0:00:40\tSPEAKER_02\n Two channels.\n\n0:00:41\tSPEAKER_01\n Yeah, it is a element.\n\n0:00:45\tSPEAKER_03\n Yep.\n\n0:00:46\tSPEAKER_03\n Okay, although the gain is pretty low.\n\n0:00:48\tSPEAKER_03\n So for the red numbers task,\n\n0:00:51\tSPEAKER_01\n let's just name the microphones. Okay, so I'm speaking on the AM-mounted wired headset thing.\n\n0:01:02\tSPEAKER_03\n Okay, right, and I'm now talking on microphone number two.\n\n0:01:06\tSPEAKER_03\n The wireless microphone number two.\n\n0:01:08\tSPEAKER_02\n Yeah.\n\n0:01:09\tSPEAKER_02\n I have no idea which one I'm on.\n\n0:01:11\tSPEAKER_02\n Oh, one, oh, I'm number one.\n\n0:01:12\tSPEAKER_02\n Absolutely.\n\n0:01:13\tSPEAKER_02\n Okay, which is a lapel that gets sticking through my...\n\n0:01:18\tSPEAKER_01\n Yeah.\n\n0:01:19\tSPEAKER_01\n Okay, so this is the PCM nearest the machine room at the table.\n\n0:01:24\tSPEAKER_01\n Actually, I know that, yeah, it's number three, it says, but we'll be able to figure it out.\n\n0:01:30\tSPEAKER_01\n This is in the middle of the table.\n\n0:01:31\tSPEAKER_01\n This is further down the table.\n\n0:01:35\tSPEAKER_01\n And this one is right at the end of the table.\n\n0:01:38\tSPEAKER_01\n Okay, and then we've got the...\n\n0:01:42\tSPEAKER_01\n This is the left side of the dummy PDA, and this will be the right side.\n\n0:01:46\tSPEAKER_02\n I think this thing is going to be like watching some of these home movies.\n\n0:01:49\tSPEAKER_03\n Yes, it'll be pretty horrible.\n\n0:01:50\tSPEAKER_03\n Very exciting.\n\n0:01:51\tSPEAKER_03\n So what I have on these forms here is for the Red numbers, Red digits test, and it's extracted directly from Aurora.\n\n0:01:58\tSPEAKER_03\n And so what I was thinking is, you could start just by filling it out and then reading the numbers on the form.\n\n0:02:04\tSPEAKER_02\n Okay, what do we do with this stuff on top?\n\n0:02:06\tSPEAKER_02\n Fill it out.\n\n0:02:08\tSPEAKER_02\n What do I...\n\n0:02:09\tSPEAKER_02\n Do we say it after we...\n\n0:02:10\tSPEAKER_02\n No, no.\n\n0:02:11\tSPEAKER_01\n Just write it down.\n\n0:02:13\tSPEAKER_02\n What are we writing at that?\n\n0:02:14\tSPEAKER_03\n So that when we transcribe the data, we can figure out who said it, and they gender and the date and the time and what might they wrong and all that sort of thing.\n\n0:02:23\tSPEAKER_02\n Okay, that's good.\n\n0:02:24\tSPEAKER_02\n So I don't need to fill that out right now.\n\n0:02:26\tSPEAKER_02\n Maybe you should just say it.\n\n0:02:28\tSPEAKER_03\n Okay, I don't want to fill it out right now just so that...\n\n0:02:31\tSPEAKER_02\n So then we're not spending the time writing it out.\n\n0:02:33\tSPEAKER_02\n So we're spending the time talking.\n\n0:02:34\tSPEAKER_01\n Well, you give me one of those, and we can fill it out, and Morgan can read, and then we can do that.\n\n0:02:39\tSPEAKER_02\n We're just concerned about a bunch of dead time when we're all sitting here and filling it up.\n\n0:02:42\tSPEAKER_02\n Yeah, yeah.\n\n0:02:44\tSPEAKER_03\n And so you have to be sure to pause between each line since we're going to be segmenting it from then.\n\n0:02:49\tSPEAKER_02\n Right, right, that way.\n\n0:02:50\tSPEAKER_02\n Okay, so this is Morgan, I'm going to read some numbers now.\n\n0:02:54\tSPEAKER_02\n One, two, three, zero, eight, two, five, two, one, zero, nine, six, three, seven, five, eight, six, zero, one, one, six, two, nine, oh, oh, two, oh, six...\n\n0:03:11\tSPEAKER_02\n Whoops, that's a mistake.\n\n0:03:12\tSPEAKER_02\n This one's the scratch, start over.\n\n0:03:15\tSPEAKER_02\n Oh, oh, two, one, six, four, one, zero, zero, seven, zero, four.\n\n0:03:22\tSPEAKER_03\n That's my good.\n\n0:03:23\tSPEAKER_03\n Okay, so Adam Janon next, transcript number two on a wireless headset number two, two, seven, oh, three, six, seven, four, five, seven, one, nine, zero, eight, five, nine, eight, zero, seven, four, three, seven, oh, zero, nine, nine, five, one.\n\n0:03:46\tSPEAKER_01\n Okay, and this is Dan on the wired headset, transcript number one, two, one, four, eight, three, eight, four, three, oh, six, five, seven, one, five, five, two, seven, six, seven, eight, oh, three, oh, zero, two, one, five, one, eight.\n\n0:04:08\tSPEAKER_03\n So I definitely wasn't pausing enough between them.\n\n0:04:11\tSPEAKER_01\n These are the things that we'll find out.\n\n0:04:13\tSPEAKER_02\n I don't know if I said my was going to have to get zero, but it was.\n\n0:04:16\tSPEAKER_02\n Okay.\n\n0:04:17\tNone\n That's a little bit.\n\n0:04:18\tSPEAKER_02\n So where are we in this?\n\n0:04:19\tSPEAKER_02\n Let's see.\n\n0:04:20\tSPEAKER_02\n So we now have a few mics that work.\n\n0:04:22\tSPEAKER_02\n How long are they going to take you to set this up?\n\n0:04:31\tSPEAKER_01\n Oh, it doesn't take, as you say, we haven't said that well, but it doesn't take long to set up.\n\n0:04:37\tSPEAKER_01\n We just came up here, after I pulled you, so it took like 20 minutes and like that.\n\n0:04:41\tSPEAKER_03\n That included a fair amount of fiddling.\n\n0:04:44\tSPEAKER_01\n Yeah.\n\n0:04:45\tSPEAKER_03\n I mean, the equipment, it's more or less the first time we tried to do it.\n\n0:04:48\tSPEAKER_01\n Right.\n\n0:04:49\tSPEAKER_01\n We had them went through yesterday, just looked at everything, but it's all kind of here and set up such its question to any of all on.\n\n0:04:55\tSPEAKER_03\n And eventually we want to like, tape that over and run them up through the center so that wires aren't, right, aren't people aren't tripping over the wires and so on.\n\n0:05:05\tSPEAKER_02\n Are we going to, I mean, it's going to be over there,\n\n0:05:07\tSPEAKER_01\n is it going to be there? It's going to, it's for reasons because of the microphone runs, and that chunk there, there's more equipment in there.\n\n0:05:15\tSPEAKER_01\n Right.\n\n0:05:16\tSPEAKER_01\n But the idea is that there are, these microphones on the table, there are some cables coming down, they're under a nice mat, and then that's, a bunch of them get sort of converted digital there.\n\n0:05:27\tSPEAKER_01\n And the idea is that this gets replaced by a cabinet with doors, so that it's not open to fiddling.\n\n0:05:34\tSPEAKER_02\n So that's what's going to happen.\n\n0:05:36\tSPEAKER_00\n Right.\n\n0:05:37\tSPEAKER_00\n Okay.\n\n0:05:38\tSPEAKER_03\n That's, do we have like a cabinet on order or do we just need to do that?\n\n0:05:42\tSPEAKER_01\n We need to do that.\n\n0:05:43\tSPEAKER_01\n It's on the list, there are things to do.\n\n0:05:45\tSPEAKER_01\n I keep on hoping that, they're going to get done, but they don't.\n\n0:05:48\tSPEAKER_01\n Well, I,\n\n0:05:49\tSPEAKER_03\n I can help them get done. One question is budget.\n\n0:05:52\tSPEAKER_03\n Do we have any money at all that we can go out and spend on things like cabinets or a hard driver, things like that?\n\n0:05:58\tSPEAKER_03\n I mean, I don't know.\n\n0:05:59\tSPEAKER_02\n Did we spend the budget already?\n\n0:06:01\tSPEAKER_02\n Yeah.\n\n0:06:02\tSPEAKER_02\n How much are we talking about?\n\n0:06:07\tSPEAKER_02\n Yeah.\n\n0:06:08\tSPEAKER_01\n I don't know.\n\n0:06:13\tSPEAKER_01\n A cabinet is probably going to cost $100, $200,000 or something like that.\n\n0:06:17\tSPEAKER_01\n Yeah, you know,\n\n0:06:18\tSPEAKER_02\n we spend $100,000 or something like that. I don't know anybody.\n\n0:06:21\tSPEAKER_02\n Anything?\n\n0:06:22\tSPEAKER_02\n I'm more worried about things being kept in a funky state long enough that stuff is broken.\n\n0:06:28\tSPEAKER_02\n Yeah.\n\n0:06:29\tSPEAKER_02\n Well, I think our intention at this point\n\n0:06:31\tSPEAKER_03\n is when we're not using it to record a meeting, we'll coil them all up and put them under so that people will not be tripping over.\n\n0:06:37\tSPEAKER_03\n So, yeah.\n\n0:06:38\tSPEAKER_01\n But what we should get to, a nice kind of working state of the setup is quickly as possible.\n\n0:06:44\tSPEAKER_01\n Yeah.\n\n0:06:45\tSPEAKER_01\n And there's also the minor matter\n\n0:06:46\tSPEAKER_02\n of becoming nice to be able to bring people in and say, yes, this is where we do such an assumption.\n\n0:06:51\tSPEAKER_02\n Right now, I can't be able to see you.\n\n0:06:53\tSPEAKER_02\n Yeah.\n\n0:06:54\tSPEAKER_02\n It's okay.\n\n0:06:55\tSPEAKER_02\n I mean, it's less important than doing what we're doing right now.\n\n0:06:57\tSPEAKER_02\n Yeah.\n\n0:06:58\tSPEAKER_02\n So, I mean, there's one big issue\n\n0:07:01\tSPEAKER_01\n with the equipment still, which is, ultimately, what the idea is to have any number of these wired headsets, but there's this amplification problem.\n\n0:07:12\tSPEAKER_01\n I built this thing.\n\n0:07:13\tSPEAKER_01\n It's very noisy.\n\n0:07:14\tSPEAKER_01\n We're actually recording.\n\n0:07:15\tSPEAKER_01\n I'm going through it at a moment.\n\n0:07:17\tSPEAKER_01\n But it's so noisy that I'm not using it for this.\n\n0:07:19\tSPEAKER_01\n It was designed to be used for the desktop videos, but I'm using running that through my, uh, dad machine as a preamp as an alternative.\n\n0:07:27\tSPEAKER_01\n Well, we should be able to do the scuba or some preamps.\n\n0:07:30\tSPEAKER_02\n Yeah.\n\n0:07:35\tSPEAKER_01\n It's just, you see how clumsy this is, right?\n\n0:07:39\tSPEAKER_01\n I have to use these batteries to buy us them.\n\n0:07:41\tSPEAKER_01\n And I'm only getting two channels and they're a bunch of, they're like three connectors in the circuit.\n\n0:07:45\tSPEAKER_01\n The thing is like, it's, it's not that the thing doesn't exist commercially, but there isn't one unit which does the whole thing in one, in one sort of.\n\n0:07:56\tSPEAKER_01\n So it seemed like it was a good idea to make one.\n\n0:07:59\tSPEAKER_01\n Um, and I'm still not sure.\n\n0:08:02\tSPEAKER_01\n I mean, I think I probably know how to fix this.\n\n0:08:04\tSPEAKER_01\n I can probably, you build it better so it doesn't have such noise.\n\n0:08:07\tSPEAKER_01\n But, um,\n\n0:08:08\tSPEAKER_03\n ultimately we're going to need to build one anyway. Oh, sure.\n\n0:08:11\tSPEAKER_01\n We could just,\n\n0:08:12\tSPEAKER_03\n we could have to put it in a pda.\n\n0:08:14\tSPEAKER_00\n Well,\n\n0:08:16\tNone\n right? We have microphones in a pda.\n\n0:08:19\tSPEAKER_03\n It's going to need bias and a preamp.\n\n0:08:22\tSPEAKER_02\n I guess I sort of figured that the gym would do that at some point.\n\n0:08:25\tSPEAKER_02\n Yeah.\n\n0:08:26\tSPEAKER_01\n Well, yeah.\n\n0:08:29\tSPEAKER_01\n James Bezier at the moment.\n\n0:08:32\tSPEAKER_01\n That's the problem.\n\n0:08:33\tSPEAKER_01\n I was kind of hoping that Jim was going to build the sparks.\n\n0:08:35\tSPEAKER_01\n Yeah.\n\n0:08:36\tSPEAKER_01\n But he hasn't had time.\n\n0:08:37\tSPEAKER_01\n Oh, I think he has quite some doing it.\n\n0:08:39\tSPEAKER_01\n Okay.\n\n0:08:40\tSPEAKER_02\n Well, if it's too noisy, and if there's something we can buy again, for you know, moderate amount of play, so he takes a couple of locks and it's just, maybe we should just do it.\n\n0:08:50\tSPEAKER_02\n And then, and then later, we can, replace it with, because there may be other considerations that we're going to design.\n\n0:08:58\tSPEAKER_02\n Are getting some experience with this may help to determine some of the things that might change this design.\n\n0:09:05\tSPEAKER_02\n Right?\n\n0:09:06\tSPEAKER_02\n So, there was a statement made, which I don't think is right, by the way, but there's a statement made at the DARPA communicator meeting, was that recently, that microphone, at a distance of less than, three feet, or something like that, we're totally useless, completely irrelevant.\n\n0:09:32\tSPEAKER_03\n Oh, yeah.\n\n0:09:33\tSPEAKER_03\n You mean for noise canceling?\n\n0:09:34\tSPEAKER_03\n No, it's nice canceling.\n\n0:09:36\tSPEAKER_02\n My common argument is, is a white rat, which has two microphones, exceedingly close together, works pretty well.\n\n0:09:48\tSPEAKER_02\n But, Okay.\n\n0:09:50\tSPEAKER_01\n Yeah.\n\n0:09:51\tSPEAKER_03\n Do they mean, on the directional, was that their point?\n\n0:09:55\tSPEAKER_03\n I mean, because all the noise canceling mics, there, you know, there, a few millimeters away from each other,\n\n0:10:00\tSPEAKER_01\n pointing in different directions. I think, I mean, my guess is, that means it's just that, if it's near field, the mathematics of beam steering is different.\n\n0:10:08\tSPEAKER_01\n If the wavefronts are not approximately planar, then you can't just do delay and solve and expect it to work.\n\n0:10:13\tSPEAKER_03\n Okay. So, they're not talking about, how far apart the mics are.\n\n0:10:16\tSPEAKER_03\n They're talking about how far they are from the speaker.\n\n0:10:18\tSPEAKER_01\n I guess.\n\n0:10:19\tSPEAKER_02\n Right.\n\n0:10:20\tSPEAKER_02\n My point is, I guess, if you have a, a volume in between the two, the two sensors, and you do something cleverer, they're fairly our ways,\n\n0:10:33\tSPEAKER_01\n to get more out of this. Right. Right. Right. Right. Right.\n\n0:10:35\tSPEAKER_01\n I mean, the, the weird thing is that, actually, delay in some beamforming is not, there's not the clever thing to do.\n\n0:10:42\tSPEAKER_01\n The, the underwater guys do this stuff, which is different.\n\n0:10:46\tSPEAKER_01\n And it actually means that, you should get micrances, close together, possible, rather than trying to get them far apart, so you can get separation.\n\n0:10:52\tSPEAKER_01\n You sort of, you want them very close, and the math is difficult to understand, but it's, yeah.\n\n0:10:57\tSPEAKER_01\n But it's there.\n\n0:10:58\tSPEAKER_02\n Well, there are various points in the meeting, where people were making very strong statements, as a matter of fact, like the interview, and the question is, it's just one of them, but it's kind of funny.\n\n0:11:07\tSPEAKER_02\n But I, what I take, if the mean is, doing the dumb thing, yeah, with two microphones, it'd be very different to get my challenge.\n\n0:11:15\tSPEAKER_02\n But I think it will be interesting to do, other things that are dumb.\n\n0:11:19\tSPEAKER_02\n So I, I think it's potentially interesting to do that, although we will have to be aware of this, and for regular purposes about it, and really that they may well be reviewers, and say, well, everyone knows, and you can't get anything out of it.\n\n0:11:31\tSPEAKER_02\n It's, yeah.\n\n0:11:32\tSPEAKER_03\n Do they believe you can get speaker location out of it?\n\n0:11:35\tSPEAKER_03\n Because that's, that's one way we could sneak it in.\n\n0:11:38\tSPEAKER_02\n Uh, that is important.\n\n0:11:41\tSPEAKER_02\n Yeah, certainly.\n\n0:11:42\tSPEAKER_02\n Well, we could,\n\n0:11:43\tSPEAKER_01\n I mean, at a time, we'll have data so we can actually, you know, demonstrate that.\n\n0:11:50\tSPEAKER_03\n Well, oh, you mean for location?\n\n0:11:53\tSPEAKER_03\n Yeah.\n\n0:11:54\tSPEAKER_02\n Well, okay.\n\n0:11:55\tSPEAKER_02\n That's something who's working on it.\n\n0:11:56\tSPEAKER_03\n We're getting similar now.\n\n0:11:57\tSPEAKER_03\n Yeah, right.\n\n0:11:58\tSPEAKER_03\n But someone has to write some software.\n\n0:11:59\tSPEAKER_00\n Right.\n\n0:12:00\tSPEAKER_00\n That's someone, someone who's interested in it.\n\n0:12:03\tSPEAKER_03\n Oh, that's, I was just thinking one thing we may want to do is put the fake pda right in front of someone, instead of in the middle of the table, like we have it now.\n\n0:12:11\tSPEAKER_03\n Yeah.\n\n0:12:12\tSPEAKER_03\n On the thought that my vision of it is, that each of us will have our little pda in front of us.\n\n0:12:16\tSPEAKER_03\n And so the acoustics, you might want to try to match the acoustics.\n\n0:12:20\tSPEAKER_02\n Maybe.\n\n0:12:21\tSPEAKER_02\n But on the other hand, suppose that you're the only one who is advancing up and is thinking, you can actually bring that to pda.\n\n0:12:29\tSPEAKER_02\n No, no, no.\n\n0:12:30\tSPEAKER_02\n You need to meet with us.\n\n0:12:31\tSPEAKER_02\n And therefore, you bring it in, and you probably want to see if there's any other people as possible.\n\n0:12:36\tSPEAKER_02\n So you might try to do the middle of the table.\n\n0:12:38\tSPEAKER_01\n Okay.\n\n0:12:40\tSPEAKER_01\n Oh, that's, we could make several, several more of these.\n\n0:12:43\tSPEAKER_01\n And we could have actual recordings with, you know, three pda's.\n\n0:12:47\tSPEAKER_01\n Yeah.\n\n0:12:48\tSPEAKER_02\n Well, I think we should.\n\n0:12:50\tSPEAKER_02\n I mean, I think at least with two.\n\n0:12:52\tSPEAKER_02\n Right.\n\n0:12:53\tSPEAKER_02\n Because one of the, one of the fantasies that was at least fun to talk about was that, okay, maybe you could, you're, the range of things that you can do with multiple microphones is limited if your appearance is a part.\n\n0:13:07\tSPEAKER_02\n But, if you have two of these things.\n\n0:13:09\tSPEAKER_02\n Yeah.\n\n0:13:10\tSPEAKER_02\n And, you know, it's this idea of the handshake that I can afford to say.\n\n0:13:14\tSPEAKER_01\n I'm here, I'm here.\n\n0:13:15\tSPEAKER_01\n Right.\n\n0:13:16\tSPEAKER_01\n Right.\n\n0:13:17\tSPEAKER_01\n Yeah.\n\n0:13:19\tSPEAKER_01\n And that seems very easy to believe.\n\n0:13:22\tSPEAKER_01\n So now I have been given the number of bomb pilots we've got in the table.\n\n0:13:26\tSPEAKER_03\n That's right.\n\n0:13:27\tSPEAKER_03\n Three, right?\n\n0:13:28\tSPEAKER_03\n Yeah.\n\n0:13:29\tSPEAKER_03\n So I guess this is a pretty dense group,\n\n0:13:30\tSPEAKER_01\n but it's getting a lot higher. We're not even, you know, it's not like we, we may be technical, but we're not particularly pda people.\n\n0:13:40\tSPEAKER_01\n So it's just having, but I'm trying to be,\n\n0:13:42\tSPEAKER_03\n well, I know, well, it's trying to, except I got a pda way before.\n\n0:13:45\tSPEAKER_03\n Well, I was doing can, I was doing wearable computers at Boeing, so I guess I sort of count.\n\n0:13:49\tSPEAKER_03\n Okay.\n\n0:13:50\tSPEAKER_02\n So, where are we?\n\n0:13:53\tSPEAKER_02\n No.\n\n0:13:54\tSPEAKER_02\n I mean, so we've just, we're doing this recording, so we show, we've been recording, right?\n\n0:14:00\tSPEAKER_02\n There's, I guess, a little more wiring to do or something to have, to have more, if we have more people participating in the meeting, we wouldn't quite be ready for that.\n\n0:14:09\tSPEAKER_01\n Well, we've got, we've got, right now we could have two more people on wireless, with a trip to Leo's audio, we could have third extra personal on wireless.\n\n0:14:17\tSPEAKER_01\n And, right now we could have three more, three more people wearing mics like this, and that would just work.\n\n0:14:23\tSPEAKER_01\n I mean, I'm not sure how, how good the quality of this mic, but I think it's going to be okay.\n\n0:14:26\tSPEAKER_01\n So we could actually have eight people with headset mics, with, basically, got an extra effort.\n\n0:14:35\tSPEAKER_03\n Five with wireless.\n\n0:14:36\tSPEAKER_03\n So we could have eight.\n\n0:14:37\tSPEAKER_03\n Nine.\n\n0:14:38\tNone\n Nine.\n\n0:14:38\tSPEAKER_03\n Nine, five with wireless.\n\n0:14:40\tSPEAKER_03\n And four without.\n\n0:14:41\tSPEAKER_03\n Yeah.\n\n0:14:42\tSPEAKER_03\n And four with wired.\n\n0:14:43\tSPEAKER_03\n We don't have headsets, though.\n\n0:14:45\tSPEAKER_01\n Yeah, we have the ones we've been using, the ones we got for the PC.\n\n0:14:49\tSPEAKER_03\n Oh, okay, so we just have to wander around\n\n0:14:51\tSPEAKER_01\n and collect the mic. Yeah, yeah.\n\n0:14:53\tSPEAKER_01\n I think we have three of those.\n\n0:14:54\tSPEAKER_01\n And there's one in my office.\n\n0:14:55\tSPEAKER_01\n Right, right.\n\n0:14:56\tSPEAKER_01\n That ain't all work, but the nice ones, the, the, the,\n\n0:15:01\tSPEAKER_03\n the, the,\n\n0:15:03\tNone\n the, the,\n\n0:15:04\tSPEAKER_02\n the, the, the, this,\n\n0:15:08\tNone\n that, on a team of ship More with the platform and basic theCUBE, he wants to use at the\n\n0:15:16\tNone\n Airport. Yeah.\n\n0:15:16\tSPEAKER_03\n But, I wanted to use a helicopter but I was walking and always wanted to use it\n\n0:15:24\tNone\n in other networks to cause it is the awareness that\n\n0:15:30\tSPEAKER_02\n it, even the throughout the algorithm is like it can tell like it was something like a gigabyte an hour if you didn't down sample once you down sample then there'll be something like a megabyte an hour a channel we figured out that it was 12 gigabyte\n\n0:15:51\tSPEAKER_01\n now for all the channels was that with or without the that was one gigabyte because no we've any no we've any got full gigabytes and\n\n0:16:00\tSPEAKER_03\n that we said four gigabytes and give us 20 minutes before we did anything else right and then we then we cut it in half by by so\n\n0:16:12\tSPEAKER_01\n saving 16 bits on set of that instead of one two okay so that's just two\n\n0:16:18\tSPEAKER_03\n gigabytes and I mean it's that's 40 minutes for the gigabytes for 40\n\n0:16:23\tSPEAKER_01\n minutes right that's a 44 kilohertz with 68 kilohertz yeah so we can actually\n\n0:16:29\tSPEAKER_03\n triple that so you can right so hang on so that would okay I came out of the gigabyte at one point that that's one computation I did for 16 channels 16 dead thanks to you now is it to you can hour them off by an order that's our headquarters because let me down back there maybe I we don't need\n\n0:16:48\tSPEAKER_01\n to save old channels and average we don't use old channels this one I'll do the higher math later but it's so\n\n0:16:56\tSPEAKER_02\n that's how much would we have to reformat the drive in there to get some of\n\n0:17:09\tSPEAKER_03\n the more space is a nine gig drive and yeah there's four gig on scratch and there's about three gig unused it looked like on show director yeah I just don't know enough about Linux how hard is it to re partition it's a pain\n\n0:17:24\tSPEAKER_01\n because because we got that 20 years and we have to back it all up and\n\n0:17:29\tSPEAKER_02\n come back on again yeah so fix and focus me if we are in fact gonna have 40 to 50 hours at some point we want to have part of our work be on future\n\n0:17:43\tSPEAKER_03\n extraction yeah so I've already created a you doctor speech data MR directory or had Jane do it and but there's not a lot of free space around so it has currently about four gig on the drive but I think she's gonna put it on and so we need we definitely need to go by yeah you know 40 gig 50\n\n0:18:13\tSPEAKER_01\n gig drive space we don't need to we don't necessarily need to online I mean it would be different subsets so you want to you want to do all 16 channels in\n\n0:18:22\tSPEAKER_03\n single that's true I hadn't even thought about that although it would be kind\n\n0:18:28\tSPEAKER_01\n of interesting yeah what would you do you typically trying I mean you'd have you'd have 50 hours we'd only use one of the 2zN channels and like this and so that wouldn't you would have to use all 16 channels at once but it's kind of painful for because basically if we put them on CDs then this each CD will have all the channels for one recording and then when you went to other P files you just want to get one of those channels off each other sessions yeah it's\n\n0:18:55\tSPEAKER_02\n pretty horrible so what would we do for training so if we're training just we\n\n0:18:59\tSPEAKER_01\n just use one of them yeah maybe two of them but I mean we didn't use we don't\n\n0:19:03\tSPEAKER_03\n use the distant mics yeah so it might be four right but it wouldn't be 16\n\n0:19:10\tSPEAKER_02\n well although we wanted to get a line that's close but that's a separate training right but you don't want to be constantly taking whatever you have on your\n\n0:19:19\tSPEAKER_03\n disk more disk is better absolutely I mean yeah my preference would be to get get ourselves a hundred giga disk yeah and just not bother so it's more of an\n\n0:19:29\tSPEAKER_02\n issue of structuring and back up\n\n0:19:34\tSPEAKER_01\n if we want to own CD room then it doesn't need to be back in fact we could you know we could put a way to put this new stuff you put on mask\n\n0:19:45\tSPEAKER_03\n yeah we were talking about that I'm not sure if anyone's still using it I think\n\n0:19:49\tSPEAKER_02\n the only one is using it has been heavier but at this point I think he's only been using features that he calculated quite a while ago if nobody else is doing\n\n0:19:57\tSPEAKER_03\n I'll send mail to speech local I'll send mail to speech local on\n\n0:20:02\tSPEAKER_02\n see if anyone's still using it how much space is that it's 20 CDs that's 12 gigabytes so that would last just for a while yeah a couple of years but anyway this recording we're fine well right now we don't have any choice\n\n0:20:20\tSPEAKER_03\n it still records all 16 channels it's just most of marl zero's that's on our list too yeah yeah it's mostly a question of user interface how do we specify which ones are on yeah so we don't store any of our audio formats compressed in any way doing so these large sections when you guys aren't\n\n0:20:43\tSPEAKER_01\n talking yeah probably we could probably guess around choking on the most something and it'll get a big win run shortening turning around since lossless it does AR modeling so it looks at the section it runs an AR model to sort of to widen it and then quantizes the residual with a nice with with as few bits so I think it on each block it'll it'll compress you know if there's low-dining range it'll use very few bits I think it\n\n0:21:24\tSPEAKER_03\n does that yes it's a pzm's yeah yeah that's something that we definitely need to look at with this maybe we shouldn't have sub sample over down to 16 bits\n\n0:21:35\tSPEAKER_01\n well it's okay it's not even first try I what I'm thinking is obviously we can do the we can we can choose any 16 bits from the home for so we can just have different games that we use you know my channel yeah so we might want to see\n\n0:21:50\tSPEAKER_03\n if maybe the low 16 bits on the pzm's are better than the middle yeah I think\n\n0:21:55\tSPEAKER_01\n probably the bottom full pits are not any good regardless yeah I'm right well though you know claims they are but probably the we I was just noticing on the on\n\n0:22:04\tSPEAKER_03\n the there's a view meter software view meter and the pzm gain is real low yeah\n\n0:22:09\tSPEAKER_02\n so I think initially we should take up more space until we've analyzed this and get a better sense of it yeah I mean we're not finding that 40 or 50 hours at this point we're talking about half on and up to three yeah we should look at this carefully yeah I was interested in the side of the 24 on yeah I mean\n\n0:22:31\tSPEAKER_00\n I think that's a nice yeah we got a lot of bits of noise\n\n0:22:37\tSPEAKER_01\n these things are really amazing yeah and they seem they seem good then some sort of\n\n0:22:43\tSPEAKER_02\n oversampling you can't have component tolerances that are right\n\n0:22:52\tSPEAKER_03\n right the other other thing another issue is just getting a sound card up here you know I assume that we could just put a sound blaster in if we want sound out\n\n0:23:05\tSPEAKER_01\n that that that machines got sound because the sound blaster built into oh it's just not working I just I just disabled it didn't want to find out how well they can sound in the structure with the deal with the ones okay but I think yeah that's probably it will be fun yeah that way we don't we can't listen to it on this machine oh for a couple of reasons there were two ways we could listen to it as a sound there's actually sound output built into this thing yeah but the driver the driver may not support it yet and then there's also the sound of the sound cut built in but I don't know how the system would like\n\n0:23:42\tSPEAKER_03\n how to sound cuts but we can have 2Q stuff over there right yeah and we've looked at it so we know it's working and you can see the little squiggles and it looks like\n\n0:23:50\tSPEAKER_02\n speech so yeah this can't be so yeah okay once you just and I have is that I think this maybe we should just read some more you made more of these right I think we should read some more okay because because this is very we need to work the the talker's more because we're not gonna have that in the meeting and this is a pretty tiny little thing so maybe we should do another\n\n0:24:23\tSPEAKER_03\n well right I just did 10 per page I could easily do 20 per page it's just a question of how much annoyance I wanted to put people going to be\n\n0:24:34\tSPEAKER_02\n well this is us we can't have a lot of annoyance yeah I think so we do you know this chart are we are we sort of we talked out about what we're\n\n0:24:45\tSPEAKER_01\n well not okay the the question I still have about what we're gonna do is what it's what it okay so we can get the equipment set up so that basically we're in situation where we can with you know 10 minutes of preparation they can bring nine people in here and do a channel recording what what are we gonna do that who are they gonna be what me to be gonna record to begin with so which I think we think what me think do we have I mean like us being the me to record a few people are I think anything that speech I think it does um\n\n0:25:17\tSPEAKER_03\n certainly us meeting recorder yeah um us other groups it just depends on how many meetings were we're having um Jerry also said it would be he would be willing to have his group some of the AI meetings do it as well and we should have like we should have decadent meetings and stuff exactly exactly I think there are enough incidental meetings for us to to do this and if we can get it set up so it's convenient enough uh I mean that's the thing it's I can just do spontaneous meetings as well right which I'm interested in that's one of the things the whole reason I want a pda as opposed to a wire grone right is for spotting these meetings so we've got to make it really really easy to start a guy that's right that's that's the one that's why I put 10 on here instead of\n\n0:25:56\tSPEAKER_01\n right I mean if we if we want Jerry's group to use it then we probably would tell them to read any numbers right right well I bet they would be willing to do it\n\n0:26:04\tSPEAKER_02\n the first few times just for the novelty I think they would and also he's he's got at least one woman that's all right that's a good point we have a little problem\n\n0:26:15\tSPEAKER_03\n that's I had never I hadn't even thought about that yeah\n\n0:26:19\tSPEAKER_02\n this uh street works that's coming in there's another woman all but she's\n\n0:26:23\tSPEAKER_01\n it's alright she doesn't mind if I could have video\n\n0:26:24\tSPEAKER_03\n all that's right yeah so maybe we should have the reading group here and force\n\n0:26:29\tSPEAKER_02\n Jane to come yeah yeah well actually we could have Jane Jane's interested in curious about this yeah so she could attend one and probably not the decoding meeting and some of the other stuff\n\n0:26:40\tSPEAKER_01\n could we could have the reading great yeah yeah yeah\n\n0:26:44\tSPEAKER_03\n it's a different style but I think that's all right yeah it's great yeah we were joking about having lunch up here but eating with the like okay I had another question briefly about transcription so are we going to get an external service or are we going to do I mean who's going to generate the transcripts I think that one of the\n\n0:27:05\tSPEAKER_02\n neat things about having this little pilot thing today is we should try it a couple different ways so we should try to do it internally maybe ask Jane if you could get her to do it or or have to supervise and just keep shooting somebody and see how long it takes and we're going out to cost and then send send the same thing out or maybe split it in halves or something like that to uh to an outside service and see what that cost and how much has it\n\n0:27:36\tSPEAKER_03\n been right then the problem of course is that it's you know in this meeting it's three four five six seven eight it's nine\n\n0:27:47\tSPEAKER_01\n transcripts potentially well except that you wouldn't transcribe the one individually right you'd send I mean a transcriber is used and I know presumably transcriber transcribes a single meeting right and so they they just have to indicate that the\n\n0:28:03\tSPEAKER_02\n speakers are going to make they're going to have to make speaker assignments\n\n0:28:23\tSPEAKER_03\n listening like this they're going to have to make speaker assignments and which recording are they going to listen to or we could mix we could mix\n\n0:28:30\tSPEAKER_01\n the the headset mics you know just to make a single high quality we could do the interesting and we could do all kinds of weird things like having you know squelts so that you only you know you can cut it out when there's no energy so you can say don't you say don't go\n\n0:28:43\tSPEAKER_02\n about that and you can do fancy things if you prefer\n\n0:28:47\tSPEAKER_01\n that yeah I mean it's it's if we if we do something we just have a little bit of human input to get the words then we can leverage that a lot by some cloud-priced single figure out which channel they really go on to\n\n0:28:59\tSPEAKER_03\n I mean that's one chunk of work and just segmenting for this is going to be\n\n0:29:08\tSPEAKER_01\n another chunk of work yeah\n\n0:29:12\tSPEAKER_02\n much less than you want yeah but I don't know this meeting say it's going to be done half-on or something yeah and you heard that that's maybe 20 times real time to do this kind of transcription so you know the principal when it takes me a day and if you deal with it and we'll see which one of those seems closest to right and they ramped up if closed the end of it is faster and it doesn't show the sense of where it does it and then I guess I'll check it out if it makes any service and see if it's faster, if you're very interested in everything\n\n0:29:57\tSPEAKER_03\n I go from there yeah one of the things I was thinking with transcript is that if we take the near field and do we do an initial recognition pass as an easier for a transcriber to correct a transcript if the near field mic does a reasonably good job I bet it isn't unless it's really close to right just because it's such\n\n0:30:19\tSPEAKER_01\n that transcribing is sort of something you imagine doing right less having this distraction of having sort of something it looks like it might be right but it's got some sorry wrong a bit it's then sort of a less less easy thing to do I don't know I don't know I'm sure the professional transcript is obviously\n\n0:30:35\tSPEAKER_02\n don't have any useful I don't know yeah well I mean there's this cyber transcript that's right yeah it's right and at least supposedly the way they work is by feeding them yeah by fixing up a transcript so maybe it depends on what the software tools are like yeah it's yeah easily flipped through stuff and get to the right thing maybe point it yeah first piece of know how to work shepherd is or something Scott made it\n\n0:31:06\tSPEAKER_01\n I should have been in there I know that's what the good the cheap English speakers are not Scott that's not in Scott well they don't speak that's clearly they speak they speak\n\n0:31:19\tSPEAKER_02\n cheap English okay so where did you enter in are we done with them in our business sure I mean what's maybe we should what are action so there's the continuing process of cleaning up the stuff and making it easy to do that there's taking the results of this meeting and put it in some kind of decent form probably getting some kind of single channel merged some data or something so that you can give a simple sound file some sort of to a transplant to deal with it I didn't miss massive things but to deal with it\n\n0:31:55\tSPEAKER_03\n stuff right and then do some segmenting and recognition initial recognition pretty interesting to do yeah although\n\n0:32:04\tSPEAKER_02\n it may be separating out these numbers that's right yeah\n\n0:32:10\tSPEAKER_03\n yeah just doing the digits on it connect the digits\n\n0:32:18\tSPEAKER_02\n you want to read sure okay so this is transcript three this is Morgan and we're listening to two four one three five five six eight six eight seven eight eight six eight nine zero eight oh one three five\n\n0:32:40\tSPEAKER_03\n two two nine this is Adam on wireless headset number two with transcript number five three four oh six five two six seven four eight five four nine oh zero one zero eight eight five three three seven one\n\n0:33:06\tSPEAKER_01\n this is Dan and this transcript number four three nine four seven one eight five six seven zero four six nine eight nine nine two three oh six five zero four four three six five nine one nine five two\n\n0:33:30\tSPEAKER_03\n oh I did ten but I can I have a script to generate them automatically\n\n0:33:36\tSPEAKER_02\n let's just one we got it okay what the fun it is well you know it's not\n\n0:33:40\tSPEAKER_01\n the it's interesting that it's not clear whether it's better to have them written as as words or figures but of course to get zero and oh distinguish between you have to do it but it's kind of weird to read\n\n0:33:54\tSPEAKER_02\n okay this is uh Morgan again with wireless lapel transcript six four five five five five five zero nine seven one six nine one four oh seven eight nine oh four five three five eight zero two one five nine one three two eight zero five three five five three six\n\n0:34:22\tSPEAKER_03\n this is Adam on the wireless headset transcript eight five five two zero six seven oh oh seven six eight nine eight nine oh zero two two eight two oh three four eight four seven zero\n\n0:34:42\tSPEAKER_01\n this is Dan with transcript number seven four five six four four five six oh six oh two eight one two oh eight five nine nine three five oh three two four oh zero one two oh six two three\n\n0:35:07\tSPEAKER_02\n yeah it's just two more uh okay\n\n0:35:14\tSPEAKER_03\n yeah thanks wait go ahead and read it then it'll help okay so uh this is\n\n0:35:22\tSPEAKER_02\n Morgan again with the wireless lapel transcript nine five seven three five three seven nine six nine seven eight zero oh two seven four oh zero two three one nine zero nine one three oh two eight nine oh two eight three five four\n\n0:35:46\tSPEAKER_01\n and this is Dan with transcript 10 five seven one one eight five oh one six four six nine eight seven zero oh zero one two four one oh four oh five three four nine nine six oh\n\n0:36:09\tSPEAKER_02\n okay okay there you go thank you wonder if we've been out of this space yet so it's going to get spring\n\n", "summary": [{"summary_text": "It's February 2nd, 2000. It's meeting number one with Adam and Dan and Morgan. They're going to watch some home movies. They have some sheets for some sheets. Speaker is speaking on the AM-mounted wired headset thing. He's also talking on microphone number two."}]}