{"filename": "./data/Bmr030.txt", "transcript": "0:00:00\tSPEAKER_03\n And we're on.\n\n0:00:01\tSPEAKER_03\n So, topic number one is we got the NSFATR, ITR, excuse me, which was originally pretty big, but it's divided among many sites, and they cut the budget by two-thirds.\n\n0:00:19\tSPEAKER_03\n So they approved it for all the sites, but only gave us like 62% of the money.\n\n0:00:25\tSPEAKER_03\n Or excuse me, cut it by 62%.\n\n0:00:29\tSPEAKER_03\n So Morgan is, and the other condition is that they have to get a budget out like immediately, or go get the money to someone else.\n\n0:00:36\tSPEAKER_03\n So Morgan's working on that.\n\n0:00:37\tSPEAKER_03\n So I mean, it's good news.\n\n0:00:38\tSPEAKER_03\n It's not as good as it could have been, but it was the ITR's long shot, and so it's really nice.\n\n0:00:47\tSPEAKER_03\n What does that say?\n\n0:00:48\tSPEAKER_03\n What's that say for?\n\n0:00:49\tSPEAKER_03\n Information technology research, something like that.\n\n0:00:53\tSPEAKER_02\n It's pretty much.\n\n0:00:54\tSPEAKER_02\n Yeah, it's pretty big.\n\n0:00:55\tSPEAKER_02\n It's government running it.\n\n0:00:56\tSPEAKER_05\n We've got some money that we can use.\n\n0:00:59\tSPEAKER_05\n We're in conjunction with SRI, Washington, and Columbia, and to do research on the meetings.\n\n0:01:07\tSPEAKER_03\n Yeah, it was specifically on the meeting.\n\n0:01:09\tSPEAKER_03\n So was that the one that was the meeting maps?\n\n0:01:11\tSPEAKER_03\n Yeah.\n\n0:01:12\tSPEAKER_03\n Okay, good.\n\n0:01:13\tSPEAKER_03\n I like that one.\n\n0:01:14\tSPEAKER_05\n What is meeting maps?\n\n0:01:15\tSPEAKER_05\n Mapping meetings.\n\n0:01:16\tSPEAKER_03\n Well, the general idea was you can think about meetings at lots of different levels, all the way down to acoustics, all the way up to dialogue, discourse, topic.\n\n0:01:28\tSPEAKER_03\n And so this was, how do you map all that information onto that?\n\n0:01:31\tSPEAKER_03\n It's like creating a map of a meeting.\n\n0:01:34\tSPEAKER_03\n So the analogy was you have maps of different things at different resolutions.\n\n0:01:40\tSPEAKER_03\n Okay.\n\n0:01:41\tSPEAKER_03\n So this had a lot of different stuff in it.\n\n0:01:44\tSPEAKER_05\n It actually doesn't have a whole lot of speech stuff to it.\n\n0:01:49\tSPEAKER_03\n It's mostly higher level.\n\n0:01:50\tSPEAKER_03\n Yeah, but nonetheless, I think it's a cool idea.\n\n0:01:55\tSPEAKER_03\n And if we can actually get it going, that would be neat.\n\n0:02:00\tSPEAKER_03\n So and this was the one also that was, was it with Susan or Rintrib?\n\n0:02:07\tSPEAKER_05\n I don't remember.\n\n0:02:08\tSPEAKER_05\n It might have been.\n\n0:02:09\tSPEAKER_03\n Yeah, we have to get some.\n\n0:02:10\tSPEAKER_03\n She's a linguist on campus.\n\n0:02:13\tSPEAKER_03\n Okay.\n\n0:02:14\tSPEAKER_03\n Anyway.\n\n0:02:15\tSPEAKER_03\n So other topics I wanted to talk about are the Doppademo, which I guess since Morgan isn't here, we can't really talk about it.\n\n0:02:23\tSPEAKER_03\n I just wanted to make sure it was ready to go.\n\n0:02:26\tSPEAKER_03\n But I guess I said that was already.\n\n0:02:29\tSPEAKER_03\n So it's just a question of did Morgan get around to testing it?\n\n0:02:32\tSPEAKER_02\n Yeah, and I sent you an email.\n\n0:02:34\tSPEAKER_02\n Yeah, I got it with the instructions.\n\n0:02:35\tSPEAKER_02\n I don't know.\n\n0:02:36\tSPEAKER_02\n So Morgan, I guess Morgan's leaving on Saturday.\n\n0:02:39\tSPEAKER_02\n Yep.\n\n0:02:40\tSPEAKER_02\n So until then, I guess we might hear something.\n\n0:02:43\tSPEAKER_03\n So I guess we had better be on call for a little while.\n\n0:02:48\tSPEAKER_05\n Did he ever figure out how to switch between applications?\n\n0:02:52\tSPEAKER_05\n I don't know.\n\n0:02:53\tSPEAKER_05\n I haven't spoken with him.\n\n0:02:54\tSPEAKER_05\n Yeah, he did.\n\n0:02:55\tSPEAKER_05\n How was he going to do it?\n\n0:02:56\tSPEAKER_02\n All tab.\n\n0:02:57\tSPEAKER_02\n Just all tab.\n\n0:02:58\tSPEAKER_02\n Like if you hold down alt and a tab tab, the task manager, right?\n\n0:03:02\tSPEAKER_03\n The problem was that I was saying hit alt tab with the assumption that he knew what I meant.\n\n0:03:07\tSPEAKER_03\n But he didn't.\n\n0:03:08\tSPEAKER_05\n So no, he said he tried that, but he didn't like it.\n\n0:03:11\tSPEAKER_05\n Because it took it out of the presentation.\n\n0:03:15\tSPEAKER_05\n But it doesn't.\n\n0:03:16\tSPEAKER_02\n Yeah, because if you just touch alt, if you just hit it once, it'll go back to the previous application.\n\n0:03:20\tSPEAKER_02\n And the previous application was the PowerPoint demo, which was the display of like, you know.\n\n0:03:25\tSPEAKER_02\n Oh.\n\n0:03:26\tSPEAKER_03\n And all I said was I just cycled with all tab because that's the standard way I hit it in Windows.\n\n0:03:30\tSPEAKER_03\n But of course, he doesn't use Windows.\n\n0:03:31\tSPEAKER_03\n Right.\n\n0:03:32\tSPEAKER_03\n So you don't have to do you have all tab.\n\n0:03:34\tSPEAKER_03\n Hold down alt and then tap tab several times and you cycle through all the open applications.\n\n0:03:39\tSPEAKER_05\n Oh, okay.\n\n0:03:41\tSPEAKER_05\n And then you can come back to your full version.\n\n0:03:43\tSPEAKER_02\n Right.\n\n0:03:44\tSPEAKER_02\n Right.\n\n0:03:45\tSPEAKER_02\n And I told him if he decides to use multiple examples for the Prozody demo to open up separate transcribers just so you don't have to load up files during the meeting.\n\n0:03:53\tSPEAKER_02\n That's a good idea.\n\n0:03:54\tSPEAKER_02\n That's not a bad idea at all.\n\n0:03:55\tSPEAKER_02\n So that's it.\n\n0:03:56\tSPEAKER_02\n He's got the memory for it soon.\n\n0:03:57\tSPEAKER_03\n Yeah.\n\n0:03:58\tSPEAKER_03\n And since the files are short, yeah.\n\n0:03:59\tSPEAKER_03\n Yeah, I'm really short.\n\n0:04:00\tSPEAKER_03\n And the TIGL TK overhead is pretty high, but it shouldn't matter.\n\n0:04:03\tSPEAKER_02\n I didn't have a prompt.\n\n0:04:04\tSPEAKER_05\n I'm sorry.\n\n0:04:05\tSPEAKER_05\n How much memory does he have?\n\n0:04:06\tSPEAKER_02\n I don't know.\n\n0:04:07\tSPEAKER_02\n I didn't seem to be a problem at all.\n\n0:04:09\tSPEAKER_02\n I would imagine he had 64 to 128.\n\n0:04:11\tSPEAKER_02\n I think he had 128, but he didn't want to work, I think.\n\n0:04:13\tSPEAKER_03\n It was faster than my PC.\n\n0:04:15\tSPEAKER_03\n Wow.\n\n0:04:16\tSPEAKER_02\n Yeah.\n\n0:04:17\tSPEAKER_02\n It was fine.\n\n0:04:18\tSPEAKER_02\n I think, yeah, I mean, we kind of walk through it a little bit on his laptop.\n\n0:04:25\tSPEAKER_05\n So are we the only ones who are giving demo or is Washington going to have a demo?\n\n0:04:32\tSPEAKER_03\n I assume, but they're all doing communicator stuff.\n\n0:04:35\tSPEAKER_03\n Oh, OK.\n\n0:04:38\tSPEAKER_02\n And it's part of the talk.\n\n0:04:39\tSPEAKER_02\n So it's really not a big part.\n\n0:04:41\tSPEAKER_03\n Yeah.\n\n0:04:42\tSPEAKER_03\n I mean, the talk's only 20 minutes.\n\n0:04:43\tSPEAKER_03\n So all this time we spent on it, it's going to be 30 seconds.\n\n0:04:46\tSPEAKER_03\n Oh my God.\n\n0:04:47\tSPEAKER_03\n Screen time.\n\n0:04:48\tSPEAKER_02\n But it's a good tool to have.\n\n0:04:49\tSPEAKER_02\n Yeah.\n\n0:04:50\tSPEAKER_02\n The meeting IR stuff is actually.\n\n0:04:52\tSPEAKER_03\n Actually, both of them.\n\n0:04:53\tSPEAKER_03\n Because we're going to want to be playing with the help my brain with the positive stuff.\n\n0:05:03\tSPEAKER_03\n So actually, at some point, we should talk to users of that technology who are actually going to be using and see what they would like to see.\n\n0:05:09\tSPEAKER_02\n Yeah.\n\n0:05:10\tSPEAKER_02\n Have you guys seen the display?\n\n0:05:11\tSPEAKER_02\n Have you guys seen either the demos?\n\n0:05:12\tSPEAKER_02\n They're pretty cool.\n\n0:05:13\tSPEAKER_02\n Like, the positive demo, we basically loaded up word alignments.\n\n0:05:17\tSPEAKER_02\n So instead of having utter answers in the bottom, it's like just word by word.\n\n0:05:21\tSPEAKER_02\n So you can see exactly where the overlaps are.\n\n0:05:24\tSPEAKER_02\n And then Adam did something where we converted these feature files into wave files.\n\n0:05:30\tSPEAKER_02\n So you can display them.\n\n0:05:31\tSPEAKER_02\n Display the feature.\n\n0:05:32\tSPEAKER_02\n Yeah.\n\n0:05:33\tSPEAKER_02\n And then using multi-wave, you can add a file and play that sound.\n\n0:05:36\tSPEAKER_02\n And the audio corresponding to that feature file.\n\n0:05:40\tSPEAKER_02\n And it's all like a little bit like the F0.\n\n0:05:42\tSPEAKER_02\n Yeah.\n\n0:05:43\tSPEAKER_02\n So you see the pitch contours.\n\n0:05:44\tSPEAKER_02\n And when you hit play, there's a line that goes through it.\n\n0:05:46\tSPEAKER_02\n And it's all aligned with the audio.\n\n0:05:48\tSPEAKER_03\n And the stylized F0 features are pretty cool.\n\n0:05:52\tSPEAKER_03\n So this does a piecewise linear.\n\n0:05:54\tSPEAKER_03\n And so normally, if you look at an F0 track, it jumps all over the place.\n\n0:05:58\tSPEAKER_03\n This is a nice smooth one.\n\n0:05:59\tSPEAKER_03\n It really does a good job.\n\n0:06:00\tSPEAKER_04\n Does it have a median filter in it or something?\n\n0:06:03\tSPEAKER_04\n Yeah, there's a combination.\n\n0:06:04\tSPEAKER_02\n It's a linear filter or whatever.\n\n0:06:05\tSPEAKER_02\n There's a median filtering.\n\n0:06:06\tSPEAKER_02\n Then there's a piecewise linear fit based on some criteria.\n\n0:06:09\tSPEAKER_03\n And that's true.\n\n0:06:10\tSPEAKER_03\n Actually, could you email me a reference to that paper if you have it?\n\n0:06:13\tSPEAKER_03\n Sure.\n\n0:06:13\tSPEAKER_02\n Because I'm sort of curious how I should email one about it, too, because he was asking about that.\n\n0:06:18\tSPEAKER_02\n And yeah.\n\n0:06:20\tSPEAKER_03\n I mean, so there's obviously a trade-off between the number of knots you pick and the best fit.\n\n0:06:25\tSPEAKER_03\n I mean, so if you're doing a piecewise linear, you have to figure out how many pieces you want.\n\n0:06:30\tSPEAKER_03\n And so there's a trade-off because the best mean-squared fit would be with an infinite number of knots.\n\n0:06:36\tSPEAKER_03\n But then it's not a linear fit.\n\n0:06:38\tSPEAKER_03\n You're not sure anything, then.\n\n0:06:40\tSPEAKER_03\n Well, so there's a trade-off.\n\n0:06:42\tSPEAKER_03\n I'm wondering what criteria they use.\n\n0:06:44\tSPEAKER_02\n Yeah, I actually don't know off the top of my head.\n\n0:06:47\tSPEAKER_05\n Was this code that you downloaded to do this?\n\n0:06:49\tSPEAKER_02\n This was Camel Sonema's SRI, who's a coworker with Liz.\n\n0:06:56\tSPEAKER_05\n That is a RIDOT comment.\n\n0:06:58\tSPEAKER_03\n Did I just... No, I used that SRI, so I had to tell him.\n\n0:07:01\tSPEAKER_03\n It sounded like a URL.\n\n0:07:02\tSPEAKER_05\n I don't know what you were saying.\n\n0:07:04\tSPEAKER_02\n Oh, sorry.\n\n0:07:06\tSPEAKER_02\n Yeah, but so Camel has...\n\n0:07:09\tSPEAKER_02\n He did a paper on this for some speech verification project.\n\n0:07:13\tSPEAKER_02\n And we basically extrapolated what he did for that work and applied it to our files.\n\n0:07:20\tSPEAKER_02\n And that's how we do... That's how we get our future files and everything for our office.\n\n0:07:23\tSPEAKER_05\n So what I mean is the implementation that you used was something that you coded up here, or you grabbed it out from somewhere.\n\n0:07:29\tSPEAKER_02\n We grabbed both linear-fitting stuff.\n\n0:07:32\tSPEAKER_02\n We did all the alignments and all the matching and stuff, but the actual coding of them.\n\n0:07:37\tSPEAKER_04\n And the math was done, too.\n\n0:07:39\tSPEAKER_04\n These are the 0 contours, which I'm supposed to use for the synthesis thing.\n\n0:07:44\tSPEAKER_02\n So that's what you were working on, right?\n\n0:07:47\tSPEAKER_01\n Right, that's the same software I used to get the data.\n\n0:07:50\tSPEAKER_01\n I gave you a couple examples.\n\n0:07:52\tSPEAKER_04\n Yeah, I didn't have time to look at the itself.\n\n0:07:55\tSPEAKER_03\n So the other topic is the IBM transcription status stuff.\n\n0:08:04\tSPEAKER_03\n So we've sent a few to them. We've gotten a few back.\n\n0:08:08\tSPEAKER_03\n I saw it was Jane, who was here because I think she gave one of them to one of the transcribers.\n\n0:08:13\tSPEAKER_03\n Yeah, it's done now.\n\n0:08:15\tSPEAKER_05\n And how was it?\n\n0:08:16\tSPEAKER_05\n She said it was much faster.\n\n0:08:18\tSPEAKER_05\n It really helped a lot to have that.\n\n0:08:20\tSPEAKER_05\n So there were...\n\n0:08:21\tSPEAKER_04\n Faster than doing...\n\n0:08:22\tSPEAKER_05\n Hand from scratch.\n\n0:08:25\tSPEAKER_05\n From the beginning of the process to the end of the process?\n\n0:08:27\tSPEAKER_05\n No, so from the point where we take it, it's that's where we want it.\n\n0:08:31\tSPEAKER_03\n Right, we know it would be longer to have multiple groups.\n\n0:08:34\tSPEAKER_05\n So it's sort of like doing things in parallel.\n\n0:08:36\tSPEAKER_05\n Right, you know.\n\n0:08:37\tSPEAKER_05\n So if they can be working on high-volume, we're working on other things, then when we get them in, they don't have to do that one from scratch.\n\n0:08:43\tSPEAKER_03\n Right.\n\n0:08:44\tSPEAKER_03\n The idea is that we're taking less time of the linguists transcribers.\n\n0:08:48\tSPEAKER_05\n Yeah, right now it is taking a bit of time to turn around the meetings from IBM.\n\n0:08:53\tSPEAKER_05\n There's several problems.\n\n0:08:54\tSPEAKER_05\n One is we were giving them these large files, which they then had to split up and put on to cassette tapes.\n\n0:09:01\tSPEAKER_05\n So either 90-minute or 60-minute tapes, so they had to try to find an appropriate place to break this large file that we gave them.\n\n0:09:07\tSPEAKER_05\n So one of the things that we did is Adam made a modification to his script that generates this so that you can tell it that you want to basically chunks that are no more than either 30 or 45 minutes.\n\n0:09:17\tSPEAKER_05\n And then we can give those to IBM and it'll make it easier for them to put them on tape.\n\n0:09:22\tSPEAKER_05\n Then the other thing is that these pool of transcribers that they're using sort of are not dedicated to our project, but are in use for all IBM projects.\n\n0:09:33\tSPEAKER_05\n And IBM has recently given them a whole bunch of stuff, so it's going to sort of delay.\n\n0:09:40\tSPEAKER_03\n We might want to revisit hiring our own external transcription company, because I think that would be cheaper than having a project.\n\n0:09:46\tSPEAKER_03\n And it would be cheaper than having our people do it, but do it with the same process with these beep files.\n\n0:09:50\tSPEAKER_03\n That's an interesting idea.\n\n0:09:51\tSPEAKER_03\n Because originally I had discounted that because it was just going to be too hard, but now we have this procedure with the beep files worked out.\n\n0:09:58\tSPEAKER_05\n So the only difference would be we would be putting the stuff on tape versus IBM.\n\n0:10:02\tSPEAKER_05\n And then we could send, if we had that process down of putting the audio onto tape, we can send IBM the tape so we can send this transcription.\n\n0:10:10\tSPEAKER_03\n We might want to do that anyway, because it seems like that's being a bottleneck, and that's silly. It shouldn't be a bottleneck.\n\n0:10:16\tSPEAKER_03\n I mean, it would once we're on it set up it.\n\n0:10:19\tSPEAKER_05\n So I don't know where the bottleneck was. Was the bottleneck in breaking this large file up into the appropriate size chunks, or was it actually putting it onto the tape?\n\n0:10:27\tSPEAKER_03\n It may have been partially that, because they tried it, and then they would have to listen to the tape and find out where it bleeds, and go forward in the file, etc.\n\n0:10:34\tSPEAKER_03\n But it just seems like it's not hard for us to do, and that would just make things go faster.\n\n0:10:41\tSPEAKER_03\n Yeah, so how do we do that? How would we get a tape deck, plug it into the computer, hit record on the tape deck, and just do it all all.\n\n0:10:51\tSPEAKER_05\n So plug it to the headphone output in the back of the computer line out, line out into the line in on a tape player.\n\n0:10:58\tSPEAKER_03\n Oh, that sounds pretty good. So, I mean, that's the easy way. They might have a more complex setup at IBM. I've seen digital, digital analog tapes where it's controlled by the computer.\n\n0:11:09\tSPEAKER_03\n Yeah, but we don't need to do that. The disadvantage of doing it this way is it's real time, so you would have to sit there for an hour while it's recording.\n\n0:11:17\tSPEAKER_05\n Yeah, but if it was at your desk or something, it's not a big deal.\n\n0:11:20\tSPEAKER_02\n So what's the turnaround period right now for IBM?\n\n0:11:23\tSPEAKER_05\n Well, there was a lot of people discussing this. They've given us, since we started doing this new beep format with beep number beep, they've given us, I think, two full transcripts.\n\n0:11:37\tSPEAKER_05\n They have a third one, and Brian just sent me a note saying, oh, that third one somehow slipped through the cracks of the transcriptionist company.\n\n0:11:46\tSPEAKER_05\n And so there's going to be a delay of a week before we get that third one back. And I've already given him three more to work on, but he said those new three won't get done until this big chunk of data has been processed by the company.\n\n0:12:00\tSPEAKER_02\n Transcribers here are still working.\n\n0:12:03\tSPEAKER_02\n Yeah, they're working away.\n\n0:12:04\tSPEAKER_02\n They're just doing their own thing.\n\n0:12:05\tSPEAKER_02\n They're just doing their own way.\n\n0:12:06\tSPEAKER_05\n So what we do is when I go to select meetings for IBM, I go into the, well, investor, master sheet here with the statuses.\n\n0:12:16\tSPEAKER_05\n And I pick ones that Tilo has pre-segmented, and I change the status to trans-IP IBM so that, you know, when Jane or whoever goes to select the next meeting, they won't choose one of those.\n\n0:12:27\tSPEAKER_05\n And so I'm not picking several chunks right now of meetings.\n\n0:12:31\tSPEAKER_03\n We should at least ask Brian, if there are any particular requirements for putting things on tape, is there a particular type of tape that they want to use or anything else like that?\n\n0:12:42\tSPEAKER_03\n And then we should see how much of a pain it is for one of us.\n\n0:12:48\tSPEAKER_03\n I mean, the other problem is you'd want to do it on an unloaded machine, right, because you wouldn't want it to start stuttering.\n\n0:12:55\tSPEAKER_03\n Yeah.\n\n0:12:56\tSPEAKER_05\n Huh.\n\n0:12:58\tSPEAKER_03\n And that means that that's more a problem because then you have to be there.\n\n0:13:03\tSPEAKER_04\n And all of the PCs are connected to the network too here.\n\n0:13:08\tSPEAKER_04\n Right.\n\n0:13:09\tSPEAKER_02\n You're just playing it and recording it like real time.\n\n0:13:13\tSPEAKER_02\n Yep.\n\n0:13:15\tSPEAKER_05\n So when that thing, when it stutters like that, is it because there's a delay getting the data off a disk, or is it because there's a delay in the D to A?\n\n0:13:23\tSPEAKER_03\n It could be either. I mean, there are lots of different places it can be delay on the disk, or it can be just load, gets high on the machine.\n\n0:13:30\tSPEAKER_03\n Yeah.\n\n0:13:31\tSPEAKER_03\n Either IO, load, or processor load.\n\n0:13:34\tSPEAKER_03\n That's a problem with these multi-user systems is that lots of processes are running and you don't really have control.\n\n0:13:41\tSPEAKER_05\n Maybe we could do it from a PC or something.\n\n0:13:44\tSPEAKER_04\n But they also have the network.\n\n0:13:46\tSPEAKER_00\n A few to line out too. You have to worry about if you click around and you hit a beep or something.\n\n0:13:50\tSPEAKER_00\n That's true.\n\n0:13:51\tSPEAKER_03\n You can keep on to the tape too.\n\n0:13:53\tSPEAKER_03\n That's right. So you really do want to be using a machine that's not.\n\n0:13:56\tSPEAKER_02\n And you have to record every channel separately.\n\n0:13:59\tSPEAKER_03\n No, because we're doing the beep files.\n\n0:14:01\tSPEAKER_05\n Well, you know how OK.\n\n0:14:02\tSPEAKER_05\n I think David might have a bunch of old PCs because he's replacing them with these new ones.\n\n0:14:07\tSPEAKER_05\n Maybe we could get one and just dedicate it to doing this.\n\n0:14:10\tSPEAKER_05\n Not even hook it at well.\n\n0:14:11\tSPEAKER_05\n I guess we need to hook it to the network so we can get the files to it.\n\n0:14:14\tSPEAKER_03\n But you could just, you could have it no active connection just SCP them.\n\n0:14:20\tSPEAKER_05\n Yeah. Right.\n\n0:14:22\tSPEAKER_05\n And then just use that machine to hook up to the...\n\n0:14:24\tSPEAKER_03\n Actually, it wouldn't be bad to have that plus put on that machine a CD burner.\n\n0:14:29\tSPEAKER_05\n Yeah.\n\n0:14:30\tSPEAKER_05\n And we don't need a powerful machine to do these things, right?\n\n0:14:32\tSPEAKER_05\n No.\n\n0:14:33\tSPEAKER_05\n No.\n\n0:14:34\tSPEAKER_05\n One of these old paniums that we have.\n\n0:14:37\tSPEAKER_05\n Should talk to him about that.\n\n0:14:38\tSPEAKER_04\n Are you the DVD burner?\n\n0:14:39\tSPEAKER_03\n A DVD burner here.\n\n0:14:41\tSPEAKER_03\n I guess the real question is where would we put it and who would do it?\n\n0:14:45\tSPEAKER_03\n I guess whoever records the meeting.\n\n0:14:47\tSPEAKER_03\n I mean, it's not a big deal but it's yet another thing you have to do.\n\n0:14:50\tSPEAKER_03\n Yeah. Yeah.\n\n0:14:52\tSPEAKER_05\n That's why I wanted to avoid having to do that if we could but...\n\n0:14:56\tSPEAKER_05\n It's just another...\n\n0:14:57\tSPEAKER_03\n They couldn't use CDs?\n\n0:14:59\tSPEAKER_03\n No, because the transcription company does what they do.\n\n0:15:02\tSPEAKER_05\n They have a device that you put the cassette in and it has a foot pedal.\n\n0:15:05\tSPEAKER_05\n Oh, I see.\n\n0:15:06\tSPEAKER_05\n Let's go back and forth and stuff like that.\n\n0:15:08\tSPEAKER_05\n I see.\n\n0:15:11\tSPEAKER_05\n I guess they haven't.\n\n0:15:13\tSPEAKER_05\n Actually, there are a few.\n\n0:15:14\tSPEAKER_03\n I saw a web based one at one point where you could send them audio files over the web and send you back text files over the web.\n\n0:15:22\tSPEAKER_03\n I should look that up again.\n\n0:15:24\tSPEAKER_05\n Can you send them huge audio files?\n\n0:15:26\tSPEAKER_03\n I assume you can send them anything if they can access with HTTP.\n\n0:15:35\tSPEAKER_02\n Well, I must be dealing with large amounts of data if they're transcribing anyway.\n\n0:15:39\tSPEAKER_02\n That's true.\n\n0:15:40\tSPEAKER_02\n People probably aren't sending them, you know, an utter answer to.\n\n0:15:44\tSPEAKER_05\n How big are these files that we send to Brian?\n\n0:15:47\tSPEAKER_05\n Half a gig.\n\n0:15:49\tSPEAKER_05\n Really that big?\n\n0:15:51\tSPEAKER_05\n Oh, no.\n\n0:15:52\tSPEAKER_03\n It's like 100 Macs.\n\n0:15:53\tSPEAKER_03\n Yeah, it's a 100 Mac. They're the B files. That's right. So they're smaller.\n\n0:15:57\tSPEAKER_05\n That's still pretty dang big.\n\n0:15:59\tSPEAKER_05\n Yes.\n\n0:16:01\tSPEAKER_04\n It's going to be an email.\n\n0:16:03\tSPEAKER_03\n And we are sending in the compressed ones, right?\n\n0:16:07\tSPEAKER_05\n I don't know. Whatever you generate.\n\n0:16:10\tSPEAKER_05\n Yeah, the last ones you did work with.\n\n0:16:12\tSPEAKER_05\n We're shortened.\n\n0:16:13\tNone\n Yeah.\n\n0:16:14\tSPEAKER_05\n I wonder if the ones before that were shortened.\n\n0:16:16\tSPEAKER_03\n The B files actually, the shortened, doesn't save a whole lot.\n\n0:16:20\tSPEAKER_03\n Because the whole point is it's extracting parts that are loud anyway.\n\n0:16:25\tSPEAKER_03\n I think it only saves like half only.\n\n0:16:30\tSPEAKER_01\n Oh, please.\n\n0:16:31\tSPEAKER_03\n Okay, so I think we just got to let things slide for now and see.\n\n0:16:37\tSPEAKER_03\n Yeah.\n\n0:16:38\tSPEAKER_03\n See what's going to happen. Nothing else really to do.\n\n0:16:41\tSPEAKER_03\n We have new equipment that I'm going to try to set up tomorrow.\n\n0:16:47\tSPEAKER_03\n New wireless.\n\n0:16:48\tSPEAKER_03\n What will that do?\n\n0:16:50\tSPEAKER_03\n Give us a couple more wireless channels.\n\n0:16:52\tSPEAKER_05\n Oh, so we can get rid of the, yeah.\n\n0:16:54\tSPEAKER_05\n Oh, that'll be nice.\n\n0:16:55\tSPEAKER_05\n Yeah.\n\n0:16:56\tSPEAKER_03\n But it involves rewiring.\n\n0:16:58\tSPEAKER_03\n And so if I could borrow someone tomorrow afternoon, I should be around to help my brain, you know, just have someone to bounce the instructions off of it.\n\n0:17:07\tSPEAKER_03\n Make sure I don't do anything too stupid.\n\n0:17:09\tSPEAKER_03\n Yeah, sure.\n\n0:17:12\tSPEAKER_03\n Did I have another topic on the list?\n\n0:17:16\tSPEAKER_03\n Experiments.\n\n0:17:17\tSPEAKER_05\n Isn't that next week?\n\n0:17:18\tSPEAKER_02\n Experiments?\n\n0:17:19\tSPEAKER_05\n Yeah, I guess that's probably the end.\n\n0:17:21\tSPEAKER_03\n What did I have on the agenda I mailed out?\n\n0:17:23\tSPEAKER_02\n I think it was.\n\n0:17:24\tSPEAKER_02\n Yeah, I don't know.\n\n0:17:25\tSPEAKER_02\n So the demo was one of them.\n\n0:17:26\tSPEAKER_02\n Yeah, that's it.\n\n0:17:28\tSPEAKER_02\n Yeah, I think that's it.\n\n0:17:29\tSPEAKER_04\n Yeah.\n\n0:17:30\tSPEAKER_04\n Short meetings.\n\n0:17:31\tSPEAKER_04\n Yeah.\n\n0:17:32\tSPEAKER_03\n Does anyone have anything else?\n\n0:17:35\tSPEAKER_05\n Oh, I made a, oh, but that's not specific to me anymore.\n\n0:17:38\tSPEAKER_05\n I was going to say I took some suggestion of atoms and I created a CGI script that lets you see the current status of the speech disks.\n\n0:17:50\tSPEAKER_05\n So if you go to the speech local web page and then there's a disk status page, you can click on that and it'll query Abbott and give you a list of all the disks that we have and then what's on each one and then it shows how big the disk is and what percent full it is.\n\n0:18:06\tSPEAKER_05\n Cool.\n\n0:18:07\tSPEAKER_05\n So and that's, you know, each time you go there, it's updated.\n\n0:18:09\tSPEAKER_02\n So what are the new disks that are installed now?\n\n0:18:11\tSPEAKER_05\n The new disks are installed if you need space just let me know.\n\n0:18:14\tSPEAKER_05\n I have to create the appropriate sub directory.\n\n0:18:17\tSPEAKER_05\n So we're kind of trying to keep, even the scratch ones, we're keeping a little organized where we put a U-doctor speech data and then I'll either create a sub directory for like if it's meeting a quarter project or hub five or whatever.\n\n0:18:28\tSPEAKER_05\n So we, I just have to create those sub director.\n\n0:18:31\tSPEAKER_05\n Do we have new DD disks also?\n\n0:18:33\tSPEAKER_03\n No.\n\n0:18:34\tSPEAKER_03\n Darn.\n\n0:18:35\tSPEAKER_03\n No.\n\n0:18:36\tSPEAKER_03\n So it's all just scratched.\n\n0:18:37\tSPEAKER_03\n It's all scratched.\n\n0:18:38\tSPEAKER_03\n Okay.\n\n0:18:39\tSPEAKER_03\n Yeah.\n\n0:18:40\tSPEAKER_03\n How are we doing on?\n\n0:18:41\tSPEAKER_05\n Uh, DE, which is where we're putting all the meeting stuff.\n\n0:18:45\tSPEAKER_05\n Now DE is full.\n\n0:18:46\tSPEAKER_03\n We must be doing it on DF.\n\n0:18:48\tSPEAKER_03\n No, it's DE.\n\n0:18:49\tSPEAKER_05\n DE is not full.\n\n0:18:50\tSPEAKER_05\n DE is full.\n\n0:18:51\tSPEAKER_05\n D-D is full.\n\n0:18:54\tSPEAKER_05\n That was the first one or that was the last one that filled up.\n\n0:18:56\tSPEAKER_05\n Okay, I guess I'm just going to slow it all off.\n\n0:18:57\tSPEAKER_05\n DE still had like, last time I looked it was like seven gigs or something.\n\n0:19:00\tSPEAKER_05\n Okay.\n\n0:19:01\tSPEAKER_05\n So in each meeting is roughly half a gig and so that means we're getting close.\n\n0:19:05\tSPEAKER_05\n We're getting close.\n\n0:19:06\tSPEAKER_05\n Yeah.\n\n0:19:07\tSPEAKER_05\n So.\n\n0:19:08\tSPEAKER_02\n We're just going to keep recording like at some point.\n\n0:19:12\tSPEAKER_05\n Morgan said something about stopping at the end of the year.\n\n0:19:14\tSPEAKER_05\n Okay.\n\n0:19:15\tSPEAKER_05\n Like when we get around a hundred meetings.\n\n0:19:17\tSPEAKER_05\n Because there's going to be data coming from UW.\n\n0:19:20\tSPEAKER_05\n Hopefully by that.\n\n0:19:21\tSPEAKER_03\n I just hate not to get data.\n\n0:19:23\tSPEAKER_03\n Yeah, I feel spawning.\n\n0:19:24\tSPEAKER_05\n How did we have to keep the community?\n\n0:19:26\tSPEAKER_02\n Yeah, it's like you build this room up for so long and then it's just like.\n\n0:19:30\tSPEAKER_02\n You start.\n\n0:19:31\tSPEAKER_05\n Now that we're used to recording it's like, well why not keep going?\n\n0:19:34\tSPEAKER_03\n The other thing we could do is stop doing the regular ones and try to convince other topics to come in and do some.\n\n0:19:41\tSPEAKER_03\n Because I think that would be nice.\n\n0:19:43\tSPEAKER_05\n We have right now like 75 or 76 hours.\n\n0:19:47\tSPEAKER_03\n You know, the other thing we were talking about also is once we, once the disk has been backed up, we don't actually needed online.\n\n0:19:56\tSPEAKER_03\n So another option is to copy it to tape manually so we have the backup copy and the tape copy.\n\n0:20:03\tSPEAKER_03\n The archive copy and the backup copy and then just take them offline.\n\n0:20:08\tSPEAKER_05\n But aren't we still using the compressed?\n\n0:20:10\tSPEAKER_03\n Once we have the expanded versions.\n\n0:20:12\tSPEAKER_03\n So if we have a ton of scratch disks, maybe the thing to do is leave those up and then use and then not necessarily have the original data online.\n\n0:20:24\tSPEAKER_05\n Yeah, we need to figure something out because the habit is basically full.\n\n0:20:29\tSPEAKER_05\n We can't add any more disks to it.\n\n0:20:31\tSPEAKER_05\n We can increase the size of the disks that are on it but that will only take us so far.\n\n0:20:36\tSPEAKER_05\n David had to suggest in about new servers and things like that.\n\n0:20:42\tSPEAKER_05\n So if we can talk to Morgan about getting some money for a new disk server.\n\n0:20:47\tSPEAKER_03\n And that would be pretty tight in the machine room.\n\n0:20:53\tSPEAKER_05\n Yeah, it would have to replace the habit basically.\n\n0:20:56\tSPEAKER_05\n Well David's plan to get new servers anyways for all of the main servers.\n\n0:21:08\tSPEAKER_05\n Yeah, it's full and there.\n\n0:21:10\tSPEAKER_05\n We've seen it recently with all of the new machines that we got.\n\n0:21:13\tSPEAKER_05\n The assembly 100s.\n\n0:21:14\tSPEAKER_05\n They're stacked upon benches and things all over.\n\n0:21:17\tSPEAKER_05\n It's really crowded.\n\n0:21:19\tSPEAKER_04\n But they're not yet accessible.\n\n0:21:22\tSPEAKER_05\n Oh yeah, yeah, they're in the, yeah, if you do the name.\n\n0:21:25\tSPEAKER_05\n What are the name?\n\n0:21:27\tSPEAKER_05\n I've forgotten now.\n\n0:21:29\tSPEAKER_05\n I assume they're in the P-Make pool.\n\n0:21:31\tSPEAKER_05\n Yeah, they're in the P-Make pool.\n\n0:21:32\tSPEAKER_05\n So if you do a Reginfo minus show attribute and...\n\n0:21:37\tSPEAKER_03\n P-Make stuff, P-Make magic.\n\n0:21:39\tSPEAKER_03\n Yeah.\n\n0:21:40\tSPEAKER_03\n Or Customs magic.\n\n0:21:41\tSPEAKER_05\n You can get a list of all the machines that are available to P-Make by using the command Reginfo minus show ATTR.\n\n0:21:49\tSPEAKER_04\n Maybe you can send me that.\n\n0:21:51\tSPEAKER_03\n Yeah, and then if you do man customs, it has almost all of that.\n\n0:21:55\tSPEAKER_03\n Okay.\n\n0:21:56\tSPEAKER_05\n And I'm not sure what attributes we attach to the sunblade 100s, but it could be SB100.\n\n0:22:02\tSPEAKER_05\n And so if you query for all machines that have that attribute, then you should see the names.\n\n0:22:07\tSPEAKER_05\n Okay.\n\n0:22:08\tSPEAKER_05\n New machines.\n\n0:22:09\tSPEAKER_03\n Do we have an attribute for non-interactive machines?\n\n0:22:12\tSPEAKER_03\n Because I was thinking that would be a good one to have non-interactive ones that aren't on people's desks.\n\n0:22:17\tSPEAKER_05\n Well, there's sort of... there's this one called... there's that attribute called no...\n\n0:22:22\tSPEAKER_05\n What's it called?\n\n0:22:24\tSPEAKER_05\n NoeVict, which is roughly that.\n\n0:22:29\tSPEAKER_05\n Right.\n\n0:22:30\tSPEAKER_05\n It's... although it's like my machine has it on my desk, so I do get jobs running on my machine all the time.\n\n0:22:38\tSPEAKER_05\n But... so that's sort of what it is.\n\n0:22:43\tSPEAKER_03\n Anyway, should we do digits?\n\n0:22:48\tSPEAKER_03\n Transcript L310, 789392150, 505-4231798, 089-031867, 356-2107119, 268-26673, 2590-477-46663, 819-7237, 819-563211, 032-7766302.\n\n0:23:19\tSPEAKER_00\n Transcript L-311, 2803079826, 832-4387338, 913130-8867, 13554122370, 71090-047118, 0663-97695, 22559173, 0867-93443572.\n\n0:24:01\tSPEAKER_02\n Transcript L-312160-50571, 9515-39861291, 7544-2428-47, 4083-0458-8790, 537-111-0491, 244937-921, 47-744-4236-47, 009-276-6185.\n\n0:24:42\tSPEAKER_05\n Transcript L-307, 6638-0405-8468, 206-887-385, 663-106-5876, 395-574-396, 685-074-877-8808, 340-3545-8407, 626-552528, 080-526-4816.\n\n0:25:19\tSPEAKER_04\n Transcript L-308, 736-285-9481, 914-402-8458, 440-29338-5055536-5821, 158-512-893, 632-299-544, 9-824-71, 819-9, 025-98514, 6092-7345,\n\n0:26:05\tSPEAKER_03\n and off.\n\n", "summary": [{"summary_text": "The NSFATR, ITR budget was cut by two-thirds. The money for the ITR was approved for all the sites, but only 62% of the money. Morgan is working on getting the money immediately. They are in conjunction with SRI, Washington, and Columbia to do research on the meetings maps. "}]}