{"filename": "./data/Bmr031.txt", "transcript": "0:00:00\tSPEAKER_01\n Okay, we're on.\n\n0:00:02\tSPEAKER_01\n See, there are some stretches that weren't there.\n\n0:00:04\tSPEAKER_01\n Right, it would have to be here.\n\n0:00:06\tSPEAKER_05\n What do you have to do about that, so?\n\n0:00:08\tSPEAKER_05\n Well, I have a person would check it over and then give it final.\n\n0:00:12\tSPEAKER_05\n The poster?\n\n0:00:14\tSPEAKER_07\n Oh, wait, for Jack.\n\n0:00:16\tSPEAKER_07\n Close the door.\n\n0:00:18\tSPEAKER_08\n Well, it's more...\n\n0:00:20\tSPEAKER_08\n We're recording, by the way, this way.\n\n0:00:22\tSPEAKER_05\n You can keep talking.\n\n0:00:24\tSPEAKER_02\n You keep talking. I just should be aware.\n\n0:00:26\tSPEAKER_02\n You are saying that we have a project for Jack's way.\n\n0:00:28\tSPEAKER_02\n So, the start and I said, okay.\n\n0:00:30\tSPEAKER_08\n So, the compromise is we're starting, but we're leaving the door open.\n\n0:00:34\tSPEAKER_08\n Okay. So, a little more background noise.\n\n0:00:36\tSPEAKER_02\n And...\n\n0:00:38\tSPEAKER_02\n That way, we can close the door, make Chuck knock when he comes.\n\n0:00:42\tSPEAKER_04\n Well, I tend to...\n\n0:00:44\tSPEAKER_04\n There are a couple of meetings where there are a lot of pre-ambles like this.\n\n0:00:46\tSPEAKER_04\n And which creates the transcription doesn't start until someone actually says, okay.\n\n0:00:50\tSPEAKER_04\n Really?\n\n0:00:51\tSPEAKER_08\n So, we're starting right now.\n\n0:00:52\tSPEAKER_08\n Yeah, oh, yeah. The meeting started.\n\n0:00:54\tSPEAKER_08\n This is the real thing.\n\n0:00:56\tSPEAKER_08\n There's Chuck just kidding.\n\n0:00:58\tSPEAKER_08\n It was. Okay.\n\n0:01:00\tSPEAKER_08\n You said Chuck gets stuck with the earplug mic.\n\n0:01:02\tSPEAKER_08\n Okay. Last guy in.\n\n0:01:04\tSPEAKER_08\n I just get the door.\n\n0:01:06\tSPEAKER_08\n You just get the door.\n\n0:01:08\tSPEAKER_08\n Yeah, so I had him sit around this thing about what we were going to talk about.\n\n0:01:12\tSPEAKER_08\n And we had this discussion of flipping back and forth between an emphasis on the technology, particularly recognition versus the recordings and transcriptions and so on.\n\n0:01:22\tSPEAKER_08\n But I was asking if we could to kind of make it just whatever is happening, rather than one or the other, because next week I'll be at a meeting on campus, and after that I'll be in New York for several meetings worth.\n\n0:01:36\tSPEAKER_08\n You folks will be going for a couple of the meetings worth.\n\n0:01:40\tSPEAKER_05\n I know that happens back to us the times here at Gone.\n\n0:01:42\tSPEAKER_05\n Really? Okay. Yeah.\n\n0:01:44\tSPEAKER_08\n So...\n\n0:01:46\tSPEAKER_08\n So, you didn't get an agenda, I guess we had the usual.\n\n0:01:50\tSPEAKER_02\n Well, because no one, no one ever responded to any items.\n\n0:01:54\tSPEAKER_02\n So I have a couple of minor ones.\n\n0:01:56\tSPEAKER_02\n Our normal transcription status, just so that we can make some plans.\n\n0:02:04\tSPEAKER_03\n So what's up with IBM, Chuck? Do you know?\n\n0:02:08\tSPEAKER_03\n I think Brian is on vacation now, but before he left, we gave him another meeting\n\n0:02:14\tSPEAKER_07\n to give to the trans fibers. How many? Is yours working there, Chuck?\n\n0:02:18\tSPEAKER_02\n Okay. Your P? What am I?\n\n0:02:22\tSPEAKER_04\n Is it turned on?\n\n0:02:24\tSPEAKER_02\n There's no on. Okay.\n\n0:02:26\tSPEAKER_02\n Yeah, it's just...\n\n0:02:28\tSPEAKER_02\n Oh, let me raise the gain on that a little bit, since it's so far from your mouth.\n\n0:02:32\tSPEAKER_07\n Sorry.\n\n0:02:36\tSPEAKER_08\n Okay. So we sent them...\n\n0:02:40\tSPEAKER_03\n We gave them four meetings before he left, and that's it.\n\n0:02:44\tSPEAKER_03\n Okay. I don't think we'll hear from him before he gets back.\n\n0:02:48\tSPEAKER_03\n Do I know about your pie chart?\n\n0:02:50\tSPEAKER_03\n I don't know.\n\n0:02:52\tSPEAKER_09\n Or pie chart?\n\n0:02:54\tSPEAKER_04\n He has a nice pie chart on the current status page, which shows the amount of data that have been transcribed and the amount of the entire.\n\n0:03:04\tSPEAKER_04\n And at this point, it's not quite half.\n\n0:03:08\tSPEAKER_04\n Is that what you say with the pie chart?\n\n0:03:10\tSPEAKER_04\n And then of that, there's a little slower I could try and draw it, but probably better describe it.\n\n0:03:14\tSPEAKER_08\n Half the data it's been recorded has been transcribed?\n\n0:03:16\tSPEAKER_04\n Roughly, almost.\n\n0:03:18\tSPEAKER_04\n Wow.\n\n0:03:20\tSPEAKER_04\n And I haven't actually caught up with, since I got back so recently for my vacation, I know that the transcribers finished several meetings while I was gone.\n\n0:03:28\tSPEAKER_04\n Oh. And I haven't told you because I haven't figured out which ones they are, or yet, but when that happens, then that pie will get even closer to the midline.\n\n0:03:36\tSPEAKER_04\n It's not quite... not quite a 2%, but really getting close.\n\n0:03:38\tSPEAKER_02\n Okay, so also...\n\n0:03:40\tSPEAKER_02\n Pie will be close to one now.\n\n0:03:42\tSPEAKER_11\n Well, it's a straight match.\n\n0:03:46\tSPEAKER_08\n Well, if we can have 3.14 times as much transcribed as we recorded, we really will be doing that.\n\n0:03:52\tSPEAKER_04\n But it's so nice. I recommend this is graphic, because it's so much...\n\n0:03:56\tSPEAKER_02\n How much do we need transcribed before it's worth doing some trainings?\n\n0:04:00\tSPEAKER_01\n Oh.\n\n0:04:02\tSPEAKER_02\n I mean, it seems like probably we have enough now, right?\n\n0:04:06\tSPEAKER_02\n Because like, like, Macrophone wasn't that much data, right?\n\n0:04:10\tSPEAKER_01\n And it helped.\n\n0:04:12\tSPEAKER_01\n Well, we already used the Predicted training.\n\n0:04:14\tSPEAKER_02\n You only used that for digits, right?\n\n0:04:16\tSPEAKER_01\n Well, we did do some training out of digits.\n\n0:04:18\tSPEAKER_01\n Rather adaptation of digits.\n\n0:04:20\tSPEAKER_01\n I mean, supervised adaptation.\n\n0:04:22\tSPEAKER_01\n Yeah, I mean...\n\n0:04:24\tSPEAKER_05\n Maybe like 20 hours we could try, but maybe not counting the non-native speech, because that just doesn't translate very well.\n\n0:04:32\tSPEAKER_01\n I would love to do some...\n\n0:04:36\tSPEAKER_01\n With adaptation, you can use fairly small amount of data to improve your performance.\n\n0:04:44\tSPEAKER_01\n And, you know, it's just basically...\n\n0:04:50\tSPEAKER_01\n I don't have time to do too much these days, except what I'm already doing.\n\n0:04:56\tSPEAKER_01\n But if there's someone who has some free time, I'll be happy to show them how it works.\n\n0:05:01\tSPEAKER_01\n Can you play with it?\n\n0:05:05\tSPEAKER_08\n I thought you were already using adaptation.\n\n0:05:09\tSPEAKER_01\n That's supervised adaptation.\n\n0:05:11\tSPEAKER_01\n So we're doing some unsupervised speaker adaptation.\n\n0:05:13\tSPEAKER_01\n I see.\n\n0:05:15\tSPEAKER_01\n But you could build a set which you sort of take your models and do supervised adaptation.\n\n0:05:21\tSPEAKER_01\n And then start with the speaker adaptation from sort of channel adapted for room adapted or whatever.\n\n0:05:25\tSPEAKER_02\n How would you imagine doing a test set on this corpus?\n\n0:05:29\tSPEAKER_02\n A test set training set division.\n\n0:05:31\tSPEAKER_02\n I mean, it's really weird, right?\n\n0:05:33\tSPEAKER_02\n Because it would be hard to get speaker disjoint sets.\n\n0:05:35\tSPEAKER_02\n Really?\n\n0:05:37\tSPEAKER_05\n Do we just give up on that?\n\n0:05:39\tSPEAKER_05\n And actually, I was thinking about this.\n\n0:05:41\tSPEAKER_05\n The original application doesn't really...\n\n0:05:43\tSPEAKER_05\n I mean, if you're using this over and over again, you're going to be testing on the same...\n\n0:05:47\tSPEAKER_05\n the same speakers.\n\n0:05:49\tSPEAKER_02\n No, but then you have the supervised versus unsupervised question.\n\n0:05:53\tSPEAKER_05\n I just mean that it's not a terrible thing to assume that you don't...\n\n0:05:57\tSPEAKER_05\n that you don't have disjoint sets.\n\n0:05:59\tSPEAKER_05\n Right.\n\n0:06:01\tSPEAKER_02\n So...\n\n0:06:03\tSPEAKER_05\n For this particular kind of...\n\n0:06:05\tSPEAKER_08\n Right.\n\n0:06:07\tSPEAKER_00\n Yeah.\n\n0:06:09\tSPEAKER_08\n I mean, you could have some parts of it that are disjoint and some that aren't.\n\n0:06:13\tSPEAKER_01\n It's sort of like in broadcast news.\n\n0:06:15\tSPEAKER_01\n Yeah.\n\n0:06:17\tSPEAKER_01\n Because you have those people who re-occur.\n\n0:06:19\tSPEAKER_01\n Over and over.\n\n0:06:21\tSPEAKER_01\n I mean, the anchor speakers.\n\n0:06:23\tSPEAKER_01\n Right.\n\n0:06:25\tSPEAKER_01\n Yeah, as long as you were aware that you're doing that, that's...\n\n0:06:27\tSPEAKER_01\n You can celebrate it out.\n\n0:06:29\tSPEAKER_02\n And similarly with subject matter.\n\n0:06:31\tSPEAKER_02\n That, you know, if you're training your language model on this meeting only and testing on this meeting only, you're going to do a lot better than if you start crossing them.\n\n0:06:41\tSPEAKER_05\n Somewhat, although what's interesting is that the majority of the words in the language model are actually...\n\n0:06:45\tSPEAKER_05\n On the same.\n\n0:06:47\tSPEAKER_05\n Yeah, they're actually just like function words and...\n\n0:06:49\tSPEAKER_05\n Yeah.\n\n0:06:51\tSPEAKER_05\n And there's a lot of speaker dependence there.\n\n0:06:53\tSPEAKER_05\n Even the transcribers will say they know who the speakers after a while just from there.\n\n0:06:57\tSPEAKER_05\n Just from a word choice.\n\n0:06:59\tSPEAKER_05\n Right.\n\n0:07:01\tSPEAKER_05\n So, I don't think you're talking the way you're right.\n\n0:07:05\tSPEAKER_02\n Well, certainly.\n\n0:07:07\tSPEAKER_02\n So, it's just that...\n\n0:07:09\tSPEAKER_02\n If we're going to do that, we should give some thought to how we want to divide it up.\n\n0:07:11\tSPEAKER_08\n Yeah.\n\n0:07:13\tSPEAKER_08\n Yeah, so maybe someone else would do a lot of the work with probably your advice.\n\n0:07:17\tSPEAKER_08\n Yeah, would be.\n\n0:07:19\tSPEAKER_02\n So, with digits, we now have a lot of digits, but most of them aren't transcribed.\n\n0:07:23\tSPEAKER_02\n So, if we want to do a forced alignment on them, we could start collecting ourselves up a fairly large digit corpus.\n\n0:07:29\tSPEAKER_02\n Yeah. That's the same issue.\n\n0:07:31\tSPEAKER_08\n We want to do that for sure.\n\n0:07:33\tSPEAKER_02\n Yeah.\n\n0:07:35\tSPEAKER_02\n Someone who's interested in that to start looking at it.\n\n0:07:37\tSPEAKER_02\n So, who's working on digits currently?\n\n0:07:39\tSPEAKER_02\n Dave Gilbert.\n\n0:07:41\tSPEAKER_02\n Maybe I'll talk to him and see if he's interested.\n\n0:07:43\tSPEAKER_02\n Not right away.\n\n0:07:45\tSPEAKER_02\n Yeah, sure.\n\n0:07:47\tSPEAKER_02\n Yeah.\n\n0:07:49\tSPEAKER_08\n One thing, just an announcement of the source is that Chuck is going to be going to a meeting at NIST in about a month and a half, I guess, they're still working out the date.\n\n0:08:05\tSPEAKER_08\n Because they want to gather together sort of one person from each site who is involved in the meeting stuff since they're going to be doing a bunch of meeting recordings there.\n\n0:08:15\tSPEAKER_08\n And so...\n\n0:08:17\tSPEAKER_02\n Are the CMU folks going to be there?\n\n0:08:19\tSPEAKER_08\n Somebody has like one person.\n\n0:08:21\tSPEAKER_08\n The moment it's one person from each site, so there'll be somebody from CMU and somebody from here and somebody from...\n\n0:08:27\tSPEAKER_08\n Number of places, probably somebody from UW.\n\n0:08:31\tSPEAKER_08\n So...\n\n0:08:33\tSPEAKER_08\n Yeah, it's possible they're opening up to more people, but I think the main thing is just...\n\n0:08:37\tSPEAKER_08\n It's not a conference.\n\n0:08:39\tSPEAKER_08\n It's not a workshop really.\n\n0:08:41\tSPEAKER_08\n It's just connecting with them.\n\n0:08:43\tSPEAKER_08\n So...\n\n0:08:45\tSPEAKER_08\n So then if they start a bunch of recordings, then ultimately they'll have training sets and test sets and all that stuff.\n\n0:08:55\tSPEAKER_01\n But it would be interesting to hear what they intend to do about speaker over that first.\n\n0:09:01\tSPEAKER_06\n Right.\n\n0:09:03\tSPEAKER_05\n Yeah.\n\n0:09:05\tSPEAKER_05\n What's the plan if we're...\n\n0:09:07\tSPEAKER_05\n We're transcribing data and what happens if they don't deliver things until next year or something like that?\n\n0:09:15\tSPEAKER_05\n That's resource here.\n\n0:09:17\tSPEAKER_08\n Well, again, the hope is that...\n\n0:09:21\tSPEAKER_08\n I mean, it's looking...\n\n0:09:23\tSPEAKER_08\n I mean, I have to ask these folks, but my impression is that the IBM path is looking more promising.\n\n0:09:33\tSPEAKER_08\n Yeah. And if that's the case, and if it turns out that it's really a relatively small amount of time for our transcribers to process things before and after, if they really have taken out enough of the work that it's feasible, then maybe we can do it with a smaller staff next year.\n\n0:09:53\tSPEAKER_08\n I mean, next year in which he's referring to us, next year we don't have a whole lot of guaranteed funding for this work.\n\n0:10:02\tSPEAKER_08\n Other funding may come.\n\n0:10:05\tSPEAKER_08\n But if we want to just count on what we know about, it's more modest than this year.\n\n0:10:12\tSPEAKER_08\n There's still be money, but it's just more modest.\n\n0:10:16\tSPEAKER_08\n So I would see us as probably not doing more recordings, at least for meetings or digits or anything.\n\n0:10:24\tSPEAKER_08\n But if we feel we need to probably still do some recordings for smart com or something.\n\n0:10:30\tSPEAKER_08\n But otherwise, just stop that and just take whatever comes from the other places, which I guess we have an unknown rate.\n\n0:10:40\tSPEAKER_08\n If it starts being, their generating is huge amount, we can't handle it, then we'll tell them.\n\n0:10:48\tSPEAKER_08\n But although it would have been nice if that their stuff had come earlier, it's some ways a good thing because we've been earning out this path.\n\n0:10:59\tSPEAKER_02\n I got an email from one of the UW guys.\n\n0:11:02\tSPEAKER_02\n They want to record the meetings at higher sampling rate than 16 kilohertz.\n\n0:11:09\tSPEAKER_02\n I didn't ask why, but it seems to me that really doesn't matter if they have the disk space to do it.\n\n0:11:15\tSPEAKER_02\n It seems that that is not a big deal.\n\n0:11:19\tSPEAKER_02\n I was just wondering if anyone had an opinion about mismatched?\n\n0:11:23\tSPEAKER_08\n Well, just if the rate's sending to us, then we have to have the disk space to do it too.\n\n0:11:29\tSPEAKER_04\n Can't we down sample?\n\n0:11:31\tSPEAKER_04\n That would be a whole bit.\n\n0:11:32\tSPEAKER_08\n Are they doing some nice integer multiple?\n\n0:11:35\tSPEAKER_08\n Excuse me?\n\n0:11:36\tSPEAKER_08\n Are they doing some nice integer multiple of the 16?\n\n0:11:39\tSPEAKER_02\n No, no, it was like 40-something, 44-42.\n\n0:11:43\tSPEAKER_08\n Oh, 44.1.\n\n0:11:47\tSPEAKER_08\n Something like that.\n\n0:11:49\tSPEAKER_08\n Oh, so that's...well, we record here at 48 or something, and then we down sample.\n\n0:11:55\tSPEAKER_05\n But it's 44 and 16 or not.\n\n0:11:58\tSPEAKER_05\n Well, you can do it.\n\n0:12:00\tSPEAKER_08\n No, I'm sorry, you can do it.\n\n0:12:02\tSPEAKER_08\n You can go from anything to anything else.\n\n0:12:04\tSPEAKER_05\n But it's just a little more complicated.\n\n0:12:06\tSPEAKER_05\n It's just a little bit more complicated.\n\n0:12:09\tSPEAKER_05\n It's just like...\n\n0:12:10\tSPEAKER_08\n It's just slightly more complicated, but you can go from any frequency to anything.\n\n0:12:17\tSPEAKER_02\n Well, the only thought was if we're going to do a combined corpus, does it really matter if some sample that won't rate in some sample that the other?\n\n0:12:25\tSPEAKER_02\n My feeling is no, it doesn't.\n\n0:12:27\tSPEAKER_02\n These days, audio tools tend to take care of all of that, but I just wanted to double check with other people before I told them, yeah, no problem.\n\n0:12:35\tSPEAKER_04\n Also, seems like the corpus could all be standardized on this...\n\n0:12:39\tSPEAKER_04\n That's why I was saying so.\n\n0:12:40\tSPEAKER_02\n Why are they asking us?\n\n0:12:41\tSPEAKER_02\n I didn't know.\n\n0:12:42\tSPEAKER_02\n Why are they asking us?\n\n0:12:43\tSPEAKER_02\n Because we're sort of doing the corpus, so they want to be as similar as possible.\n\n0:12:49\tSPEAKER_02\n I think the answer is if we tell him, no, that's not all right, what he'll probably say is what we're going to do in any way.\n\n0:12:55\tSPEAKER_01\n Well, that's the...\n\n0:12:56\tSPEAKER_01\n It would be interesting to find out why they're choosing the other sample.\n\n0:12:59\tSPEAKER_08\n Well, I would suspect this because it's what the hardware does.\n\n0:13:02\tSPEAKER_02\n Oh, and they just don't want it down sample.\n\n0:13:04\tSPEAKER_02\n Yeah.\n\n0:13:05\tSPEAKER_01\n They're just deferring the problem to later, and they might say themselves a lot of this.\n\n0:13:10\tSPEAKER_01\n They can't participate.\n\n0:13:11\tSPEAKER_08\n I think it's the sort of thing that's deserving of discussion with them.\n\n0:13:15\tSPEAKER_08\n I don't think it's like...\n\n0:13:17\tSPEAKER_08\n They'll ask us, we'll give a simple answer and come back.\n\n0:13:19\tSPEAKER_08\n It needs them back and forth because it's a little gnarly to have parts of the database with different things.\n\n0:13:25\tSPEAKER_08\n And it's...\n\n0:13:28\tSPEAKER_08\n Part of the arguments for the higher sampling rate is that maybe there's something, you know, say, in 6 to 10 kilohertz that you might use for some purposes somewhere.\n\n0:13:38\tSPEAKER_08\n People are doing a wide range of things, doing location, doing a bunch of things.\n\n0:13:43\tSPEAKER_08\n Maybe, you know, why throw it away if you don't need to.\n\n0:13:46\tSPEAKER_08\n On the other hand, I mean...\n\n0:13:50\tSPEAKER_08\n It's...\n\n0:13:52\tSPEAKER_08\n 16 kilohertz is plenty.\n\n0:13:53\tSPEAKER_08\n Yeah.\n\n0:13:54\tSPEAKER_08\n So I think it's...\n\n0:13:59\tSPEAKER_08\n And they are going to be using a ballad disk, both for them and for us when we're processing their stuff.\n\n0:14:04\tSPEAKER_01\n We should want them to use this space issues, like, going to creep up on them very fast.\n\n0:14:09\tSPEAKER_01\n Yeah, it would be...\n\n0:14:10\tSPEAKER_08\n If they're going to creep up on you, you won't even creep.\n\n0:14:13\tSPEAKER_05\n As long as it's heavily like three people per meeting.\n\n0:14:16\tSPEAKER_05\n How many channels?\n\n0:14:17\tSPEAKER_05\n They can just limit the number of people.\n\n0:14:19\tSPEAKER_02\n I don't remember what their hardware set up was, but it was smaller than ours.\n\n0:14:23\tSPEAKER_08\n Well, that might help a bit.\n\n0:14:25\tSPEAKER_08\n Yeah, actually, I think at NIST, there was some discussion of fairly high sampling rates too.\n\n0:14:29\tSPEAKER_02\n Well, with NIST, I think they're in a different situation because they're doing video.\n\n0:14:34\tSPEAKER_02\n And so compared to the video, the audio was just noise in terms of disk space, literally.\n\n0:14:38\tSPEAKER_08\n I don't think that's true.\n\n0:14:40\tSPEAKER_08\n Really?\n\n0:14:41\tSPEAKER_08\n They're recording 50 channels or mics.\n\n0:14:43\tSPEAKER_02\n They're not recording all 50 of the array.\n\n0:14:46\tSPEAKER_02\n They're cooking the down, right?\n\n0:14:48\tSPEAKER_05\n They said they were going to record 50, but they were definitely above, like, 20.\n\n0:14:52\tSPEAKER_02\n That's funny.\n\n0:14:53\tSPEAKER_02\n I thought that they were cooking down that data.\n\n0:14:55\tSPEAKER_02\n I don't think so for them.\n\n0:14:56\tSPEAKER_08\n They were storing it.\n\n0:14:57\tSPEAKER_08\n I don't think so.\n\n0:14:58\tSPEAKER_08\n No, so I think they have actually a very large audio data rate.\n\n0:15:02\tSPEAKER_08\n I think it is comparable to a video data rate.\n\n0:15:05\tSPEAKER_08\n So.\n\n0:15:06\tSPEAKER_03\n How many words are they going to ever distribute this?\n\n0:15:10\tSPEAKER_02\n They're not going to.\n\n0:15:11\tSPEAKER_08\n You're going to have to just get...\n\n0:15:14\tSPEAKER_08\n Interesting question.\n\n0:15:15\tSPEAKER_08\n Because you'll have to just work on little subsets of it.\n\n0:15:18\tSPEAKER_02\n There's just no way.\n\n0:15:19\tSPEAKER_03\n We're estimating that ours, if we collect, say, 100 meetings in each meeting, is just the audio compressed audio is half a gig.\n\n0:15:27\tSPEAKER_03\n So there's 50 gigs just for our corpus, for 100 meetings.\n\n0:15:32\tSPEAKER_03\n And that's no video.\n\n0:15:35\tSPEAKER_08\n 16.\n\n0:15:36\tSPEAKER_03\n 16.\n\n0:15:37\tSPEAKER_03\n And so...\n\n0:15:38\tSPEAKER_03\n You just get like...\n\n0:15:39\tSPEAKER_03\n Even the distribution of 20 gigs, you know, if you use DVDs or something, that's a lot.\n\n0:15:47\tSPEAKER_03\n It's still two or three DVDs.\n\n0:15:49\tSPEAKER_03\n And I feel it's to read the video also.\n\n0:15:51\tSPEAKER_03\n It's used both sides and the two layers.\n\n0:15:53\tSPEAKER_02\n It's a lot more than that, right?\n\n0:15:55\tSPEAKER_02\n DVD is eight gigs.\n\n0:15:57\tSPEAKER_08\n Well, I think you also have interesting discussions next month when you go out there.\n\n0:16:00\tSPEAKER_08\n Yeah.\n\n0:16:01\tSPEAKER_08\n And how are they going to...\n\n0:16:02\tSPEAKER_08\n What's the distribution plan?\n\n0:16:03\tSPEAKER_08\n If they have something really smart in mind, then maybe we can use it.\n\n0:16:06\tSPEAKER_08\n I mean, we talked about sending around a disk or...\n\n0:16:10\tSPEAKER_02\n I think that's the right way to do it.\n\n0:16:12\tSPEAKER_02\n Someone sends us a disk.\n\n0:16:13\tSPEAKER_02\n We loaded it with data and send it back.\n\n0:16:15\tSPEAKER_02\n It's going to be easier than any other method.\n\n0:16:19\tSPEAKER_02\n Well, if you want to burn the CDs here, welcome to it.\n\n0:16:23\tSPEAKER_03\n We give it to LDC and let them do it.\n\n0:16:25\tSPEAKER_02\n Oh, yeah.\n\n0:16:26\tSPEAKER_02\n Yeah, absolutely.\n\n0:16:27\tSPEAKER_02\n If they have a way to do it.\n\n0:16:28\tSPEAKER_02\n I'm thinking prior to that.\n\n0:16:30\tSPEAKER_05\n If there ever any talk of taking the closed talking mics when people aren't talking and deleting those portions, or is the bridge...\n\n0:16:37\tSPEAKER_02\n You already do that.\n\n0:16:38\tSPEAKER_02\n Shorten does that automatically.\n\n0:16:39\tSPEAKER_02\n That's why you...\n\n0:16:40\tSPEAKER_02\n That's why shorten...\n\n0:16:41\tSPEAKER_02\n That's why shorten reduces the size so much.\n\n0:16:44\tSPEAKER_08\n That's why it's only 50 gigs.\n\n0:16:46\tSPEAKER_05\n Right.\n\n0:16:47\tSPEAKER_05\n So it's really big, even if you're only one person or two people that most are actually talking all the time.\n\n0:16:52\tSPEAKER_00\n Yep.\n\n0:16:53\tSPEAKER_05\n Wow.\n\n0:16:54\tSPEAKER_02\n Just talk less.\n\n0:16:55\tSPEAKER_02\n Well, if you talk less, it does, in fact, use less data.\n\n0:16:59\tSPEAKER_02\n So the channel...\n\n0:17:01\tSPEAKER_08\n The first time I ever heard you ask for less data.\n\n0:17:04\tSPEAKER_02\n It's actually one way to tell if a microphone is dead and bleeding, is if the short file is too short.\n\n0:17:10\tSPEAKER_02\n It's really short, then.\n\n0:17:11\tSPEAKER_02\n Then you can be pretty sure that the mic was off.\n\n0:17:13\tSPEAKER_11\n Okay.\n\n0:17:14\tSPEAKER_02\n And unfortunately, the tabletop ones, the six tabletop, which we record all the time, no matter how many people are there, don't compress nearly as well, because they almost always have signal on them.\n\n0:17:27\tSPEAKER_02\n Yeah, that's probably a lot of it.\n\n0:17:28\tSPEAKER_08\n And they're going to hit mics like that, too.\n\n0:17:30\tSPEAKER_08\n In fact, they're array.\n\n0:17:31\tSPEAKER_02\n They're array, we'll be.\n\n0:17:32\tSPEAKER_02\n So they want shorten nearly as well.\n\n0:17:34\tSPEAKER_02\n Wow.\n\n0:17:35\tSPEAKER_11\n And I assume they're going to do it lossless.\n\n0:17:37\tSPEAKER_01\n So they're really going to have a huge distribution purposes, might make sense to split it by channel, rather than by meetings.\n\n0:17:44\tSPEAKER_01\n So you could distribute, like, only the near field.\n\n0:17:47\tSPEAKER_01\n Yeah, absolutely.\n\n0:17:49\tSPEAKER_01\n Together for a bunch of meetings.\n\n0:17:51\tSPEAKER_02\n And then maybe one far field, you know, things or the mix channel.\n\n0:17:55\tSPEAKER_02\n I think there are a lot of ways to do it.\n\n0:17:57\tSPEAKER_02\n But let's not worry about that now.\n\n0:17:59\tSPEAKER_02\n Are we on disk space, Jack?\n\n0:18:01\tSPEAKER_03\n We're okay.\n\n0:18:02\tSPEAKER_03\n We've got, for the compressed meetings, we've still got about, I think it was four gigs, the one disk that we're using.\n\n0:18:11\tSPEAKER_03\n And we've got several, we still got quite a bit of space on the unbacked up.\n\n0:18:18\tSPEAKER_03\n So good.\n\n0:18:19\tSPEAKER_03\n But I think it's probably we should start thinking about where to go next, especially on the backed up disk space.\n\n0:18:25\tSPEAKER_08\n Now we bought, no, longer we bought three.\n\n0:18:29\tSPEAKER_08\n That's the unbacked.\n\n0:18:30\tSPEAKER_08\n 36 gigabyte disks.\n\n0:18:31\tSPEAKER_02\n Yeah, and we're using those for the poor, the expanded.\n\n0:18:34\tSPEAKER_03\n So for example, the Gunter's Wall Street Journal data went on to one of those.\n\n0:18:39\tSPEAKER_03\n Some other experiment things that people are doing are on there.\n\n0:18:42\tSPEAKER_03\n So if you put it there, people will use it.\n\n0:18:48\tSPEAKER_08\n So I think after that we need another rack or some servers.\n\n0:18:52\tSPEAKER_08\n Change servers?\n\n0:18:54\tSPEAKER_03\n Well, we could, we could, there are a bunch of disks that we have that are smaller and they're like 17, we could go to 35.\n\n0:19:03\tSPEAKER_03\n So we could get some extra space out of that.\n\n0:19:05\tSPEAKER_03\n But right now the server's full, we couldn't add any more disks.\n\n0:19:09\tSPEAKER_03\n We could change a smaller disk for a larger one.\n\n0:19:12\tSPEAKER_08\n We should probably do that while we have the space left on the existing disks.\n\n0:19:18\tSPEAKER_02\n Yeah, the problem with that for backed up media is the Sysadmins want to keep them at 18 gig partitions because that takes up how to day to get off backup tape.\n\n0:19:30\tSPEAKER_03\n Well then there's the other issue is that to add more disk now, David says we really need to go to new servers.\n\n0:19:37\tSPEAKER_03\n But he wants to go to new servers, not just for us, but for other nodes too.\n\n0:19:42\tSPEAKER_03\n So there's this sort of coordination issue.\n\n0:19:45\tSPEAKER_03\n And I guess I need to talk to him more about it.\n\n0:19:48\tSPEAKER_02\n Actually, going to bigger disks we can do even and just maintain the 18 gig partitions, just partition them into multiple.\n\n0:19:55\tSPEAKER_02\n So that's probably the next step is to get the 80 or 90 gig drives to replace the 30 gig we're in 18 gig that we have now.\n\n0:20:03\tSPEAKER_08\n There are 80 gig drives now, you can get that.\n\n0:20:08\tSPEAKER_08\n See that's probably what we should send around to for distribution.\n\n0:20:14\tSPEAKER_02\n This is a corpus.\n\n0:20:15\tSPEAKER_02\n That's a whole handful of micro drives.\n\n0:20:19\tSPEAKER_02\n Is the aerial density of the micro drive higher than if it were normal drive?\n\n0:20:23\tSPEAKER_02\n It must be.\n\n0:20:24\tSPEAKER_03\n When they come out with the 80 gig micro drive then we'll just send one of those little things with all the meeting days.\n\n0:20:28\tSPEAKER_02\n Yeah. Well they have the two gig already.\n\n0:20:30\tSPEAKER_02\n I'm just thinking 40 of them is probably still smaller in area than one normal size drive.\n\n0:20:37\tSPEAKER_08\n Actually, I think what was it Dave who was suggesting that you just get a computer that has one of these drives and send the computer around to the different sites and just help the computer.\n\n0:20:52\tSPEAKER_08\n A laptop.\n\n0:20:53\tSPEAKER_08\n A laptop.\n\n0:20:54\tSPEAKER_08\n A send the laptop.\n\n0:20:55\tSPEAKER_08\n 80 gig laptop.\n\n0:20:56\tSPEAKER_08\n Of course you don't trust the shippers necessarily so you send a person to and they just don't go to the site.\n\n0:21:02\tSPEAKER_02\n I'll do that.\n\n0:21:03\tSPEAKER_08\n Download their data.\n\n0:21:05\tSPEAKER_08\n Unfortunately it just takes a week at each site.\n\n0:21:08\tSPEAKER_02\n What?\n\n0:21:09\tSPEAKER_02\n It does take a week at each site.\n\n0:21:10\tSPEAKER_02\n Does it?\n\n0:21:11\tSPEAKER_02\n Yeah, absolutely.\n\n0:21:12\tSPEAKER_02\n If it's a nice site.\n\n0:21:13\tSPEAKER_08\n Yeah, they really need it in a Vesa Bursk.\n\n0:21:17\tSPEAKER_08\n Yeah.\n\n0:21:18\tSPEAKER_02\n That only takes a day or so.\n\n0:21:21\tSPEAKER_08\n Anyway.\n\n0:21:22\tSPEAKER_08\n But the University of Hawaii has issued a request.\n\n0:21:27\tSPEAKER_01\n Yeah.\n\n0:21:28\tSPEAKER_08\n That needs an opportunity.\n\n0:21:29\tSPEAKER_08\n Yeah.\n\n0:21:30\tSPEAKER_08\n Did that move.\n\n0:21:31\tSPEAKER_08\n Things are slower there.\n\n0:21:33\tSPEAKER_08\n Definitely true.\n\n0:21:34\tSPEAKER_08\n Yeah.\n\n0:21:35\tSPEAKER_08\n Any other items?\n\n0:21:37\tSPEAKER_08\n So, okay.\n\n0:21:38\tSPEAKER_08\n So that's the meeting stuff transcripts.\n\n0:21:40\tSPEAKER_08\n So you said it was almost half so that means that we have like 80 or so hours and out of that maybe 35 or something.\n\n0:21:47\tSPEAKER_08\n Yeah.\n\n0:21:48\tSPEAKER_03\n The pie chart shows actually meetings that are it combines the categories of you know currently in oh I've got it right there.\n\n0:21:59\tSPEAKER_02\n I saw the pie charts.\n\n0:22:01\tSPEAKER_02\n Yeah.\n\n0:22:02\tSPEAKER_02\n There's just a few.\n\n0:22:03\tSPEAKER_04\n 200 on the board.\n\n0:22:05\tSPEAKER_03\n Yeah.\n\n0:22:06\tSPEAKER_03\n Except for the other.\n\n0:22:08\tSPEAKER_03\n I could run on the board.\n\n0:22:09\tSPEAKER_03\n Okay.\n\n0:22:10\tSPEAKER_03\n It combines categories.\n\n0:22:12\tSPEAKER_03\n So when we say transcribed we mean either in the process of being transcribed either here or at IBM.\n\n0:22:17\tSPEAKER_03\n Yeah.\n\n0:22:18\tSPEAKER_03\n Or complete transcription.\n\n0:22:20\tSPEAKER_03\n And it also includes checked.\n\n0:22:23\tSPEAKER_03\n So it includes a lot of categories to be.\n\n0:22:25\tSPEAKER_03\n I see.\n\n0:22:26\tNone\n So.\n\n0:22:27\tSPEAKER_02\n We need different colored pens.\n\n0:22:30\tSPEAKER_03\n Oh, I think that's that's that if thing is kind of old actually right now.\n\n0:22:35\tSPEAKER_04\n Last updated in July.\n\n0:22:37\tSPEAKER_04\n That one that you have?\n\n0:22:38\tSPEAKER_04\n Oh, I'm not sure.\n\n0:22:39\tSPEAKER_04\n The one that I saw on the web when I came back.\n\n0:22:43\tNone\n Okay.\n\n0:22:44\tSPEAKER_03\n Yeah.\n\n0:22:45\tSPEAKER_03\n The Russell Russell.\n\n0:22:47\tSPEAKER_03\n The date on this one is July 26th.\n\n0:22:49\tSPEAKER_08\n I have to go here.\n\n0:22:52\tSPEAKER_08\n But how much do we have that sort of.\n\n0:22:55\tSPEAKER_03\n So we have total number of meetings is 78 meetings.\n\n0:22:59\tSPEAKER_03\n And the total meeting time is 75 hours.\n\n0:23:07\tSPEAKER_03\n And so the ones that are finished being transcribed as opposed to in the process of being transcribed we've got 26 hours that are finished being transcribed.\n\n0:23:17\tSPEAKER_03\n What does that mean?\n\n0:23:18\tSPEAKER_03\n Finished being transcribed.\n\n0:23:19\tSPEAKER_03\n So there's several processes to the transcription.\n\n0:23:24\tSPEAKER_03\n There's ranges from being assigned to a transcriber to them finishing transcription to then being checked with the double check.\n\n0:23:34\tSPEAKER_03\n And so when we say the total transcribed that's the one that's gone through being checked I believe.\n\n0:23:40\tSPEAKER_03\n I think that's what I have here.\n\n0:23:42\tSPEAKER_03\n It's not yet approved.\n\n0:23:44\tSPEAKER_06\n But not yet approved.\n\n0:23:45\tSPEAKER_03\n And then there's the final one is approved for release.\n\n0:23:48\tSPEAKER_03\n That's after the meeting participants have.\n\n0:23:50\tSPEAKER_02\n So I should probably send those to you.\n\n0:23:52\tSPEAKER_02\n Yeah.\n\n0:23:53\tSPEAKER_02\n If you know.\n\n0:23:54\tSPEAKER_03\n Yeah, currently that's zero released.\n\n0:23:56\tSPEAKER_03\n They're five.\n\n0:23:57\tSPEAKER_02\n They're five.\n\n0:23:59\tSPEAKER_02\n We have five where everyone is replied.\n\n0:24:01\tSPEAKER_03\n Okay.\n\n0:24:02\tSPEAKER_03\n So we have five that are potentially released.\n\n0:24:04\tSPEAKER_04\n So the cross hatching there is.\n\n0:24:07\tSPEAKER_04\n It's been through the double check, right?\n\n0:24:09\tSPEAKER_04\n Yeah, that's approval and progress.\n\n0:24:12\tSPEAKER_04\n So I mean, when I add a couple more from that we're done in my absence, I think that we're down about there.\n\n0:24:20\tSPEAKER_04\n It's not quite as close to half as I thought, but it's, you know, it's more than it.\n\n0:24:25\tSPEAKER_04\n And so these right here have been through the double check.\n\n0:24:28\tSPEAKER_04\n These haven't.\n\n0:24:29\tSPEAKER_04\n How nice of you holding the things on them.\n\n0:24:32\tSPEAKER_04\n It was falling off.\n\n0:24:33\tSPEAKER_04\n Thank you.\n\n0:24:34\tSPEAKER_08\n Okay.\n\n0:24:37\tSPEAKER_08\n All right. So we still have a lot of ways to go, but maybe the, the IBM thing, well, I'll push through the rest of it some quicker.\n\n0:24:47\tSPEAKER_02\n Okay.\n\n0:24:49\tSPEAKER_02\n Well, there's still two people for whom I have not been able to get in touch.\n\n0:24:53\tSPEAKER_02\n I have never gotten a response from any of the emails about permission forms.\n\n0:24:58\tSPEAKER_02\n So are they from one before language ones?\n\n0:25:01\tSPEAKER_04\n Yep.\n\n0:25:02\tSPEAKER_02\n Okay, good.\n\n0:25:07\tSPEAKER_04\n That's why the NSA once have still not been approved.\n\n0:25:10\tSPEAKER_08\n It was a figure that's prominently in things anyway.\n\n0:25:13\tSPEAKER_08\n Yep.\n\n0:25:14\tSPEAKER_02\n Yeah, it might, it might partly just be Europeans and communication issues.\n\n0:25:18\tSPEAKER_02\n Possibly, it's been like four months.\n\n0:25:21\tSPEAKER_08\n Oh.\n\n0:25:24\tSPEAKER_08\n How long vacation?\n\n0:25:28\tSPEAKER_08\n Okay.\n\n0:25:33\tSPEAKER_08\n I'm just going around.\n\n0:25:35\tSPEAKER_06\n Can you want to say something about the hardware?\n\n0:25:37\tSPEAKER_02\n Oh, that's right.\n\n0:25:38\tSPEAKER_02\n Yeah, we have new hardware.\n\n0:25:40\tSPEAKER_02\n So I want to set it up at some point.\n\n0:25:42\tSPEAKER_02\n So I just wanted to know what meeting schedules were.\n\n0:25:44\tSPEAKER_02\n What new hardware?\n\n0:25:45\tSPEAKER_02\n We have several more wireless channels so that we can set up and get rid of these, the wired stuff completely.\n\n0:25:51\tSPEAKER_02\n And then also we got replacements for these mics.\n\n0:25:55\tSPEAKER_02\n So what's your question?\n\n0:25:57\tSPEAKER_02\n I don't really like this.\n\n0:25:58\tSPEAKER_02\n Those are the only two choices right now, unfortunately.\n\n0:26:00\tSPEAKER_02\n So what's your question?\n\n0:26:01\tSPEAKER_02\n The question is when are we not recording any meetings for a couple days so that I can do it.\n\n0:26:05\tSPEAKER_02\n And if it doesn't work, we won't impact people.\n\n0:26:08\tSPEAKER_02\n Well, there's a point.\n\n0:26:09\tSPEAKER_08\n So when the bunch of us are off at ERA speech.\n\n0:26:13\tSPEAKER_02\n So what smart come?\n\n0:26:15\tSPEAKER_06\n Nothing this week, maybe in the end of next week.\n\n0:26:18\tSPEAKER_02\n End of next week.\n\n0:26:19\tSPEAKER_02\n Is EDU still recording?\n\n0:26:21\tSPEAKER_05\n They usually do Thursdays.\n\n0:26:23\tSPEAKER_05\n I don't get a lot of advance notice.\n\n0:26:25\tSPEAKER_05\n But it's always been either Monday or Thursdays.\n\n0:26:28\tSPEAKER_05\n Thursdays?\n\n0:26:29\tSPEAKER_05\n Yeah, they often do it after.\n\n0:26:31\tSPEAKER_02\n So if I did it like tomorrow, that would be all right.\n\n0:26:34\tSPEAKER_02\n It sounds like.\n\n0:26:35\tSPEAKER_05\n Yeah, Wednesdays, Fridays.\n\n0:26:37\tSPEAKER_02\n So it sounds like no one.\n\n0:26:39\tSPEAKER_02\n No one early next week.\n\n0:26:41\tSPEAKER_06\n Yeah, let me check with Robert again, but I'm pretty sure that does nothing this week.\n\n0:26:47\tSPEAKER_06\n Okay.\n\n0:26:48\tSPEAKER_02\n And then I'll also re-number.\n\n0:26:52\tSPEAKER_02\n So that the mics are in order.\n\n0:26:55\tSPEAKER_02\n Okay.\n\n0:26:56\tSPEAKER_02\n Thank you.\n\n0:26:57\tSPEAKER_02\n Okay.\n\n0:26:58\tSPEAKER_02\n Help with the transcripts.\n\n0:27:01\tSPEAKER_02\n So right now the channel numbers are discontinuous.\n\n0:27:04\tSPEAKER_04\n Yeah.\n\n0:27:05\tSPEAKER_04\n I mean, it's like extra step.\n\n0:27:10\tSPEAKER_08\n So I was just thinking maybe just go around and just briefly look.\n\n0:27:14\tSPEAKER_08\n Other things that are going on.\n\n0:27:16\tSPEAKER_08\n Maybe since we don't have much of a set agenda.\n\n0:27:18\tSPEAKER_08\n We don't have much time.\n\n0:27:21\tSPEAKER_05\n But feel free to overlap.\n\n0:27:24\tSPEAKER_02\n Okay, we'll all say what we're doing at the same time.\n\n0:27:27\tSPEAKER_05\n I mean, I was scared when these portions were not going to overlap.\n\n0:27:32\tSPEAKER_05\n That's just state of points.\n\n0:27:34\tSPEAKER_08\n So why don't we, we, we, we, we, we, we pick two people to.\n\n0:27:37\tSPEAKER_05\n People like that channel.\n\n0:27:39\tSPEAKER_08\n Ask much.\n\n0:27:40\tSPEAKER_08\n Yeah.\n\n0:27:41\tSPEAKER_08\n I'll keep seeing you.\n\n0:27:42\tSPEAKER_08\n Yeah.\n\n0:27:45\tSPEAKER_08\n There's absolutely natural meetings.\n\n0:27:47\tSPEAKER_08\n We have absolutely no effect from a preconception.\n\n0:27:50\tSPEAKER_01\n The transcribers have trouble with your back channel.\n\n0:27:53\tSPEAKER_01\n Because with my back channel.\n\n0:27:55\tSPEAKER_01\n Yeah, with your back channel.\n\n0:27:56\tSPEAKER_01\n Because sometimes you have the sort of this, this, this aha that you don't know.\n\n0:28:01\tSPEAKER_01\n So there's aha and there is aha.\n\n0:28:03\tSPEAKER_01\n And it's not quite clear always what.\n\n0:28:05\tSPEAKER_01\n Which I mean.\n\n0:28:06\tSPEAKER_01\n Yeah.\n\n0:28:07\tSPEAKER_05\n But I don't think it's aha.\n\n0:28:08\tSPEAKER_05\n It's more like aha.\n\n0:28:11\tSPEAKER_05\n Resident.\n\n0:28:12\tSPEAKER_06\n And.\n\n0:28:13\tSPEAKER_06\n I don't like the back channels at all.\n\n0:28:16\tSPEAKER_06\n That's really a problem with the speech and non-speech detect.\n\n0:28:19\tSPEAKER_06\n Anybody done anything?\n\n0:28:20\tSPEAKER_06\n What are we doing?\n\n0:28:21\tNone\n I mean, I'll start if you want.\n\n0:28:22\tSPEAKER_08\n I've been the most recently rewriting transcriber and Java for no particular reason.\n\n0:28:26\tSPEAKER_02\n Well, I mean, what happened was that transcribers very slow to load.\n\n0:28:39\tSPEAKER_02\n So when you have a big meeting, especially on a slower machine, it can take five minutes before you can start doing anything.\n\n0:28:45\tSPEAKER_02\n And so I was thinking about why that was and the data structures I would use and I found myself unable not to sit down and code it.\n\n0:28:50\tSPEAKER_02\n So I did.\n\n0:28:51\tSPEAKER_02\n And so I have a big chunk of transcriber now written in Java and it comes up, you know, in a couple of seconds.\n\n0:28:56\tSPEAKER_01\n Do you take feature requests?\n\n0:28:59\tNone\n Yeah.\n\n0:29:00\tSPEAKER_02\n What?\n\n0:29:01\tSPEAKER_02\n It's not really, no, probably not worth doing.\n\n0:29:05\tSPEAKER_01\n Well, I think it is worth doing.\n\n0:29:07\tSPEAKER_01\n Because here's the thing.\n\n0:29:08\tSPEAKER_01\n We're sort of, we're starting to move from transcription to annotation.\n\n0:29:11\tSPEAKER_01\n And the transcriber in a face is fine.\n\n0:29:15\tSPEAKER_01\n If essentially what you're doing is stringing words together to make transcribers.\n\n0:29:21\tSPEAKER_01\n But in, for instance, what we're doing now with communicator data, but what you would like to do with meeting data is to actually label utterances or words or whatever units you want with, you know, basically doing a multiple choice type of labeling.\n\n0:29:36\tSPEAKER_01\n And for those type of tasks, it's much more efficient to present a bunch of applicable buttons or whatever.\n\n0:29:46\tSPEAKER_05\n But it has to be multi-streamed.\n\n0:29:48\tSPEAKER_05\n In other words, the beginning of something could be one speaker and the end of that unit, like question, answer pair, could be a different speaker.\n\n0:29:56\tSPEAKER_05\n That's why we can't just annotate the transcripts one listening to one at a time.\n\n0:30:05\tSPEAKER_05\n So that's why the transcriber is nice for sort of listening to it, but you can't actually encode.\n\n0:30:11\tSPEAKER_05\n Yeah, I understand that.\n\n0:30:13\tSPEAKER_01\n And that's actually a good model, which is what this current tool that we're using has is to associate these labels with attributes of HTML tags.\n\n0:30:25\tSPEAKER_01\n So, you know, you have say a tag for, I don't know, what type of items, whether it's a question or a statement or whatever, and then you have a tag attribute and the value of that includes the choice.\n\n0:30:38\tSPEAKER_02\n So what I don't have with it so far is it doesn't play wave files and it doesn't display wave files, it just haven't done that since that part wasn't display as showing the way for one day.\n\n0:30:50\tSPEAKER_02\n And then also a lot of the fancy user interface stuff that's in transcriber I haven't done, but it works.\n\n0:30:56\tSPEAKER_08\n What's the original transcriber written in?\n\n0:30:58\tSPEAKER_08\n Tickle TK.\n\n0:30:59\tSPEAKER_08\n I see.\n\n0:31:00\tNone\n I know.\n\n0:31:02\tSPEAKER_02\n Which is nice and flexible, but very, very slow, right comparison.\n\n0:31:06\tSPEAKER_03\n Are you using the, oh, you are, we already talked about that, the XML.\n\n0:31:10\tSPEAKER_02\n Yep, it's actually, yeah, because it's much faster than DOM and uses less memory.\n\n0:31:15\tSPEAKER_02\n And then, uh, bearing for calls, uh, hopefully second week of September, if I can never get war in sack to answer my emails.\n\n0:31:26\tSPEAKER_02\n I probably shouldn't say that on a safe, yeah, oh well, I gotta remember to beat that out.\n\n0:31:32\tSPEAKER_02\n Who was that?\n\n0:31:33\tSPEAKER_02\n No.\n\n0:31:34\tSPEAKER_02\n So anyway, that's it.\n\n0:31:37\tSPEAKER_02\n I'm sorry, I forgot about that.\n\n0:31:46\tSPEAKER_02\n Actually, I wanted to say offline with you about any literature reviews I should do beforehand.\n\n0:31:52\tSPEAKER_05\n Weren't peace.\n\n0:31:53\tSPEAKER_05\n Weren't peace, that's a good choice.\n\n0:31:55\tSPEAKER_05\n Keep me busy.\n\n0:31:56\tSPEAKER_05\n Yeah.\n\n0:31:57\tSPEAKER_05\n It's actually not a bad idea to say beep as a word because you can search the transcripts, you know, for that.\n\n0:32:03\tSPEAKER_05\n For beep, that's a good idea.\n\n0:32:04\tSPEAKER_08\n Okay.\n\n0:32:07\tSPEAKER_08\n I'll take that role anytime you want, I like saying it.\n\n0:32:10\tSPEAKER_08\n So.\n\n0:32:11\tSPEAKER_06\n Okay.\n\n0:32:13\tSPEAKER_06\n Yeah, I've been doing a bunch of recognition experiments on meeting data with different, uh, segmentations with different automatic segmentations, but it's not yet finished.\n\n0:32:24\tSPEAKER_06\n It's working progress.\n\n0:32:26\tSPEAKER_08\n Okay.\n\n0:32:27\tSPEAKER_08\n Any sense about how?\n\n0:32:28\tSPEAKER_06\n Yeah, for, uh, for the paper, I went to submit to these are you two, uh, you evaluate the quality of the speech and on speech detection by using it for speech recognition.\n\n0:32:41\tSPEAKER_08\n Right.\n\n0:32:42\tSPEAKER_08\n I was just asking if you had a sense yet of, uh, whether maybe you already did this experiment.\n\n0:32:47\tSPEAKER_08\n What was the question of, of how much of hurt you or helped you to use segmented?\n\n0:32:51\tSPEAKER_01\n Yeah, but we didn't have the exact comparison.\n\n0:32:55\tSPEAKER_01\n You know, there were, the experiments were based on different segmentations and different transcripts.\n\n0:33:00\tSPEAKER_01\n So we weren't quite sure what, what of the difference came from different transcripts, for instance.\n\n0:33:05\tSPEAKER_06\n And so it hurts compared to the ideal segmentation when you have the manual segmentations where you have exact boundaries for each other.\n\n0:33:13\tSPEAKER_06\n And so sometimes there are some, some words are cut off for.\n\n0:33:18\tSPEAKER_06\n There's some segments are assigned to speech, which there is nothing in.\n\n0:33:25\tSPEAKER_06\n And so there are more insertions, but most of the time there are more, the, the number of deletions is higher when, when you use the automatic segmentation compared to the ideal one.\n\n0:33:35\tSPEAKER_06\n And so I'm just in, in progress of yet trying to feed the recognize of both unsigmented data and see how much worse that is.\n\n0:33:45\tSPEAKER_06\n So that, that I have three things.\n\n0:33:47\tSPEAKER_06\n Yeah.\n\n0:33:48\tSPEAKER_01\n Unsegmented the automatic and the ideal one.\n\n0:33:58\tSPEAKER_07\n Yeah, I just got back.\n\n0:34:05\tSPEAKER_07\n I was going to post some results.\n\n0:34:09\tSPEAKER_07\n Was content with fishing was, was content fishing.\n\n0:34:14\tSPEAKER_08\n So your results are about same as both.\n\n0:34:18\tSPEAKER_08\n You should have seen the one that got away.\n\n0:34:20\tSPEAKER_08\n Yeah, who's results?\n\n0:34:21\tSPEAKER_08\n Bushes.\n\n0:34:22\tSPEAKER_07\n Yeah, you're both sort of, he's going back to the heartland.\n\n0:34:25\tSPEAKER_07\n Yeah, right, exactly.\n\n0:34:26\tSPEAKER_07\n I did my short part of heartland.\n\n0:34:28\tSPEAKER_07\n Yeah, built a few classes.\n\n0:34:31\tSPEAKER_07\n But right now I guess I'm working on this paper, this isca paper for this workshop that listen and dress.\n\n0:34:38\tSPEAKER_07\n So we're just getting different results for, we fixed up our different transcripts with different types of annotations.\n\n0:34:48\tSPEAKER_07\n And we ran, we ran alignments and we're going to develop a new feature database based on those alignments.\n\n0:34:54\tSPEAKER_07\n And do some trees and analysis.\n\n0:34:56\tSPEAKER_07\n So I'm kind of in the middle of that.\n\n0:34:59\tSPEAKER_07\n And flee by the 20th, 23rd.\n\n0:35:03\tSPEAKER_05\n 20th?\n\n0:35:04\tSPEAKER_07\n 20th.\n\n0:35:05\tSPEAKER_07\n Yeah, we'll have it all straightened out.\n\n0:35:08\tSPEAKER_07\n It's going to be a busy week.\n\n0:35:10\tSPEAKER_01\n I bet Bush went on the CRP intrep recently.\n\n0:35:14\tSPEAKER_01\n Yeah.\n\n0:35:15\tSPEAKER_01\n They told him that they got more vacation so he came back here and thought I'd have to somewhere with this.\n\n0:35:20\tSPEAKER_11\n Me.\n\n0:35:23\tSPEAKER_08\n I think he's been, he will have been off like two months out of his first seven.\n\n0:35:27\tSPEAKER_01\n Yeah.\n\n0:35:28\tSPEAKER_08\n It's hard to keep.\n\n0:35:29\tSPEAKER_08\n Very good deal.\n\n0:35:30\tSPEAKER_08\n Concentration.\n\n0:35:31\tSPEAKER_01\n I really know this.\n\n0:35:37\tSPEAKER_01\n So while he's vacationing, we've been, well, basically this is like a joint effort.\n\n0:35:44\tSPEAKER_01\n We're time for it.\n\n0:35:45\tSPEAKER_01\n Bush, you're done.\n\n0:35:49\tSPEAKER_01\n You know, apart from getting, preparing the data for the, for these experiments, for the, for this project, for this project workshop, we just, we just had a phone call with Mari and her students in fact.\n\n0:36:07\tSPEAKER_01\n And they want to, they're bringing up their own meeting recognize, which is based on Bill Burns, recognize from Johns Hopkins.\n\n0:36:18\tSPEAKER_01\n Based on Hub 5, like, based on their Hub 5 recognize, and so they've been getting from us the, you know, some support in terms of getting the latest transcripts and the, also the actually transcripts annotated with events like sentence boundaries and stuff like that.\n\n0:36:38\tSPEAKER_01\n Because one of Mari's students was, wants to do some language modeling for predicting overlaps and stuff like that.\n\n0:36:46\tSPEAKER_05\n Actually, we had this idea from the last time that they were here that it'd be nice to have UW do some work on language modeling that would be trying to get at the same detection as what we do acoustically since they can ramp up much quicker on the language modeling and we don't, you know, we want to do the prosotic side.\n\n0:37:03\tSPEAKER_05\n And so this is supposed to be a project that we could actually integrate the pastures that they get from their language model for every word boundary, every frame boundary, and then train up the classifiers.\n\n0:37:13\tSPEAKER_05\n And it's, I guess it's an undergrad too that, that's going to be doing this work.\n\n0:37:17\tSPEAKER_01\n On the recognition side, actually, I think the main person doing that is Herit from Herit Nark from, yeah, formerly Cambridge.\n\n0:37:28\tSPEAKER_01\n And apparently they get reasonable results except in some portions they get very high in search and rates, even higher than we get with the lag evenly on the halmikes with background speech and so they were trying to track that down.\n\n0:37:43\tSPEAKER_01\n It could be that our recognizes actually doing relatively well because it has a reject model for mismatched speech essentially or for unspecified speech.\n\n0:37:53\tSPEAKER_01\n So I sent them our recognition outputs so they can sort of do a line by line comparison and see if they, you know, their insertions correspond to our rejects and stuff like that.\n\n0:38:06\tSPEAKER_01\n So we'll see what that leads to.\n\n0:38:11\tSPEAKER_01\n Yeah, other than that, well, that's much, pretty much it.\n\n0:38:18\tSPEAKER_01\n As far as meeting certain sort of.\n\n0:38:22\tSPEAKER_08\n Yeah, I mean, we're doing, as I said mentioned, Dave and I have sort of been pushing through thinking in terms of an ASRU paper, but still, I think early next week with the side weather, we'll do one or not.\n\n0:38:35\tSPEAKER_08\n But because the results are still confusing enough that we've got to be convinced we understand what's going on.\n\n0:38:42\tSPEAKER_08\n But it's starting to look like it's almost the opposite of the usual situation where you get some really nice result with digits A and then you go to a large corpus and the result goes away.\n\n0:38:55\tSPEAKER_08\n We had what looked like a good result in digits but then we went to more training data that kind of went away.\n\n0:39:01\tSPEAKER_08\n So the digits result right now is kind of equivocal.\n\n0:39:06\tSPEAKER_08\n But the conversational speech one, well not huge, is in sort of hub five or meeting kind of terms.\n\n0:39:12\tSPEAKER_08\n Actually, it's not bad, you know.\n\n0:39:15\tSPEAKER_08\n So it's, you know, it's like after he did some adjustments more like a percent or so that it absolutely goes down.\n\n0:39:22\tSPEAKER_08\n It's a PhD.\n\n0:39:25\tSPEAKER_01\n Sometimes. But it's still true that basically the speaker adaptation sort of negates much of the data.\n\n0:39:33\tSPEAKER_08\n No, I'm talking about with the adaptation. Without the adaptation is a much bigger effect.\n\n0:39:38\tSPEAKER_08\n Okay.\n\n0:39:39\tSPEAKER_08\n So it's very reasonable to think it was an alternative way of getting this kind of kind of improvement.\n\n0:39:44\tSPEAKER_08\n But I think what ultimately we have to face with it is that I mean he gets incredibly good results if you artificially reverberate close to my data. So I think the thing we really have to face is that our model for what's going on is wrong or incomplete.\n\n0:40:02\tSPEAKER_08\n And that in this situation, particularly there's a lot of noise.\n\n0:40:06\tSPEAKER_08\n And noise plus reverberation is not all the same as just reverberation.\n\n0:40:09\tSPEAKER_08\n So there's one thing that I've been thinking of doing is there's a whole lot of work that's been going on in noise suppression in the Aurora team.\n\n0:40:19\tSPEAKER_08\n And so they've got some software and I'm thinking of just having us integrate that in.\n\n0:40:24\tSPEAKER_08\n Is it mine at sea?\n\n0:40:25\tSPEAKER_08\n Yeah, because it just I mean it just subtracts it out.\n\n0:40:28\tSPEAKER_08\n In fact, in fact, you can run it and sort of enhance it when we get speech out and just run it through the rest of your recognizers.\n\n0:40:35\tSPEAKER_08\n So.\n\n0:40:36\tSPEAKER_08\n So.\n\n0:40:38\tSPEAKER_08\n Let's work on that.\n\n0:40:45\tSPEAKER_01\n There's some work that do you remember this paper or poster by some CMU folks at the HLT.\n\n0:40:58\tSPEAKER_01\n They were talking about and they referred to an upcoming I cast paper I think at the time.\n\n0:41:03\tSPEAKER_01\n Someone in culture I think worked on estimating noise from the sudden regions and then doing some explicit.\n\n0:41:16\tSPEAKER_01\n I don't know if it's something akin to parallel model combination or something like that to.\n\n0:41:21\tSPEAKER_01\n I mean people have done that for a long time.\n\n0:41:23\tSPEAKER_01\n Right.\n\n0:41:24\tSPEAKER_01\n So I couldn't judge whether this was original or not but it seemed like they got pretty good results on their meeting data.\n\n0:41:33\tSPEAKER_08\n Yeah, I don't remember the paper but I mean that that's certainly one of the common techniques is to do that.\n\n0:41:38\tSPEAKER_08\n And in all these the stuff that our team is doing they certainly look at regions that you think are non-speech or to get nice statistics.\n\n0:41:46\tSPEAKER_08\n And they use a host of things different things you can do.\n\n0:41:55\tSPEAKER_08\n And the Aurora thing we have a little bit of a handicap in that they don't watch you adjust the statistical models.\n\n0:42:01\tSPEAKER_08\n So you have to do everything at the future level.\n\n0:42:04\tSPEAKER_08\n But there's a weener filtering and spectral subtraction which are sort of can be looked at as minor modifications of one another.\n\n0:42:13\tSPEAKER_08\n And they've now built up a nice piece of software that does has a sort of general framework for it so you can adjust it to sort of any any one of a dozen ways that people have done this kind of thing.\n\n0:42:26\tSPEAKER_08\n And they found a particular set of parameters they like this week and we're running with that for a while.\n\n0:42:36\tSPEAKER_05\n So I'll just really briefly so when working with Don and also in Andreas on the this paper on positive and what we're trying to do is predict where people at given all information up to whatever point in time you're considering trying to predict if that's a good location for someone else to jump in.\n\n0:42:56\tSPEAKER_05\n So that's the idea of that paper and that's the same task that Marie a student named Dustin and also Sarah who was at this last meeting will be looking into doing from the language model.\n\n0:43:07\tSPEAKER_05\n Maybe some kind of clustered class and grammar or something.\n\n0:43:12\tSPEAKER_05\n And also we're using a couple of the lablers who are doing a motion to help us finalize some transcripts for this.\n\n0:43:19\tSPEAKER_05\n So these undergrad undergrad students are really helping us out a lot under Don's provision actually that's good. So these offices are being very busy Don's and the one across from them.\n\n0:43:28\tSPEAKER_05\n And then also working with Jeremy on communicator emotion labeling and most of that up to a few weeks ago was just getting the people labeling these utterances to a computer for emotion and that's going pretty well now.\n\n0:43:42\tSPEAKER_05\n What kind of emotions do you label well we're mostly looking for places where the person's frustrated with the system.\n\n0:43:49\tSPEAKER_08\n So it's just two categories frustrated not there.\n\n0:43:52\tSPEAKER_05\n There are actually that's how we started.\n\n0:43:54\tSPEAKER_05\n Yeah.\n\n0:43:55\tSPEAKER_05\n And we had different levels now we have things like amused like oh you finally got it.\n\n0:43:59\tSPEAKER_05\n And this appointed tired like yeah no that's wrong again which isn't really mad but you know so they gave me a lot of feedback the lablers after doing this told me what they wanted as categories.\n\n0:44:10\tSPEAKER_05\n And then there's jokes.\n\n0:44:12\tSPEAKER_05\n Yeah.\n\n0:44:13\tSPEAKER_05\n Right. There's not a lot of enough frustration for us to really go through quickly because we have to label every meeting and also things like repeats for the same information and so forth.\n\n0:44:22\tSPEAKER_05\n And I've been coordinating a little bit with Katrin at UW who was doing user correction work that she presented at the at the meeting.\n\n0:44:31\tSPEAKER_05\n So there's some overlap there and what you know there's a correlation between corrections and annoyance or frustration.\n\n0:44:40\tSPEAKER_05\n But Jeremy's been starting to really work on that project now from the acoustic side so we have all these waveforms and he's been with Morgan's help and Dan Ellis is I think looking into spectral tilt of it.\n\n0:44:50\tSPEAKER_05\n So he can talk about that.\n\n0:44:52\tSPEAKER_05\n It's a feature we haven't used before.\n\n0:44:54\tSPEAKER_05\n And starting to take information from alignments and create a database that we can use sort of as a large feature vector table to feed to our decision trees which we'll try to give us back and answer from the speech only as to whether the person's frustrated.\n\n0:45:14\tSPEAKER_08\n That reminds me of something we talked about something ways back and I sort of lost track of it about having a synthesizer driven with.\n\n0:45:24\tSPEAKER_05\n I haven't really actually had time to do that to talk with you about that because there's a similar project at SRI where we're used that we want to do something like that to look at whether or not some of the stylized pitch stuff is sort of perceptually similar to the kinds of things that people would mark.\n\n0:45:41\tSPEAKER_06\n So I actually wanted to talk to you maybe after Wednesday.\n\n0:45:45\tSPEAKER_05\n Yeah, because you have this ASS or your deadline.\n\n0:45:48\tSPEAKER_05\n Yeah, just will be after sometime.\n\n0:45:50\tSPEAKER_08\n But that seemed like it would be fairly straightforward that you take the pitch from the real data.\n\n0:45:54\tSPEAKER_08\n Right.\n\n0:45:55\tSPEAKER_08\n If you did into the synthesizer and then process the output with a gain box that you also had energy from the real data.\n\n0:46:00\tSPEAKER_05\n Yeah, there was just no way to use the energy that still exists in the English.\n\n0:46:04\tSPEAKER_01\n We have to do the English synthesis for smart come.\n\n0:46:07\tSPEAKER_01\n What if we make the system really annoyed?\n\n0:46:10\tSPEAKER_05\n Okay, anyway, I should move on because we're running late.\n\n0:46:13\tSPEAKER_05\n But I wanted to say there's one question in my mind which maybe Morgan can talk to Jeremy about is how to sort of normalize spectral tilt is just sort of in this area I don't know much about.\n\n0:46:24\tSPEAKER_05\n And so we should talk offline.\n\n0:46:26\tSPEAKER_05\n But if you have a certain speaker and you want to sort of get a bunch of data from that speaker but compare it directly on a feature to like a decision tree that won't normalize anything for you once you feed it the features.\n\n0:46:38\tSPEAKER_05\n How do you sort of normalize over a particular speaker what makes sense to do with that feature?\n\n0:46:44\tSPEAKER_08\n Well, after you're with us using given the different suggestions he's got.\n\n0:46:47\tSPEAKER_05\n That's something we would be glad to have help on.\n\n0:46:52\tSPEAKER_05\n Yeah.\n\n0:46:54\tSPEAKER_05\n So go ahead, Jeremy.\n\n0:46:56\tSPEAKER_00\n All right, so I've been looking at spectral tilt and different ways of perhaps generating it and basically have three ways right now that we're looking at for we're going to look at for features.\n\n0:47:08\tSPEAKER_00\n One is just looking at first kept stroke coefficient and using that.\n\n0:47:15\tSPEAKER_00\n Another is looking at the difference of log energies between the high frequency band and a low frequency band and a third is just taking a slope of the linear fit of the spectrum and using that.\n\n0:47:33\tSPEAKER_00\n So those are the three ways I have right now for generating these spectral tilt numbers and hopefully soon can look at some of the labeled stuff and look at these numbers and see which ones seem to be working well and things like that.\n\n0:47:51\tSPEAKER_00\n Also recently wrote a script that generates the Kappa statistic, which is a for labular agreement.\n\n0:48:02\tSPEAKER_00\n So looking at that as well.\n\n0:48:11\tSPEAKER_05\n Specifically what you want to do is remove the average speaker tilt in some sense.\n\n0:48:35\tSPEAKER_05\n You don't know it.\n\n0:48:44\tSPEAKER_05\n You want to capture the change in voice quality within a speaker without having to know ahead of time, which is which because it's circular.\n\n0:49:11\tSPEAKER_05\n And we can try all of them and just put them in.\n\n0:49:14\tSPEAKER_08\n Well the answer is yeah, I mean you want to figure out where the place is going to go.\n\n0:49:17\tSPEAKER_01\n You can't just normalize it based on the utterance because then you're going to have zero everywhere.\n\n0:49:22\tSPEAKER_01\n So you'd have to normalize it based on everything for the speaker.\n\n0:49:26\tSPEAKER_01\n Yeah, okay, but that's not really feasible because you have a system, a dialog system where you only have access to what the speaker said before.\n\n0:49:34\tSPEAKER_01\n So it have to be sort of a causal.\n\n0:49:36\tSPEAKER_05\n Oh yeah, that's okay. That's the sort of we keep you keep iterating, you keep updating those numbers for future.\n\n0:49:43\tSPEAKER_08\n Yeah, I mean, but the main thing is that you're right.\n\n0:49:47\tSPEAKER_08\n I mean the main distinction is whether it's voice or voice turnout.\n\n0:49:50\tSPEAKER_08\n If it's if it's silence or on voice regions, then you don't really want that in there if you can help it.\n\n0:49:56\tSPEAKER_08\n But actually, I mean just the first order, suppose you just didn't do anything smart at all and just did, you know, did that.\n\n0:50:02\tSPEAKER_08\n It wouldn't be that bad because you get some number that would be skewed by you skip that.\n\n0:50:07\tSPEAKER_05\n Using the V and the variant.\n\n0:50:09\tSPEAKER_08\n You know, X, X minus mu or sigma.\n\n0:50:13\tSPEAKER_08\n Right, right.\n\n0:50:14\tSPEAKER_05\n So it is distributed in a way that you can do this.\n\n0:50:18\tSPEAKER_08\n It's sort of the first order thing to do.\n\n0:50:20\tSPEAKER_08\n There's obviously much more arcane things to do and complicated things to do.\n\n0:50:24\tSPEAKER_08\n That was our sort of, but that's the first thing to do.\n\n0:50:27\tSPEAKER_08\n And then, you know, then the next thing is, well, let's just look at the voice regions, you know, and that would be a reasonable thing to do.\n\n0:50:34\tSPEAKER_08\n And then if it's really, when you look at which, since you're looking at something that's sort of in log domain, cap stroke is like log, you know, linearly transformed the log domain, it's probably not that terrible assumption of attendance Gaussian anyway.\n\n0:50:45\tSPEAKER_08\n And so the other things that get more, more tricky are to handle the fact that it's not really Gaussian.\n\n0:50:51\tSPEAKER_08\n And I mean, I really need that for this.\n\n0:50:54\tSPEAKER_08\n Yeah, so I think that would be the obvious thing, too.\n\n0:50:58\tSPEAKER_01\n Well, we're not going to build a parametric model of that.\n\n0:51:02\tSPEAKER_01\n Of the future, right?\n\n0:51:04\tSPEAKER_01\n We just kind of could use that.\n\n0:51:05\tSPEAKER_01\n No, I understand.\n\n0:51:06\tSPEAKER_08\n It's just, no, it's more that if you felt something wasn't Gaussian, and you were trying to normalize for some kind of bias of some sort, you might use a nonparametric measure, you might use a median, you know, and rank statistics and all that sort of stuff.\n\n0:51:21\tSPEAKER_08\n But I mean, it shouldn't bother with any of the traffic outings.\n\n0:51:24\tSPEAKER_08\n Yeah.\n\n0:51:25\tSPEAKER_11\n Okay.\n\n0:51:26\tSPEAKER_05\n Thanks.\n\n0:51:28\tSPEAKER_05\n Sure.\n\n0:51:29\tSPEAKER_08\n And I already said what I was doing, which is mostly trying to give advice to Dave when he actually does the real work on this reberpiration thing.\n\n0:51:41\tSPEAKER_08\n But I think it's a real learning experience for both of us.\n\n0:51:46\tSPEAKER_08\n And I think it's a problem, an error problem area that people really haven't dealt with that much, as we know.\n\n0:51:52\tSPEAKER_08\n So he kind of did, he started off with what was in some sense sort of the first obvious thing to do, although hardly anybody had done it yet.\n\n0:52:01\tSPEAKER_08\n And it does work very well under some conditions, and other conditions it doesn't, and now we're understanding, trying to understand what those are.\n\n0:52:08\tSPEAKER_08\n It's fun.\n\n0:52:11\tSPEAKER_08\n She just got back.\n\n0:52:16\tNone\n No fish.\n\n0:52:18\tSPEAKER_08\n Okay.\n\n0:52:20\tSPEAKER_08\n Bush catches fish. They actually put a bunch of fish in the lake right now.\n\n0:52:25\tSPEAKER_08\n Really?\n\n0:52:26\tSPEAKER_08\n Really hungry fish.\n\n0:52:29\tSPEAKER_08\n I'm not kidding.\n\n0:52:31\tSPEAKER_08\n Really?\n\n0:52:32\tSPEAKER_02\n They've reached out there.\n\n0:52:33\tSPEAKER_08\n They're on fish and they're on the ocean.\n\n0:52:34\tSPEAKER_07\n Really not kidding.\n\n0:52:35\tSPEAKER_07\n Like, they got like scuba gear on, and like, what they didn't tell her.\n\n0:52:40\tSPEAKER_02\n Hey, I caught one this one, and it's already cooked.\n\n0:52:43\tSPEAKER_02\n I'm about to keep it.\n\n0:52:44\tSPEAKER_08\n 30 dead.\n\n0:52:46\tSPEAKER_08\n So we're...\n\n0:52:47\tSPEAKER_08\n What are you doing?\n\n0:52:48\tSPEAKER_08\n I think we're doing federal funding.\n\n0:52:51\tSPEAKER_02\n Should we do simultaneous digits so that I actually have time for tea?\n\n0:52:54\tSPEAKER_08\n Yeah, let's do that.\n\n0:52:57\tSPEAKER_08\n I don't know if these are going to be any good, but sure does get us out of here quickly.\n\n0:53:03\tSPEAKER_08\n One and a two and a three.\n\n0:53:06\tSPEAKER_08\n Transfer.\n\n0:53:07\tSPEAKER_09\n Second.\n\n0:53:12\tNone\n Oh my gosh.\n\n0:53:12\tSPEAKER_09\n I am about to return.\n\n0:53:14\tSPEAKER_09\n 50nd time.\n\n0:53:15\tSPEAKER_09\n I'm paying all of the transfer payments\n\n0:53:17\tSPEAKER_00\n for my cake.\n\n0:53:18\tSPEAKER_09\n Just should reduce the current period of the year.\n\n0:53:20\tSPEAKER_10\n Right and beyond, our service's going to be potential Ù\u0088Ù\u0087 replicant.\n\n0:53:22\tSPEAKER_04\n Waiting for currentÐ¾Ð¹ 200. That's just right before the gas station out there.\n\n0:53:23\tSPEAKER_04\n This is it.\n\n0:53:24\tSPEAKER_10\n We're going to reach depth of the relief in the flowBuite.\n\n0:53:26\tSPEAKER_00\n So, by the time it blesses, we're looking to sort that out.\n\n0:53:27\tNone\n This is another line under this line of income.\n\n0:53:24\tSPEAKER_10\n Probably a bit closer to the ganze lane right now.\n\n0:53:26\tSPEAKER_00\n But we're coming to a sort of higher point above the healthcare officers.\n\n0:53:27\tSPEAKER_00\n Let me get some, one thing to show you.\n\n0:53:29\tSPEAKER_00\n I wrote it in one day.\n\n0:53:31\tSPEAKER_00\n Even recently, COVID thousands.\n\n0:53:31\tSPEAKER_00\n 4273.\n\n0:53:34\tSPEAKER_10\n 3.050.\n\n0:53:35\tSPEAKER_10\n 8.090.\n\n0:53:36\tSPEAKER_10\n 7.060.\n\n0:53:37\tSPEAKER_10\n 8.470.\n\n0:53:38\tSPEAKER_00\n 6.060.\n\n0:53:39\tSPEAKER_00\n 8.260.\n\n0:53:40\tSPEAKER_00\n 6263.\n\n0:53:41\tSPEAKER_00\n 9273.\n\n0:53:44\tSPEAKER_08\n Anywhere worried we wouldn't have any overlap today?\n\n0:53:46\tSPEAKER_02\n Yeah.\n\n0:53:47\tSPEAKER_08\n A plenty of overlap.\n\n0:53:48\tSPEAKER_01\n And you know that whoever finished this last has to buy.\n\n0:53:51\tSPEAKER_01\n Did you know that?\n\n0:53:52\tSPEAKER_01\n I remember.\n\n0:53:53\tSPEAKER_01\n And we're ssssss.\n\n0:54:20\tNone\n I'm gonna make it happen today.\n\n", "summary": [{"summary_text": "There is a project for Jack's way. Speaker is in New York for several meetings next week. The meeting started and Speaker was the last person in. He is recording the meeting. Speakers are trying to keep talking. Chuck gets stuck with the earplug mic. "}]}