{"filename": "./data/Bmr019.txt", "transcript": "0:00:00\tSPEAKER_06\n Okay, we're on. Okay. So I mean everyone who's on the wireless check that they're on.\n\n0:00:07\tSPEAKER_06\n Okay, our agenda was quite short. Oh, could you please add on two items which was digits and Possibly stuff on on forced alignment, which Jane said that was an and Ray's headed information on but they didn't. I guess the only other thing\n\n0:00:27\tSPEAKER_07\n Okay Okay, so there's digits alignments and I guess the other thing Which I came up prepared for Is to just see if there's anything anybody wants to discuss about the Saturday meeting right?\n\n0:00:45\tSPEAKER_07\n so I mean digits and alignments\n\n0:00:50\tSPEAKER_03\n but Aligning people schedules. Yeah\n\n0:00:54\tSPEAKER_06\n Yeah, I mean right first alignment the people schedule\n\n0:01:02\tSPEAKER_07\n With whatever was a month and a half or something ahead of time the only time we could find in common roughly in common was on a Saturday\n\n0:01:10\tSPEAKER_03\n Yeah\n\n0:01:12\tSPEAKER_02\n I Thought about having a conference call to include him in more in more of the meeting I mean, I don't know if we had if he had a telephone on the table. No, but he probably has to go do something right?\n\n0:01:34\tSPEAKER_03\n Right so we have we make for interesting noise background noise. Yeah\n\n0:01:39\tSPEAKER_07\n So we have to equip him with And we'd have to put lots and lots of digits\n\n0:01:46\tSPEAKER_00\n Real car noise\n\n0:01:55\tSPEAKER_06\n So anyway, I can talk about digits. Did everyone get the results or shall I go over them again? I mean that it was basically the only thing that was even slightly surprising was that the lapel did so well and And in retrospect, that's not a surprising as maybe it shouldn't have been as surprising as I as I felt it was The lapel mic is a very high quality microphone and as Morgan pointed out that there are actually some advantages to it in terms of breath noises and clothes Wrestling if no one else is talking. Yeah so\n\n0:02:28\tSPEAKER_07\n Well, it's yeah, so the breath noises in the mouth clicks and so forth like that though pal is gonna be better on The lapel is typically worse on the enclosed wrestling, but if no one's wrestling their clothes\n\n0:02:38\tSPEAKER_06\n Right, I mean a lot of people are just sort of leaning over and reading digits. So it's it's a very\n\n0:02:43\tSPEAKER_00\n Different tasks than sort of neutral such during reading digits. Yeah, right\n\n0:02:53\tSPEAKER_07\n Right, right so in the digits in most most cases there weren't other people talking\n\n0:02:57\tSPEAKER_03\n The lapel likes to make a direction. They're typically don't know because I suppose you could make some that have sort of that you have to orient\n\n0:03:07\tSPEAKER_06\n They have a little bit, but they're not noise-cancelling so\n\n0:03:11\tSPEAKER_07\n They're intended to be on the directional right and and because you don't know how people are gonna put them on right now\n\n0:03:18\tSPEAKER_06\n So also and grace on that one the the back part of it should be right against your head and that will keep it from flopping or up and down as much\n\n0:03:25\tSPEAKER_07\n Yeah, yeah, we actually talked about this in the friend-in meeting this morning too I think anything and it was I mean, they're the point of interest to the group was primarily that The the system that we had that was based on HTK that's used by you know All the participants in Aurora was so much worse than they than the SRI and the interesting thing is that even though Yes, it's a digits task and that's relatively small number of words and there's a bunch of digits that you train on It's just not as good as having a very large amount of data and training up a nice good big HMM also you had the adaptation in the SRI system which we didn't have in this so\n\n0:04:14\tSPEAKER_03\n No, or if you did I didn't think I think Stefan had seen them so Yeah A couple I don't remember but there was there was a significant And And that was the founder by the patient and then there was a very small Like point one percent of the natives Adaptation to the recognition hypotheses And I try both So\n\n0:05:17\tSPEAKER_07\n But I think one thing is that I would presume have you ever have you ever tried this exact same recognizer out on the actual T.I. Digits test set This exact same recognizer though it might be interesting to do that it's my because my sense\n\n0:05:33\tSPEAKER_03\n I have tried but I would do even slightly better. Yes or I are actually working on digits I could and they are using a system that's You know is actually trained on digits But otherwise it's the same You know the coder the same training Methods and so forth and I could ask them what they do yeah, but although I think it'd be interesting to just take this exact\n\n0:06:00\tSPEAKER_07\n Actual system so these numbers were comparable and try it on on T.I. Digits. Yeah, yeah, yeah Because our sense from the other from the Aurora task is that I mean because we were getting sub 1% Numbers on T.I. Digits also with the tandem thing so one so there were a number of things we noted from this one is yeah The SRI system is a lot better than the HTK This you know very limited training HTK system But the other is that the digits recorded here in this room with these close mics Actually a lot harder than the studio recording the digits I think you know one reason for that Might be that the still even though it's close talking there still is some noise and some room acoustics And another might be that I would presume that in the studio uh, uh, situation recording red speech that if somebody did something a little funny or not something a little funny or made a little\n\n0:06:54\tSPEAKER_06\n They didn't include it. They didn't include it. They made a good use. Whereas I took out the ones that I noticed that were blatant that were correctable Yeah, so that if someone just read the wrong digit I corrected it and then there was another one where Jose Couldn't tell whether I couldn't tell whether he was saying zero or six and I asked him and he couldn't tell either So I just cut it out You know, so just edit out the first word of the utterance um, so there's a little bit of correction But it's definitely not as clean as t i digits So my expectations is t i digits would especially I think t i digits is all American English right? So we probably do even a little better still\n\n0:07:31\tSPEAKER_03\n On the s r i system but we could give it a try Um, I was I thought that maybe that's actually\n\n0:07:45\tNone\n good thing Because it gets in some of the The noises Um, hello Um,\n\n0:07:55\tNone\n The Um, speech And um, I suspect that to get sort of the last Been out of these higher quality recordings you would have the These models that are portraying on lighter band data and\n\n0:08:09\tSPEAKER_07\n What's t i digits? I thought it's wide band. Yeah, it is wide band. We looked it up and it was actually 20 kilohertz sample. Oh, that's right\n\n0:08:18\tSPEAKER_06\n I did look that up. I couldn't remember whether that was t i digits or one of the other digit tasks\n\n0:08:22\tSPEAKER_03\n But I would yeah\n\n0:08:24\tSPEAKER_06\n So Morgan you're getting a little breath noise you might want to move the mic down a little bit\n\n0:08:31\tSPEAKER_03\n One issue with that is that The system has this The notion of a speaker Which would use an app patient\n\n0:08:38\tNone\n And Um, You know And also The VPL\n\n0:08:46\tNone\n So Yeah, I noticed the script that extracted it\n\n0:08:48\tSPEAKER_03\n So does Um, the t i digits database have speakers? Yep, there are now. Yep. And is there is there enough data or that I don't know\n\n0:08:58\tSPEAKER_06\n A terrible amount of data to the I don't know what we have in our acquaintance. I don't know how many speakers there are. Yeah, and how many speakers per\n\n0:09:04\tSPEAKER_07\n Outerance. Well, the other thing would be to do it without the adaptation and compare it to the Sembers without the adaptation\n\n0:09:10\tSPEAKER_03\n Right, but I'm not so much worried about the application actually Um, uh, the, uh, VPL Right, if you have only one other speaker, my next reason is The Morgan\n\n0:09:28\tSPEAKER_06\n I strongly suspect that they have more speakers than we do Right, so, uh,\n\n0:09:34\tSPEAKER_03\n We might have speakers to the numbers and see what the data first speaker\n\n0:09:36\tSPEAKER_06\n Right, so we could probably do an extraction that was roughly equivalent Um So although I sort of know how to run it, there are a little Few details here and there that I'll have to dig out\n\n0:09:50\tSPEAKER_03\n Actually, it's the speaker ID from the white farm names. Right, I saw that There's a script and that is actually all in one script. So there's one script that parses white farm names And the text is like the speaker ID or something that can stand in as a speaker ID. So I have to modify that script to recognize the, you know, uh, uh, uh,\n\n0:10:12\tSPEAKER_06\n Speak as, uh, yeah, I did it. Right, and that uh\n\n0:10:20\tSPEAKER_03\n Or you can, you can, uh, Make names for these white forms that are that relevant and that we use here for that. Right.\n\n0:10:28\tSPEAKER_06\n I might have to do that any way to, to do, because we may have to do an extract to get the amount of data per speaker about right.\n\n0:10:38\tSPEAKER_06\n The other thing is isn't TI digits isolated digits? Or is that another one?\n\n0:10:42\tSPEAKER_06\n I looked through a bunch of the digits to corporate, corporate, and now they're all blurring.\n\n0:10:48\tSPEAKER_06\n Because one of them was literally people reading a single digit.\n\n0:10:52\tSPEAKER_06\n And then others were connected digits.\n\n0:10:56\tSPEAKER_07\n I mean, we had a bell cord corpus that we were using.\n\n0:11:00\tSPEAKER_07\n It was a bell cord. That's that was isolated digits.\n\n0:11:04\tSPEAKER_03\n All right.\n\n0:11:06\tSPEAKER_03\n I think we can improve these numbers.\n\n0:11:08\tSPEAKER_03\n It can improve the improvement by not starting with the switchboard models.\n\n0:11:12\tSPEAKER_03\n By taking the switchboard models and doing supervised adaptation on the small and the digit data collected.\n\n0:11:20\tSPEAKER_03\n Yep.\n\n0:11:22\tSPEAKER_03\n And then we would adapt your models to the room acoustics and for the fun, if I could, you know, to the noise.\n\n0:11:28\tSPEAKER_03\n And that should really improve things further.\n\n0:11:32\tSPEAKER_03\n And then you use those adaptive models, which should not speak for adaptive, but sort of channel adapted.\n\n0:11:38\tSPEAKER_03\n You use that as the starting models for your feedback adaptation.\n\n0:11:42\tSPEAKER_07\n Yeah. But the thing is, I mean, when you, depends whether you're just using this as a starter task for, you know, to get things going for a conversation or for really interested in connected digits.\n\n0:11:54\tSPEAKER_07\n And I think the answer is both.\n\n0:11:56\tSPEAKER_07\n And for connected digits over the telephone, you don't actually want to put a whole lot of effort into adaptation because somebody gets on the phone and says the number.\n\n0:12:04\tSPEAKER_07\n And then you just want it.\n\n0:12:06\tSPEAKER_03\n You don't say it's better.\n\n0:12:08\tSPEAKER_03\n But, you know, my impression was that you actually just a minute of the positive.\n\n0:12:14\tSPEAKER_03\n So you want to, you want to, that's the obviously you can try.\n\n0:12:18\tSPEAKER_03\n Right?\n\n0:12:20\tSPEAKER_03\n Right.\n\n0:12:22\tSPEAKER_03\n You don't have any, that's where the most requested list matches between the correlation and models.\n\n0:12:28\tSPEAKER_03\n Right.\n\n0:12:30\tSPEAKER_07\n So that's how you're doing stuff.\n\n0:12:32\tSPEAKER_07\n Yeah, so that'd be another interesting data point.\n\n0:12:34\tSPEAKER_07\n I mean, I guess I'm saying I don't know if we're going to do that with this.\n\n0:12:38\tSPEAKER_06\n It clips over your ears. There you go.\n\n0:12:42\tSPEAKER_02\n If you have a strong, if you have a strong preference, you could use this.\n\n0:12:46\tSPEAKER_02\n I think it has some spikes.\n\n0:12:48\tSPEAKER_02\n So we use that.\n\n0:12:50\tSPEAKER_02\n But you could if you wanted to.\n\n0:12:52\tSPEAKER_02\n Anyway, I don't know if you want to.\n\n0:12:54\tSPEAKER_07\n Yes, your microphones a little bit low.\n\n0:12:56\tSPEAKER_07\n Yeah. I don't know if we use that as the...\n\n0:12:58\tSPEAKER_02\n Give it.\n\n0:13:00\tSPEAKER_03\n So if you see a picture like this.\n\n0:13:02\tSPEAKER_03\n And then you have to...\n\n0:13:04\tSPEAKER_06\n I already adjusted this a number of times.\n\n0:13:06\tSPEAKER_06\n Yeah, I think these mics are not working as well as I would like.\n\n0:13:08\tSPEAKER_07\n Yeah, I think there's too many adjustments.\n\n0:13:10\tSPEAKER_07\n Yeah.\n\n0:13:12\tSPEAKER_07\n Anyway, what I was saying is I think I probably wouldn't want to see that as sort of like the norm that we compared all things to.\n\n0:13:14\tSPEAKER_07\n To have all of this at all this adaptation.\n\n0:13:18\tSPEAKER_07\n But I think it's an important data point if you...\n\n0:13:22\tSPEAKER_07\n Yeah.\n\n0:13:24\tSPEAKER_07\n The other thing that, of course, everybody was looking at was just that, the near versus far.\n\n0:13:30\tSPEAKER_07\n And yeah, the adaptation would get to some of that.\n\n0:13:34\tSPEAKER_07\n But I think even if there was only a factor of two or something, like I was saying in the email, I think that's a big factor.\n\n0:13:40\tSPEAKER_07\n So...\n\n0:13:44\tSPEAKER_06\n Liz, you could also just use the other mic if you ever promise with that one.\n\n0:13:46\tSPEAKER_02\n Yeah, this would be okay.\n\n0:13:48\tSPEAKER_02\n We think that this has spikes on it, so it's not as good acoustically.\n\n0:13:52\tSPEAKER_03\n You're such a big...\n\n0:13:54\tSPEAKER_03\n I mean, mine are two.\n\n0:13:56\tNone\n Everybody's here.\n\n0:13:58\tSPEAKER_05\n Hello.\n\n0:14:00\tSPEAKER_02\n Well, if you'd rather have this one then.\n\n0:14:04\tNone\n Okay.\n\n0:14:06\tSPEAKER_06\n Yeah.\n\n0:14:08\tSPEAKER_06\n So to get that pivoted this way, it pivots like this.\n\n0:14:14\tSPEAKER_06\n Yeah, there you go.\n\n0:14:16\tSPEAKER_06\n And there's a screw that you can tighten.\n\n0:14:18\tSPEAKER_05\n Right. I already tried to get it good.\n\n0:14:20\tSPEAKER_06\n So if it doesn't bounce around too much, that's actually a good placement.\n\n0:14:22\tSPEAKER_06\n That's good.\n\n0:14:24\tSPEAKER_06\n But it looks like it's going to bounce a lot.\n\n0:14:28\tSPEAKER_07\n So where were we?\n\n0:14:30\tSPEAKER_07\n Digits.\n\n0:14:32\tSPEAKER_07\n So, I think that's an adaptation, an adaptation, factor two.\n\n0:14:38\tSPEAKER_07\n Oh, yeah, I know what it's going to be.\n\n0:14:40\tSPEAKER_07\n Oh, no, no.\n\n0:14:42\tSPEAKER_07\n That we were saying, you know, well, is how much worse as far the near, you know.\n\n0:14:46\tSPEAKER_07\n I mean, it depends on which one you're looking at, but for the everybody, it's the London factor two.\n\n0:14:50\tSPEAKER_07\n Yeah, I know what I was thinking was that maybe we could actually try, at least looking at some of the...\n\n0:15:00\tSPEAKER_07\n The archivic capillary speech from a far microphone, at least from the good one.\n\n0:15:04\tSPEAKER_07\n I mean, before I thought we'd get, you know, 150% error or something, but if we're getting 35%, 40% or something...\n\n0:15:13\tSPEAKER_05\n Actually, if you run though on a close talking mic over the whole meeting during all those silences, you get like 400%.\n\n0:15:22\tSPEAKER_07\n Right, I understand.\n\n0:15:24\tSPEAKER_07\n But doing the same kind of limited thing...\n\n0:15:26\tSPEAKER_07\n Yeah, sure. Get all these insertions. But I'm saying if you do the same kind of limited thing as people have done in switchboard evaluations, or as...\n\n0:15:34\tSPEAKER_05\n You know who the speaker is and there's no overlap.\n\n0:15:36\tSPEAKER_05\n Yeah.\n\n0:15:37\tSPEAKER_05\n You do just the far, like, for those regions.\n\n0:15:39\tSPEAKER_07\n Yeah, the same sort of numbers that we got those graphs.\n\n0:15:41\tSPEAKER_06\n We do exactly the same thing that we're doing now, but do it with a far-field mic.\n\n0:15:45\tSPEAKER_06\n Yeah, do it with a mic.\n\n0:15:46\tSPEAKER_06\n Because we extract the times from the near-field mic, but you use the acoustics from the far-field mic.\n\n0:15:49\tSPEAKER_05\n Right, I understand that.\n\n0:15:50\tSPEAKER_05\n I just meant that... So you have three choices. There's... You can use times where that person is talking only from the transcripts, but the segmentations were synchronized.\n\n0:16:04\tSPEAKER_05\n Or you can do a forced alignment on the close talking to determine that within this segment, these really were the times that this person was talking in, and the cells were in the segment. Other people are overlapping and just running those pieces, or you can run on the whole data.\n\n0:16:20\tSPEAKER_07\n But how did we determine the links that we're testing on in the stuff we reported?\n\n0:16:29\tSPEAKER_05\n In the HLT paper, we took segments that are channeled, time aligned, which is now being changed in the transcription process, which is good.\n\n0:16:38\tSPEAKER_05\n We took cases where the transcribers said there was only one person talking here, because no one else had time any words in that segment.\n\n0:16:47\tSPEAKER_07\n They called that non-overlapping.\n\n0:16:48\tSPEAKER_07\n And that's what we were getting those numbers from. Right?\n\n0:16:51\tSPEAKER_05\n The good numbers. The bad numbers were from the segments where there was...\n\n0:16:56\tSPEAKER_07\n Well, we could start with the good ones, but anyway, so I think that we should try it once with the same conditions that were used to create those, and in those same segments just use one of the PCMs.\n\n0:17:06\tSPEAKER_07\n And then, you know, I mean, the thing is, if we were getting what, 35, 40% something like that on that particular set, does it go to 70 or 80, or does it use it so much memory we can't decode it?\n\n0:17:19\tSPEAKER_05\n I might have said that then, which speaker it is on how close they are to the PCM? I don't know how different they are to each other to be best.\n\n0:17:27\tSPEAKER_06\n For this particular digit ones, I just picked that one.\n\n0:17:31\tSPEAKER_07\n So, we would then use that. This is kind of central, you know, but I pick that one. It will be less good for some people than for other, but I'd like to see it on the same exact same data set that...\n\n0:17:41\tSPEAKER_06\n I actually shouldn't pick a different one, because that could be why the PDA is worse, because it's further away from most of the people reading digits.\n\n0:17:49\tSPEAKER_07\n That's probably one of the reasons.\n\n0:17:52\tSPEAKER_05\n Well, yeah, you could look at, I guess, that, the PCM.\n\n0:17:56\tSPEAKER_07\n But the other is, I mean, even though there's, I'm sure, the SRI friend has some kind of pre-ampuses, it's still picking up lots of low frequency energy.\n\n0:18:08\tSPEAKER_07\n So, even discriminating against it, I'm sure some of it's getting through.\n\n0:18:13\tSPEAKER_07\n But yeah, you're probably part of it, it's just the distance.\n\n0:18:17\tSPEAKER_05\n And aren't these pretty bad microphones?\n\n0:18:19\tSPEAKER_07\n Yep.\n\n0:18:20\tSPEAKER_07\n Well, they're bad.\n\n0:18:22\tSPEAKER_07\n But I mean, if you listen to it, sounds okay, you know.\n\n0:18:26\tSPEAKER_06\n Yeah, when you listen to it, the PCM and the PDA, yeah, the PDA has higher sound flow, but not by a lot, it's really pretty.\n\n0:18:36\tSPEAKER_05\n It is, remember, you've got them to be cheap on purpose.\n\n0:18:39\tSPEAKER_05\n Cheap on terms of their quality.\n\n0:18:41\tSPEAKER_07\n Well, they're one at the 25 cents or so.\n\n0:18:43\tSPEAKER_06\n To be typical of what would be in a PDA, so they are, they're not the PCM $300 type. They're the 25 cent.\n\n0:18:51\tSPEAKER_06\n Buy them in tax of thousand times.\n\n0:18:53\tSPEAKER_07\n But I mean, the things, people use those little mics for everything, because they're really not bad.\n\n0:18:58\tSPEAKER_07\n I mean, if you're not doing something ridiculous like feeding it to a speech recognizer, they, you know, you can hear the sound.\n\n0:19:06\tSPEAKER_07\n Hear the sounds just fine, you know.\n\n0:19:08\tSPEAKER_07\n I mean, it's more or less the same principles as these other mics are built on.\n\n0:19:12\tSPEAKER_07\n There's just that there's less quality control.\n\n0:19:14\tSPEAKER_07\n They just turn them out and don't check them.\n\n0:19:16\tSPEAKER_07\n So, so that was, yeah, so it was interesting to me, so like I said, the front end guys are very much interested in this as well.\n\n0:19:31\tSPEAKER_03\n So, but where is this, what's, what do we want from, yeah?\n\n0:19:34\tSPEAKER_06\n Yeah, that was going to be my question.\n\n0:19:36\tSPEAKER_07\n I think what we want to do is we want to, we talked about this in other contexts, we want to have the ability to feed it different features.\n\n0:19:54\tSPEAKER_07\n And then from the point of view of the front end research, it would be substituting for HTK.\n\n0:20:01\tSPEAKER_07\n I think that's the key thing. And then if we can feed it different features, then we can try all the different things we're trying there.\n\n0:20:07\tSPEAKER_07\n And then also Davis is thinking about using the data in different ways to explicitly work on reverberations, starting with some techniques that some other people have found somewhat useful.\n\n0:20:23\tSPEAKER_03\n So, the key thing that's missing here is basically the ability to feed, you know, other features, and also try to fix it.\n\n0:20:34\tSPEAKER_03\n Right.\n\n0:20:35\tSPEAKER_07\n And I don't know where I try to pull it back, but that's exactly what he's, he's sort of back, but he drove for 14 hours and wasn't going to make it in today.\n\n0:20:44\tSPEAKER_03\n I think that's one of the things that he's doing.\n\n0:20:56\tSPEAKER_03\n Right.\n\n0:21:17\tSPEAKER_03\n So, that means probably for the foreseeable features that you have to dump out, you know, if you want to use some features, you have to dump them into little files and give those files to the right person.\n\n0:21:34\tSPEAKER_06\n We tend to do that anyway.\n\n0:21:36\tSPEAKER_06\n So, although you can pipe it as well, we tend to do it that way because that way you can concentrate on one block and not keep redoing it over and over.\n\n0:21:49\tSPEAKER_06\n Yeah, sorry.\n\n0:21:50\tSPEAKER_06\n So, that's exactly what the defile is for.\n\n0:21:53\tSPEAKER_03\n Yeah.\n\n0:21:54\tSPEAKER_03\n The thing is that you actually have to dump out little files of each segment that you want to recognize. That's not the separate file.\n\n0:22:13\tSPEAKER_07\n Cool. Okay. So, the next thing we had in the agenda was something about linements.\n\n0:22:25\tSPEAKER_05\n Yes, we have. Did you want to talk about it? I was just telling this to Jane. We were able to get some definite improvement on the forced linements by looking at them first and then realizing the kinds of errors that were occurring.\n\n0:22:46\tSPEAKER_05\n Some of the errors occurring very frequently are just things like the first word being moved as early as possible in the recognition, which is a...\n\n0:22:55\tSPEAKER_05\n I think it was both a pruning problem and possibly a problem with beating constraints on word-boundations.\n\n0:23:04\tSPEAKER_05\n And so we tried both these things. We tried saying, I don't know, I got this wacky idea that just from looking at the data that when people talk their words are usually chunked together.\n\n0:23:16\tSPEAKER_05\n It's not that they say one word and then there's a bunch of words together.\n\n0:23:20\tSPEAKER_05\n There might say one word and then another word, far away if they were doing just back channels. But in general, if there's like five or six words and one word far away from it, that's probably wrong on a error.\n\n0:23:31\tSPEAKER_05\n Then also the pruning, of course, was two severe...\n\n0:23:37\tSPEAKER_03\n It's actually interesting. The pruning was the same value that we used for recognition.\n\n0:23:42\tSPEAKER_03\n And we had to lower that. We had to use tighter pruning up to Liz Ratz, who is showing that a run slower and there's no...\n\n0:23:50\tSPEAKER_05\n It was better with slightly better, it was the same with type.\n\n0:23:54\tSPEAKER_05\n So for a free recognition, the lower pruning is better. Probably because the recognition is just bad at a point where it's bad enough that you don't lose that.\n\n0:24:05\tSPEAKER_03\n But it turned out to get accurate alignments, it was really important to open up the pruning significantly.\n\n0:24:12\tSPEAKER_03\n Because otherwise it would do greedy alignments in regions where there was no real speech yet from the front-end speaker.\n\n0:24:21\tSPEAKER_03\n So that was one big factor that helped me do things. And then the other thing was that, as I said, we put in force the fact that the foreground speech has to be continuous.\n\n0:24:34\tSPEAKER_03\n And you cannot have a background speech, hypothesis, or the middle of the foreground speech. You only have background speech at the beginning at the end.\n\n0:24:44\tSPEAKER_05\n But I mean, it isn't always true. And I think what we really wanted, whenever way to do this, from the data, or maybe some hand corrected alignments from transcribers, that things like words that do occur just by themselves alone.\n\n0:25:00\tSPEAKER_05\n Like, back tunnels are something that we did allow to have background speech around. Those would be able to do that, but the rest would be constrained.\n\n0:25:08\tSPEAKER_05\n So I think we have version of it. It's pretty good for the native speakers. I don't know yet about the native speakers.\n\n0:25:15\tSPEAKER_05\n And we basically also made noise models for the different group, some of the mouth noises together.\n\n0:25:24\tSPEAKER_05\n So then there's a background speech model. And we also, there was some neat or interesting cases. Like, there's one meeting where Jose is giving a presentation.\n\n0:25:34\tSPEAKER_05\n And he's talking about the word mixed signal. And so I wanted to understand that you were saying mixed. I think Morgan.\n\n0:25:43\tSPEAKER_05\n And so your speech was saying something about mixed signal. And the next turn was a lot of people saying mixed. Like he means mixed signal. Or I think it's mixed.\n\n0:25:54\tSPEAKER_05\n And the word mixed in this segment occurs like a bunch of times and chucks on the lapel here. And he also says mix, but it's at the last one. And of course the aligner aligns it everywhere else to everybody else's mix.\n\n0:26:05\tSPEAKER_05\n Because there's no adaptation yet. So there's, I think there's some issues about. We probably want to adapt at least the foreground speaker.\n\n0:26:13\tSPEAKER_05\n But I guess I just tried adapting both the foreground and a background generic speaker. And that's actually a little bit of a funky model. Like it gives you some weird alignments just because off the background speakers match better to the foreground and the foreground speaker.\n\n0:26:27\tSPEAKER_05\n So there's some things there, especially when you get lots of the same words.\n\n0:26:32\tSPEAKER_03\n I think you can do better by cloning. So we have a reject phone and you and what we wanted to try with.\n\n0:26:43\tSPEAKER_03\n Once we have this paper in one time. Cloning that reject mom and then one copy of it would be adapted to the foreground speaker to capture the rejects in the foreground by fragment of the other.\n\n0:26:55\tSPEAKER_05\n Right. I mean, in general, we actually right now the words like partial words are reject models. And you normally allow those to match any word. But then the background speech was also a reject model.\n\n0:27:09\tSPEAKER_05\n And so this constraint of not allowing reject can be to be you know, it needs to differentiate which is just sort of working through a bunch of debugging kinds of issues.\n\n0:27:18\tSPEAKER_05\n And another one is turns like people starting with well, I think, and someone else is well, how about so the word well is in this segment, multiple times.\n\n0:27:28\tSPEAKER_05\n And as soon as it occurs, usually the aligner will try to align it to the first person who says it. But then that constraint of sort of proximity constraint will push it over to the first person who really is.\n\n0:27:39\tSPEAKER_06\n Is the proximity constraint a hard constraint or did you do some sort of probabilistic way in distance?\n\n0:27:44\tSPEAKER_03\n I know it's a glitch. It's straightforward to actually just have a panel here that doesn't allow this. But we just didn't have time to play with the level.\n\n0:27:57\tSPEAKER_03\n And really the reason we can't do it is that we don't have a round truth. So we would need a hand mark wood level alignments or at least sort of the boundaries of the speech between the speakers. And then use that as a reference and to the parameters of the volume that you often hear.\n\n0:28:20\tSPEAKER_07\n I was going to ask anyway how you assessed things were better.\n\n0:28:27\tSPEAKER_05\n I looked at them as two days.\n\n0:28:31\tSPEAKER_05\n I was painful because the thing is the alignment share a lot in common. So you're looking at these segments where there's a lot of speech.\n\n0:28:39\tSPEAKER_05\n A lot of them have a lot of words. Not by every speaker but by some speaker.\n\n0:28:44\tSPEAKER_05\n I mean, if you look at these individual segments from just one person you don't see a lot of words. But altogether you'll see a lot of words up there.\n\n0:28:53\tSPEAKER_05\n So the reject is also mapping. So I looked at them all in ways and just lined up all the alignments. At first it sort of looked like a mess.\n\n0:29:02\tSPEAKER_05\n And then the more I looked at it, well it's moving these words left word. And it wasn't that bad. It was just doing certain things wrong.\n\n0:29:09\tSPEAKER_05\n But I don't have time to look at all of them. And it would be really useful to have a transcriber who could use ways.\n\n0:29:18\tSPEAKER_05\n Just mark the beginning and end of the foreground speakers real words. The beginning of the first word, the end of the last word.\n\n0:29:26\tSPEAKER_02\n Okay, I have to ask you something which is first of all, does it have to be waves? Because if we could benefit from what you did, incorporate that into the present transcripts that would help.\n\n0:29:36\tSPEAKER_02\n And then the other thing is I believe that I did hand. So one of these transcripts was gone over by a transcriber and then I hand marked it myself so that we do have the beginning and ending of individual utterances.\n\n0:29:51\tSPEAKER_02\n I didn't do a word level but in terms so for one of the NSA groups. And also I went back to the original one that I first transcribed and did it utterance by utterance for that particular one.\n\n0:30:03\tSPEAKER_02\n I think you do have, if that's a sufficient unit, I think that you do have hand marking for that. But it'd be wonderful to be able to benefit from your wave stuff.\n\n0:30:12\tSPEAKER_05\n Okay, you used to transcriber in it.\n\n0:30:14\tSPEAKER_05\n If you want to, well, Dan and I were, in terms of the tool, talking about this, I guess Sue had had some reactions, you know, interface wise if you're looking at speech, you want to be able to really wear the words.\n\n0:30:24\tSPEAKER_05\n So we can give you some examples of what the sounds that looks like and see if you can maybe incorporate it into the transcriber tools way or.\n\n0:30:34\tSPEAKER_02\n Well, I'm thinking just incorporating it into the representation. I mean, if it's, if it's, if you have start points, if you have like time tags, which is what I assume is not what you, well,\n\n0:30:44\tSPEAKER_03\n that would be you as, I mean, we've been related to this format that the miss scoring code on the CTM conversation in that part. And then that's that's what I think transcriber output CTM.\n\n0:30:59\tSPEAKER_06\n I think so.\n\n0:31:00\tSPEAKER_02\n It seems like she's, if she's moving time marks around since our presentation in transcriber uses time marks, it seems like there should be some way of using that benefit.\n\n0:31:10\tSPEAKER_05\n The advantage would just be that when you brought up a bin, you would be able, if you were zoomed in enough in transcriber to see all the words, you would be able to like have the words located in the time.\n\n0:31:20\tSPEAKER_07\n So, so if we even just had a, it sounds like we, we, we almost do.\n\n0:31:26\tSPEAKER_07\n We're two, yeah, just trying out the alignment procedure that you have on that, you could actually get something, the good objective measure.\n\n0:31:38\tSPEAKER_05\n You mean not on the hand mark.\n\n0:31:40\tSPEAKER_05\n Yeah.\n\n0:31:41\tSPEAKER_05\n So, we only have, I only looked at actually alignments from one meeting that we chose, and our four is randomly, and...\n\n0:31:50\tSPEAKER_03\n Actually, not randomly.\n\n0:31:51\tSPEAKER_03\n Not randomly.\n\n0:31:52\tSPEAKER_05\n We know that it has these things in sort of a virus.\n\n0:31:54\tSPEAKER_05\n That's sort of average recognition performance and a bunch of speakers and meeting the point of view.\n\n0:31:59\tSPEAKER_05\n But yeah, we should try to use what you have.\n\n0:32:01\tSPEAKER_05\n I did re-run recognition on your new version of our one.\n\n0:32:05\tSPEAKER_05\n Good. The one with Dan.\n\n0:32:08\tSPEAKER_05\n Yeah, exactly. Yeah, yeah.\n\n0:32:09\tSPEAKER_04\n I don't think that was the new version.\n\n0:32:11\tSPEAKER_05\n Yeah, actually it wasn't the new, it was the medium view, but we would do the latest.\n\n0:32:16\tSPEAKER_04\n Did you adjust the utterance times for each channel?\n\n0:32:22\tSPEAKER_02\n Yes, I did. And furthermore, I found that there were a certain number where not, not a lot, but several times I actually moved an utterance from Adam's channel to Dan's or from Dan's to Adam.\n\n0:32:32\tSPEAKER_02\n So there was some speaker, and the reason was because I transcribed that at a point before we had the multiple audio available.\n\n0:32:40\tSPEAKER_02\n So I couldn't switch between the auto.\n\n0:32:42\tSPEAKER_02\n I transcribed it off of the mix channel entirely, which meant an overlap.\n\n0:32:45\tSPEAKER_02\n I was at a terrific disadvantage.\n\n0:32:47\tSPEAKER_02\n In addition, it was before the channelized possibility was there.\n\n0:32:50\tSPEAKER_02\n And finally, I did it using speakers of my, you know, off the CPU on my machine because I didn't have a headphone.\n\n0:32:57\tSPEAKER_02\n So it was like, I mean, in retrospect, it would have been good to have got, I should have gotten the headphone.\n\n0:33:03\tSPEAKER_02\n But in any case, this was transcribed in a less optimal way than the ones that came after it.\n\n0:33:10\tSPEAKER_02\n And I was able to, you know, and this meant that there were some speaker identifications.\n\n0:33:15\tSPEAKER_04\n When are there speaker labeling channels after interrupting this?\n\n0:33:18\tSPEAKER_04\n So you're referring to...\n\n0:33:19\tSPEAKER_04\n Oh, well.\n\n0:33:20\tSPEAKER_04\n For example, you're running down the stairs.\n\n0:33:22\tSPEAKER_04\n I remember this meeting really.\n\n0:33:23\tSPEAKER_04\n Yeah, I'm pan-pan-pan.\n\n0:33:27\tSPEAKER_04\n I'm very well-planted with this.\n\n0:33:29\tSPEAKER_04\n You can just read it like a play.\n\n0:33:31\tSPEAKER_04\n Yeah, I can use it.\n\n0:33:33\tSPEAKER_04\n And she said, and I know.\n\n0:33:34\tSPEAKER_04\n So there's one point where you're running down the stairs.\n\n0:33:36\tSPEAKER_04\n And like, there's an interruption.\n\n0:33:38\tSPEAKER_04\n You interrupt somebody, but there's no line after that.\n\n0:33:41\tSPEAKER_04\n For example, there's no speaker identification after that line.\n\n0:33:44\tSPEAKER_04\n Is that what you're talking about?\n\n0:33:45\tSPEAKER_04\n Or were there mislabelings as far as like, Adam was...\n\n0:33:48\tSPEAKER_02\n That was fixed before...\n\n0:33:50\tSPEAKER_02\n I can't or said that pretty thank you for mentioning.\n\n0:33:53\tSPEAKER_02\n I know that, that, I think went away a couple of reasons.\n\n0:33:56\tSPEAKER_02\n But you're actually saying that's a...\n\n0:33:58\tSPEAKER_02\n I speak of herbicide.\n\n0:33:59\tSPEAKER_02\n Yeah, so with, under...\n\n0:34:00\tSPEAKER_02\n Listening to the mixed channel, there were times when, as surprising as that is, I got Adam's voice confused with dance and vice versa, not for long utterances, but just a couple of places.\n\n0:34:09\tSPEAKER_02\n And I bet it in Overlapse.\n\n0:34:11\tSPEAKER_02\n The other thing that was interesting to me was that I picked up a lot of back channels, which were hidden in the mixed signal, which, you know, you can not too surprising.\n\n0:34:18\tSPEAKER_02\n But the other thing that I hadn't thought about this, but I thought I wanted to raise this with respect to also a strategy, which might help with the alignments potentially.\n\n0:34:26\tSPEAKER_02\n But that's when I was looking at these back channels.\n\n0:34:29\tSPEAKER_02\n They were turning up usually very often, and I won't say usually anyway, very often, I picked them up in a channel, which was the person who had asked a question.\n\n0:34:39\tSPEAKER_02\n So like, someone says, and have you done the so-and-so?\n\n0:34:42\tSPEAKER_02\n And then there would be back channels, but it would be the person who asked the question.\n\n0:34:46\tSPEAKER_02\n And then people weren't really doing much back channeling.\n\n0:34:49\tSPEAKER_02\n And you know, sometimes you have, yeah, I mean, it wouldn't be perfect, but it does seem more natural to give a back channel when you're somehow involved in the topic, and the most natural way is for you to initiate the topic asking questions.\n\n0:35:01\tSPEAKER_03\n I think what's going on is back channeling is something that happens in two party conversations.\n\n0:35:07\tSPEAKER_03\n If you ask someone a question, you're essentially initiating a little two party conversation.\n\n0:35:11\tSPEAKER_03\n Well, actually, when you look at this...\n\n0:35:13\tSPEAKER_03\n It's a back channel because the person is about to be involved in everything.\n\n0:35:16\tSPEAKER_02\n Exactly, my point.\n\n0:35:17\tSPEAKER_02\n And so this is the expectation thing, just the diet, but in addition, you know, if someone has done this analysis himself and isn't involved in the diet, but they might also give back channels to verify what the answer is at this point.\n\n0:35:29\tSPEAKER_07\n I tell you, I say a half-long.\n\n0:35:31\tSPEAKER_07\n Well, people are talking to each other.\n\n0:35:34\tSPEAKER_05\n There you go, but I think there are fewer ah-haves.\n\n0:35:37\tSPEAKER_05\n I mean, just from, we were looking at word frequency lists, to try to find the cases that we would allow to have the reject words in between and doing the line, the one that we want to be constrained to be next to the word.\n\n0:35:47\tSPEAKER_05\n And ah-hah is not as frequent as it sort of would be in pitch-work.\n\n0:35:53\tSPEAKER_05\n If you looked at just word frequency lists of one word, short utterances.\n\n0:35:57\tSPEAKER_05\n And yeah, it's way out there, but not ah-hah.\n\n0:35:59\tSPEAKER_05\n So I was thinking, it's not like you're being encouraged by everybody else to keep talking in the meeting.\n\n0:36:06\tSPEAKER_05\n That's all I'll stop there.\n\n0:36:07\tSPEAKER_05\n Well, that's right. And that would make sort of-\n\n0:36:10\tSPEAKER_02\n And what you say is the other side of this, which is that, you know, so there are lots of channels where you don't have these back channels.\n\n0:36:17\tSPEAKER_02\n When a question has been asked, and these-\n\n0:36:19\tSPEAKER_05\n It's just probably less back-telling. So this good news, really.\n\n0:36:23\tSPEAKER_05\n Even if you consider every other person altogether one person in the meeting, but we'll find out anyway.\n\n0:36:30\tSPEAKER_05\n I guess the other thing we should say is that we're going to compare this type of overlap analysis to switchboard.\n\n0:36:38\tSPEAKER_05\n And call home where we have those sides.\n\n0:36:41\tSPEAKER_05\n We can try to answer this question of, you know, is there really more overlap in meetings or is it just because we don't have the other channel in switchboard?\n\n0:36:48\tSPEAKER_05\n And we don't know what to do.\n\n0:36:49\tSPEAKER_05\n Try to create a paper out of that.\n\n0:36:51\tSPEAKER_07\n Yeah, I mean, you folks have probably already told me, but we're intending to do a your speech to the mission.\n\n0:36:58\tSPEAKER_05\n You want to do tomorrow?\n\n0:37:00\tSPEAKER_05\n Yeah.\n\n0:37:01\tSPEAKER_05\n Yeah, we're still like writing the scripts.\n\n0:37:04\tSPEAKER_05\n We're doing the research.\n\n0:37:06\tSPEAKER_05\n You will, yes, we're going to try.\n\n0:37:08\tSPEAKER_05\n And I was telling Don, do not take this as an example of how.\n\n0:37:13\tSPEAKER_07\n Do what I say, don't do what I do.\n\n0:37:16\tSPEAKER_06\n You'll try to probably be a little late.\n\n0:37:18\tSPEAKER_06\n It is different.\n\n0:37:19\tSPEAKER_06\n In previous years, your speech only had the abstract to do by now, not the whole paper.\n\n0:37:23\tSPEAKER_06\n Right.\n\n0:37:24\tSPEAKER_06\n And so all our timing was off.\n\n0:37:25\tSPEAKER_06\n I've given up on trying to do digits.\n\n0:37:27\tSPEAKER_06\n I think that what I have so far makes a your speech paper.\n\n0:37:30\tSPEAKER_05\n Well, we may be in the same position.\n\n0:37:32\tSPEAKER_05\n And I figured, we'll try because that'll at least get us to the point where we have, we have this really nice database format that Andreas and I were working out that.\n\n0:37:41\tSPEAKER_05\n It's not very fancy.\n\n0:37:42\tSPEAKER_05\n It's just a asking line by line format, but it does give you information.\n\n0:37:47\tSPEAKER_05\n It's the spurred format.\n\n0:37:48\tNone\n Yeah, we're calling these spurts after, Chase.\n\n0:37:50\tSPEAKER_05\n I was trying to find what's a word for a continuous region with causes around it.\n\n0:37:55\tSPEAKER_07\n Yeah, I know that the telecom people use, use spurred for that.\n\n0:37:59\tSPEAKER_07\n Yes.\n\n0:38:00\tSPEAKER_07\n And that's, I mean, I was using that for a while when I was doing the greatest speech stuff because I, because I looked up and some books and I found, okay, I want to find a spurred in which, and because, because it's another question about how many pauses they put in between them, but how fast do they do the words within the spurred?\n\n0:38:16\tSPEAKER_07\n Right.\n\n0:38:17\tSPEAKER_04\n That's what we were doing.\n\n0:38:18\tSPEAKER_04\n First is used also.\n\n0:38:19\tSPEAKER_04\n Spurt.\n\n0:38:20\tSPEAKER_06\n Spurt has the horrible name overloading with other, with hard here in Mexico.\n\n0:38:25\tSPEAKER_07\n Just very locally, yeah.\n\n0:38:26\tSPEAKER_05\n I think it was Chase or somebody had the word spurred originally.\n\n0:38:30\tSPEAKER_05\n And so I, that's good.\n\n0:38:32\tSPEAKER_02\n Well, I know Sue wrote about spurts of development, but in any case, I think it's a good term.\n\n0:38:38\tSPEAKER_05\n So we have spurts and we have spurredify.\n\n0:38:41\tSPEAKER_02\n And maybe, maybe, maybe, Chase did.\n\n0:38:43\tSPEAKER_02\n I know, Chase dealt with, Chase speaks about intonation units.\n\n0:38:46\tSPEAKER_02\n Yeah, right.\n\n0:38:47\tSPEAKER_02\n Maybe he speaks about spurts as well, I guess.\n\n0:38:50\tSPEAKER_03\n I've heard your stuff, so.\n\n0:38:51\tSPEAKER_03\n Maybe someone has some ideas about how to do better, but we, there were taking these alignments from the individual channels.\n\n0:38:59\tSPEAKER_03\n We're, from each alignment, we're producing one of these CTM pod, which is actually has, is just a linear sequence of words, which we begin times for every word in the duration.\n\n0:39:10\tSPEAKER_05\n It looks like a wave's label file on all this.\n\n0:39:12\tSPEAKER_05\n Right.\n\n0:39:13\tSPEAKER_03\n So this is one of the first column has the meeting name, so it could actually contain several meetings.\n\n0:39:19\tSPEAKER_03\n And the second column is the channel.\n\n0:39:21\tSPEAKER_03\n Third column is the, start times of the words, the fourth column is the duration of words.\n\n0:39:27\tSPEAKER_03\n And then we're, okay, then we have a messy alignment process where we actually insert into this sequence of words, the tags for like, where were sentence and sentence, question marks, various other things.\n\n0:39:45\tSPEAKER_05\n And these are things that we had done, the done sort of, propagated the punctuation from the original transcribers, so whether it was like question marks, a period, or, you know, comment and things like that, and we kept, and this fluency dashes, we kept those in because we sort of want to know where those are relative to that.\n\n0:40:05\tSPEAKER_03\n So those are actually, so retrofit into the time alignment.\n\n0:40:10\tSPEAKER_03\n And then we merge all the alignments from the various channels and we sort them by time.\n\n0:40:17\tSPEAKER_03\n And then there's a process where you now determine the spurts.\n\n0:40:25\tSPEAKER_03\n That is, actually, you know, you do that before you merge the various channels, so you identify by some criteria, which is pause length, but identify the beginnings and then the spurts.\n\n0:40:36\tSPEAKER_03\n And you put another set of tags in there, and keep those straight.\n\n0:40:39\tSPEAKER_03\n And then you merge everything and you know, linearizing the sequence space on the time marks.\n\n0:40:44\tSPEAKER_03\n And then you extract the individual channels again, but this time, you know, where are the other people starting to end talking, you know, where their spurts start to end.\n\n0:40:56\tSPEAKER_03\n And so you extract the individual channels once spurred by spurred, and you're aware.\n\n0:41:02\tSPEAKER_03\n And then inside the words, or between the words, you now have begin and end tags for overlaps.\n\n0:41:08\tSPEAKER_03\n So you basically have everything sort of lined up in a form where you can look at the individual speakers and how their speech relates to the other speakers.\n\n0:41:19\tSPEAKER_05\n I mean, I think that's actually really useful also because even if you weren't studying overlaps, if you want to get a transcription for the carb-filled mics, how are you going to know which words, from which speakers, occurred at which times, relative to each other, you have to be able to get a transcript like this anyway, just for doing carb-filled recognition.\n\n0:41:39\tSPEAKER_05\n So, you know, it's sort of, hey, it's just an issue we haven't dealt with before, how you timeline things that are overlap.\n\n0:41:46\tNone\n That's one thing.\n\n0:41:48\tSPEAKER_06\n Well, I never thought about that.\n\n0:41:50\tSPEAKER_06\n Yes, I mean, when I came up with the original data, it suggests a data format based on the transcription graph.\n\n0:41:56\tSPEAKER_06\n There's capability of doing that sort of thing in there.\n\n0:42:00\tSPEAKER_05\n So you can't see it directly from the transcription.\n\n0:42:03\tSPEAKER_03\n Yeah, this is like a command for the form, and it's a command script, not a command script.\n\n0:42:08\tSPEAKER_03\n There's lots of little things, like the 12 different scripts, which you can run at the end of the year, you have what you want.\n\n0:42:15\tSPEAKER_03\n But, at the last stage, we saw a way, the actual time information, all we care about is whether that this assertive word was overlap by someone else's word.\n\n0:42:25\tSPEAKER_03\n So you sort of, at that point, you discretize things into just having overlap or no overlap.\n\n0:42:31\tSPEAKER_03\n Because we figure that's about the level of analysis that we want to do from paper.\n\n0:42:36\tSPEAKER_03\n But if you wanted to do a more frangering analysis and say, how far into the word of the overlap, you could do that.\n\n0:42:43\tSPEAKER_03\n Yes.\n\n0:42:44\tSPEAKER_03\n It's required more.\n\n0:42:45\tSPEAKER_02\n What's interesting is, it's exactly what, in discussing with Sue about this, she indicated that that's very important for all of us.\n\n0:42:57\tSPEAKER_02\n It's nice to know, and also, I think, as a human,\n\n0:43:00\tSPEAKER_05\n I don't always hear these in the actual order that they occur. So I can have two foreground speakers in a Morgan, and Adam, Jane, could all be talking, and I can align each of them to be starting their utterance at the correct time, and then look where they are relative to each other, and that's not really what I heard.\n\n0:43:17\tSPEAKER_02\n And that's another thing she said.\n\n0:43:18\tSPEAKER_02\n This is Bevers effect.\n\n0:43:20\tSPEAKER_02\n Where, in the second linguistics, you have these experiments, where people have perceptual biases as to what they hear.\n\n0:43:27\tSPEAKER_05\n Yeah, you move things around until you get the best low information point that you can bring in the other person.\n\n0:43:33\tSPEAKER_05\n So it's actually not even possible, I think, for any person to listen to a mix signal, even equalize and make sure that they have the words in their line.\n\n0:43:41\tSPEAKER_05\n So I guess we'll try to write the zeros of each paper.\n\n0:43:44\tSPEAKER_05\n We will write it, whether they accept it later or not.\n\n0:43:47\tSPEAKER_05\n And the good thing is that we have, it's sort of the beginning of what Don can use to link the prosodic features from each level to each other.\n\n0:43:56\tSPEAKER_07\n Yeah, that's a good thing about these papers.\n\n0:43:58\tSPEAKER_07\n You know, I might as well...\n\n0:44:00\tSPEAKER_03\n I don't know if I can read the frame too.\n\n0:44:02\tSPEAKER_03\n I mean, Jane likes to look at data, maybe.\n\n0:44:04\tSPEAKER_03\n You could look at this format and see if you find anything interesting.\n\n0:44:08\tSPEAKER_07\n Yeah.\n\n0:44:09\tSPEAKER_07\n Oh, it's a good thing about these paper deadlines and class projects, and things like that, because you're looking.\n\n0:44:15\tSPEAKER_03\n The other thing is that you usually don't tell your graduate students that these deadlines are actually not that strict.\n\n0:44:22\tSPEAKER_03\n Oh, now it's out in the public.\n\n0:44:25\tSPEAKER_07\n This is secret information.\n\n0:44:27\tSPEAKER_06\n No.\n\n0:44:28\tSPEAKER_06\n No.\n\n0:44:29\tSPEAKER_03\n That's what I'm going to do.\n\n0:44:32\tSPEAKER_03\n We have an interesting guy in the office.\n\n0:44:34\tSPEAKER_03\n Right.\n\n0:44:35\tSPEAKER_03\n Yeah.\n\n0:44:36\tSPEAKER_03\n Thank you, one.\n\n0:44:38\tSPEAKER_02\n It's a strict one.\n\n0:44:39\tSPEAKER_02\n Which sometimes means little ones with a string.\n\n0:44:41\tSPEAKER_07\n By the way, this is totally unfair.\n\n0:44:44\tSPEAKER_07\n You may feel, but the morning meeting folks actually have an extra month or so.\n\n0:44:49\tSPEAKER_06\n Yeah.\n\n0:44:50\tSPEAKER_06\n Yep.\n\n0:44:51\tSPEAKER_06\n There's a special Aurora.\n\n0:44:53\tSPEAKER_07\n There's a special Aurora session, and the Aurora people involved in Aurora have to really may or something to turn in their paper.\n\n0:45:00\tSPEAKER_05\n Well, then you can just name them a submitter.\n\n0:45:03\tSPEAKER_08\n Yeah.\n\n0:45:04\tSPEAKER_06\n Oh, I can submit that to Aurora.\n\n0:45:06\tSPEAKER_06\n Well, it's not a Aurora.\n\n0:45:09\tSPEAKER_07\n No, it's not a Aurora.\n\n0:45:10\tSPEAKER_07\n It's not the Aurora.\n\n0:45:11\tSPEAKER_07\n I mean, it's actually a very specific.\n\n0:45:13\tSPEAKER_05\n Well, maybe it won't be after this.\n\n0:45:15\tSPEAKER_03\n But the people, I mean, stand in the middle of it.\n\n0:45:17\tSPEAKER_03\n The paper that is not an Aurora would probably be more interesting at that point because I'm already so sick and tired of Aurora task.\n\n0:45:23\tSPEAKER_06\n Well, I thought you meant this was just the digit section.\n\n0:45:25\tSPEAKER_06\n I didn't know you meant it was Aurora digits.\n\n0:45:28\tSPEAKER_03\n Well, no.\n\n0:45:29\tSPEAKER_03\n If you have this, if you discuss some relation to the Aurora task, like if you use the same...\n\n0:45:33\tSPEAKER_07\n This is not the Aurora task.\n\n0:45:35\tSPEAKER_07\n So they just do a little grab for it.\n\n0:45:40\tSPEAKER_03\n We are not sitting in the middle of it.\n\n0:45:43\tSPEAKER_03\n Well, in relation to other than the case.\n\n0:45:46\tSPEAKER_06\n Anyway.\n\n0:45:47\tSPEAKER_06\n Well, I know.\n\n0:45:48\tSPEAKER_06\n You could do a paper on what's wrong with the Aurora task by comparing it to other ways of doing it.\n\n0:45:54\tSPEAKER_03\n Well, that's an oral answer to the rule.\n\n0:45:57\tSPEAKER_03\n No, a digit is collected in a different way.\n\n0:46:00\tSPEAKER_07\n Yeah.\n\n0:46:01\tSPEAKER_07\n Maybe.\n\n0:46:02\tSPEAKER_07\n It's pretty hoax.\n\n0:46:04\tSPEAKER_07\n I think it's a little far-fetched.\n\n0:46:06\tSPEAKER_07\n I mean, the thing is that Aurora is a pretty close community.\n\n0:46:10\tSPEAKER_07\n I mean, you know, the people who are involved.\n\n0:46:12\tSPEAKER_07\n The only people who are allowed to test them are people who made it above a certain threshold in the first round.\n\n0:46:18\tSPEAKER_07\n Even in 99.\n\n0:46:19\tSPEAKER_07\n And it's sort of...\n\n0:46:20\tSPEAKER_03\n Well, that's what you wanted.\n\n0:46:22\tSPEAKER_03\n Well, not that they have a company system.\n\n0:46:26\tSPEAKER_03\n I mean, I mean, seriously.\n\n0:46:30\tNone\n No, I'm sorry.\n\n0:46:32\tSPEAKER_03\n I mean...\n\n0:46:36\tSPEAKER_03\n In the particular system, I met this HTK backhand.\n\n0:46:40\tSPEAKER_03\n Oh, you don't like HTK?\n\n0:46:43\tSPEAKER_03\n I don't have any stock.\n\n0:46:46\tSPEAKER_07\n No, I mean, this is the HTK that is trained on a very limited amount of data.\n\n0:46:51\tSPEAKER_03\n But maybe you should, you know, do you have more data or...?\n\n0:46:57\tSPEAKER_07\n Oh, yeah, I really think that that's true.\n\n0:46:59\tSPEAKER_06\n But they had something very specific in mind when they designed it.\n\n0:47:05\tSPEAKER_06\n Well, so you can argue about maybe that wasn't the right thing to do.\n\n0:47:09\tSPEAKER_06\n But, you know, they...\n\n0:47:11\tSPEAKER_07\n But one of the reasons I have is Chuck's messing around with the backhand that you're not supposed to touch.\n\n0:47:16\tSPEAKER_07\n I mean, for the evaluations, yes, we'll run a version that hasn't been touched.\n\n0:47:19\tSPEAKER_07\n But one of the reasons I have messing around with it, because I think it's sort of an open question that we don't know the answer to.\n\n0:47:25\tSPEAKER_07\n I always say very glibly that if you show improvement on a bad system, that doesn't mean anything, because it may not be show...\n\n0:47:32\tSPEAKER_07\n Because, you know, it doesn't tell you anything about the good system.\n\n0:47:35\tSPEAKER_07\n And I've always sort of felt that that depends.\n\n0:47:38\tSPEAKER_07\n You know, that if something...\n\n0:47:39\tSPEAKER_07\n If you actually are getting at something that has some conceptual substance to it, it will report.\n\n0:47:44\tSPEAKER_07\n And in fact, most methods that people now use were originally tried with something that was not their absolute best system at some level.\n\n0:47:51\tSPEAKER_07\n Or sometimes it doesn't... not important. So I think that's an interesting question.\n\n0:47:55\tSPEAKER_07\n If we're getting 3% error on English native speakers using the ROR system, and we do some improvements and bring it from 3 to 2, do those same improvements bring the SRI system from 1.3 to 0.8.\n\n0:48:15\tSPEAKER_07\n Well, you know, so that's something we can test.\n\n0:48:19\tSPEAKER_07\n So, anyway, I think we've covered that one up.\n\n0:48:23\tSPEAKER_07\n It's simply well.\n\n0:48:28\tSPEAKER_07\n Okay.\n\n0:48:29\tSPEAKER_07\n So, yeah, so that's...\n\n0:48:32\tSPEAKER_07\n Well, you know, maybe you guys will have one.\n\n0:48:35\tSPEAKER_07\n You and Dan have a paper that's going in.\n\n0:48:39\tSPEAKER_07\n That's pretty solid on the segmentation.\n\n0:48:42\tSPEAKER_07\n Yeah.\n\n0:48:43\tSPEAKER_07\n Still send you the final roadstrip.\n\n0:48:45\tSPEAKER_07\n And there are folks here who will definitely get something in on a rare.\n\n0:48:49\tSPEAKER_03\n So, there's another paper from the US speech paper.\n\n0:48:53\tSPEAKER_03\n But it's on digits.\n\n0:48:55\tSPEAKER_03\n So, a colleague has to realize that it includes version of M&E training.\n\n0:49:02\tSPEAKER_03\n And he tested it mostly on digits.\n\n0:49:05\tSPEAKER_03\n So, you know, it takes weeks to try it.\n\n0:49:09\tSPEAKER_03\n Right.\n\n0:49:10\tSPEAKER_03\n So, I think it's a very impressive result.\n\n0:49:16\tSPEAKER_03\n It's been a very noisy environment.\n\n0:49:22\tSPEAKER_03\n I'm not sure about the order of make from like 10% to 8% or from the 8.1%.\n\n0:49:36\tSPEAKER_03\n Yeah, it got better.\n\n0:49:42\tSPEAKER_06\n Yeah.\n\n0:49:43\tSPEAKER_06\n Hey, that's the same percent relative.\n\n0:49:46\tSPEAKER_06\n Yeah.\n\n0:49:47\tSPEAKER_06\n 20% relative gain.\n\n0:49:49\tSPEAKER_08\n Yeah.\n\n0:49:51\tSPEAKER_07\n Let's see.\n\n0:49:52\tSPEAKER_07\n I think the only thing we had left was some of those...\n\n0:49:55\tSPEAKER_07\n Well, there's a couple things.\n\n0:49:57\tSPEAKER_07\n One is anything that anybody has to say about Saturday.\n\n0:50:02\tSPEAKER_07\n Anything we should do in prep for Saturday.\n\n0:50:05\tSPEAKER_07\n I guess everybody knows about...\n\n0:50:08\tSPEAKER_07\n I mean, Mary was asking, was trying to come up with something like an agenda and sort of fitting around people's times a bit.\n\n0:50:15\tSPEAKER_07\n But clearly, when we actually get here, what things around this, as we need to.\n\n0:50:20\tSPEAKER_07\n But, okay.\n\n0:50:21\tSPEAKER_07\n So, we can't absolutely count on it.\n\n0:50:23\tSPEAKER_07\n Yeah.\n\n0:50:24\tSPEAKER_05\n Are we leaving in here?\n\n0:50:25\tSPEAKER_07\n Yeah.\n\n0:50:26\tSPEAKER_07\n That was my thought.\n\n0:50:27\tSPEAKER_07\n I think this is...\n\n0:50:28\tSPEAKER_05\n We wanted an microphone.\n\n0:50:30\tSPEAKER_07\n No, I hadn't intended to.\n\n0:50:32\tSPEAKER_07\n We wanted... I mean, there's going to be Jeff Katrin, Mary, and two students, so there's five.\n\n0:50:38\tSPEAKER_07\n And Brian.\n\n0:50:39\tSPEAKER_07\n And Brian's coming, so six.\n\n0:50:41\tSPEAKER_07\n And plus all of us.\n\n0:50:44\tSPEAKER_05\n That's how fast we can.\n\n0:50:46\tSPEAKER_06\n It seems like too much coming and going.\n\n0:50:49\tSPEAKER_06\n Well.\n\n0:50:50\tSPEAKER_03\n Because it would be a different kind of meeting.\n\n0:50:53\tSPEAKER_07\n Well, I hadn't really thought of it.\n\n0:50:56\tSPEAKER_03\n Maybe they got the whole day, but just...\n\n0:50:58\tSPEAKER_03\n Maybe part of it.\n\n0:50:59\tSPEAKER_06\n Maybe part of it.\n\n0:51:01\tSPEAKER_06\n And make everyone read digits.\n\n0:51:03\tSPEAKER_06\n At the same time.\n\n0:51:04\tSPEAKER_06\n At the same time.\n\n0:51:05\tSPEAKER_06\n Yeah.\n\n0:51:06\tSPEAKER_07\n I don't know.\n\n0:51:08\tSPEAKER_05\n Is there an initiation in July?\n\n0:51:10\tSPEAKER_05\n Into our heart at Colter.\n\n0:51:12\tSPEAKER_03\n Maybe the sections that I know, right after...\n\n0:51:15\tSPEAKER_03\n I have to lie.\n\n0:51:16\tSPEAKER_03\n I have to stop watching.\n\n0:51:18\tSPEAKER_03\n Yeah.\n\n0:51:19\tSPEAKER_05\n Okay.\n\n0:51:20\tSPEAKER_05\n So, when you...\n\n0:51:21\tSPEAKER_05\n I know the schedule.\n\n0:51:22\tSPEAKER_07\n You know, I just...\n\n0:51:23\tSPEAKER_07\n Okay, yeah.\n\n0:51:24\tSPEAKER_07\n I guess I sent it around a little bit.\n\n0:51:25\tSPEAKER_07\n Is it changed now?\n\n0:51:27\tSPEAKER_07\n I hadn't heard back from Mari after I...\n\n0:51:29\tSPEAKER_07\n I brought up the point about...\n\n0:51:31\tSPEAKER_07\n about the enderesis schedule.\n\n0:51:33\tSPEAKER_07\n So, maybe when I get back, there'll be some mail from her.\n\n0:51:38\tSPEAKER_07\n So...\n\n0:51:39\tSPEAKER_02\n It's a bit more to saying representation.\n\n0:51:41\tSPEAKER_02\n That they...\n\n0:51:42\tSPEAKER_05\n We see that.\n\n0:51:43\tSPEAKER_05\n The two meetings from...\n\n0:51:44\tSPEAKER_05\n I mean, I know about the first meeting.\n\n0:51:46\tSPEAKER_05\n But the other one that you get, the NSA one, which we hadn't done because we weren't running with the initial knowledge.\n\n0:51:51\tSPEAKER_05\n Because the non-A to speak it.\n\n0:51:53\tSPEAKER_05\n Five-nine to say.\n\n0:51:54\tSPEAKER_05\n But it would be useful for the...\n\n0:51:57\tSPEAKER_05\n to see what we get.\n\n0:51:59\tSPEAKER_05\n Great.\n\n0:52:00\tSPEAKER_02\n It's said 2011-21-1000.\n\n0:52:03\tSPEAKER_04\n Yeah, three.\n\n0:52:06\tSPEAKER_05\n Great.\n\n0:52:07\tSPEAKER_02\n I sent email when I finished the...\n\n0:52:09\tSPEAKER_02\n that one.\n\n0:52:10\tSPEAKER_02\n Yeah, that's right.\n\n0:52:12\tSPEAKER_02\n That's what I said.\n\n0:52:14\tSPEAKER_02\n I know the thing.\n\n0:52:15\tSPEAKER_07\n That part's definitely going to confuse somebody who looks at these later.\n\n0:52:18\tSPEAKER_07\n I mean, this is...\n\n0:52:19\tSPEAKER_07\n We're recording secret NSA meetings.\n\n0:52:21\tSPEAKER_07\n Not that NSA.\n\n0:52:24\tSPEAKER_07\n It's network services and applications.\n\n0:52:27\tSPEAKER_07\n There.\n\n0:52:28\tSPEAKER_05\n Out there.\n\n0:52:29\tSPEAKER_05\n No idea what they're talking about.\n\n0:52:31\tSPEAKER_03\n Yeah.\n\n0:52:32\tSPEAKER_03\n The other good thing about the lineman system.\n\n0:52:35\tSPEAKER_03\n It's not always the machines falling if it doesn't work.\n\n0:52:37\tSPEAKER_03\n So you can actually find...\n\n0:52:39\tSPEAKER_03\n Persons falling.\n\n0:52:41\tSPEAKER_07\n It's Morgan's fault.\n\n0:52:43\tSPEAKER_07\n It's always Morgan's fault.\n\n0:52:45\tSPEAKER_07\n It's always Morgan's fault.\n\n0:52:47\tSPEAKER_00\n It's always the transcripts.\n\n0:52:49\tSPEAKER_05\n Oh.\n\n0:52:50\tSPEAKER_05\n Yeah.\n\n0:52:51\tSPEAKER_05\n I guess there are some cases where the wrong speaker...\n\n0:52:54\tSPEAKER_05\n these cases.\n\n0:52:55\tSPEAKER_05\n Not a lot, but where the wrong person...\n\n0:52:58\tSPEAKER_05\n the speech is attached to the wrong speaker and you can tell that when you run it.\n\n0:53:02\tSPEAKER_05\n Or at least you can get clues to it.\n\n0:53:04\tSPEAKER_05\n I guess it does.\n\n0:53:05\tSPEAKER_05\n I'm the early transcripts that people did on the next single.\n\n0:53:08\tSPEAKER_02\n It also raises the possibility of using that kind of representation.\n\n0:53:12\tSPEAKER_02\n I don't know if this would be something we want to check, but maybe using that representation for data entry and then displaying it on the channelized representation.\n\n0:53:18\tSPEAKER_02\n I think that my preference in terms of looking at the data is to see it in this kind of musical score format.\n\n0:53:25\tSPEAKER_02\n And also, you know, soos preference as well.\n\n0:53:28\tSPEAKER_02\n Yeah.\n\n0:53:29\tSPEAKER_02\n But I mean, this is a better interface for making these kinds of, you know, local changes.\n\n0:53:35\tSPEAKER_02\n I'd be kind to...\n\n0:53:37\tSPEAKER_02\n I have no idea.\n\n0:53:38\tSPEAKER_02\n I think there's something that would need to be checked.\n\n0:53:42\tSPEAKER_07\n The other thing I actually had was...\n\n0:53:44\tSPEAKER_07\n I didn't realize this till today.\n\n0:53:47\tSPEAKER_07\n But this is Jose's last day.\n\n0:53:49\tSPEAKER_07\n He's missing.\n\n0:53:50\tSPEAKER_07\n Yeah.\n\n0:53:51\tSPEAKER_06\n Been acting a day tomorrow?\n\n0:53:52\tSPEAKER_06\n About meetings.\n\n0:53:53\tSPEAKER_06\n Oh, that's right, tomorrow.\n\n0:53:54\tSPEAKER_06\n Because if...\n\n0:53:55\tSPEAKER_01\n In the Sunday, I will come back to Spain.\n\n0:53:59\tSPEAKER_01\n Yeah, so I...\n\n0:54:00\tSPEAKER_01\n We would like to say thank you very much to all people.\n\n0:54:05\tSPEAKER_01\n Yeah, it was good having you.\n\n0:54:06\tSPEAKER_01\n At least because I enjoyed very much.\n\n0:54:10\tSPEAKER_01\n I'm sorry by the result of overlapping.\n\n0:54:13\tSPEAKER_01\n I have a good result, Jett, but I...\n\n0:54:19\tSPEAKER_01\n I pretend to continue at Spain during the following months, because I have other ideas.\n\n0:54:28\tSPEAKER_01\n But I have enough time to...\n\n0:54:31\tSPEAKER_01\n Since Maun is not enough to research.\n\n0:54:36\tSPEAKER_01\n I'm mainly for the topic, because it's all difficult.\n\n0:54:41\tSPEAKER_07\n Yeah, maybe somebody else will come along and will be interested in working on it and start off from where you are also.\n\n0:54:48\tSPEAKER_07\n They make use of what you've done.\n\n0:54:51\tSPEAKER_01\n Yeah.\n\n0:54:52\tSPEAKER_01\n But I would like to recommend that...\n\n0:54:57\tSPEAKER_01\n It's funny, but the following to school or sleep...\n\n0:55:02\tSPEAKER_01\n Will be here more time.\n\n0:55:05\tSPEAKER_01\n My opinion is for us to spend more time here and to work more time in the topic.\n\n0:55:15\tSPEAKER_07\n Yeah, it's a very short time.\n\n0:55:16\tSPEAKER_06\n Yeah, it's once a hard and a year.\n\n0:55:18\tSPEAKER_06\n Yeah.\n\n0:55:19\tSPEAKER_01\n It's difficult, a lot better.\n\n0:55:20\tSPEAKER_01\n You are lucky and you find a solution in some few months.\n\n0:55:28\tSPEAKER_01\n Okay, but I think it's not the beginning.\n\n0:55:31\tSPEAKER_01\n Anyway, thank you very much.\n\n0:55:35\tSPEAKER_01\n I've been discharged to...\n\n0:55:38\tSPEAKER_01\n...20 years with you.\n\n0:55:42\tSPEAKER_01\n I hope if you need something for us in the future, I will be at Spain to help you.\n\n0:55:53\tSPEAKER_07\n Thank you, Sunsai.\n\n0:55:55\tSPEAKER_04\n Thank you.\n\n0:55:57\tSPEAKER_04\n Yeah.\n\n0:56:01\tSPEAKER_07\n Okay, I guess...\n\n0:56:04\tSPEAKER_07\n Did it?\n\n0:56:05\tSPEAKER_07\n...as something else, but we'd read our digits.\n\n0:56:07\tSPEAKER_07\n We'll do our last three or Jose's digits.\n\n0:56:10\tSPEAKER_07\n I'm sorry?\n\n0:56:11\tSPEAKER_01\n You prefer to eat chocolate at the coffee break or you prefer now...\n\n0:56:18\tSPEAKER_01\n We have a time.\n\n0:56:20\tSPEAKER_02\n Well, we have a time.\n\n0:56:22\tSPEAKER_07\n You're just people from that end of the table.\n\n0:56:25\tSPEAKER_06\n We've got to wait until after we take the mic off.\n\n0:56:30\tSPEAKER_06\n So we're going to do digits simultaneously or what?\n\n0:56:34\tSPEAKER_07\n We're going to do digits at the same...\n\n0:56:38\tSPEAKER_01\n That's nice.\n\n0:56:40\tSPEAKER_01\n Wow.\n\n0:56:41\tSPEAKER_02\n Well...\n\n0:56:43\tSPEAKER_02\n Very nice.\n\n0:56:44\tSPEAKER_07\n That looks great.\n\n0:56:46\tSPEAKER_07\n Oh, it's all in the interest of getting to the...\n\n0:56:50\tSPEAKER_07\n Yeah.\n\n0:56:51\tSPEAKER_07\n You said yes.\n\n0:56:55\tSPEAKER_06\n It's the rest of the digits.\n\n0:57:01\tSPEAKER_06\n The rest of the digits are very clean without a lot of background noise.\n\n0:57:06\tSPEAKER_06\n So I'm just not sure.\n\n0:57:08\tSPEAKER_05\n What chocolate you're eating because they might make you feel sad.\n\n0:57:12\tSPEAKER_07\n I'm not sure for all because...\n\n0:57:15\tSPEAKER_07\n Actually, I'm actually kind of careful because I have a strong allergy to nuts.\n\n0:57:18\tSPEAKER_07\n So I have to figure out one without it.\n\n0:57:21\tSPEAKER_07\n It's hard to say.\n\n0:57:24\tSPEAKER_07\n I don't know.\n\n0:57:27\tSPEAKER_05\n This is a different kind of...\n\n0:57:30\tSPEAKER_07\n I may hold off.\n\n0:57:33\tSPEAKER_07\n Maybe I'll get some later.\n\n0:57:36\tSPEAKER_07\n Well, he's worried about a ticket.\n\n0:57:39\tSPEAKER_07\n Why don't we do a simultaneous one?\n\n0:57:41\tSPEAKER_06\n Remember to read the transcript number, please.\n\n0:57:44\tSPEAKER_05\n You left it me to the first time.\n\n0:57:46\tSPEAKER_07\n I did, and now I love it so much.\n\n0:57:49\tSPEAKER_05\n Okay, everyone ready?\n\n0:57:51\tSPEAKER_05\n You have to sort of...\n\n0:57:52\tSPEAKER_05\n I'm saying you haven't done this yet.\n\n0:57:54\tSPEAKER_07\n Wait, wait, wait.\n\n0:57:56\tSPEAKER_07\n We want it synchronized.\n\n0:57:58\tSPEAKER_02\n You've done this before, haven't you?\n\n0:58:00\tSPEAKER_02\n Did it together with us?\n\n0:58:02\tSPEAKER_02\n You mean at the same time?\n\n0:58:04\tSPEAKER_02\n Oh, you haven't done this either.\n\n0:58:07\tSPEAKER_02\n The groupings are important.\n\n0:58:10\tSPEAKER_02\n So you're supposed to pass between the groupings.\n\n0:58:13\tSPEAKER_07\n So the groupings must be synchronized.\n\n0:58:16\tSPEAKER_05\n Synchronized digits.\n\n0:58:19\tSPEAKER_05\n We'll give everybody the same sheet.\n\n0:58:22\tSPEAKER_06\n What a good idea.\n\n0:58:24\tSPEAKER_06\n We could do the same sheet for everyone.\n\n0:58:26\tSPEAKER_05\n Have them all read them at once.\n\n0:58:28\tSPEAKER_06\n Or it's just same digits.\n\n0:58:30\tSPEAKER_07\n There's so many possibilities.\n\n0:58:33\tSPEAKER_07\n Okay, why am I going?\n\n0:58:35\tSPEAKER_07\n One, two, three, go.\n\n0:58:37\tSPEAKER_06\n No, 40 transcripts.\n\n0:58:39\tSPEAKER_07\n 911, 911, 911 45 Justice Services.\n\n0:58:43\tSPEAKER_00\n 911 Known.\n\n0:58:47\tSPEAKER_00\n 911, turncase.\n\n0:58:50\tSPEAKER_00\n 2, 1, 2, 1,ga-eral.\n\n0:58:50\tSPEAKER_07\n 3, 2, 3, 2, 3, 2, 5, 2, 1, 4, 3, 2, 1, 6oints, 8, 6 Michigan, 7, 6, 8, 7, 6, 8,\n\n0:58:59\tSPEAKER_00\n If the groupies are counted, then even community groups are captured.\n\n0:59:04\tSPEAKER_00\n So in turn, that's right.\n\n0:59:06\tSPEAKER_00\n 485-793-589-284-3455198-5984-843-1-277-5-0-8395-4397\n\n", "summary": [{"summary_text": "Everyone who's on the wireless check that they're on is on the agenda for the Saturday meeting. The only thing that was surprising was that the lapel microphone did well. The lapel mic is a very high quality microphone. It has some advantages in terms of breath noises and clothes wrestling."}]}