{"filename": "./data/Bmr022.txt", "transcript": "0:00:00\tSPEAKER_06\n Okay, here we go.\n\n0:00:04\tSPEAKER_05\n So I definitely have to leave it through 30 today.\n\n0:00:07\tSPEAKER_05\n We're definitely have to go to T.\n\n0:00:09\tSPEAKER_05\n Yeah, they're having birthday cake and so I can't miss that.\n\n0:00:13\tSPEAKER_05\n I'm a May birthday, yeah.\n\n0:00:14\tSPEAKER_05\n So I've told me.\n\n0:00:15\tSPEAKER_05\n Yeah.\n\n0:00:16\tSPEAKER_06\n I'm okay.\n\n0:00:20\tSPEAKER_03\n So, only a couple of agenda items since no one sent me email for agenda items.\n\n0:00:25\tSPEAKER_03\n The first is the IBM transcripts.\n\n0:00:30\tSPEAKER_03\n I'd like to mention, I spoke with several of you about this, but just brainstorm a little bit of what we can do with it.\n\n0:00:36\tSPEAKER_03\n So we got back the IBM transcript and the accuracy looks okay.\n\n0:00:39\tSPEAKER_03\n There are, I mean, there are areas which are clearly wrong and there are a lot of areas where they put question marks where the acoustics weren't very good.\n\n0:00:46\tSPEAKER_03\n And I think that's fine.\n\n0:00:47\tSPEAKER_03\n Putting question marks is better than doing it wrong.\n\n0:00:49\tSPEAKER_03\n The big problem was they had the wrong number of beeps in it.\n\n0:00:52\tSPEAKER_03\n Oops.\n\n0:00:53\tSPEAKER_03\n So it didn't align.\n\n0:00:55\tSPEAKER_03\n And that's exactly what I was afraid of.\n\n0:00:57\tSPEAKER_03\n And I went in and more or less by hand corrected it by loading it.\n\n0:01:02\tSPEAKER_03\n I wrote a script that will convert it to the multi-channel trans format.\n\n0:01:06\tSPEAKER_03\n Looked it in channel trans and found the places where it got unsynchronized.\n\n0:01:11\tSPEAKER_03\n And then either, in this case, only had to remove beeps because that was always the error.\n\n0:01:17\tSPEAKER_03\n Is that they put it in extraneous beeps.\n\n0:01:19\tSPEAKER_03\n But it's not easy to do because the whole thing gets offset and basically it's assigning the wrong speaker to the text and it all gets on the line.\n\n0:01:28\tSPEAKER_03\n So it's very difficult to do.\n\n0:01:30\tSPEAKER_03\n So it took me several hours just to do that.\n\n0:01:33\tSPEAKER_05\n Just one hour of speech.\n\n0:01:36\tSPEAKER_05\n And a few hours to do that.\n\n0:01:38\tSPEAKER_03\n It took me a couple hours to write the scripts and then it probably took me maybe 45 minutes just going through it.\n\n0:01:46\tSPEAKER_03\n Now obviously it will be a lot faster from now on because now I sort of understand how it works.\n\n0:01:51\tSPEAKER_03\n But I think if we had some way, some tool that made it easier to insert and delete beeps, it would make it a lot easier.\n\n0:01:58\tSPEAKER_03\n Because one of the problems is that it takes a very long time when you make a change to load it back up in the channel transcribe.\n\n0:02:04\tSPEAKER_01\n That's true.\n\n0:02:05\tSPEAKER_01\n I've noticed that.\n\n0:02:06\tSPEAKER_04\n One of the things that I've said that I thought would be a good idea would be if we used different beeps.\n\n0:02:11\tSPEAKER_04\n So for example, if we alternated between two beeps, a high and a low.\n\n0:02:16\tSPEAKER_04\n Well, into me mail.\n\n0:02:17\tSPEAKER_03\n I didn't just say that.\n\n0:02:19\tSPEAKER_03\n Yeah.\n\n0:02:20\tSPEAKER_03\n Because then.\n\n0:02:21\tSPEAKER_03\n So this is the other approach, which is what do we do in the future to try to make this less common.\n\n0:02:26\tSPEAKER_03\n But it's still going to happen.\n\n0:02:28\tSPEAKER_01\n Well, then the other possibility was that we provide them with a file that already has a beeps in it or something.\n\n0:02:33\tSPEAKER_04\n Sort of a text template, but I don't know how.\n\n0:02:36\tSPEAKER_03\n We don't know what their process is.\n\n0:02:38\tSPEAKER_03\n So I had two ideas. The first was to provide them a text template that had both the beeps in it and the speaker IDs.\n\n0:02:44\tSPEAKER_03\n You know, just mail, female, English, non-English, one, two, three, four.\n\n0:02:48\tSPEAKER_03\n And they just filled it in.\n\n0:02:51\tSPEAKER_05\n How many beeps are there and how many do it where they were off?\n\n0:02:56\tSPEAKER_03\n It was like 120 and they had 123 or something like that.\n\n0:03:01\tSPEAKER_03\n All right.\n\n0:03:02\tSPEAKER_03\n And it seems a lot more than that.\n\n0:03:03\tSPEAKER_03\n Well, I don't remember.\n\n0:03:04\tSPEAKER_03\n It was three off.\n\n0:03:06\tSPEAKER_05\n Yeah, and it was a hundredish.\n\n0:03:08\tSPEAKER_05\n So if you get one off, everything's off because of the letter, right?\n\n0:03:14\tSPEAKER_05\n Yep.\n\n0:03:15\tSPEAKER_05\n And this is all in one file that's continuing.\n\n0:03:17\tSPEAKER_05\n So I just make it multiple files.\n\n0:03:19\tSPEAKER_05\n How would that help?\n\n0:03:20\tSPEAKER_05\n Because then if they have one off, then it would only screw up that file.\n\n0:03:24\tSPEAKER_03\n Oh, you mean just break the one hour into a few chunks?\n\n0:03:27\tSPEAKER_05\n Yeah.\n\n0:03:28\tSPEAKER_05\n I mean, it seems like if you just make one mistake, then everything is off.\n\n0:03:31\tSPEAKER_04\n So the only question about that that I have is, I think Brian has to put all this stuff onto a tape.\n\n0:03:36\tSPEAKER_04\n So I don't know whether I'm sure they would send them.\n\n0:03:40\tSPEAKER_04\n I guess you could send them multiple tapes.\n\n0:03:44\tSPEAKER_05\n Yeah, just say, okay, there's 10 sentences.\n\n0:03:47\tSPEAKER_05\n I mean, maybe there's other things to do that are more clever, but this just seems to be sort of the obvious thing.\n\n0:03:52\tSPEAKER_05\n Because again, if you make one mistake, then everything after that mistake is off.\n\n0:03:57\tSPEAKER_04\n And will the only other issue we have to worry about reassembling them in the proper order?\n\n0:04:02\tSPEAKER_03\n Yeah.\n\n0:04:03\tSPEAKER_03\n I mean, just naming schemes, we'll get, we can definitely do that.\n\n0:04:08\tSPEAKER_03\n So one question is, are there good places in the files where we can really do that?\n\n0:04:13\tSPEAKER_03\n Well, the other thing makes it so someone will have to go through and listen to them and make a place to break them.\n\n0:04:20\tSPEAKER_00\n The other thing you can do, this is on the mix signal, are these the individual?\n\n0:04:25\tSPEAKER_00\n The ones with the beeps that they're getting, that they made mistakes on is...\n\n0:04:29\tSPEAKER_03\n They are plates from the individual.\n\n0:04:32\tSPEAKER_00\n If it's individual, we can probably run a forced alignment where you include the beeps as words, and pretty much figure out where the errors are.\n\n0:04:45\tSPEAKER_00\n I don't think we could do it on the mix signal, because it, but on the individual channels, that would probably work if they have enough words in the transcript.\n\n0:04:54\tSPEAKER_00\n Yeah, we, in fact, that's pretty quick to run.\n\n0:04:57\tSPEAKER_00\n We could try it, because if a beep is treated as a...\n\n0:05:03\tSPEAKER_03\n You mean, so actually put the wave file in with beep in it, and have a beep model.\n\n0:05:09\tSPEAKER_00\n Well, the beep model, actually, you could train a beep model, that's a good idea.\n\n0:05:14\tSPEAKER_00\n It would be very good.\n\n0:05:15\tSPEAKER_03\n Yes, it would be.\n\n0:05:16\tSPEAKER_03\n It's very, very regular.\n\n0:05:17\tSPEAKER_05\n Yeah, so...\n\n0:05:18\tSPEAKER_05\n Kind of low variance, wouldn't it?\n\n0:05:19\tSPEAKER_05\n Yeah, I'm very concerned.\n\n0:05:20\tSPEAKER_05\n Yeah, I'm very concerned.\n\n0:05:24\tSPEAKER_00\n I mean, that might actually work, because I guess the trick is figuring out where it doesn't align.\n\n0:05:29\tSPEAKER_00\n But if it's a problem of extra beeps, rather than missing beeps, then that's easier.\n\n0:05:37\tSPEAKER_04\n It could be some missing ones.\n\n0:05:40\tSPEAKER_03\n But it's just in this case, they were not.\n\n0:05:43\tSPEAKER_03\n So I think Chuck had a good explanation for it, which I liked, which is they're listening to it, and so they write something down.\n\n0:05:48\tSPEAKER_03\n Let's say they miss it, they rewind.\n\n0:05:51\tSPEAKER_03\n Well, they hear the beep again.\n\n0:05:52\tSPEAKER_03\n Was that beep, or was that a different beep?\n\n0:05:54\tSPEAKER_03\n So that's why Chuck was suggesting different tones.\n\n0:05:56\tSPEAKER_03\n My original thought was you could have a different tone for each speaker.\n\n0:05:59\tSPEAKER_03\n There's plenty of tone space, and that might help cue the transcriptionist, give him a little cue about where they are.\n\n0:06:07\tSPEAKER_05\n Or you could have a sending tones or something.\n\n0:06:11\tSPEAKER_04\n What do you mean?\n\n0:06:14\tSPEAKER_04\n Increasingly high frequency.\n\n0:06:16\tSPEAKER_00\n Each speaker in the meeting say beep and record it at one point.\n\n0:06:20\tSPEAKER_05\n I think I do know if you have a hundred or something, just sort of move them up a half tone or something for each one.\n\n0:06:27\tSPEAKER_03\n That's what I was saying, is that you could have each speaker.\n\n0:06:29\tSPEAKER_03\n You could have their own tone.\n\n0:06:31\tSPEAKER_03\n And since there are no more than 10 speakers or so per meeting, there's plenty of tone space.\n\n0:06:37\tSPEAKER_05\n Okay, yeah.\n\n0:06:38\tSPEAKER_05\n So that might work, too.\n\n0:06:40\tSPEAKER_05\n Yeah, I was just thinking, actually, temporarily, just an increasing tone.\n\n0:06:44\tSPEAKER_05\n So that they would really have a sense of whether they were going forward or backward or.\n\n0:06:48\tSPEAKER_01\n So just truly, chromatically up, follow through the entire meeting.\n\n0:06:52\tSPEAKER_01\n Interesting.\n\n0:06:53\tSPEAKER_01\n Oh, it'd be impossible to miss order them.\n\n0:06:56\tSPEAKER_00\n Yeah.\n\n0:06:57\tSPEAKER_00\n But I guess you'd still get the mistake that you mentioned because the person, I mean, if that's some of the errors, those would probably stay the same.\n\n0:07:04\tSPEAKER_00\n Regardless.\n\n0:07:05\tSPEAKER_03\n Yeah, Chuck's suggestion of just two beeps is nice, because then you could have them actually transcribe HB for LB, pi beep or low beep.\n\n0:07:12\tSPEAKER_04\n And then when we get them back, if we see two LBs, that's probably better.\n\n0:07:15\tSPEAKER_00\n Yeah, you have like scratch my other idea.\n\n0:07:17\tSPEAKER_00\n Sounded each check.\n\n0:07:18\tSPEAKER_00\n Yeah.\n\n0:07:19\tSPEAKER_00\n That's a good idea, alternating.\n\n0:07:20\tSPEAKER_00\n Yeah.\n\n0:07:21\tSPEAKER_04\n And it seems like it would help them, you know, if they just finished a long passage and they heard one beep and then they hear it again, they know it's the same beep versus if they heard it.\n\n0:07:31\tSPEAKER_00\n Yeah, that's a good error checking.\n\n0:07:34\tSPEAKER_03\n Yeah, I do do one for each person in the meeting.\n\n0:07:39\tSPEAKER_03\n You can only hire people with perfect pitch and they're a flat.\n\n0:07:42\tSPEAKER_03\n Yeah.\n\n0:07:43\tSPEAKER_03\n That was great.\n\n0:07:45\tSPEAKER_05\n Great idea.\n\n0:07:46\tSPEAKER_05\n Yeah.\n\n0:07:47\tSPEAKER_05\n Now two is probably better than when I was suggesting, because what I was suggesting, in order to make a through a reasonable range for the whole thing, you'd have to have the tonal differences between the two kind of small and actually what the large.\n\n0:07:59\tSPEAKER_01\n You have to have the acoustics of dogs.\n\n0:08:02\tSPEAKER_01\n You're right.\n\n0:08:03\tSPEAKER_03\n So I think certainly doing two beeps is no brainer.\n\n0:08:08\tSPEAKER_03\n And then the other question is if they can, if they do something on a computer in a format we can handle, we could give them a text file that was a template with speaker ID and beeps already in it.\n\n0:08:20\tSPEAKER_03\n And then they could just fill that in.\n\n0:08:22\tSPEAKER_04\n Maybe I should write to Brian and tell him what the problem was and what our proposed solutions are.\n\n0:08:27\tSPEAKER_04\n Yeah.\n\n0:08:28\tSPEAKER_04\n See what he thinks would work best with them.\n\n0:08:30\tSPEAKER_05\n I mean, what's going wrong in the other end?\n\n0:08:32\tSPEAKER_05\n What are they doing?\n\n0:08:33\tSPEAKER_03\n Well, as I said, I think we don't actually know, but I think Chuck's hypothesis was a good one, which is you listen to something, you write down what you thought you heard, but you want to listen to it against who you rewind.\n\n0:08:43\tSPEAKER_03\n And then you hear the beep again and you say, well, is that that beep or is that a new beep?\n\n0:08:47\tSPEAKER_03\n I don't remember.\n\n0:08:48\tSPEAKER_03\n And so, you know, a couple times they got it wrong.\n\n0:08:50\tSPEAKER_04\n And there are some cases where there's very little speech before you hear a beep.\n\n0:08:54\tSPEAKER_04\n So here, a little bit of speech beep, a little bit of speech beep.\n\n0:08:57\tSPEAKER_04\n Maybe three of those in a row was at three beeps, was at two beeps.\n\n0:09:01\tSPEAKER_04\n So they have the, Brian said the setup that they have is they've got headphones, and I guess they have a computer, and they have a foot pedal, which lets them quickly scan back and forth through the tape.\n\n0:09:15\tSPEAKER_04\n It makes the tape go real fast forward or fast backward.\n\n0:09:18\tSPEAKER_04\n And so they can hear something, then step on the pedal and quickly rewind and go back in here again.\n\n0:09:23\tSPEAKER_04\n And so they're, I think they're probably going over and over sections, and then they get confused about whether they already put that beep or if they heard, you know, three beeps in a row, was at three or two.\n\n0:09:35\tSPEAKER_01\n It's a shame we can't really give a number.\n\n0:09:38\tSPEAKER_01\n So it would be a number and a beep.\n\n0:09:40\tSPEAKER_01\n It's a shame we can't do that.\n\n0:09:42\tSPEAKER_03\n Well, that's an interesting idea.\n\n0:09:44\tSPEAKER_03\n We could, but then that starts getting pretty long.\n\n0:09:48\tSPEAKER_04\n No, no, no, but wait, maybe what we have instead of a beep is a synthesized number, and they put the number in when they hear it.\n\n0:09:58\tSPEAKER_04\n So placing the beep with 23, 24, and then they have to transcribe what that number is each time.\n\n0:10:06\tSPEAKER_01\n Wow, that also be shorter than time.\n\n0:10:08\tSPEAKER_04\n Yeah, just a two, three, two, four, that way.\n\n0:10:10\tSPEAKER_04\n Well, they would have to have a mark.\n\n0:10:12\tSPEAKER_04\n Be some kind of mark in front of it.\n\n0:10:14\tSPEAKER_05\n Well, because there's distinguishing between 23, that's your indicator there and 23 that somebody happens to say.\n\n0:10:20\tSPEAKER_04\n Well, it would have to be either obviously a sounding synthesized.\n\n0:10:27\tSPEAKER_04\n They might miss that, right?\n\n0:10:28\tSPEAKER_01\n Or maybe it could be a quick and a number.\n\n0:10:31\tSPEAKER_04\n Or a beep in the number.\n\n0:10:32\tSPEAKER_04\n Well, it's sequential.\n\n0:10:33\tSPEAKER_03\n And then you just do the number.\n\n0:10:34\tSPEAKER_03\n Right, you go sequential.\n\n0:10:35\tSPEAKER_03\n So unless you got pretty unlucky, what the person was saying and the number.\n\n0:10:41\tSPEAKER_04\n In fact, we could put it at the beginning of each other.\n\n0:10:44\tSPEAKER_04\n We could say beep one, and then they'll hear the speed.\n\n0:10:47\tSPEAKER_05\n I think having a beep too is good.\n\n0:10:50\tSPEAKER_03\n So beep number.\n\n0:10:51\tSPEAKER_03\n Or a number beep.\n\n0:10:52\tSPEAKER_03\n It's just getting pretty long.\n\n0:10:53\tSPEAKER_03\n You know, the other answers are very short.\n\n0:10:55\tSPEAKER_03\n And so you're going to be talking beep number.\n\n0:10:57\tSPEAKER_03\n Yes, beep number.\n\n0:10:59\tSPEAKER_01\n No.\n\n0:11:00\tSPEAKER_01\n Well, if it saves time.\n\n0:11:02\tSPEAKER_01\n Yeah, and I think it would actually happen.\n\n0:11:04\tSPEAKER_03\n And when they transcribe this meeting, it's going to be really impossible.\n\n0:11:07\tSPEAKER_03\n We're saying beep.\n\n0:11:09\tSPEAKER_05\n Yeah, yeah, for instance.\n\n0:11:10\tSPEAKER_04\n But see, that would definitely keep.\n\n0:11:12\tSPEAKER_04\n It's not a bad idea.\n\n0:11:13\tSPEAKER_04\n Yeah.\n\n0:11:14\tSPEAKER_04\n Yeah, keep things from getting out of sequence.\n\n0:11:17\tSPEAKER_04\n If they heard it over again, they would know it would be obvious from their transcript, whether they did that one or not.\n\n0:11:20\tSPEAKER_03\n That would help get them synchronized.\n\n0:11:22\tSPEAKER_03\n Yeah.\n\n0:11:23\tSPEAKER_01\n It might be helpful to them in terms of.\n\n0:11:25\tSPEAKER_01\n I think it would be.\n\n0:11:26\tSPEAKER_03\n And we have plenty of digit data.\n\n0:11:27\tSPEAKER_03\n So yeah.\n\n0:11:28\tSPEAKER_03\n They would know their place, darn it.\n\n0:11:30\tSPEAKER_03\n It was transcriptionists need to know their place.\n\n0:11:33\tSPEAKER_05\n It sounds like a short conversation with Brian.\n\n0:11:36\tSPEAKER_05\n It might be helpful to get a sense of it.\n\n0:11:38\tSPEAKER_03\n Yeah, the numbers are a good idea.\n\n0:11:40\tSPEAKER_03\n Yeah.\n\n0:11:41\tSPEAKER_03\n And then, I think the transcript, I think it would be very helpful.\n\n0:11:45\tSPEAKER_02\n Just instead of the sequential number, perhaps just a speaker idea or something, just say, speaker one or just one, two, three, four, four speakers or something, it could be helpful.\n\n0:11:55\tSPEAKER_03\n Yeah, you don't have to, you could keep them short or just go one through ten, one through ten or one through twenty.\n\n0:12:02\tSPEAKER_01\n And then also, I mean, I don't know what their set up is, but your template idea might be a way of, we could actually build the numbers into a template.\n\n0:12:10\tSPEAKER_03\n Yep.\n\n0:12:11\tSPEAKER_04\n I'll talk to Brian.\n\n0:12:14\tSPEAKER_03\n Yeah, single digit numbers that also appeals to me so that you don't have to, you know, one hundred twenty four.\n\n0:12:22\tSPEAKER_03\n Well, even one thousand, three hundred forty two.\n\n0:12:26\tSPEAKER_05\n You're saying it's about an hour meeting and there were hundred and twenty-three.\n\n0:12:29\tSPEAKER_03\n I don't remember.\n\n0:12:30\tSPEAKER_03\n It's a track we're saying there was more than that, four beeps than that.\n\n0:12:33\tSPEAKER_04\n I was thinking there was only order of fifteen hundred segments, but maybe I'm...\n\n0:12:37\tSPEAKER_00\n There must be because otherwise you're going to call.\n\n0:12:40\tSPEAKER_00\n I think it should be more than that.\n\n0:12:41\tSPEAKER_00\n That was at least forty five minutes, right?\n\n0:12:43\tSPEAKER_00\n That's right.\n\n0:12:44\tSPEAKER_00\n Was it that?\n\n0:12:45\tSPEAKER_00\n I just don't recall.\n\n0:12:46\tSPEAKER_00\n That's the shortest meeting we have.\n\n0:12:47\tSPEAKER_00\n Most of them are double ladder.\n\n0:12:48\tNone\n Yep.\n\n0:12:49\tSPEAKER_05\n Well, I was just wondering what the average length of a segment they're hearing.\n\n0:12:54\tSPEAKER_05\n Yeah.\n\n0:12:55\tSPEAKER_00\n No, no.\n\n0:12:56\tSPEAKER_03\n Easy enough to figure out.\n\n0:12:57\tSPEAKER_00\n So if there are in the hundredth and that were thousands of these, there must be in the high hundreds of them at least.\n\n0:13:05\tSPEAKER_00\n That's getting a little cumbersome for them to tie it up.\n\n0:13:08\tSPEAKER_00\n I would just one five.\n\n0:13:10\tSPEAKER_00\n But yeah, if they recycled for...\n\n0:13:12\tSPEAKER_05\n Yeah, if it didn't mod ten.\n\n0:13:14\tSPEAKER_05\n My point was, you know, it's a big difference to me if there's a thousand of those hundred.\n\n0:13:17\tSPEAKER_05\n If there's a thousand, then that means that this is only happening three times out of a thousand, which means even just splitting it up into a few files, we'd probably take nearly all the time there would be no.\n\n0:13:28\tSPEAKER_05\n If it's a hundred, then that's not the issue, but if it's a hundred, then the average length of each one is pretty, pretty long, and so having a little thing at the front of it is no big deal.\n\n0:13:38\tSPEAKER_05\n So you're right.\n\n0:13:39\tSPEAKER_03\n It's what's curious.\n\n0:13:40\tSPEAKER_03\n More than that.\n\n0:13:41\tSPEAKER_03\n I mean, it was a 45 minute meeting.\n\n0:13:42\tSPEAKER_03\n And it certainly was not a minute of chunk.\n\n0:13:44\tSPEAKER_03\n It was a few seconds of chunk.\n\n0:13:46\tSPEAKER_00\n That's what I...\n\n0:13:47\tSPEAKER_00\n Yeah, so I'm just going to survive.\n\n0:13:48\tSPEAKER_03\n So I'm just going to go overhead to type.\n\n0:13:49\tSPEAKER_03\n I'm just missing remembering.\n\n0:13:50\tSPEAKER_01\n Well, and the other thing is maybe the numbers would help them keep their place in the transcriptions.\n\n0:13:55\tSPEAKER_03\n It might make the transcript faster.\n\n0:13:56\tSPEAKER_03\n I mean, I mean, I...\n\n0:13:57\tSPEAKER_03\n Quick conversation with Brian would be good.\n\n0:13:59\tSPEAKER_03\n Okay.\n\n0:14:04\tSPEAKER_03\n Another of that.\n\n0:14:09\tSPEAKER_00\n Actually, if it is...\n\n0:14:12\tSPEAKER_00\n I mean, it's not a bad idea to try the alignment.\n\n0:14:16\tSPEAKER_00\n If there's only like three of them, then if you align, the first point at which things get messed up is sort of the location of the first problem.\n\n0:14:25\tSPEAKER_00\n And then the second... I mean, you could do it that way.\n\n0:14:30\tSPEAKER_00\n It would be able to handle any errors.\n\n0:14:33\tSPEAKER_00\n So if they make on the average that many, and it costs them more time to do something different than what they're doing, which I don't know.\n\n0:14:40\tSPEAKER_00\n But if it does, then you could try doing it as a post-process.\n\n0:14:44\tSPEAKER_00\n And have a student or a transcriber run this alignment, or we could do it.\n\n0:14:49\tSPEAKER_00\n You know, actually, what all we would...\n\n0:14:51\tSPEAKER_00\n And then we could iteratively figure out where the problems are.\n\n0:14:55\tSPEAKER_00\n You know, there's always...\n\n0:14:56\tSPEAKER_00\n It's like a little work, but not any real human.\n\n0:14:58\tSPEAKER_00\n Right.\n\n0:14:59\tSPEAKER_04\n I mean, that's what we want to do.\n\n0:15:00\tSPEAKER_04\n In terms of the alignment, actually, all we would need is...\n\n0:15:02\tSPEAKER_04\n We wouldn't even need words.\n\n0:15:03\tSPEAKER_04\n We would need a general speech model and a beep model.\n\n0:15:05\tSPEAKER_04\n Because all we're really concerned about is missing beeps or too many beeps.\n\n0:15:09\tSPEAKER_00\n Well, of course, the forced alignment will run fat.\n\n0:15:12\tSPEAKER_00\n Otherwise, it'll take forever.\n\n0:15:14\tSPEAKER_00\n I mean, to really run regular things.\n\n0:15:15\tSPEAKER_04\n Well, I guess what I'm thinking of is that a lot of times, there will be... they'll put in question marks that represent some unknown amount of speech.\n\n0:15:24\tSPEAKER_04\n So we're going to have to have some kind of...\n\n0:15:26\tSPEAKER_00\n Yeah, then we just map it to a reject model.\n\n0:15:28\tSPEAKER_00\n And in fact, that's what we do now.\n\n0:15:30\tSPEAKER_00\n Because it's even after Jane listens where we have an expert, can't even tell what they're talking about.\n\n0:15:36\tSPEAKER_00\n So that's okay.\n\n0:15:37\tSPEAKER_00\n We just map that to a reject model.\n\n0:15:38\tSPEAKER_04\n But what I was thinking is map all the speech to the reject model.\n\n0:15:41\tSPEAKER_04\n And then you have a beep model.\n\n0:15:43\tSPEAKER_00\n Yeah, so talking, of course, still...\n\n0:15:45\tSPEAKER_00\n The forced alignment might not work then, although we can try it.\n\n0:15:48\tSPEAKER_00\n Well, but all the beeps...\n\n0:15:49\tSPEAKER_05\n Well, the beep model is what's really...\n\n0:15:51\tSPEAKER_05\n You'd have really good...\n\n0:15:52\tSPEAKER_05\n The beep model is really nice.\n\n0:15:53\tSPEAKER_04\n We really do match.\n\n0:15:54\tSPEAKER_05\n So it's really just doing a keyword like a spotting for beep with...\n\n0:15:57\tSPEAKER_00\n We're going to edit it all, grab the next beep in other words.\n\n0:15:59\tSPEAKER_00\n It'll be... you'll get back another offset.\n\n0:16:02\tSPEAKER_00\n I mean, let's think of that.\n\n0:16:04\tSPEAKER_00\n And then I realize, well, recognize we'll just go along and line up all the beeps.\n\n0:16:08\tSPEAKER_00\n And then there'll be all the extra beeps at the end if there were more beeps than you want it.\n\n0:16:12\tSPEAKER_00\n So you need the word...\n\n0:16:14\tSPEAKER_00\n So you need the word to...\n\n0:16:15\tSPEAKER_04\n To tell it we're a call it wrong.\n\n0:16:18\tSPEAKER_04\n I'm not suggesting that we don't have anything between the beeps.\n\n0:16:21\tSPEAKER_04\n Oh.\n\n0:16:22\tSPEAKER_04\n But what I'm saying is what's between the beeps we don't really care about.\n\n0:16:25\tSPEAKER_00\n I think you do care about it.\n\n0:16:27\tSPEAKER_00\n Unless you want to know if they're...\n\n0:16:29\tSPEAKER_00\n Otherwise, you just count up the total number of...\n\n0:16:32\tSPEAKER_03\n And we could do that with word count.\n\n0:16:34\tSPEAKER_03\n Right, we already know that we're three short.\n\n0:16:36\tSPEAKER_03\n And so if we just did...\n\n0:16:38\tSPEAKER_03\n Speak beep and non-beap, all you would get is that you have three mistakes, but you wouldn't tell you which ones were wrong.\n\n0:16:46\tSPEAKER_00\n Right.\n\n0:16:47\tSPEAKER_03\n You need some of the words in there so that you can say, well, this segment matches this one, this segment matches this one, and this one doesn't match at all unless we insert a beep.\n\n0:16:57\tSPEAKER_00\n And the only thing I'm worried about with that approach is that if we need to figure out the beep alignment problem before the transcribers do the corrections here, then we're in trouble.\n\n0:17:09\tSPEAKER_00\n In other words, if the transcripts aren't sort of good enough that the aligner constraints are good enough to sort of show you where the errors are, then it wouldn't work.\n\n0:17:19\tSPEAKER_00\n But it might work.\n\n0:17:20\tSPEAKER_00\n It might work to do this if their transcripts are pretty close on the words that usually get recognized correctly, which are the function words.\n\n0:17:27\tSPEAKER_03\n Well, actually, you know, there's an even easier way.\n\n0:17:29\tSPEAKER_03\n We don't really need a beep model.\n\n0:17:31\tSPEAKER_03\n Just extract the segments and do a forced alignment.\n\n0:17:35\tSPEAKER_03\n Right, you can say that the score is good if you say it matches.\n\n0:17:37\tSPEAKER_00\n Right, the individual segments between the beeps.\n\n0:17:40\tSPEAKER_00\n If beeps were like the segments that we get from the transcription tool already, that's what we have done, and it works very well.\n\n0:17:49\tSPEAKER_00\n You can see these segments align and these don't.\n\n0:17:52\tSPEAKER_00\n Then you just have to go back in and figure out where the endpoints of those segments are because some of them will be wrong.\n\n0:17:57\tSPEAKER_00\n Right.\n\n0:17:58\tSPEAKER_00\n Because the beeps were missing by definition.\n\n0:18:00\tSPEAKER_00\n So do you get a score for each alignment?\n\n0:18:02\tSPEAKER_00\n You get, definitely when they don't align at all, it fails.\n\n0:18:09\tSPEAKER_00\n I mean, that's how we found a lot of problems before with words being on the wrong place or something.\n\n0:18:16\tSPEAKER_00\n So a fail alignment is a very good indicator that the words don't match up.\n\n0:18:20\tSPEAKER_04\n And just wondering what it means to fail.\n\n0:18:22\tSPEAKER_04\n Is it the likelihood scores below some threshold?\n\n0:18:24\tSPEAKER_00\n Yeah, it's a, right.\n\n0:18:26\tSPEAKER_00\n You can't match up the, that's why you actually need the text in order to force you to try to match something that gives you a moment.\n\n0:18:31\tSPEAKER_00\n So it's just an idea if it turns out that, I mean, I also like this idea of high and low beeps or, but if, suppose we get one or two errors still per, you know, per transcript, then we might want to try some approach like that.\n\n0:18:51\tSPEAKER_03\n Well, the numbered ones would make it a lot easier because you could then really localize where the, right.\n\n0:18:55\tSPEAKER_00\n So if that doesn't add time for them, it'd be great.\n\n0:19:02\tSPEAKER_05\n Yeah, I think we'll just ask them.\n\n0:19:03\tSPEAKER_05\n Again, especially if there's 100, many hundreds or thousands, I still think it would cut the incidence of this lot if it was possible to break it into a couple of files.\n\n0:19:13\tSPEAKER_05\n Because it, you know.\n\n0:19:14\tSPEAKER_00\n I guess also even for the transcribers, it's quicker to load a smaller file.\n\n0:19:20\tSPEAKER_03\n Yeah, I mean, we could certainly break the meat. We could certainly break 20-inch pieces.\n\n0:19:26\tSPEAKER_05\n And we've already broken them into chunks. So if you have a thousand chunks, then just accumulate it to get 10 things per 100 or, you know, that's true.\n\n0:19:34\tSPEAKER_05\n And then it would be, you know, every now and then it'll be a, a beep missing.\n\n0:19:41\tSPEAKER_01\n So someone's going to talk to Brian.\n\n0:19:43\tSPEAKER_03\n I think that was Chuck.\n\n0:19:44\tSPEAKER_03\n Oh, yeah.\n\n0:19:46\tSPEAKER_01\n I also looked over the text and I was impressed by the accuracy. It looks really good.\n\n0:19:50\tSPEAKER_03\n Yeah, it does look good. I found several errors, but they were not significant.\n\n0:19:54\tSPEAKER_03\n They were all things that I could easily listen to.\n\n0:19:57\tSPEAKER_03\n And sometimes convince myself they said one thing and sometimes the other.\n\n0:20:01\tSPEAKER_00\n I haven't looked at these because I was gone last week.\n\n0:20:06\tSPEAKER_00\n But, but Don had told me that there's a difference in some of the conventions.\n\n0:20:10\tSPEAKER_00\n Oh, yes.\n\n0:20:11\tSPEAKER_00\n But those are all easy things, right?\n\n0:20:13\tSPEAKER_01\n Yeah.\n\n0:20:14\tSPEAKER_01\n And Brian actually forwarded me in advance. He worked very nicely, worked out, set a convention which is intermediate between ours and the ones that they're used to.\n\n0:20:23\tSPEAKER_01\n Okay.\n\n0:20:24\tSPEAKER_00\n Which is really a good, so we can just map them.\n\n0:20:27\tSPEAKER_00\n It'll talk great.\n\n0:20:32\tSPEAKER_03\n Okay.\n\n0:20:36\tSPEAKER_03\n We still haven't really sat down and talked about file reorganization and directory reorganization.\n\n0:20:44\tSPEAKER_03\n So we still have to do that.\n\n0:20:45\tSPEAKER_03\n But I don't think we need to do that in this meeting.\n\n0:20:48\tSPEAKER_03\n But it is something that needs to get done.\n\n0:20:51\tSPEAKER_03\n And I want to also coordinate it with Dave so that we do a level zero back up right after.\n\n0:20:57\tSPEAKER_03\n So we don't waste a lot of tapes.\n\n0:21:01\tSPEAKER_03\n So let's try to do that sometime.\n\n0:21:08\tSPEAKER_03\n We also still have to make a decision about my issues.\n\n0:21:12\tSPEAKER_03\n What we want to do with that.\n\n0:21:15\tSPEAKER_01\n I thought we were going to get two more of the.\n\n0:21:18\tSPEAKER_03\n And just swap them in and out.\n\n0:21:20\tSPEAKER_03\n Yeah, we could certainly do that.\n\n0:21:22\tSPEAKER_02\n So one note.\n\n0:21:23\tSPEAKER_03\n So Morgan, just to.\n\n0:21:26\tSPEAKER_03\n I think you weren't at the meeting last week.\n\n0:21:31\tSPEAKER_00\n Apparently a bunch of the EDU folks really hate this style might.\n\n0:21:35\tSPEAKER_00\n Well, they didn't say hate, but they.\n\n0:21:38\tSPEAKER_03\n They come on time to their meetings in order to not be left the last person who has to sit by us.\n\n0:21:43\tSPEAKER_03\n That's that's a fairly strong indication of dislike.\n\n0:21:47\tSPEAKER_00\n Which one is the crowd?\n\n0:21:49\tSPEAKER_03\n The people you like three or four people who really like them and all the others.\n\n0:21:53\tSPEAKER_03\n And the number of the Sony ones and just unplug them and plug them in.\n\n0:21:56\tSPEAKER_03\n The only thing is that when you fill out the digit forms, you have to be sure to indicate which mic was actually used.\n\n0:22:02\tSPEAKER_03\n So that's easy to do.\n\n0:22:05\tSPEAKER_03\n It moves us away from this uniform.\n\n0:22:07\tSPEAKER_03\n All the mics are the same, which some people had said was a benefit.\n\n0:22:13\tSPEAKER_01\n The other thing too is you said that the acoustic quality of the one that you're wearing, the fancy one is actually somewhat better than.\n\n0:22:20\tSPEAKER_01\n It is.\n\n0:22:21\tSPEAKER_01\n So I don't know if it's a noticeable difference, but it is.\n\n0:22:24\tSPEAKER_01\n I personally really prefer that model.\n\n0:22:27\tSPEAKER_01\n So I think we've got this problem of people having different.\n\n0:22:31\tSPEAKER_05\n You know, there are so many things about this that are not uniform.\n\n0:22:34\tSPEAKER_05\n I think having some modicum of uniformity is a good thing, but you're just not going to.\n\n0:22:39\tSPEAKER_05\n I mean, we've.\n\n0:22:42\tSPEAKER_05\n For instance, just the fact that people sit in different positions, different times.\n\n0:22:47\tSPEAKER_05\n Exactly where they put it with respect to their mouth is different each time.\n\n0:22:53\tSPEAKER_05\n I just don't.\n\n0:22:55\tSPEAKER_05\n I mean, I think we're getting rid of major differences.\n\n0:22:57\tSPEAKER_05\n Like we're not using the lapel anymore and so forth, but the other stuff is just going to.\n\n0:23:01\tSPEAKER_05\n Some very ability we're going to have to accept.\n\n0:23:04\tSPEAKER_01\n I understand.\n\n0:23:05\tSPEAKER_01\n It's fun.\n\n0:23:06\tSPEAKER_01\n I would say that I find this model easier to adjust.\n\n0:23:09\tSPEAKER_01\n That's one of the reasons I don't like these because I keep bending it.\n\n0:23:13\tSPEAKER_05\n Yeah, I happen to like the old one better, but yeah, what about just a different headband thing?\n\n0:23:19\tSPEAKER_00\n Or even if we can attach two headband like we have lots of choices of microphones.\n\n0:23:25\tSPEAKER_00\n So I mean, can we keep the microphones and just somehow attach a more comfortable thing over your head?\n\n0:23:33\tSPEAKER_00\n That's my problem with this one.\n\n0:23:35\tSPEAKER_00\n The ear thing comes out to here.\n\n0:23:37\tSPEAKER_00\n It doesn't even fit over my ear.\n\n0:23:39\tSPEAKER_00\n For some of the others, their ears were shaped in a way that didn't hold the...\n\n0:23:45\tSPEAKER_03\n So we can go microphone shopping and get more microphones.\n\n0:23:49\tSPEAKER_03\n I'm not sure what we should do.\n\n0:23:51\tSPEAKER_05\n I mean, here's another argument against worrying too much about uniformity.\n\n0:23:55\tSPEAKER_05\n We have something like 45 hours of data collected.\n\n0:23:59\tSPEAKER_05\n We're also going to be integrating this corpus stuff that's being done at UW with entirely different microphones.\n\n0:24:05\tSPEAKER_05\n So I think getting away from the little pal, having close mounted mics, having people adjust them as comfortable as they can...\n\n0:24:15\tSPEAKER_03\n Well, I agree with that.\n\n0:24:17\tSPEAKER_03\n So my feeling is we should get mics that people like.\n\n0:24:21\tSPEAKER_03\n And so my feeling is going out and buying a few more mics is fine.\n\n0:24:25\tSPEAKER_03\n So should I just go do that?\n\n0:24:27\tSPEAKER_03\n And then also should we go ahead and get another wireless system for whatever it's going to be?\n\n0:24:35\tSPEAKER_05\n Another wireless system.\n\n0:24:37\tSPEAKER_05\n You mean another transmitter?\n\n0:24:39\tSPEAKER_03\n No, actually we need another box because each box in the back room can only take six.\n\n0:24:45\tSPEAKER_05\n Oh, to get rid of the wired things.\n\n0:24:47\tSPEAKER_05\n Yes, absolutely.\n\n0:24:49\tSPEAKER_05\n With the exception of forgetting the chains, the batteries from time to time, we've really had no trouble with this at all.\n\n0:24:55\tSPEAKER_05\n And the wired stuff is just going to continue to degrade.\n\n0:24:59\tSPEAKER_05\n Nobody will remember how to repair a gym box or a gym let.\n\n0:25:07\tSPEAKER_03\n Okay, then I will just go do that and send the bill to whoever will pay.\n\n0:25:15\tSPEAKER_00\n I have a quick question about microphones.\n\n0:25:17\tSPEAKER_00\n I got this crazy idea that in the future people will just walk around with the microphones that they use for their cell phones, you know, these little boom ones, like, and really go to meetings with close talking mics if they're their own personal microphone.\n\n0:25:35\tSPEAKER_00\n And so I'm wondering if we can get a couple though.\n\n0:25:37\tSPEAKER_00\n I don't know how good quality there are, but it would be really interesting to see if they're good enough.\n\n0:25:41\tSPEAKER_00\n Do you mean the kind of hang from the ear or something?\n\n0:25:43\tSPEAKER_00\n They kind of guys that like to look like they're really cool at airports.\n\n0:25:47\tSPEAKER_05\n Yeah, I don't know that one.\n\n0:25:49\tSPEAKER_05\n It's a cell phone.\n\n0:25:51\tSPEAKER_00\n Oh, yeah, you do.\n\n0:25:53\tSPEAKER_00\n You cannot know that.\n\n0:25:55\tSPEAKER_00\n They're probably talking to nobody.\n\n0:25:57\tSPEAKER_00\n They have little headsets or what are they?\n\n0:25:59\tSPEAKER_00\n They wear the heads.\n\n0:26:01\tNone\n Well, there you go.\n\n0:26:01\tSPEAKER_03\n Yes, that looks sort of like that.\n\n0:26:03\tSPEAKER_03\n That one's even bigger than most of the ones I've seen.\n\n0:26:05\tSPEAKER_05\n So where does the mic go?\n\n0:26:07\tSPEAKER_01\n How do you wear that?\n\n0:26:09\tSPEAKER_05\n You put it over the corner of your ear.\n\n0:26:11\tSPEAKER_01\n I'm having a microphone, a headphone problem here.\n\n0:26:13\tSPEAKER_04\n There's another kind which goes in your ear and it hangs down.\n\n0:26:15\tSPEAKER_04\n There's a little bit of that I've seen here.\n\n0:26:17\tSPEAKER_00\n Okay, so whatever people sort of wear to use, yeah, something like with their cell phones, it'd be really great.\n\n0:26:25\tSPEAKER_00\n I think if we can argue to that.\n\n0:26:27\tSPEAKER_00\n It's interesting to see people who like that.\n\n0:26:29\tSPEAKER_01\n The acoustics on this are really better than when I talk into it directly.\n\n0:26:33\tSPEAKER_03\n Yeah, the biggest issue is the stupid cable that Sony, the connector that Sony has, it's non-standard and so you can't just plug something in.\n\n0:26:41\tSPEAKER_03\n You need to get it wide.\n\n0:26:43\tSPEAKER_05\n Oh, I'm sorry. You're talking about that as a possible thing to plug into the Sony's.\n\n0:26:47\tSPEAKER_00\n Just as an example for the future of the fact that maybe people will wear those microphones or some people might to meet.\n\n0:26:55\tSPEAKER_00\n Well, some people will, yeah.\n\n0:26:57\tSPEAKER_00\n I'm not saying there's not a far-filed microphone application, but I always wondered how well they would work.\n\n0:27:03\tSPEAKER_04\n It is an interesting idea.\n\n0:27:05\tSPEAKER_04\n I think the building adapter that went from, because I think mine looks like this too, with this dial plug that went to that, right, then we just have adapters and people plug them in.\n\n0:27:13\tSPEAKER_03\n You could use the...\n\n0:27:15\tSPEAKER_03\n I don't know if you can or not.\n\n0:27:17\tSPEAKER_03\n It's just an idea.\n\n0:27:19\tSPEAKER_03\n Well, I mean, another is be a better idea than redoing the wiring all the time.\n\n0:27:23\tSPEAKER_05\n Another side of that is that in principle, if it all comes together, supposedly we're going to get two iran boards, a little later on in the year.\n\n0:27:35\tSPEAKER_05\n And so we're going to want to be thinking in terms of some wireless connection to it.\n\n0:27:41\tSPEAKER_05\n So we have some kind of little something.\n\n0:27:45\tSPEAKER_05\n And we have a wireless connection.\n\n0:27:47\tSPEAKER_05\n This board is doing the computation for the recognition.\n\n0:27:51\tSPEAKER_05\n And so we want to be able to show off to somebody.\n\n0:27:53\tSPEAKER_05\n We have a base station somewhere, and you're wandering around hands-free.\n\n0:27:59\tSPEAKER_04\n I don't understand. So there's a mic that plugs into the iran board?\n\n0:28:03\tSPEAKER_05\n No. No. What I'm saying is that we're going to have to put together some kind of a little superstructure, some sort of demo box that doesn't do a whole lot, but it somehow connects to remotely to this iran board, which will be doing the real computation.\n\n0:28:19\tSPEAKER_05\n Oh, nice.\n\n0:28:21\tSPEAKER_05\n No, we're not going to attempt to build...\n\n0:28:23\tSPEAKER_05\n Do the real work of building a portable device that's little that is doing all the computation we want to do for the recognition and the far-field-like compensation and all that stuff.\n\n0:28:35\tSPEAKER_05\n So we're going to do all that on this powerful board.\n\n0:28:39\tSPEAKER_05\n And have some wireless connection to it.\n\n0:28:41\tSPEAKER_05\n And then the question is, what does it look like?\n\n0:28:43\tSPEAKER_05\n Does it look like something that you hold like this, or do we make a big deal out of it that you hold it at arms length so that you can see some display, or do we have one of these?\n\n0:28:55\tSPEAKER_05\n I don't know. So it's these are all possibilities.\n\n0:28:59\tSPEAKER_03\n What I was envisioning was a PDA with a cellular link and with one of the short-range wireless.\n\n0:29:07\tSPEAKER_03\n Just to capture the audio on the PDA and set the audio over the wireless net.\n\n0:29:13\tSPEAKER_05\n Yeah. Bluetooth sort of thing.\n\n0:29:15\tSPEAKER_03\n Bluetooth is shorter range, but you could use Bluetooth.\n\n0:29:19\tSPEAKER_03\n Whatever the network guys already have hooked up for this floor, I don't remember what it's called.\n\n0:29:27\tSPEAKER_03\n Okay, then another issue on file reorganization is making data available to people outside XC.\n\n0:29:35\tSPEAKER_03\n So specifically the UW folks have been wanting to get access to it.\n\n0:29:39\tSPEAKER_03\n So I think the right thing to do for that is figure out how to do CVS without compromising security.\n\n0:29:45\tSPEAKER_03\n Some SSH tunneled CVS.\n\n0:29:49\tSPEAKER_04\n Well, I'll give them access.\n\n0:29:53\tSPEAKER_04\n I was reading through some of the CVS documentation and you can just substitute CVS for your RSH command.\n\n0:29:57\tSPEAKER_03\n Yes, except that the command has to not take a password because it's non-interactive.\n\n0:30:05\tSPEAKER_03\n And so the only way to do that is with S-host switches and secure.\n\n0:30:09\tSPEAKER_03\n So we still have to sort of look at it a little bit.\n\n0:30:13\tSPEAKER_03\n I mean, I'm sure it's been solved and I just haven't found the solution yet.\n\n0:30:17\tSPEAKER_03\n It's going to be a problem a lot of people have.\n\n0:30:21\tSPEAKER_05\n Well, we're talking about fairly limited group.\n\n0:30:25\tSPEAKER_05\n Is it a small enough group that they could just have accounts?\n\n0:30:29\tSPEAKER_03\n Not really because then we have the coordination issue.\n\n0:30:33\tSPEAKER_03\n I mean, so one thing they could do, I mean, I guess that's true.\n\n0:30:35\tSPEAKER_03\n They could simply log into XC.\n\n0:30:37\tSPEAKER_03\n Yeah, they're going to have to have everything locally.\n\n0:30:39\tSPEAKER_04\n If they use SSH, they have to have an account.\n\n0:30:41\tSPEAKER_03\n Yeah, except they could share one.\n\n0:30:45\tSPEAKER_03\n The SSH accounts and the user accounts don't have to be similar.\n\n0:30:53\tSPEAKER_03\n So, I mean, there are lots of ways of doing it.\n\n0:30:57\tSPEAKER_03\n But if we can't figure out a remote way of doing it, just letting them log into XC might be okay.\n\n0:31:03\tSPEAKER_03\n So the intention was to put everything except the audio files themselves under revision control.\n\n0:31:09\tSPEAKER_03\n And the audio files, it's not worth doing because they're too big.\n\n0:31:11\tSPEAKER_03\n You're never going to be copying them around and making working copies of them.\n\n0:31:15\tSPEAKER_03\n Right.\n\n0:31:17\tSPEAKER_03\n And then the other issue, Jane and I spoke of briefly, is just general permission issues.\n\n0:31:23\tSPEAKER_03\n That right now lots of people create the files and then we have group meeting recorder.\n\n0:31:27\tSPEAKER_03\n But that means anyone in the meeting recorder group can overwrite the files.\n\n0:31:31\tSPEAKER_03\n And so that's pretty coarse level of granularity.\n\n0:31:35\tSPEAKER_03\n So we might want to think about doing a meeting recorder user owner for those files.\n\n0:31:40\tSPEAKER_03\n And then doing group slightly differently.\n\n0:31:42\tSPEAKER_03\n But I think what we have now.\n\n0:31:44\tSPEAKER_00\n I think what we have now.\n\n0:31:46\tSPEAKER_00\n I mean, if you just have one user that...\n\n0:31:50\tSPEAKER_03\n Another option is to make a non-make it owned by a not real user.\n\n0:31:58\tSPEAKER_03\n And then only root will be able to do it.\n\n0:32:00\tSPEAKER_03\n But root is pretty tightly controlled here.\n\n0:32:04\tSPEAKER_03\n So I don't think that's a good solution.\n\n0:32:06\tSPEAKER_01\n There are scripts that run and when it's finished compressing, would it be possible for the script to change the permissions on the file to be more straight?\n\n0:32:16\tSPEAKER_03\n Yes, but if you do that then someone who isn't the owner can't unchange it.\n\n0:32:22\tSPEAKER_01\n But after the meeting's done, would they want to?\n\n0:32:26\tSPEAKER_03\n Yeah, as I said, it's just a question of, do you want to have to track down root if you have to make any change?\n\n0:32:32\tSPEAKER_00\n But it doesn't have to be root. It could be some other user that we all can SUX too.\n\n0:32:36\tSPEAKER_00\n That's true.\n\n0:32:38\tSPEAKER_03\n Yeah, security issues with that.\n\n0:32:40\tSPEAKER_00\n That's true.\n\n0:32:42\tSPEAKER_00\n I mean...\n\n0:32:43\tSPEAKER_04\n So we do with doctor speech though, right?\n\n0:32:45\tSPEAKER_03\n No, with doctor speech it's just a group.\n\n0:32:47\tSPEAKER_03\n So there are lots of different owners of the files, but the group is always doctor speech or real usually.\n\n0:32:53\tSPEAKER_04\n But there is a user doctor speech, right?\n\n0:32:57\tSPEAKER_04\n I mean, I SUX to doctor speech.\n\n0:32:59\tSPEAKER_04\n Oh, do you?\n\n0:33:00\tSPEAKER_04\n Well, that's what I meant.\n\n0:33:02\tSPEAKER_00\n A directory on that.\n\n0:33:03\tSPEAKER_00\n User like meeting root or something.\n\n0:33:05\tSPEAKER_00\n Okay.\n\n0:33:06\tSPEAKER_00\n I know.\n\n0:33:10\tSPEAKER_03\n I mean, I'm not too worried because the group is pretty small.\n\n0:33:14\tSPEAKER_03\n But yeah.\n\n0:33:16\tSPEAKER_01\n It also seems like once it's been stored that night, it's possible to recover from backups.\n\n0:33:21\tSPEAKER_01\n So the main risk is avoiding it being accidentally deleted during the day that it was recorded.\n\n0:33:28\tSPEAKER_03\n Well, you then also just have the general problem of permission on the other files.\n\n0:33:35\tSPEAKER_03\n Do you want people checking out a transcript file when they find an error and correcting it, or do you want it to go through you?\n\n0:33:43\tSPEAKER_01\n Yeah.\n\n0:33:45\tSPEAKER_01\n Yeah.\n\n0:33:46\tSPEAKER_01\n And I prefer it to go through me.\n\n0:33:48\tSPEAKER_03\n If that means that you're going to have to be available for people all the time who say there's an error here, rather than just them just going in and correcting it.\n\n0:33:56\tSPEAKER_04\n Well, it's CVS, though. You don't actually have to do it that way.\n\n0:33:59\tSPEAKER_03\n Well, but you have a choice.\n\n0:34:01\tSPEAKER_03\n Either you let people do it themselves or you don't.\n\n0:34:04\tSPEAKER_04\n What I'm saying is that it can be the case that people can do it themselves and it can be reviewed.\n\n0:34:10\tSPEAKER_04\n Right?\n\n0:34:11\tSPEAKER_04\n Right.\n\n0:34:12\tSPEAKER_04\n I mean, it's not like it's one or the other.\n\n0:34:14\tSPEAKER_06\n We can do both.\n\n0:34:15\tSPEAKER_03\n Yeah, you can do both.\n\n0:34:16\tSPEAKER_03\n Right.\n\n0:34:17\tSPEAKER_03\n So you can get email.\n\n0:34:18\tSPEAKER_03\n Send email to Jane that someone has done a, right?\n\n0:34:21\tSPEAKER_01\n I want to also say that, you know, this is my view on this is that once it's in a file, once it's in a final version and I'm working toward all these final versions, then it can go into this next row, this next row, but it's sort of counterproductive to have changes made, which I would be making if I just got in that far on the file.\n\n0:34:38\tSPEAKER_03\n You know, it's, it's, well, so you don't have to release it to the world until you're ready to.\n\n0:34:43\tSPEAKER_03\n That's right.\n\n0:34:44\tSPEAKER_03\n So the question is, so you would keep it in a separate file structure until you were ready to put it in the repository.\n\n0:34:51\tSPEAKER_00\n Or just keep the lock on.\n\n0:34:55\tSPEAKER_00\n Yeah, just keep the lock on.\n\n0:34:57\tSPEAKER_00\n Check it out.\n\n0:34:58\tSPEAKER_00\n Check it out and don't let anyone check it out.\n\n0:34:59\tSPEAKER_00\n No, it doesn't, the CVS doesn't work that way.\n\n0:35:00\tSPEAKER_04\n Oh, it doesn't.\n\n0:35:01\tSPEAKER_04\n There's no, there's no lock when you check something out, not like RCS.\n\n0:35:04\tSPEAKER_04\n No, there's everybody can check out anything.\n\n0:35:07\tSPEAKER_04\n Oh, the C stands for concurrent.\n\n0:35:09\tSPEAKER_00\n Why not use RCS at that point?\n\n0:35:10\tSPEAKER_00\n Because it's not remote.\n\n0:35:11\tSPEAKER_00\n It's not remote.\n\n0:35:14\tSPEAKER_03\n The nice thing about CVS is, is you can be on a different machine.\n\n0:35:18\tSPEAKER_00\n But at that point, we only want probably Jane to be in control anyway.\n\n0:35:24\tSPEAKER_03\n I know because UW wants to have access to these files.\n\n0:35:28\tSPEAKER_03\n That's the whole point.\n\n0:35:29\tSPEAKER_00\n But not to modify them right, just to read them.\n\n0:35:31\tSPEAKER_03\n Well, if they, and if they record a meeting and they'd create a key file and they find an error in their key file, they shouldn't have to tell us about that so that they can create correct an error in one of their files.\n\n0:35:43\tSPEAKER_03\n So that's why I want to do it.\n\n0:35:44\tSPEAKER_03\n So that's why I want to do it.\n\n0:35:45\tSPEAKER_01\n Oh, key files different.\n\n0:35:46\tSPEAKER_01\n Different than what?\n\n0:35:48\tSPEAKER_01\n Well, key file has the extra attributes that if you notice that there are lots of spikes on channel so and so it's useful as a repository for putting it there.\n\n0:35:55\tSPEAKER_01\n And also if you notice that there was an extra speaker and didn't get mentioned in the key file, but they were only there for a second, but it's useful to mention that they're there.\n\n0:36:04\tSPEAKER_01\n So I think that the key files use it for notations related to the meeting.\n\n0:36:07\tSPEAKER_03\n But the meetings are going to be the same way.\n\n0:36:09\tSPEAKER_03\n So UW records a meeting.\n\n0:36:10\tSPEAKER_03\n We transcribe it.\n\n0:36:11\tSPEAKER_03\n Yeah.\n\n0:36:12\tSPEAKER_03\n A few months later, they listened to it and they say, oh, they got that acronym wrong.\n\n0:36:17\tSPEAKER_00\n Yeah.\n\n0:36:18\tNone\n Why?\n\n0:36:18\tSPEAKER_00\n Why?\n\n0:36:19\tSPEAKER_00\n Well, it's sort of not really question about permissions, but more of procedure.\n\n0:36:24\tSPEAKER_00\n Either those all go through Jane or through someone or they all don't.\n\n0:36:28\tSPEAKER_00\n But it's sort of, and if they all do, then there isn't a problem, right?\n\n0:36:32\tSPEAKER_00\n Because once they give us the data, it's ours.\n\n0:36:35\tSPEAKER_00\n And if they want to make change it, I mean, ours to sort of transcribe and annotate.\n\n0:36:40\tSPEAKER_03\n And if they want to make change it, it would be nice to be one repository.\n\n0:36:45\tSPEAKER_03\n And if we don't let them modify their own data, they're not going to store their data in our repository, or if we make it inconvenient for them to change their data.\n\n0:36:54\tSPEAKER_03\n So then if they, you know, I'm just looking at the other way around.\n\n0:36:56\tSPEAKER_03\n So let's say we,\n\n0:36:57\tSPEAKER_00\n And they use RCS at that point, where you can really lock a file. I mean, I'm worried if you can't lock a file, this to me sounds very scary.\n\n0:37:09\tSPEAKER_00\n And if they have accounts here and they're modifying, if they're, if they're so closely linked that they're actually modifying transcripts and key files, then they could do it by, you know, secure shelling into Xe under RCS at that point.\n\n0:37:24\tSPEAKER_03\n Well, I don't see a real difference between RCS and any other system.\n\n0:37:27\tSPEAKER_03\n I mean, it's just mechanisms.\n\n0:37:28\tSPEAKER_03\n The nice thing about CVS is that you can have multiple people modifying.\n\n0:37:32\tSPEAKER_03\n And if the changes don't overlap each other, they can just do it.\n\n0:37:37\tSPEAKER_03\n So the problem with RCS is that if two people want to modify a file at the same time they can't, because the granularity of locking is at the file level.\n\n0:37:47\tSPEAKER_05\n What does CVS do if they, if they do overlap?\n\n0:37:50\tSPEAKER_03\n There are lots of different policies for dealing with it.\n\n0:37:53\tSPEAKER_04\n But typically a person has to mediate, you know, which changes actually get you to go through.\n\n0:37:59\tSPEAKER_02\n Yeah, to go through which one is.\n\n0:38:01\tSPEAKER_00\n So maybe there is a way in CVS to effectively lock something.\n\n0:38:06\tSPEAKER_00\n If you don't want people to make any changes.\n\n0:38:09\tSPEAKER_03\n At the repository level there certainly is.\n\n0:38:11\tSPEAKER_03\n You can mark a file as you can't check this out.\n\n0:38:15\tSPEAKER_00\n Oh, so CVS is pretty good.\n\n0:38:18\tSPEAKER_00\n And you can use CVS and, you know, just have remote access.\n\n0:38:22\tSPEAKER_00\n But then it's up to whoever is sort of responsible for that level of transcription to decide how and when to put these blocks.\n\n0:38:30\tSPEAKER_03\n But it's just like source code, right?\n\n0:38:32\tSPEAKER_03\n So that when you're developing it and it's really rough, you don't put it in the repository.\n\n0:38:36\tSPEAKER_03\n You wait to the point where you're ready to release it.\n\n0:38:38\tSPEAKER_03\n And then you put it in the repository.\n\n0:38:40\tSPEAKER_03\n Yes, so there were other people on there.\n\n0:38:41\tSPEAKER_04\n Maybe the model, it's a little bit different.\n\n0:38:43\tSPEAKER_04\n CVS, when you check something out, you actually create your own directory with copies of everything in it.\n\n0:38:48\tSPEAKER_04\n And that's what you work on.\n\n0:38:50\tSPEAKER_04\n So until you're ready to check it in, nobody sees anything you've done.\n\n0:38:54\tSPEAKER_04\n And then when you check it in, it puts sort of, you know, every change you've done.\n\n0:38:57\tSPEAKER_04\n Right.\n\n0:38:58\tSPEAKER_00\n It goes into the central.\n\n0:38:59\tSPEAKER_00\n So if that's, I guess it depends on James, you know, if that's, if that model works for the transcripts, then that's fine.\n\n0:39:08\tSPEAKER_00\n But if that allows someone to come in and modify while you're modifying, and they turn out to be changes that, you know, would have better to wait until your version came out then.\n\n0:39:21\tSPEAKER_00\n That's really up to you, not up to software.\n\n0:39:23\tSPEAKER_01\n I also think that the type of change varies.\n\n0:39:26\tSPEAKER_01\n I think it's a very good point because what if the, what if one set of changes, one person was making was with reference to some typographical convention.\n\n0:39:35\tSPEAKER_01\n And the other person, quite unknowingly, was changing it the other way around.\n\n0:39:40\tSPEAKER_01\n And you could end up with a real mess in terms of like consistency of conventions across a file.\n\n0:39:44\tSPEAKER_01\n There is an argument to be made for having a single editor editing at that level.\n\n0:39:47\tSPEAKER_01\n Well, yeah, there would have to be somebody to enforce the consistency.\n\n0:39:50\tSPEAKER_01\n That's right.\n\n0:39:51\tSPEAKER_01\n I also like, this is a phraseology of this level of, I don't remember how you put it, but this at this level of transcription or whatever, it means like they're different layers of whatever and different types of conventions.\n\n0:40:02\tSPEAKER_01\n And if it were an acronym, then I would, I think that it would make sense for them to have input into that level of things.\n\n0:40:10\tSPEAKER_01\n But I wouldn't want to be changing.\n\n0:40:11\tSPEAKER_03\n I'm just, imagine that we reverse this, and they were keeping the repository, and we were collecting meetings and sending them to them.\n\n0:40:17\tSPEAKER_03\n If I found an error, and I sent them email and said, here's this error, and I didn't get a response for a couple of weeks, I would stop sending them to my data, and I would start collecting it here, and we would end up with two corpora.\n\n0:40:28\tSPEAKER_03\n Well.\n\n0:40:29\tSPEAKER_03\n And I don't want that to happen.\n\n0:40:30\tSPEAKER_03\n I do.\n\n0:40:31\tSPEAKER_03\n So we have to make it convenient for them to make changes that they want to make.\n\n0:40:35\tSPEAKER_01\n Well, I see now we're back into the same situation as when we're talking about allowing people to edit the transcripts to become public. This question of how easy or how hard to modify and how that impacts the amount of changing that's done.\n\n0:40:48\tSPEAKER_01\n And I think that it's, I have received some suggestions for change which I've made.\n\n0:40:55\tSPEAKER_01\n And I think with an acronym, that's a clear case where it would be easy change to incorporate.\n\n0:41:00\tSPEAKER_01\n But it would worry me to have people having free reign to change these things because of the need to have consistent conventions and people who are only just visiting the data might not have a sense of a larger system.\n\n0:41:14\tSPEAKER_00\n Yeah, that's what I would be worried about.\n\n0:41:16\tSPEAKER_04\n Well, I think there are probably ways that you can say that only certain users are allowed to change things.\n\n0:41:22\tSPEAKER_04\n So we can probably restrict it to be casual users, or just browsing can just get it read-only, can't check into the archive, or as we could say other people, these people are allowed to actually submit changes.\n\n0:41:35\tSPEAKER_04\n I think one thing that's probably everybody would agree on is that there will never be a point where we can say that for sure there's no problems with any of the transcripts.\n\n0:41:46\tSPEAKER_04\n I mean, there's, you know, some things are going to get overlooked at some point, or somebody's going to want to make a change somehow.\n\n0:41:52\tSPEAKER_04\n So we need to have some mechanism for handling changes in the future.\n\n0:41:58\tSPEAKER_01\n I agree, but I have to also add one other thing which is before I forget it, which is Adam's point about when you were reviewing the IBM transcripts, this is mentioned at the beginning of the meeting, you said that there were some places where it wasn't what was written already, but you could see how they might have thought that's what it said.\n\n0:42:13\tSPEAKER_01\n So it's not just a right and wrong thing.\n\n0:42:15\tSPEAKER_01\n Sometimes they're true, there are absolutely stresses where there is no, if you were at the meeting and you could ask the person, maybe, you know, they could have told you, but five minutes later they might not have been able to tell you, even if they were listening to it.\n\n0:42:27\tSPEAKER_01\n So sometimes it isn't right and wrong, sometimes it's multiple interpretations.\n\n0:42:31\tSPEAKER_01\n Good point.\n\n0:42:32\tSPEAKER_01\n But of course this does raise the possibility of allowing an extra annotation for, you know, alternative interpretations of a stretch.\n\n0:42:39\tSPEAKER_01\n But I just wanted to say it isn't simply right or wrong, or overlooked or not overlooked.\n\n0:42:43\tSPEAKER_01\n Sometimes they're truly ambiguous and nice to have a notation for that.\n\n0:42:48\tSPEAKER_00\n I mean, I like that idea because even a casual user can always send email to whoever's in charge and say, you know, we'd like these changes and, you know, hopefully we'll give them a response.\n\n0:43:00\tSPEAKER_00\n And if they really do it a lot and they say, we're a casual user, but we want a chance to change the transcripts.\n\n0:43:05\tSPEAKER_00\n And we can face that.\n\n0:43:07\tSPEAKER_00\n You can write 100.\n\n0:43:09\tSPEAKER_00\n I don't really see the people at UW that I know of right now making huge, investing huge amounts of time and changing transcripts.\n\n0:43:16\tSPEAKER_00\n But it could be wrong.\n\n0:43:17\tSPEAKER_03\n We could not transcripts, but it would be nice to have one mechanism for all the files.\n\n0:43:21\tSPEAKER_03\n And they're certainly going to want to change tools.\n\n0:43:24\tSPEAKER_03\n And so, you know, it's the same as source code.\n\n0:43:26\tSPEAKER_03\n You release source code at some point.\n\n0:43:28\tSPEAKER_03\n And either you have to do everything or you share responsibility.\n\n0:43:32\tSPEAKER_04\n Yeah, I mean, a lot of the open source projects face the same problem.\n\n0:43:35\tSPEAKER_04\n Right.\n\n0:43:36\tSPEAKER_04\n You know, anybody can check out the code, but not everybody can check it in.\n\n0:43:40\tSPEAKER_00\n Right. And there's some happy medium and we don't know what that is yet until we get feedback from people.\n\n0:43:46\tSPEAKER_00\n But what if it's okay to just handle it with sort of a person in charge of the philosophy behind it?\n\n0:43:53\tSPEAKER_00\n And some people with permissions maybe buy request to make changes.\n\n0:43:57\tSPEAKER_00\n That we don't just give people permissions if they're not going to make changes.\n\n0:44:00\tSPEAKER_00\n Because I've overwritten a file by mistake not wanting to have done that because I didn't think I had permission when I did.\n\n0:44:07\tSPEAKER_00\n And then just seeing if that is enough to handle the transcript changes.\n\n0:44:15\tSPEAKER_00\n I'm just worried about letting everybody go in and make changes.\n\n0:44:18\tSPEAKER_00\n Because it's really easy when you're trying to run the linements and there's a word you want to fix to go in and do that and then mess up other things.\n\n0:44:27\tSPEAKER_00\n If you don't know the overall philosophy behind the conventions.\n\n0:44:32\tSPEAKER_04\n There is also the possibility, remember in CBS when we talk about making changes, there's sort of two types that can be made to your local or to the global.\n\n0:44:41\tSPEAKER_04\n And so people can make changes to their local and they screw those up.\n\n0:44:44\tSPEAKER_04\n Exactly.\n\n0:44:45\tSPEAKER_04\n And that's only on them. It's the checking in part that you really care about.\n\n0:44:50\tSPEAKER_04\n And that we can control with who can check things in and stuff.\n\n0:44:54\tSPEAKER_04\n So I think we can do this.\n\n0:44:55\tSPEAKER_00\n Yeah, start by making it a really tight control and then as people really need the control, you can...\n\n0:45:00\tSPEAKER_00\n They can still check it out.\n\n0:45:01\tSPEAKER_00\n Asher chain weather.\n\n0:45:02\tSPEAKER_04\n Yeah, because they can still check out full copies and make whatever changes they want to their local copies.\n\n0:45:06\tSPEAKER_04\n And it won't affect the global official ones at all.\n\n0:45:10\tSPEAKER_03\n But what I want to avoid is ending up with two corpora.\n\n0:45:13\tSPEAKER_03\n Yes. And so if you make it too hard for them to check back in, they'll check it out once.\n\n0:45:18\tSPEAKER_03\n They'll make all the changes. They'll never tell us about the changes and we'll get two different corpora.\n\n0:45:25\tSPEAKER_00\n I think we're already going to...\n\n0:45:27\tSPEAKER_00\n I mean, there's already some chance that different annotations, different places, you know.\n\n0:45:32\tSPEAKER_00\n But you can control that by knowing you're making two corpora or knowing that you're adding annotations on one version and you don't have the latest corrections maybe at that point.\n\n0:45:43\tSPEAKER_00\n And then you finish the project and you realize that there were corrections made on your originals and then you have to merge them.\n\n0:45:50\tSPEAKER_00\n And the thing that makes it okay to do that is knowing where the sync time boundaries are.\n\n0:45:56\tSPEAKER_00\n Because you can automatically pretty much merge things if you've only got 20 words or so in an utterance.\n\n0:46:01\tSPEAKER_00\n It's when you get the whole meeting.\n\n0:46:03\tSPEAKER_00\n And the sync times have changed.\n\n0:46:05\tSPEAKER_00\n Or you can't correspond to a previous version with sync times that you get in trouble.\n\n0:46:10\tSPEAKER_00\n So...\n\n0:46:17\tSPEAKER_00\n Was there anything else?\n\n0:46:19\tSPEAKER_00\n Nope.\n\n0:46:20\tSPEAKER_03\n Should we do some digits?\n\n0:46:25\tSPEAKER_03\n Transcript L116?\n\n0:46:28\tSPEAKER_00\n Are we doing them simultaneously or what?\n\n0:46:31\tSPEAKER_00\n I wasn't planning on doing it simultaneously.\n\n0:46:33\tSPEAKER_03\n Transcript L116?\n\n0:46:35\tSPEAKER_03\n 826-445-199.\n\n0:46:38\tSPEAKER_03\n 1-311-8736-7117.\n\n0:46:41\tSPEAKER_03\n 828-380-382-9.\n\n0:46:45\tSPEAKER_03\n 2-758-430997.\n\n0:46:49\tSPEAKER_03\n 094-484-474.\n\n0:46:52\tSPEAKER_03\n 764-1889-87.\n\n0:46:56\tSPEAKER_03\n 3246-431-928.\n\n0:46:59\tSPEAKER_03\n 476-24045-9651.\n\n0:47:04\tSPEAKER_00\n Transcript L117-758-513-0714.\n\n0:47:11\tSPEAKER_00\n 2-694-5623-7044.\n\n0:47:15\tSPEAKER_00\n 7-513-74815.\n\n0:47:19\tSPEAKER_00\n 626-75376.\n\n0:47:23\tSPEAKER_00\n 806-976-142.\n\n0:47:26\tSPEAKER_00\n 1-39-852310.\n\n0:47:29\tSPEAKER_00\n 884-4295.\n\n0:47:32\tSPEAKER_00\n 461-103-224.\n\n0:47:36\tSPEAKER_04\n Transcript L-127.\n\n0:47:39\tSPEAKER_04\n 282-276-864.\n\n0:47:43\tSPEAKER_04\n 883-206-262.\n\n0:47:47\tSPEAKER_04\n 8756-7617-00.\n\n0:47:51\tSPEAKER_04\n 78-3075-275-383.\n\n0:47:56\tSPEAKER_04\n 557-308-5957.\n\n0:48:00\tSPEAKER_04\n 1-482-896670.\n\n0:48:04\tSPEAKER_04\n 2936-92150580.\n\n0:48:09\tSPEAKER_04\n 976-603-976.\n\n0:48:13\tSPEAKER_01\n Transcript L129-0900539255.\n\n0:48:19\tSPEAKER_01\n 6-037-709-889.\n\n0:48:24\tSPEAKER_01\n 075-969-1182.\n\n0:48:28\tSPEAKER_01\n 687-251144.\n\n0:48:31\tSPEAKER_01\n 04455-275-055-7530679.\n\n0:48:39\tSPEAKER_01\n 178-4-3-278.\n\n0:48:42\tSPEAKER_01\n 637-5128-4.\n\n0:48:46\tSPEAKER_02\n Transcript L-128-8-432-36107-6.\n\n0:48:54\tSPEAKER_02\n 046-696509.\n\n0:48:58\tSPEAKER_02\n 628-7817702.\n\n0:49:03\tSPEAKER_02\n 979-210-055-1.\n\n0:49:08\tSPEAKER_02\n 3047-9615.\n\n0:49:13\tSPEAKER_02\n 2072-6060-6742.\n\n0:49:18\tSPEAKER_02\n 3-524-06-6028-382-27196.\n\n0:49:28\tSPEAKER_02\n Oops!\n\n0:49:34\tSPEAKER_03\n Ouch!\n\n", "summary": [{"summary_text": "SPEAKER has to leave it through 30 today. He has to go to T. because they're having a birthday cake and he can't miss it. It took him a couple of hours to write the scripts and then it probably took him 45 minutes just going through it. The accuracy of the IBM transcript looks okay, but there are some places where it's wrong. He wrote a script that will convert it to the multi-channel trans format."}]}