{"filename": "./data/Bmr014.txt", "transcript": "0:00:00\tNone\n All right.\n\n0:00:01\tSPEAKER_04\n Are we going?\n\n0:00:10\tSPEAKER_04\n It must be February 15th.\n\n0:00:12\tSPEAKER_07\n I think the date's written in there.\n\n0:00:17\tSPEAKER_07\n And actually if everyone could cross out the R9 next session and write MR11.\n\n0:00:22\tSPEAKER_04\n Yeah, we didn't have a front-end meeting today.\n\n0:00:28\tSPEAKER_07\n And let's remember also to make sure that once you get smart as unread, unused.\n\n0:00:35\tSPEAKER_07\n MR11.\n\n0:00:39\tSPEAKER_04\n Okay, so.\n\n0:00:46\tSPEAKER_07\n Lots of clicking on sure as I'm trying to get this to work.\n\n0:00:50\tSPEAKER_04\n Agenda.\n\n0:00:51\tSPEAKER_04\n Agenda items today.\n\n0:00:53\tSPEAKER_07\n I want to talk a little bit about getting how we're going to get people to edit bleeps parts of the meeting that they don't want to include.\n\n0:01:01\tSPEAKER_07\n What I've done so far and I want to get some opinions on how to finish it up.\n\n0:01:06\tSPEAKER_07\n Okay.\n\n0:01:07\tSPEAKER_02\n I'm just going to ask about you monitoring some of the particular topics.\n\n0:01:21\tSPEAKER_02\n In listening to some of these meetings for our recorded, there are sometimes big spikes\n\n0:01:32\tSPEAKER_06\n on particular things. I don't know what the electronics is.\n\n0:01:39\tSPEAKER_07\n Yeah, well I think it could be a number of things.\n\n0:01:43\tSPEAKER_07\n It could be touching and fiddling and the other thing is that it could, the fact that it's on a wired mic is suspicious, it might be a connector.\n\n0:01:50\tSPEAKER_02\n Well maybe then we don't really have to talk about that.\n\n0:01:53\tSPEAKER_06\n You could try and experiment and say, okay, I'm about to test for spikes and then wiggle the thing there.\n\n0:01:58\tSPEAKER_06\n Right, and when they go to transcribe it, it could ask them to come get you.\n\n0:02:03\tSPEAKER_06\n Come get me when you transcribe this and see if there's any.\n\n0:02:06\tSPEAKER_04\n I'm just...\n\n0:02:08\tSPEAKER_04\n I mean, were this a professional audio recording?\n\n0:02:13\tSPEAKER_04\n Well what you would do is, in testing it is you would actually do all this wood letting them make sure that things are not giving that kind of performance that they are than to campus use.\n\n0:02:24\tSPEAKER_04\n Right, so let's see, I guess I would like to have a discussion about where we are on recording transcription, you know, basically where we are on the corpus.\n\n0:02:40\tSPEAKER_04\n And then the other thing which I would like to talk about, which is a real matter question, is maybe I'll start with that actually, Andreas brought up the fact that he would kind of like to know if possible what we're going to be talking about because he's sort of peripherally involved at this point and if there's going to be a topic about, a discussion about something that he strongly cares about then he would come.\n\n0:03:12\tSPEAKER_04\n And I think part of his motivation of this is he's trying to help us out because of the fact that the meetings are tending to become reasonably large now and days when everybody shows up and so he figures he could help that out by not showing up if it's a meeting that he's...\n\n0:03:33\tSPEAKER_04\n So in order, I think that this is a wish on his part, it's actually going to be hard because it seems like a lot of times things come up that are unanticipated.\n\n0:03:46\tSPEAKER_04\n But we could try anyway, do another try at coming up with the agenda at some point before the meeting.\n\n0:03:56\tSPEAKER_07\n Well, maybe it would be a good idea for one of us to, like on Wednesday or Tuesday, send out a reminder for people to send in agenda items.\n\n0:04:06\tSPEAKER_04\n Okay, you want to alter it to that? Sure.\n\n0:04:10\tSPEAKER_04\n Okay, so we'll send out agenda requests.\n\n0:04:14\tSPEAKER_07\n That'll be... but that'll help air-brainer or will not help a lot.\n\n0:04:18\tSPEAKER_04\n Yeah, I have to tell you for the admin meeting that we have, Lyle, does that every time before the admin meeting and she ends up getting the agenda requests 10 minutes before the meeting.\n\n0:04:32\tSPEAKER_04\n But we can try. Maybe it'll work.\n\n0:04:37\tSPEAKER_07\n Yeah, maybe. Where are things have happened?\n\n0:04:42\tSPEAKER_02\n I'm wondering if he were to specify particular topics that we'd be able to meet that requested business.\n\n0:04:52\tSPEAKER_06\n I would also guess that as we get more into processing the data and things like that, there'll be more things of interest to him.\n\n0:04:59\tSPEAKER_04\n Yeah, actually, this maybe brings up another topic which is...\n\n0:05:04\tSPEAKER_04\n So we're talking about that topic. The other topic I was thinking of was the status on microphones and channels.\n\n0:05:10\tSPEAKER_07\n Yeah, actually, I was going to say we need to talk about that too.\n\n0:05:14\tSPEAKER_07\n What line do we do that?\n\n0:05:16\tSPEAKER_07\n Okay, the new microphones, the two new ones are in.\n\n0:05:20\tSPEAKER_07\n And they are being assembled as we speak, I hope.\n\n0:05:23\tSPEAKER_07\n And I didn't bring my card today, so I'm going to pick them up tomorrow.\n\n0:05:27\tSPEAKER_07\n And then the other question I was thinking about is, well, a couple of things.\n\n0:05:31\tSPEAKER_07\n First of all, if the other headsets are a lot more comfortable, we should probably just go ahead and get them.\n\n0:05:37\tSPEAKER_07\n So we'll have to evaluate that when they come in and get people's opinions on what they think of them.\n\n0:05:42\tSPEAKER_07\n Then the other question I had is maybe we should get another wireless setup.\n\n0:05:48\tSPEAKER_07\n It's expensive, but it does seem to be better than the wired.\n\n0:05:53\tSPEAKER_04\n So how many channels do you get to have?\n\n0:05:57\tSPEAKER_04\n You know, wireless setup?\n\n0:05:59\tSPEAKER_07\n Well, I'm pretty sure that you can daisy chain them together.\n\n0:06:02\tSPEAKER_07\n So what we would do is replace the wired mics with wireless.\n\n0:06:06\tSPEAKER_07\n So we currently have one base station with six wireless mic, possibility of six wireless receivers.\n\n0:06:11\tSPEAKER_07\n And apparently you can chain those together.\n\n0:06:13\tSPEAKER_07\n And so we could replace our wired mics with wireless if we bought another base station and more wireless mics.\n\n0:06:20\tSPEAKER_07\n So it's still at 15 minus 6.\n\n0:06:25\tSPEAKER_07\n So we could have up to 9.\n\n0:06:28\tSPEAKER_04\n And right now we can know at the 6.\n\n0:06:30\tSPEAKER_07\n And we have 5, we're getting one more.\n\n0:06:33\tSPEAKER_07\n And it's about $900 for the base station and then 800 per channel.\n\n0:06:43\tSPEAKER_04\n Oh, so yeah, so the only, beyond the mic cost of the mics, the only thing is the base station is $900.\n\n0:06:49\tSPEAKER_04\n Oh, we should do it.\n\n0:06:51\tSPEAKER_07\n Okay.\n\n0:06:52\tSPEAKER_07\n So I'll look into how you daisy chain them and then just go ahead and understand how that works.\n\n0:06:58\tSPEAKER_07\n So we're not increasing the number of channels. We're just replacing the wired, the two wired that are still working, along with a couple of the wired that aren't working, one of the wired that's not working with a wireless.\n\n0:07:10\tSPEAKER_06\n Yeah, basically three wired's work, right?\n\n0:07:13\tSPEAKER_06\n I guess three wired's work.\n\n0:07:16\tSPEAKER_04\n But we've had more problems with that.\n\n0:07:18\tSPEAKER_04\n And this sort of bypasses the whole gym box thing.\n\n0:07:21\tSPEAKER_04\n And so we seemed to have a reliable way of getting the data in which is through the Sony Radio Max, as long as we're conscious about the batteries.\n\n0:07:31\tSPEAKER_05\n Right.\n\n0:07:32\tSPEAKER_05\n Everyone's battery, okay?\n\n0:07:33\tSPEAKER_06\n I'm sure.\n\n0:07:34\tSPEAKER_06\n I checked them this morning.\n\n0:07:35\tSPEAKER_06\n I should be.\n\n0:07:36\tSPEAKER_04\n Yeah.\n\n0:07:37\tSPEAKER_04\n That's the only thing with them.\n\n0:07:40\tSPEAKER_04\n But the quality seems really good.\n\n0:07:43\tSPEAKER_04\n I heard from UW that they're very close to getting their set up purchased.\n\n0:07:51\tSPEAKER_04\n They're buying something that you just sort of buy off the shelf.\n\n0:07:54\tSPEAKER_07\n Well, we should talk to them about because I know that SRI is also in the process of looking at stuff.\n\n0:07:59\tSPEAKER_07\n And so, you know, we should try to keep everyone on the same page with that.\n\n0:08:04\tSPEAKER_07\n So, are I really?\n\n0:08:05\tSPEAKER_07\n Yeah.\n\n0:08:06\tSPEAKER_07\n They got a parent.\n\n0:08:07\tSPEAKER_07\n No.\n\n0:08:08\tSPEAKER_07\n Maybe this needs to be bleeped out.\n\n0:08:11\tSPEAKER_04\n I don't know how much of it's probably working.\n\n0:08:14\tSPEAKER_04\n I don't know how much of it's probably working.\n\n0:08:15\tSPEAKER_04\n I'm talking about funding stuff.\n\n0:08:16\tSPEAKER_04\n Right.\n\n0:08:17\tSPEAKER_04\n But anyway, there's other activities that are going on there.\n\n0:08:23\tSPEAKER_04\n And NIST and UW.\n\n0:08:25\tSPEAKER_04\n But I think that at least the message we can tell other people that our experience is quite positive with the Sony Radio Max.\n\n0:08:32\tSPEAKER_04\n Right.\n\n0:08:33\tSPEAKER_04\n Now, the one thing that you have said that actually concerns me a little is you're talking about changing headsets, changing the connector, which means some hands-out or something.\n\n0:08:41\tSPEAKER_07\n No, we're having them do it.\n\n0:08:44\tSPEAKER_07\n So, it's hand-sortering it, but I'm not doing it.\n\n0:08:47\tSPEAKER_07\n Okay.\n\n0:08:48\tSPEAKER_07\n So, they charge.\n\n0:08:49\tSPEAKER_04\n No, I guess you're doing your hands-out.\n\n0:08:51\tSPEAKER_07\n You've never seen my hands-out or anything.\n\n0:08:54\tSPEAKER_07\n But, as I've said, they're coming in.\n\n0:08:57\tSPEAKER_07\n I mean, yeah.\n\n0:08:59\tSPEAKER_07\n As professionally as I guess you can get it done.\n\n0:09:03\tSPEAKER_07\n I mean, if they do it...\n\n0:09:07\tSPEAKER_07\n I mean, it's just their repair shop.\n\n0:09:09\tSPEAKER_04\n Right.\n\n0:09:10\tSPEAKER_04\n They're maintenance people.\n\n0:09:12\tSPEAKER_04\n We'll see what it's like.\n\n0:09:14\tSPEAKER_04\n That can be quite good.\n\n0:09:16\tSPEAKER_04\n Yeah.\n\n0:09:17\tSPEAKER_04\n Okay.\n\n0:09:18\tSPEAKER_04\n Good.\n\n0:09:19\tSPEAKER_07\n Yes, let's go with that.\n\n0:09:21\tSPEAKER_07\n And then you will see tomorrow.\n\n0:09:23\tSPEAKER_04\n It looks like.\n\n0:09:26\tSPEAKER_04\n So, Dave isn't here, but he was going to start working on some things with the digits.\n\n0:09:32\tSPEAKER_04\n So, he'll be interested in what's going on with that.\n\n0:09:35\tSPEAKER_04\n I guess the decision last time was that the transcribers were going to be doing stuff with the digits as well.\n\n0:09:43\tSPEAKER_04\n Is that Starters?\n\n0:09:44\tSPEAKER_02\n It would be to use his interface now as going to meet with him today about that.\n\n0:09:49\tSPEAKER_07\n Right.\n\n0:09:50\tSPEAKER_07\n So, the decision was that Jane did not want the transcribers to be doing any of the paperwork.\n\n0:09:53\tSPEAKER_07\n So, I did all that last week.\n\n0:09:56\tSPEAKER_07\n So, all the forms are now on the computer.\n\n0:10:01\tSPEAKER_07\n And then I have a bunch of scripts that will read those and let the transcribers use different tools.\n\n0:10:07\tSPEAKER_07\n And I just wanted to talk to Jane about how we transition to using those.\n\n0:10:11\tSPEAKER_03\n So, he hasn't set up that they could be efficient than I just did.\n\n0:10:15\tSPEAKER_07\n Okay.\n\n0:10:16\tSPEAKER_07\n So, I don't think it'll take too long.\n\n0:10:18\tSPEAKER_07\n So, you know, just a matter of a few days, I suspect.\n\n0:10:21\tSPEAKER_04\n So, anyway, I think we have at least one user for the digits once they get done, which will be Dave.\n\n0:10:27\tSPEAKER_07\n Right.\n\n0:10:28\tSPEAKER_07\n I've already done five or six sets.\n\n0:10:30\tSPEAKER_07\n So, if you wanted to, you know, just have a few to start with, he could.\n\n0:10:35\tSPEAKER_07\n And I also have a bunch of scripts that will generate key files and run recognition on them also.\n\n0:10:40\tSPEAKER_03\n Right.\n\n0:10:41\tNone\n Okay.\n\n0:10:43\tSPEAKER_04\n It's Dave.\n\n0:10:45\tSPEAKER_04\n I don't know if Dave is on the list.\n\n0:10:48\tSPEAKER_04\n He's invited to these meetings.\n\n0:10:51\tSPEAKER_02\n I don't tend to get an invitation myself.\n\n0:10:54\tSPEAKER_07\n We don't have an active one, but I'll make sure he's on the list.\n\n0:10:57\tNone\n Should we call him?\n\n0:11:00\tSPEAKER_02\n I mean, you see, you see, he definitely not available today.\n\n0:11:03\tSPEAKER_07\n I don't know.\n\n0:11:04\tSPEAKER_07\n Should I call him?\n\n0:11:05\tSPEAKER_07\n He's still taking classes.\n\n0:11:07\tSPEAKER_02\n So, he may well have classes.\n\n0:11:09\tSPEAKER_04\n He wasn't there at college.\n\n0:11:11\tSPEAKER_04\n Yeah, so this might be a conflict.\n\n0:11:14\tNone\n Okay.\n\n0:11:15\tSPEAKER_05\n Okay.\n\n0:11:16\tSPEAKER_05\n So, did Indy say his signal processing class was like, I think he has Tuesdays and Thursdays?\n\n0:11:21\tSPEAKER_05\n Yeah.\n\n0:11:22\tSPEAKER_05\n He might have.\n\n0:11:23\tSPEAKER_05\n Okay.\n\n0:11:24\tSPEAKER_00\n Talking about David Gilbert.\n\n0:11:25\tSPEAKER_00\n Yeah.\n\n0:11:27\tSPEAKER_00\n I think he's taking 225A, which is now.\n\n0:11:29\tSPEAKER_04\n Yeah.\n\n0:11:30\tSPEAKER_04\n Okay.\n\n0:11:31\tSPEAKER_04\n So, that's why we're doing team.\n\n0:11:33\tSPEAKER_04\n Okay.\n\n0:11:34\tSPEAKER_04\n Transcription is beyond the digits where we are.\n\n0:11:38\tSPEAKER_04\n Okay.\n\n0:11:39\tSPEAKER_04\n And the recording is also just where we are.\n\n0:11:42\tSPEAKER_02\n So, should we do a little recording?\n\n0:11:45\tSPEAKER_07\n It's the first turn.\n\n0:11:47\tSPEAKER_07\n Oh, we have about 32 hours.\n\n0:11:52\tSPEAKER_07\n I guess a week and a half ago.\n\n0:11:55\tSPEAKER_07\n So, you probably now have about 35 hours.\n\n0:11:58\tSPEAKER_04\n And that's how much of those digits?\n\n0:12:02\tSPEAKER_04\n That's including digits.\n\n0:12:03\tSPEAKER_04\n That's including digits.\n\n0:12:04\tSPEAKER_07\n So, I haven't separated out, so I've no clue how much of that is digits.\n\n0:12:07\tSPEAKER_04\n So, anyway, there's at least probably 30 hours.\n\n0:12:10\tSPEAKER_04\n Got to be more than 30 hours.\n\n0:12:12\tSPEAKER_04\n Of non-digits?\n\n0:12:13\tSPEAKER_04\n Yeah, absolutely.\n\n0:12:14\tSPEAKER_07\n I mean, the digits don't take up that much time.\n\n0:12:16\tSPEAKER_07\n Okay.\n\n0:12:17\tSPEAKER_02\n Okay.\n\n0:12:18\tNone\n And the transcribers, I don't have the exact numbers.\n\n0:12:21\tNone\n I think it would come to about 11 hours that are finished transcribing from them right now.\n\n0:12:26\tNone\n The next step is to do the recording.\n\n0:12:29\tNone\n And then to ensure that the data are clean first.\n\n0:12:32\tNone\n And then to channelize.\n\n0:12:34\tSPEAKER_03\n The only clean is that there's a check.\n\n0:12:37\tSPEAKER_02\n And the markup is not only throughout, but also that we now incorporate these additional conventions that, uh, Liz requested in terms of, uh, in terms of having us, uh, systematic handling of numbers and acronyms, which I hadn't been specific about.\n\n0:12:52\tSPEAKER_02\n Uh, for example, they'll say 92.\n\n0:12:56\tSPEAKER_02\n And, you know, so how you could...\n\n0:12:58\tSPEAKER_02\n 92.\n\n0:12:59\tSPEAKER_02\n Exactly.\n\n0:13:00\tSPEAKER_02\n So, if you just say 92, then there are many ways that could have been expressed.\n\n0:13:02\tSPEAKER_02\n And I just had them.\n\n0:13:03\tSPEAKER_02\n I mean, a certain number of them did put the words down.\n\n0:13:06\tSPEAKER_02\n But now we have a convention which also involves having it followed by a gloss.\n\n0:13:11\tSPEAKER_02\n You know, Jay?\n\n0:13:12\tSPEAKER_06\n Um, one suggestion that you may already be doing this.\n\n0:13:14\tSPEAKER_06\n But I've noticed in the past that when I've gone through transcriptions and, you know, in order to build lexiconcant things, if you, um, just take all the transcriptions and separate them into words and then alphabetize them, a lot of times just scanning down that list you'll find a lot of misspelled inconsistency.\n\n0:13:30\tSPEAKER_02\n Just talking about the tech token frequency listings.\n\n0:13:32\tSPEAKER_02\n And I use those two.\n\n0:13:33\tSPEAKER_02\n You mean, just a, on each line, there's one word, right?\n\n0:13:36\tSPEAKER_02\n It's one token from the corpus.\n\n0:13:38\tSPEAKER_02\n Yeah, those are extremely efficient.\n\n0:13:40\tSPEAKER_02\n And I agree that's a good decision.\n\n0:13:41\tSPEAKER_02\n So you already have that, okay.\n\n0:13:42\tSPEAKER_02\n Well, that's a way, you know, the spell check basically does that.\n\n0:13:45\tSPEAKER_02\n But, but in addition, yes, that's exactly the strategy.\n\n0:13:48\tSPEAKER_02\n I want to do in terms of locating these things, which are, you know, locally spoken forms, which aren't the likes of them.\n\n0:13:53\tSPEAKER_02\n Exactly.\n\n0:13:54\tSPEAKER_06\n So a lot of times they'll appear next to each other and, uh, in alphabetize list, they'll appear next to each other.\n\n0:13:59\tSPEAKER_06\n Exactly.\n\n0:14:00\tSPEAKER_02\n I agree.\n\n0:14:01\tSPEAKER_02\n That's a very good suggestion.\n\n0:14:02\tSPEAKER_02\n And that was, that's my strategy, praneling a lot of these things in terms of things that need to be glossed.\n\n0:14:07\tSPEAKER_02\n I didn't get to that point.\n\n0:14:09\tSPEAKER_02\n But so there are numbers, then there are acronyms.\n\n0:14:11\tSPEAKER_02\n And then, um, there's a, she wants to be, uh, actually, an explicit marker of what type of comment this is.\n\n0:14:21\tSPEAKER_02\n So it curly inside the curly brackets, I kind of put either vote for vocalize, like cough or laugh or whatever, non-vogue for door slam and gloss for things that have to do with, if they set us, uh, spoken form with this, maybe this pronunciation, or I already had that convention that I've been asking these people to do this,\n\n0:14:39\tNone\n because I think it can be most efficiently handled by, by, uh, a filter, and that's what I was always planning on. So, you know, you get a whole long list, exactly what you're saying.\n\n0:14:46\tSPEAKER_02\n You get a whole list of things that say curly bracket, laugh curly bracket.\n\n0:14:49\tSPEAKER_02\n Then, you know, it's, it's, you risk less error if you handle it by a filter.\n\n0:14:54\tSPEAKER_02\n Then if you have the transcribed, laboriously typing in, it's going to be a voc space.\n\n0:14:58\tSPEAKER_02\n So many ways that can be error.\n\n0:15:00\tSPEAKER_02\n Right.\n\n0:15:01\tSPEAKER_02\n So, um, I'm, I'm going to convert that via a filter into these tagged, uh, subcategorized comments.\n\n0:15:09\tSPEAKER_02\n And same thing with, you know, you see, you get a subset, when you do what you're saying, you end up with, with, uh, your claps can cross the frequency, you just have to open, so you can, uh, have a filter which more efficiently makes those changes.\n\n0:15:21\tSPEAKER_02\n But the numbers and acronyms have to be handled by hand, because, you know,\n\n0:15:25\tSPEAKER_07\n you don't know what they could be.\n\n0:15:27\tSPEAKER_02\n Yeah, no timents clear, um, and PLP is clear. But, uh, there are things that are not so well known, or, or have variant, you use like the numbers, you could say 9 to, you could say 92.\n\n0:15:41\tSPEAKER_07\n So, how are you doing the, I handle the numbers individually.\n\n0:15:45\tSPEAKER_07\n How are you doing the, uh, acronyms?\n\n0:15:46\tSPEAKER_07\n So if I say PZM, what would it be here on the transcript?\n\n0:15:49\tSPEAKER_02\n The letters would be separated.\n\n0:15:50\tSPEAKER_02\n Okay.\n\n0:15:51\tSPEAKER_02\n Space.\n\n0:15:52\tSPEAKER_02\n And potentially they'll have, uh, curly bracket thing afterwards.\n\n0:15:55\tSPEAKER_02\n But I'm not sure if that's necessarily clarifying what it is, so gloss up, whatever.\n\n0:15:59\tSPEAKER_02\n Right.\n\n0:16:00\tSPEAKER_02\n I don't know if that's really necessary to do that.\n\n0:16:02\tSPEAKER_02\n It's a nice thing to do because of, it then indicating this is, uh, a step away from, indicating that it really is intentional, those spaces are there, indicating why they're there, indicating that it's, uh, the, uh, enumerated, or, I mean, that's not a good way of saying it.\n\n0:16:18\tSPEAKER_02\n But it's, it's the, it's a thick, uh, way of stating these, these letters.\n\n0:16:23\tSPEAKER_02\n So it sounds good.\n\n0:16:25\tSPEAKER_02\n And so anyway, the clean, those are those things, and then, channelized is to then, uh, get it into this multi-channel format.\n\n0:16:32\tSPEAKER_02\n And at that point, then it's ready for use by Liz and Dawn.\n\n0:16:36\tSPEAKER_02\n But that's been my top priority.\n\n0:16:37\tSPEAKER_02\n Beyond getting a channel channelized, the next step is to work on tightening up the boundaries of the time.\n\n0:16:42\tSPEAKER_02\n Right.\n\n0:16:43\tSPEAKER_02\n And, uh, Tila had a, uh, I've right through this, this last week in terms of getting the channel based, uh, speech-non-speech segmentation, uh, up and running, and I haven't, I haven't been able to use that yet, because I'm working through it. This is my top priority. Get the data clean.\n\n0:16:57\tSPEAKER_07\n Have you also been doing spot checks, Jane?\n\n0:17:00\tSPEAKER_02\n Oh, yes. Well, you see, that's part of the cleaning process.\n\n0:17:02\tSPEAKER_02\n I spent, um, actually, um, I have a segment of 10 minutes that was transcribed by two of our transcribers.\n\n0:17:09\tSPEAKER_02\n Okay. Good.\n\n0:17:10\tSPEAKER_02\n And I went through it last night. It's, it's almost spooky how similar these are.\n\n0:17:13\tSPEAKER_02\n Word for word. And there are some differences in commas, because commas, I left in discretion at commas.\n\n0:17:19\tSPEAKER_02\n Right.\n\n0:17:20\tSPEAKER_02\n And so, because it's not part of our, our, our needed conventions, and, um, and, um, and it still will be different from commas, but it's, it's word by word the same, in, in huge patches of the data.\n\n0:17:33\tSPEAKER_02\n And I have 10 minutes stretch where I can, where I can show that.\n\n0:17:36\tSPEAKER_02\n And, and sometimes it turns out that one of these transcribers has a better ear for technical jargon, and the other one has a better ear for co-ocleal speech.\n\n0:17:43\tSPEAKER_02\n So, um, the one, the, the co-ocleal speech person picked up gobble-dee book, and the other one did, and on this side, this one's picking up things like neural nets, and the one that's good on this vocabulary.\n\n0:17:56\tSPEAKER_02\n Right.\n\n0:17:57\tSPEAKER_06\n Yeah, co-ocleal speech.\n\n0:17:58\tSPEAKER_06\n For the person who missed gobble-dee book, what did they put?\n\n0:18:01\tSPEAKER_02\n It was, uh, interesting approximation put in parentheses, because I had this convention that if they're not sure what it was, they put it in parentheses, so I tried to approximate it, but it was spelled GA, BB, L.\n\n0:18:12\tSPEAKER_02\n Sort of how it sounds.\n\n0:18:13\tSPEAKER_02\n Yes, more of an attempt to, I mean, apparently it was very clear to her, these, these, this, this, this, this, this, this, this, It was a technical term that she didn't recognize.\n\n0:18:21\tSPEAKER_02\n Yeah, but she knew she didn't know it, maybe it was a technical term exactly, but she even know her technical perception is just really, you know, I'm tempted to ask her, is she's taking any courses in this area, or is she's taking cognitive science, or is that right?\n\n0:18:32\tSPEAKER_02\n Because neural nets, and oh, she has some things that are, oh, down sample, she got that right, and some of these are rather, uh, I'm excited.\n\n0:18:39\tSPEAKER_02\n That's obscure, yeah.\n\n0:18:40\tSPEAKER_02\n But ten solid, she's trying to have ten solid minutes where they both coded the same data, and, uh,\n\n0:18:45\tSPEAKER_04\n and again, the main track that you're working with is 11 hours, is that right?\n\n0:18:49\tSPEAKER_02\n Yes, exactly.\n\n0:18:50\tSPEAKER_02\n Okay.\n\n0:18:51\tSPEAKER_02\n And that's probably, uh, 11 hours.\n\n0:18:52\tSPEAKER_04\n Is that, is that, that including digits?\n\n0:18:54\tSPEAKER_04\n Yes it is.\n\n0:18:55\tSPEAKER_04\n Yeah.\n\n0:18:56\tSPEAKER_04\n So let's say roughly 10 hours or so.\n\n0:18:59\tSPEAKER_04\n I mean it's probably more than that.\n\n0:19:00\tSPEAKER_02\n It ain't been more than that because my recollection is a minute, and that's not, that, that, that, that just don't take more than half a minute for a person.\n\n0:19:05\tSPEAKER_02\n Okay.\n\n0:19:07\tSPEAKER_02\n But, uh, the, uh, the total set that I gave them is 12 hours of tape, But they haven't gotten to the end of that yet, so there's still working on some of them.\n\n0:19:16\tSPEAKER_02\n Two of them are still working on completing that.\n\n0:19:21\tSPEAKER_06\n Quite him, moving right along.\n\n0:19:25\tSPEAKER_02\n Yeah, they are.\n\n0:19:26\tSPEAKER_02\n There's some that have more hours that they devote to it than others.\n\n0:19:31\tSPEAKER_04\n So what's the deal with your talent thing?\n\n0:19:36\tSPEAKER_01\n Oh, it's just I ran the Rekinaza, other speech and speech detector on different channels.\n\n0:19:41\tSPEAKER_01\n It's just in this new multi-channel format and output.\n\n0:19:46\tSPEAKER_01\n I just gave one meaning to Liz who wanted to try it for the Rekinaza.\n\n0:19:52\tSPEAKER_01\n As apparently the Rekinaza had problems with those long channels of speech, which took too much memory or whatever.\n\n0:20:01\tSPEAKER_01\n And so she will try that.\n\n0:20:06\tSPEAKER_01\n I'm raking on it.\n\n0:20:07\tSPEAKER_07\n Is there anything different than the HMM system you were using before?\n\n0:20:13\tSPEAKER_01\n I used some different features, but not the basic thing is this.\n\n0:20:19\tSPEAKER_07\n So there's still no knowledge using different channels at the same time?\n\n0:20:24\tSPEAKER_01\n Yeah, it's as the energy is normalized across all of them.\n\n0:20:31\tSPEAKER_01\n That's one of the main changes.\n\n0:20:35\tSPEAKER_04\n First of the other features, besides the energy.\n\n0:20:39\tSPEAKER_04\n You said you're trying some different features.\n\n0:20:42\tSPEAKER_01\n Oh, I just used our loudness based things.\n\n0:20:49\tSPEAKER_01\n I used to stay before the area where some in the locked domain.\n\n0:20:54\tSPEAKER_01\n I changed just to the cube root.\n\n0:20:59\tSPEAKER_01\n No, I changed just to the loudness thing you had.\n\n0:21:04\tSPEAKER_01\n What do you call it?\n\n0:21:06\tSPEAKER_04\n The Trim.\n\n0:21:07\tSPEAKER_01\n I'm not sure about the Trim.\n\n0:21:11\tSPEAKER_01\n I'll look it up.\n\n0:21:14\tSPEAKER_01\n That's basically the thing.\n\n0:21:21\tSPEAKER_01\n I tried to normalize the features, loudness and modified loudness within one channel.\n\n0:21:31\tSPEAKER_01\n Because they're to be able to distinguish between foreground and background speech.\n\n0:21:38\tSPEAKER_01\n And it works quite well, but not always.\n\n0:21:45\tSPEAKER_04\n I think the re-basic redone with the transcription.\n\n0:21:52\tSPEAKER_04\n So I guess the next thing is this.\n\n0:21:56\tSPEAKER_04\n We better.\n\n0:21:58\tSPEAKER_07\n Right, so the idea is that we need to provide the transcripts to every participant of every meeting.\n\n0:22:04\tSPEAKER_07\n To give them an opportunity to leave out sections they don't want.\n\n0:22:07\tSPEAKER_07\n So I've written a bunch of tools that will generate web pages with the transcription in it so that they can click on them and listen to pieces and they can scroll through and read them.\n\n0:22:17\tSPEAKER_07\n And then they can check on each one if they wanted excluded.\n\n0:22:20\tSPEAKER_07\n And then it's a form, a single form so they can submit it and it will end up sending me email with the times that they want excluded.\n\n0:22:27\tSPEAKER_07\n And so some of the questions on this is what do we do about the privacy issue?\n\n0:22:31\tSPEAKER_07\n And so I thought about this a little bit and I think the best way to do it is every participant will have a password, a single password.\n\n0:22:37\tSPEAKER_07\n Each person will have a single password, username and password.\n\n0:22:40\tSPEAKER_07\n And then each meeting will only allow the participants who are at that meeting to look at it.\n\n0:22:46\tSPEAKER_07\n And that way each person only has to remember one password.\n\n0:22:51\tSPEAKER_04\n I can't help but wonder if this is maybe a little more elaborate than is needed.\n\n0:23:02\tSPEAKER_04\n I mean, for me I would actually want to have some pieces of paper that have a transcription and sort of flip through it.\n\n0:23:09\tSPEAKER_04\n And then if I thought it was okay, I'd say it's okay.\n\n0:23:14\tSPEAKER_04\n And I mean, it depends how this really ends up working out. But I guess my thought was that the occasion of somebody wondering whether something was okay or not, the meeting to listen to it was going to be extremely rare.\n\n0:23:29\tSPEAKER_07\n Right. I mean, so the fact that you could listen to it over the web is a minor thing that I already had done for other reasons.\n\n0:23:37\tSPEAKER_07\n And so that's a minor part of it. I just wanted some web interface so that people, you didn't actually have to send everyone the text.\n\n0:23:43\tSPEAKER_07\n So what my intention to do is that as the transcripts become ready, I would take them and generate the web pages and send email to every participant or contact them using the contact method they wanted.\n\n0:23:54\tSPEAKER_07\n And just tell them, here's the web page. You need a password. So question number one is how do we distribute the passwords.\n\n0:24:03\tSPEAKER_07\n And question number two is how else do we want to provide this information if they want it?\n\n0:24:08\tSPEAKER_04\n Let's think what I was sort of saying is that if you just say here is it, here is, maybe it sounds peveolithic, but I thought if you handed them some sheets of paper that said, here's what was said in this transcription, is it okay with you?\n\n0:24:25\tSPEAKER_04\n And if it is, here's the other sheet of paper that you sign that says that it's okay.\n\n0:24:29\tSPEAKER_07\n I think that there are a subset of people who want printouts that we can certainly provide, but certainly I wouldn't want to print out. These are big. And I would much rather be able to just sit and read through it.\n\n0:24:41\tSPEAKER_04\n I mean, how do you read books?\n\n0:24:43\tSPEAKER_07\n Well, I certainly read books by hand, but for something like this, I think it's easier to do it on the web.\n\n0:24:48\tSPEAKER_07\n Does your going to get, you know, I mean a bunch of meetings and I don't want to get a stack of these, I want to just be able to go to the website and visit it as I want.\n\n0:24:59\tSPEAKER_04\n Going to a website is easy, but flipping through 100 pages of stuff is not easy on the web.\n\n0:25:04\tSPEAKER_07\n Well, I don't think it's that much harder than paper.\n\n0:25:07\tSPEAKER_02\n So, I have a question. So, are you thinking that the person would have a transcription go strictly through the transcript? Because I do think that there's a benefit to being able to hear the tone of voice.\n\n0:25:18\tSPEAKER_04\n So, here's where I was imagining it, maybe I'm wrong, but the way I mentioned it was that the largest set of people is going to go, oh yeah, I didn't say any funny that meaning just go ahead, where's the release?\n\n0:25:30\tSPEAKER_04\n There will be a subset of people, right? Because think of who it is we've been recording. There will be a subset of people who will say, well yeah, I really would like to see that.\n\n0:25:42\tSPEAKER_04\n And for them, the easiest way to flip through, if it's a really large document, I mean unless you're searching, searching, of course, should be electronic.\n\n0:25:51\tSPEAKER_04\n But if you're not, so if you provide some search mechanism, go to every place they said something or something like that, see them or get more elaborate with this thing.\n\n0:25:59\tSPEAKER_04\n If you don't have search mechanisms, you just sort of have this really, really long document. I mean whenever I've had a really, really long document that is sitting on the web, I've always ended up printing it out.\n\n0:26:11\tSPEAKER_04\n I mean, so it's, I mean, you're not necessarily going to be sitting at the desk all the time, you want to figure you have a train ride, there's all these situations where, I mean, this how it's imagining it anyway.\n\n0:26:23\tSPEAKER_04\n And then I figured that out of that group, there would be a subset who would go, you know, I'm really not sure about this section here. And then that group would need it.\n\n0:26:32\tSPEAKER_04\n It seems like, if I'm right in that, it seems like you're setting it up for the most infrequent case rather than for the most frequent case.\n\n0:26:42\tSPEAKER_04\n So that now we have to worry about, we'll see if we're going to talk about all these passwords for different people.\n\n0:26:48\tSPEAKER_07\n For the most frequent case, they just say, it's okay. And then they're done. And I think almost everyone would rather do that by email than any other method.\n\n0:26:58\tSPEAKER_02\n The other thing too is, it seems like.\n\n0:27:01\tSPEAKER_07\n Because you don't have to visit the web page if you don't want to.\n\n0:27:04\tSPEAKER_04\n I guess, yeah, I guess we don't need their signature. I guess an email.\n\n0:27:08\tSPEAKER_07\n Oh, that was another thing. I had assumed that we didn't need their signature, that an email approval was sufficient.\n\n0:27:15\tSPEAKER_06\n Are people going to be allowed to leap out sections of a meeting where they weren't speaking?\n\n0:27:22\tSPEAKER_06\n Yes.\n\n0:27:26\tSPEAKER_07\n If someone feels strongly enough about it, then I think they should be allowed to do that.\n\n0:27:32\tSPEAKER_06\n So that means other people are editing what you say.\n\n0:27:34\tSPEAKER_06\n I don't know about that.\n\n0:27:36\tSPEAKER_06\n I don't know if I like that.\n\n0:27:37\tSPEAKER_07\n Well, the only other choice is that the person would say, no, don't distribute this meeting at all. And I would rather they were able to edit out other people than just said, don't distribute it at all.\n\n0:27:47\tSPEAKER_04\n But what they signed in the consent form was something that said, you can use my voice.\n\n0:27:55\tSPEAKER_07\n Well, but if someone is having a conversation and you only bleep out one side of it, that's not sufficient.\n\n0:28:02\tSPEAKER_04\n Yeah, but that's our decision, right?\n\n0:28:04\tSPEAKER_07\n I don't think so. Because if I object to the conversation, if I say we were having a conversation, and I consider that conversation private, and I consider that your side of it is enough for other people to infer.\n\n0:28:18\tSPEAKER_07\n I want to be able to bleep out your side.\n\n0:28:20\tSPEAKER_02\n I agree that the consent forms were, I agree with what Adam's saying, that the consent form did leave open this possibility that they could edit things which they found offensive.\n\n0:28:31\tSPEAKER_02\n And the other thing is from the standpoint of the lawyer, but it strikes me that we wouldn't want someone to say, oh yes, I was a little concerned about it, but it was too hard to access.\n\n0:28:44\tSPEAKER_02\n So I think it's kind of nice to have this facility to listen to it, not in terms of like editing it by hand.\n\n0:28:51\tSPEAKER_02\n I think it's, some people would find that easier to specify the bleep part by having a document they edited, but it seems to me that sometimes, you know, if the person had a bad day and they had a tone in their voice that they didn't really like, you know, it's nice to be able to listen to it, be sure that that was okay.\n\n0:29:09\tSPEAKER_07\n Yeah, I can certainly provide a printable version if people want it.\n\n0:29:12\tSPEAKER_04\n And it's also a mixture of people. I mean, some people are, do their work primarily by sitting at the computer and flipping around the web and others do not.\n\n0:29:21\tSPEAKER_04\n Others would consider it a set of skills that they would have to gain.\n\n0:29:27\tSPEAKER_07\n Well, I think most of the people in the meetings are the former so far.\n\n0:29:32\tSPEAKER_04\n Yeah, the meeting so far. Yeah, but we're trying to expand this, right?\n\n0:29:36\tSPEAKER_04\n So I absolutely think that papers, the more universal thing. Well, but if they want to print it out, that's all right. I think everyone in the meeting can access the web.\n\n0:29:45\tSPEAKER_04\n No, I think we have to be able to print it out. It's not just if they want to print it out.\n\n0:29:49\tSPEAKER_07\n Okay, so does that mean that I can't use email? Or what?\n\n0:29:53\tSPEAKER_02\n Because you can send a through email, I think.\n\n0:29:56\tSPEAKER_07\n Well, I don't think I, well, I don't think we can send the text through email because of the privacy issues.\n\n0:30:02\tSPEAKER_07\n So giving them, you think a website to say if you want to print it out here, it is not sufficient.\n\n0:30:08\tSPEAKER_04\n Certainly for everybody who's been in the meeting so far would be sufficient.\n\n0:30:12\tSPEAKER_07\n Yeah, I'm just thinking for people that that's not sufficient for what the only sufficient thing would be for me to walk up to them and hand it to them.\n\n0:30:19\tSPEAKER_02\n It may not be. It's equivalent.\n\n0:30:22\tSPEAKER_02\n I think it's easier to put the box back.\n\n0:30:26\tSPEAKER_01\n Just put the button on the web page, which say please send me the scripts.\n\n0:30:30\tSPEAKER_01\n That's interesting.\n\n0:30:33\tSPEAKER_06\n When you display it on the web page, what are you showing them utterances?\n\n0:30:38\tSPEAKER_06\n And so can they bleep within an utterance?\n\n0:30:41\tSPEAKER_07\n No, whole utterances.\n\n0:30:43\tSPEAKER_07\n And that was just convenience for my sake that it's, it would end up being fairly difficult to edit the transcripts if we want to do it at the sub-eitorance level.\n\n0:30:53\tSPEAKER_07\n Because this way I can just delete an entire line out of a transcript file rather than have to do it by hand.\n\n0:31:00\tSPEAKER_04\n There's other aspect to this, which maybe is part of why it's bothering me.\n\n0:31:04\tSPEAKER_04\n I think you're really trying very hard to make this as convenient as possible for people to do this.\n\n0:31:11\tSPEAKER_07\n I mean that's why I did the web form because for me that would be my most convenient.\n\n0:31:14\tSPEAKER_07\n I know where you go.\n\n0:31:16\tSPEAKER_04\n See, because you're going to end up with all these little patchy things, where really what we want to do is have the bias towards letting it go.\n\n0:31:28\tSPEAKER_04\n Because there was one or twice in the meetings we've heard where somebody said something that they might be embarrassed by.\n\n0:31:35\tSPEAKER_04\n But overall, people are talking about technical topics.\n\n0:31:38\tSPEAKER_04\n Nobody's going to get hurt. Nobody's being liable.\n\n0:31:42\tSPEAKER_04\n We're playing the lawyers game and we're looking for the extreme case.\n\n0:31:48\tSPEAKER_04\n If we really orient it towards that extreme case, make it really easy.\n\n0:31:51\tSPEAKER_04\n We're going to end up encouraging the headache.\n\n0:31:54\tSPEAKER_04\n I think that's sort of psyching myself out here.\n\n0:31:59\tSPEAKER_07\n I guess I don't see having a few phrases here and there in a meeting being that much of a headache.\n\n0:32:04\tSPEAKER_07\n Well, so.\n\n0:32:06\tSPEAKER_06\n I think what Morgan's saying is that easier it is the more it's going to be bleeped.\n\n0:32:09\tSPEAKER_04\n And it really depends on what kind of research you're doing.\n\n0:32:12\tSPEAKER_04\n I think some researchers who are going to be working with this group as years from now are really going to be cursing the fact that there's a bunch of stuff in there that's missing from the dialogue.\n\n0:32:21\tSPEAKER_04\n It depends on the kind of research they're doing, but it might be really a pain.\n\n0:32:27\tSPEAKER_04\n And where it's really going to hurt somebody in some way, the one who said it or someone who's being spoken about, we definitely want to allow the option of being bleeped out.\n\n0:32:37\tSPEAKER_04\n But I really think we want to make it the rare incidence.\n\n0:32:41\tSPEAKER_04\n And I'm just a little worried about making it so easy for people to do and so much fun.\n\n0:32:47\tSPEAKER_04\n But they're going to go through and bleep that stuff.\n\n0:32:50\tSPEAKER_04\n I think I'm bleeped out stuff they don't like too, right?\n\n0:32:52\tSPEAKER_04\n Somebody else, as you say, you know?\n\n0:32:54\tSPEAKER_07\n Well, I don't see any way of avoiding that.\n\n0:32:57\tSPEAKER_07\n We have promised that we will try them to transcript them that they can remove parts that they don't like.\n\n0:33:02\tSPEAKER_07\n Yeah, so that the...\n\n0:33:04\tSPEAKER_04\n No, no, no. The only question is...\n\n0:33:07\tSPEAKER_04\n It doesn't mean to that, but I just think that we should make it harder to do.\n\n0:33:10\tSPEAKER_07\n The problem is if it's harder for them, it's also harder for me.\n\n0:33:13\tSPEAKER_07\n Whereas this web interface, I just get email, it's all formatted, it's all ready to go.\n\n0:33:17\tSPEAKER_04\n So maybe you don't get the access to the web interface unless they really need it.\n\n0:33:21\tSPEAKER_04\n Oh, I can...\n\n0:33:22\tSPEAKER_04\n So, I'm sorry. So maybe this is a way out of it.\n\n0:33:25\tSPEAKER_04\n You've provided something that's useful for you to handle and useful for someone else if they need it.\n\n0:33:32\tSPEAKER_04\n But I think the issue of privacy and ease and so forth should be that they get access to this if they really need it.\n\n0:33:39\tSPEAKER_06\n So you're saying the sequence would be more like...\n\n0:33:42\tSPEAKER_06\n First Adam goes to the contact lists, contacts them, whatever their preferred method is, to see if they want to review the meeting.\n\n0:33:49\tSPEAKER_06\n Right.\n\n0:33:50\tSPEAKER_06\n And then if they don't, you're done.\n\n0:33:52\tSPEAKER_06\n If they do, then he provides them access to the website.\n\n0:33:55\tSPEAKER_07\n Well, to some extent, I have to do it anyway because as I said, we have to distribute passwords.\n\n0:33:59\tSPEAKER_04\n But you don't necessarily have to distribute passwords, that's what I'm saying.\n\n0:34:04\tSPEAKER_07\n Well, but only if they...\n\n0:34:06\tSPEAKER_07\n What I'm saying is that I can't just email them the password because that's not secure.\n\n0:34:09\tSPEAKER_04\n No, no, no, but you have to call me and ask.\n\n0:34:11\tSPEAKER_04\n Right.\n\n0:34:12\tSPEAKER_04\n But we don't even necessarily need to end up distributing passwords at all.\n\n0:34:17\tSPEAKER_07\n Well, we do because of privacy. We can't just make it openly available.\n\n0:34:20\tSPEAKER_04\n No, no, you're missing the point.\n\n0:34:22\tSPEAKER_04\n We're trying to make it less of an obvious, just fall off a log to do this.\n\n0:34:29\tSPEAKER_02\n Not everyone gets a password.\n\n0:34:31\tSPEAKER_04\n Right.\n\n0:34:32\tSPEAKER_04\n So what I would see is that first you contact them and ask them if they would like to review it, or to check for it, not just for fun.\n\n0:34:40\tSPEAKER_04\n Okay.\n\n0:34:41\tSPEAKER_04\n But to check this for things that they're worried about having said, or if they're willing to just send approval from their memory.\n\n0:34:49\tSPEAKER_04\n And we should think carefully, actually, we should review, go through how that's worded.\n\n0:34:56\tSPEAKER_04\n Okay.\n\n0:34:57\tSPEAKER_04\n Then if someone wants to review it, and I know you don't like this, but I'm offering this as a suggestion, is that we then give them a printout.\n\n0:35:06\tSPEAKER_04\n And then if they say that I have a potential problem with these things, then you say, okay, well, you might want to hear this in context.\n\n0:35:14\tSPEAKER_04\n I think if you need that, you issue them a password.\n\n0:35:17\tSPEAKER_07\n The problem with what you're suggesting is it's not just inconvenient for them.\n\n0:35:20\tSPEAKER_07\n It's inconvenient for me, because that means multiple contacts every time, for every single meeting, every time anyone wants anything.\n\n0:35:28\tSPEAKER_07\n I would much prefer to have it all be automatic.\n\n0:35:31\tSPEAKER_07\n They visit the website if they want to.\n\n0:35:33\tSPEAKER_07\n Obviously they don't have to.\n\n0:35:35\tSPEAKER_04\n I know you prefer it, but the problem is there's a problem.\n\n0:35:37\tSPEAKER_07\n So I think you're thinking people are going to arbitrarily start bleeping, and I just don't think that's going to happen.\n\n0:35:42\tSPEAKER_02\n I'm also concerned about the spirit of the event.\n\n0:35:45\tSPEAKER_02\n I think it's important to want something, because I think if they feel that it's...\n\n0:35:49\tSPEAKER_02\n If it turns out that something gets published in this corpus, that someone really should have eliminated and didn't detect, then it could have been because of their own negligence that they didn't pursue that next level and get the password and do that.\n\n0:36:03\tSPEAKER_02\n But they might be able to argue, oh well, it was cumbersome, and I was busy, and it was going to take me too much time to trace it down, so it could be that the burden would come back on to a song a little bit worried about making it harder.\n\n0:36:15\tSPEAKER_04\n Where you can go to far in that direction, you need to find somewhere between, I think.\n\n0:36:19\tSPEAKER_07\n It seems to me that sending the email, saying, if you have an okay, reply to this email and say, okay, if you have a problem with it, contact me, and I'll give you a password.\n\n0:36:28\tSPEAKER_07\n It seems like it's a perfectly reasonable compromise, and if they want to print out, they can print it out themselves.\n\n0:36:34\tSPEAKER_07\n Well, we can print it up for them, let me give you off of that.\n\n0:36:37\tSPEAKER_02\n But there's another aspect of that, and that is that in the informed consent form, my impression is that we offered them, at the very least, that they definitely would have access to the transcript.\n\n0:36:47\tSPEAKER_02\n And I know that there's a chance of really skipping that stage.\n\n0:36:51\tSPEAKER_02\n I thought that maybe I'm a sort of turpid, and what you said about this.\n\n0:36:55\tSPEAKER_04\n Having access to it doesn't necessarily mean having it.\n\n0:36:58\tSPEAKER_04\n Having it.\n\n0:36:59\tSPEAKER_04\n Having the correct answer.\n\n0:37:00\tSPEAKER_07\n Well, the consent form is right in there, if anyone wants to look at it.\n\n0:37:03\tSPEAKER_07\n You want me to grab it?\n\n0:37:05\tSPEAKER_07\n Yeah, but you're wired.\n\n0:37:07\tSPEAKER_04\n I asked you.\n\n0:37:12\tSPEAKER_04\n Yeah, I mean, I don't want to fool them.\n\n0:37:14\tSPEAKER_04\n I just meant that every, anytime you say anything to anyone, there is, in fact, a bias that is presented.\n\n0:37:21\tSPEAKER_07\n If you agree to participate, you'll have the opportunity to have anything x-anything excised, which you would prefer not to have included in the data set.\n\n0:37:28\tSPEAKER_07\n Once the transcript is available, we will ask your permission to include the data in the corpus for the larger research community.\n\n0:37:33\tSPEAKER_07\n There, again, you will be allowed to indicate any sections that you'd prefer to have x-ays from the database, and they will remove both from the transcript and the recording.\n\n0:37:41\tNone\n Well, that's more open than I realized.\n\n0:37:43\tSPEAKER_07\n Well, I mean, the one question is definitely clear, anything, as opposed to just what you said.\n\n0:37:48\tSPEAKER_02\n Yeah, I know that.\n\n0:37:49\tSPEAKER_02\n That's more severe, but the next one says the transcript will be around, and it's really, say, we'll send it to you, or it'll be available to you on the web.\n\n0:37:56\tSPEAKER_06\n Thank you.\n\n0:37:57\tSPEAKER_06\n I hope it leaves it open.\n\n0:37:58\tSPEAKER_02\n How do we get it to that?\n\n0:37:59\tSPEAKER_02\n It leaves it open.\n\n0:38:00\tSPEAKER_02\n It means also we don't have to give it to him.\n\n0:38:03\tSPEAKER_07\n They just have to make sure that it is available to them.\n\n0:38:06\tSPEAKER_02\n Is it able to, if they ask?\n\n0:38:08\tSPEAKER_04\n Yeah.\n\n0:38:09\tSPEAKER_04\n Okay, so I think I have an idea that maybe you satisfy both you and me in this, which is, we just go over carefully how these notes to people are worded.\n\n0:38:19\tSPEAKER_04\n So I just wanted to be worded in such a way where it gives the strong impression, gives very, I mean, nothing hidden, very strongly, the bias, that we would really like to use all of these data.\n\n0:38:31\tSPEAKER_04\n Right. That we really would rather it wasn't a patchwork of things tossed out, that it would be better for our field if that is the case.\n\n0:38:42\tSPEAKER_04\n But if you really think something is going to, and I don't think there's anything in legal aspects that is hurt by our expressing that bias.\n\n0:38:51\tSPEAKER_04\n Great, great.\n\n0:38:52\tSPEAKER_04\n And then my concern about, which, you know, you might be right, it maybe was just paranoia in my part, but people just, it's, I'm not worried about you making this interface so much fun, and people start bleeping stuff out just because they can't.\n\n0:39:05\tSPEAKER_07\n It's just a checkbox, that's to the text, it's not any fun at all.\n\n0:39:10\tSPEAKER_04\n Why do I kind of had fun when you played me something was bleeped out, you know?\n\n0:39:15\tSPEAKER_07\n Well, but they won't get that feedback.\n\n0:39:17\tSPEAKER_07\n No, because it does not automatically bleep it at the time.\n\n0:39:20\tSPEAKER_07\n It just sends me, right?\n\n0:39:22\tSPEAKER_07\n Oh, good.\n\n0:39:23\tSPEAKER_07\n It just sends me the time intervals, and then at some point, I'm going to break them all and put bleeps.\n\n0:39:28\tSPEAKER_07\n I mean, I don't want to do that yet until we actually release the data because then we have to have two copies of every meeting, and we're already short on disk space.\n\n0:39:36\tSPEAKER_07\n Yeah.\n\n0:39:37\tSPEAKER_07\n So I want to, I just keep the times until we actually want to release the data, and then we bleep it.\n\n0:39:43\tSPEAKER_04\n Okay.\n\n0:39:44\tSPEAKER_04\n Alright, so I think, yeah, so if we have, again, let's, you know, sort of circulate the wording on each of these things and get it right.\n\n0:39:51\tSPEAKER_07\n Well, since you seem to feel strong as to about it, would you like to do the first pass?\n\n0:39:56\tSPEAKER_07\n Okay.\n\n0:39:58\tSPEAKER_04\n Fair enough.\n\n0:40:00\tSPEAKER_04\n Fair enough.\n\n0:40:01\tSPEAKER_04\n Fair enough.\n\n0:40:02\tSPEAKER_02\n There's this other question, a legal question that I answered about whether we need a concrete signature or, you know, it suffices or whatever.\n\n0:40:10\tNone\n I don't know how that works.\n\n0:40:11\tSPEAKER_02\n And there's something down there about if you...\n\n0:40:13\tSPEAKER_04\n I don't think so.\n\n0:40:15\tSPEAKER_04\n I thought about it with one of my background processes, and it's fine to do the email.\n\n0:40:22\tSPEAKER_07\n Okay.\n\n0:40:24\tSPEAKER_07\n Because they're signing here that they're agreeing to the paragraph, which says, you'll be given an opportunity.\n\n0:40:29\tSPEAKER_07\n Yeah.\n\n0:40:30\tSPEAKER_07\n And so I don't think they need another signature.\n\n0:40:32\tSPEAKER_04\n Well, and furthermore, I, it's now fairly routine in a lot of arrangements that I do with people on contracts and so forth, that, that, if it's, if it's that sort of thing where you're, you're saying, okay, I agree, we want 80 hours of this person that's such a mouth, and I agree that's okay.\n\n0:40:48\tSPEAKER_04\n If it's a follow-up to some other agreement where there's a signature, it's often done in email now.\n\n0:40:53\tSPEAKER_04\n So it's okay.\n\n0:40:59\tSPEAKER_07\n So I guess I probably should at the minimum think about how to present it in a printed form.\n\n0:41:07\tSPEAKER_07\n I'm not really sure what's best with that.\n\n0:41:09\tSPEAKER_07\n The problem is a lot of them are really short, and so I don't necessarily want to do one per line, but I don't know how else to do it.\n\n0:41:16\tSPEAKER_02\n I also have this.\n\n0:41:17\tSPEAKER_02\n I think it's nice you have a view of her here on the web for those who might wonder about non-briple sign.\n\n0:41:25\tSPEAKER_02\n I mean, I agree that our bias should be, as I expressed here.\n\n0:41:29\tSPEAKER_02\n But I think it's nice to a person could check, because sometimes, you know, the words on the page come out sounding different terms of social dynamics at the end of the year.\n\n0:41:38\tSPEAKER_02\n And I realize we shouldn't emphasize that people shouldn't borrow travel.\n\n0:41:42\tSPEAKER_07\n I think actually, my opinion probably is that the only time someone who will need to listen to it is if the transcript is not good, you know, if there are lots of mumbles in parentheses and things like that.\n\n0:41:54\tSPEAKER_02\n Or what if there was an error in the transcript?\n\n0:41:56\tSPEAKER_02\n Right.\n\n0:41:57\tSPEAKER_02\n Didn't get detected, and there was a whole segment against some personal.\n\n0:42:03\tSPEAKER_07\n That was all mumbled.\n\n0:42:04\tSPEAKER_07\n I think Microsoft is really.\n\n0:42:06\tSPEAKER_07\n Exactly.\n\n0:42:07\tNone\n Sorry, transcripters.\n\n0:42:08\tSPEAKER_02\n Or even there was a line, you know, about how Bill Gates and I know.\n\n0:42:12\tSPEAKER_02\n But it was all, the words were all visible, but they didn't end up.\n\n0:42:16\tSPEAKER_07\n They're going to hate this meeting.\n\n0:42:18\tSPEAKER_07\n Yeah.\n\n0:42:19\tSPEAKER_07\n Actually, Liz will like it, you know.\n\n0:42:20\tSPEAKER_07\n But this will like it.\n\n0:42:21\tSPEAKER_04\n We had pretty strong agreement going on.\n\n0:42:22\tSPEAKER_07\n Yeah, that's right.\n\n0:42:23\tSPEAKER_02\n So I don't know.\n\n0:42:26\tSPEAKER_02\n I guess we're assuming that the transcript is close to an approximation and that my double checking will be so close to absolutely perfect that nothing will slip behind.\n\n0:42:37\tSPEAKER_04\n But something might sometime.\n\n0:42:40\tSPEAKER_04\n If it's something that they said, they might, I mean, you might be very accurate in putting down what they actually said.\n\n0:42:48\tSPEAKER_04\n But when they hear it themselves, they may hear something different because they know what they're meant.\n\n0:42:54\tSPEAKER_04\n I don't know how to note it.\n\n0:43:01\tNone\n Sarcasm.\n\n0:43:03\tSPEAKER_06\n How do you indicate Sarcasm?\n\n0:43:05\tSPEAKER_06\n No, I'm serious.\n\n0:43:07\tSPEAKER_04\n So we might get some feedback from people that such and such was, not really what I said.\n\n0:43:16\tSPEAKER_07\n Well, that would be good to get that.\n\n0:43:18\tSPEAKER_07\n Yeah, sure.\n\n0:43:19\tSPEAKER_07\n Just for corrections.\n\n0:43:20\tSPEAKER_07\n Yeah.\n\n0:43:21\tSPEAKER_07\n So in terms of password distribution, I think phone is really the only way to do it, phone an in person.\n\n0:43:26\tSPEAKER_07\n Yeah.\n\n0:43:27\tSPEAKER_07\n Or mail, physical mail.\n\n0:43:28\tSPEAKER_07\n We can have their voice mail.\n\n0:43:29\tSPEAKER_07\n Any sub word level.\n\n0:43:30\tSPEAKER_07\n Any sub word?\n\n0:43:31\tSPEAKER_07\n Yeah.\n\n0:43:32\tSPEAKER_07\n Okay.\n\n0:43:34\tSPEAKER_07\n I mean, you could do it with PGP or things like that, but it's too complex.\n\n0:43:38\tSPEAKER_02\n I just realized something, which is this question about the possible mismatch of, I mean, well, and actually also the lawyer is saying that we shouldn't really have them, have the people believing that they will be cleared by our checks.\n\n0:43:56\tSPEAKER_02\n So it's like, in a way, it's nice to have the responsibility still on them to listen to the tape and hear the transcript to have that be.\n\n0:44:06\tSPEAKER_04\n Well, yeah, but you can't, I mean, most people will not want to take the time to do that.\n\n0:44:12\tSPEAKER_04\n Yeah.\n\n0:44:13\tSPEAKER_02\n Okay, sure.\n\n0:44:14\tSPEAKER_02\n And they're observing the responsibility.\n\n0:44:15\tSPEAKER_02\n And they have to.\n\n0:44:16\tSPEAKER_02\n So it's not, yeah, good.\n\n0:44:17\tSPEAKER_04\n But I mean, if you write a meeting and you don't think at least that you said anything funny and the meeting was about, you know, some funny thing about semantics or something, or you probably won't listen to it.\n\n0:44:33\tSPEAKER_02\n It is true that the content is technical, and so we're not having these discussions, which I mean, when I listen to these things, I don't find things that are questionable.\n\n0:44:42\tSPEAKER_02\n Yeah.\n\n0:44:43\tSPEAKER_02\n People's speech are in my own way.\n\n0:44:44\tSPEAKER_04\n You think of Bebe Rare?\n\n0:44:45\tSPEAKER_04\n I mean, we're not talking about the energy crisis or something.\n\n0:44:48\tSPEAKER_04\n Man.\n\n0:44:49\tSPEAKER_07\n How about them energy crises?\n\n0:44:52\tSPEAKER_07\n Yeah.\n\n0:44:57\tSPEAKER_04\n I think we're done.\n\n0:44:59\tSPEAKER_04\n Kind of done.\n\n0:45:00\tSPEAKER_04\n Actually, I was kind of, did you have anything going on?\n\n0:45:03\tSPEAKER_00\n Not really.\n\n0:45:04\tSPEAKER_00\n No, my project is going along, but I really just shared to follow the project, the overall progress.\n\n0:45:11\tSPEAKER_00\n I don't really have anything specific to talk about.\n\n0:45:15\tSPEAKER_04\n Is there more to talk about?\n\n0:45:17\tSPEAKER_04\n No, okay.\n\n0:45:18\tSPEAKER_04\n You know, I've made things.\n\n0:45:20\tSPEAKER_04\n Transcribers, he was rattling in the barbells in his brain.\n\n0:45:27\tSPEAKER_07\n So we did digits?\n\n0:45:29\tSPEAKER_07\n Oh, yeah.\n\n0:45:30\tSPEAKER_07\n Oh, by the way, I did find a bunch.\n\n0:45:32\tSPEAKER_07\n We should count out how many more digits to forms do we have back there?\n\n0:45:35\tSPEAKER_07\n Quite a few.\n\n0:45:36\tSPEAKER_07\n That's what I thought.\n\n0:45:37\tSPEAKER_07\n I was going through them all, and I found actually a lot filed in with them that were blanks that no one had actually read.\n\n0:45:43\tSPEAKER_07\n And so we still have more than I thought we did.\n\n0:45:45\tSPEAKER_07\n Okay.\n\n0:45:46\tSPEAKER_07\n So we have a few more digits before we're done.\n\n0:45:48\tSPEAKER_07\n So transcript 30113030.\n\n0:45:52\tSPEAKER_07\n 9858-001-207-4241866-54622-63781168889869-0090-1194-254-34689266.\n\n0:46:17\tSPEAKER_07\n 4901 correction 4905708467075793.\n\n0:46:29\tSPEAKER_06\n Transcript 3531-355090111914700226351839556.\n\n0:46:46\tSPEAKER_06\n 6, 7, 9253-05564-0549014234-6287256-8709873450.\n\n0:47:10\tSPEAKER_04\n Transcript 2851-2870.\n\n0:47:15\tSPEAKER_04\n 2390392-377-485-6282864-950-0712-0972-192-305-5165-7769-88409-00.\n\n0:47:44\tSPEAKER_04\n 0, 0, 0, 2, 4, 2, 1.\n\n0:47:50\tSPEAKER_02\n Transcript 2631-265-0.\n\n0:47:55\tSPEAKER_02\n 300-514-066-225-6773-89181-910-227-003245-02426-599-67.\n\n0:48:19\tSPEAKER_02\n 7, 8, 0, 2, 5, 0135655-04310-1756-2949578-3990467.\n\n0:48:36\tSPEAKER_01\n Transcript 2411-243057844-69621-78901-1286-235-2027-3951-45656-81396204-0801407-0166.\n\n0:49:05\tSPEAKER_01\n 2667-1123-5263.\n\n0:49:15\tSPEAKER_00\n Transcript 3211-3230-60811-95103060502020231-22810308-207.\n\n0:49:32\tSPEAKER_00\n 32308-228-5215-6274-3248-9880010-0252036-4833-00157076.\n\n0:49:59\tSPEAKER_06\n loop wasn't\n\n", "summary": [{"summary_text": "There was no front-end meeting today. Speaker wants to know how they're going to get people to edit bleeps parts of the meeting that they don't want to include. He also wants to have a discussion about where they are on recording transcription."}]}