{"filename": "./data/Bmr016.txt", "transcript": "0:00:00\tSPEAKER_06\n And we already got the crash out of the way.\n\n0:00:03\tSPEAKER_06\n It did crash, so I feel much better earlier.\n\n0:00:06\tSPEAKER_06\n Interesting.\n\n0:00:07\tSPEAKER_07\n Get the door.\n\n0:00:13\tSPEAKER_05\n Hey.\n\n0:00:14\tSPEAKER_05\n So I did collect an agenda.\n\n0:00:16\tSPEAKER_06\n I did collect an agenda.\n\n0:00:18\tSPEAKER_06\n So I'm going to go first.\n\n0:00:20\tSPEAKER_06\n Well, it shouldn't take too long.\n\n0:00:22\tSPEAKER_06\n So we're pretty much out of digits.\n\n0:00:24\tSPEAKER_06\n We've gone once through the set.\n\n0:00:26\tSPEAKER_06\n So the only thing I have to do, that's right.\n\n0:00:29\tSPEAKER_06\n So I just have to go through them and pick out the ones that have problems and either correct them or have them reread.\n\n0:00:39\tSPEAKER_06\n So we probably have like four or five more forms to be read to be once through the set.\n\n0:00:44\tSPEAKER_06\n I've also extracted out about an hour's worth.\n\n0:00:47\tSPEAKER_06\n We have about two hours worth.\n\n0:00:49\tSPEAKER_06\n I extracted about an hour's worth, which are the digits for which whose speaker have speaker forms, have filled out speaker forms.\n\n0:00:57\tSPEAKER_06\n Not everyone's filled out a speaker form.\n\n0:00:58\tSPEAKER_06\n So I extracted one for speakers who have speaker forms and for meetings in which the key file and the transcript files are possible.\n\n0:01:07\tSPEAKER_06\n Some of the early key files it looks like were done by hand.\n\n0:01:10\tSPEAKER_06\n And so they're not automatically possible, and I have to go back and fix those.\n\n0:01:13\tSPEAKER_06\n So what that means is we have about an hour of transcribed digits that we can play with.\n\n0:01:22\tSPEAKER_07\n Liz.\n\n0:01:23\tSPEAKER_07\n I think two hours is the total value.\n\n0:01:25\tSPEAKER_07\n Yeah.\n\n0:01:26\tSPEAKER_07\n Yeah.\n\n0:01:27\tSPEAKER_07\n And you can go to the question, all these different things that are not quite right, but you can go to the other three or the other hour.\n\n0:01:33\tSPEAKER_06\n Yes, absolutely.\n\n0:01:34\tSPEAKER_06\n So that's just a question of a little hand editing of some files and then waiting for more people to turn in their speaker forms.\n\n0:01:40\tSPEAKER_06\n I have this web-based speaker form, and I sent mail to everyone who hadn't filled out a speaker form, and they're slowly trickling in.\n\n0:01:47\tSPEAKER_07\n So the relevance of the speaker form here\n\n0:01:49\tSPEAKER_06\n is for labeling the extracted audio files. Oh, OK.\n\n0:01:53\tSPEAKER_06\n By speaker ID and microphone type.\n\n0:01:56\tSPEAKER_07\n Permission to use their digits.\n\n0:01:57\tSPEAKER_06\n No, I spoke with Jane about that, and we sort of decided that it's probably not an issue, that we edit out any of the errors anyway.\n\n0:02:05\tSPEAKER_06\n So there are no errors in the digits.\n\n0:02:07\tSPEAKER_06\n You always read the string correctly.\n\n0:02:10\tSPEAKER_06\n So I can't imagine why anyone would care.\n\n0:02:13\tSPEAKER_06\n So the other topic with digits is, Liz would like to elicit different prosotics.\n\n0:02:21\tSPEAKER_06\n And so we tried last week with them written out in English, and it just didn't work at all, because no one grouped them together.\n\n0:02:29\tSPEAKER_06\n So it just sounded like many, many more lines instead of anything else.\n\n0:02:33\tSPEAKER_06\n So in conversations with Liz and Jane, we decided that if you wrote them out as numbers instead of words, it would elicit more phone number, social security number, like readings.\n\n0:02:45\tSPEAKER_06\n The problem with that is it becomes numbers instead of digits.\n\n0:02:48\tSPEAKER_06\n When I look at this, that first line is 61, 62, 18, 86, 10.\n\n0:02:53\tSPEAKER_06\n And so the question is, does anyone care?\n\n0:02:56\tSPEAKER_06\n I've already spoken with Liz, and she feels that, correct me if I'm wrong, that for her connected numbers is fine, as opposed to connected digits.\n\n0:03:05\tSPEAKER_06\n I think two hours is probably fine for test set, but it may be a little short if we actually want to do training and adaptation and all that other stuff.\n\n0:03:13\tSPEAKER_07\n Yeah.\n\n0:03:15\tSPEAKER_07\n Do you want different prasadics?\n\n0:03:18\tSPEAKER_07\n So if you always had the same group, things you wouldn't like that, is that correct?\n\n0:03:22\tSPEAKER_04\n Well, we actually figured out a way to do the groupings are randomly generated.\n\n0:03:26\tSPEAKER_07\n No, but I was asking if that was something you really cared about, because if it wasn't, it seems to me if you made it really specifically telephone groupings that maybe people wouldn't bring with a number so much.\n\n0:03:41\tSPEAKER_07\n You know, if it is a bit...\n\n0:03:42\tSPEAKER_04\n They may still do it.\n\n0:03:44\tSPEAKER_04\n Maybe some.\n\n0:03:45\tSPEAKER_08\n What about putting a hyphen between the numbers in the group?\n\n0:03:48\tSPEAKER_07\n So if you have six-1, you mean?\n\n0:03:51\tSPEAKER_07\n If you go six-6-6-2931.\n\n0:03:57\tSPEAKER_04\n Well, OK, it might help.\n\n0:03:59\tSPEAKER_04\n I would like to get away from having only one specific grouping.\n\n0:04:04\tSPEAKER_04\n So if that's your question.\n\n0:04:06\tSPEAKER_04\n But it seems to me that at least for us, we can learn to read the math digits.\n\n0:04:12\tSPEAKER_04\n If that's what people want.\n\n0:04:13\tSPEAKER_04\n I don't think that'd be that hard.\n\n0:04:15\tSPEAKER_04\n I agree.\n\n0:04:15\tSPEAKER_04\n To read the math single digits.\n\n0:04:18\tSPEAKER_04\n And it seems like that might be better for you guys, since then you'll have just more digit data.\n\n0:04:24\tSPEAKER_04\n And that's always a good thing.\n\n0:04:26\tSPEAKER_04\n It's a little bit better for me, too, because the digits are easier to recognize.\n\n0:04:30\tSPEAKER_04\n They're better trained than the numbers.\n\n0:04:31\tSPEAKER_06\n So we could just put in the instructions\n\n0:04:35\tSPEAKER_04\n with the math digits. Right.\n\n0:04:37\tSPEAKER_04\n Read the math single digits.\n\n0:04:38\tSPEAKER_04\n So 61 was read as 6-1.\n\n0:04:40\tSPEAKER_04\n And if people make a mistake, we...\n\n0:04:42\tSPEAKER_06\n So versus 0.\n\n0:04:44\tSPEAKER_07\n I mean, the other thing is we could just beg it because it's worrying about it.\n\n0:04:48\tSPEAKER_07\n I mean, because we do have digits training data that we have from OGI.\n\n0:04:53\tSPEAKER_07\n I'm sorry, it's numbers training data that we have from OGI.\n\n0:04:56\tSPEAKER_07\n We've done lots and lots of studies with that.\n\n0:04:58\tSPEAKER_07\n And...\n\n0:04:59\tSPEAKER_04\n But it's nice to get it in this room with the...\n\n0:05:02\tNone\n Yeah.\n\n0:05:02\tSPEAKER_04\n...accus.\n\n0:05:03\tSPEAKER_07\n No, no, I guess what I'm saying is that...\n\n0:05:05\tSPEAKER_06\n Just let them read it.\n\n0:05:06\tSPEAKER_07\n How they read it.\n\n0:05:07\tSPEAKER_07\n Just read it.\n\n0:05:08\tSPEAKER_07\n How they read it.\n\n0:05:09\tSPEAKER_07\n And just means we have to expand our vocabulary out to...\n\n0:05:13\tSPEAKER_04\n Well, that's fine with me.\n\n0:05:14\tSPEAKER_04\n As long as it's just that I didn't want to cause the people who would have been collecting digits the other way to not have the digits.\n\n0:05:21\tSPEAKER_04\n So...\n\n0:05:22\tSPEAKER_07\n We can go back to the other thing later.\n\n0:05:24\tSPEAKER_07\n I mean, we...\n\n0:05:25\tSPEAKER_07\n OK.\n\n0:05:26\tSPEAKER_07\n We can do this for a while and then go back to digits for a while.\n\n0:05:29\tSPEAKER_07\n OK.\n\n0:05:31\tSPEAKER_07\n Yeah, I mean, you want this...\n\n0:05:34\tSPEAKER_07\n Do you need training data or adaptation data or this?\n\n0:05:36\tSPEAKER_07\n How much of this do you need with the...\n\n0:05:41\tSPEAKER_04\n It's actually unclear right now.\n\n0:05:43\tSPEAKER_04\n I just thought, well, if we're collecting digits and add them, it's that we were running out of the TI forms.\n\n0:05:48\tSPEAKER_04\n I thought it'd be nice to have them in groups.\n\n0:05:51\tSPEAKER_04\n And probably, all else being equal, it'd be better for me to just have single digits since...\n\n0:05:56\tSPEAKER_04\n OK.\n\n0:05:57\tSPEAKER_04\n...you know, I recognize it's going to do better on those anyway.\n\n0:06:01\tSPEAKER_04\n And it's more predictable.\n\n0:06:02\tSPEAKER_04\n So we can know from the transcript what the person said and the transcriber in general.\n\n0:06:06\tSPEAKER_04\n But if they make mistakes, it's no big deal.\n\n0:06:08\tSPEAKER_04\n If people say 100 instead of 100 and also maybe we can just let them choose 0 versus 0 as they like.\n\n0:06:16\tSPEAKER_04\n Because even the same person sometimes says 0 and sometimes 0 in different contexts and that's sort of interesting.\n\n0:06:23\tSPEAKER_04\n So I don't have a specific need because if I did, I'd probably try to collect it without bothering this group.\n\n0:06:31\tSPEAKER_04\n But if we can try...\n\n0:06:33\tSPEAKER_06\n So I can just add to the instructions to read it as digits.\n\n0:06:36\tSPEAKER_04\n Right.\n\n0:06:36\tSPEAKER_04\n And you can give an example like, you know, 6-61 would be read as 6-1.\n\n0:06:42\tSPEAKER_04\n Right.\n\n0:06:43\tSPEAKER_00\n And actually, it's no more artificial than what we've been doing with words.\n\n0:06:46\tSPEAKER_00\n I'm sure people can adapt to this.\n\n0:06:48\tSPEAKER_00\n Right.\n\n0:06:48\tSPEAKER_00\n It's simple.\n\n0:06:49\tSPEAKER_00\n The space is already biased toward being separated.\n\n0:06:52\tSPEAKER_00\n Right.\n\n0:06:52\tSPEAKER_00\n And I know I'm going to find this easier than words.\n\n0:06:54\tSPEAKER_06\n Oh, yeah, absolutely.\n\n0:06:55\tSPEAKER_06\n Cognitively, it's much easier.\n\n0:06:56\tSPEAKER_04\n I also had a hard time with the words.\n\n0:06:58\tSPEAKER_04\n But then we went back and forth.\n\n0:06:59\tSPEAKER_04\n OK, so let's give that a try.\n\n0:07:01\tSPEAKER_06\n And is the spacing all right or do you think there should be more space between digits and groups?\n\n0:07:06\tSPEAKER_04\n I mean, what do other people think because you guys are reading them?\n\n0:07:09\tSPEAKER_00\n I think that it's fine.\n\n0:07:10\tSPEAKER_00\n To me, it looks like you've got the idea of grouping and you have the idea of separation.\n\n0:07:14\tSPEAKER_00\n And it's just a matter of the instructions.\n\n0:07:18\tSPEAKER_00\n That's right.\n\n0:07:18\tSPEAKER_00\n OK.\n\n0:07:19\tSPEAKER_06\n And I think there are about 10 different grouping patterns.\n\n0:07:21\tSPEAKER_06\n Isn't that right, Liz?\n\n0:07:23\tSPEAKER_04\n Right.\n\n0:07:23\tSPEAKER_04\n Right.\n\n0:07:24\tSPEAKER_04\n And you just, they're randomly generated and randomly assigned to digits.\n\n0:07:28\tSPEAKER_04\n I did.\n\n0:07:29\tSPEAKER_07\n So what?\n\n0:07:30\tSPEAKER_07\n I was just going to say, so we have, we've sent you 40 hours of recordings now.\n\n0:07:36\tSPEAKER_07\n And you're saying two hours is digits.\n\n0:07:38\tSPEAKER_07\n That's for the ratio.\n\n0:07:39\tSPEAKER_07\n Yeah.\n\n0:07:40\tSPEAKER_07\n 20 to 1, which I guess makes sense.\n\n0:07:43\tSPEAKER_07\n So if we did another 40 hours of recordings, then we could get a couple hours.\n\n0:07:47\tSPEAKER_07\n Right.\n\n0:07:49\tSPEAKER_07\n Yeah, like you say, I think a couple hours for a test sense, OK?\n\n0:07:53\tSPEAKER_07\n It'd be nice to get more later because we're going to use this up in some sense.\n\n0:08:00\tSPEAKER_07\n Right?\n\n0:08:01\tSPEAKER_00\n I also would like to argue for that because it seems to me that there's a real strength in having the same test replicated a whole bunch of times and adding to that basic test bank.\n\n0:08:09\tSPEAKER_00\n Right?\n\n0:08:10\tSPEAKER_00\n Because then you have more and more chances to get away from random errors.\n\n0:08:16\tSPEAKER_00\n And I think the other thing too is that right now, we have sort of a stratified sample with reference to dialect groups.\n\n0:08:22\tSPEAKER_00\n And there might be an argument to be made for for replicating all of the digits that we've done, which were done by non-native speakers, so that we have a core that totally replicates the original data set, which is totally American speakers.\n\n0:08:35\tSPEAKER_00\n And then we have these stratified additional language groups overlapping certain aspects of the database.\n\n0:08:40\tSPEAKER_06\n I think that trying to duplicate, spending too much effort trying to duplicate the existing TI digits probably isn't too worthwhile because the recording situation is so different.\n\n0:08:52\tSPEAKER_06\n It's going to be very hard to be comparable.\n\n0:08:54\tSPEAKER_00\n Except that if you have a stimuli comparable, then it says something about the contribution of setting.\n\n0:09:01\tSPEAKER_07\n But the other differences are so major.\n\n0:09:03\tSPEAKER_07\n OK.\n\n0:09:04\tSPEAKER_07\n Yeah.\n\n0:09:04\tSPEAKER_07\n Red versus not.\n\n0:09:05\tSPEAKER_07\n It's a very serious thing.\n\n0:09:07\tSPEAKER_00\n What's an example of some of the other differences?\n\n0:09:10\tSPEAKER_00\n Any other differences?\n\n0:09:11\tSPEAKER_07\n Well, individual human glottis is going to be different.\n\n0:09:16\tSPEAKER_06\n You know, there's so many things.\n\n0:09:18\tSPEAKER_06\n And not just that.\n\n0:09:19\tSPEAKER_06\n I mean, the corpus itself, we're collecting it in a red digit in a particular list.\n\n0:09:26\tSPEAKER_06\n And I'm sure that they're doing more specific stuff.\n\n0:09:29\tSPEAKER_06\n I remember correctly, it was like postman reading zip codes and things like that.\n\n0:09:33\tSPEAKER_06\n The idea did it suppose?\n\n0:09:34\tSPEAKER_06\n I thought so.\n\n0:09:35\tSPEAKER_07\n Was it red?\n\n0:09:36\tSPEAKER_07\n Yeah, I think the reading zip code stuff, you think you're going to do.\n\n0:09:38\tSPEAKER_07\n Oh, I may well be.\n\n0:09:39\tSPEAKER_07\n Yeah, not TI digits was red in red.\n\n0:09:41\tSPEAKER_06\n I haven't ever listened to TI digits.\n\n0:09:44\tSPEAKER_06\n So I don't really know how to compare this.\n\n0:09:46\tSPEAKER_06\n But regardless, it's going to be hard to compare cross-corpus.\n\n0:09:49\tSPEAKER_07\n It's different people.\n\n0:09:50\tSPEAKER_07\n This is a different thing.\n\n0:09:51\tSPEAKER_07\n And they're different circumstances, different recording, and so forth.\n\n0:09:55\tSPEAKER_07\n So it's really pretty different.\n\n0:09:56\tSPEAKER_07\n But I think the idea of using a set thing was just to give you some sort of framework so that even though you couldn't exact comparison, this is what these valid, something like group is doing.\n\n0:10:06\tSPEAKER_07\n Some kind of reference.\n\n0:10:09\tSPEAKER_08\n OK, what do the groupings represent?\n\n0:10:12\tSPEAKER_08\n You said there's like 10 different groupings.\n\n0:10:14\tSPEAKER_04\n Right, just groupings in terms of number of groups in a line and number of digits in a group and the pattern of groupings.\n\n0:10:22\tSPEAKER_08\n Are the patterns based on anything there?\n\n0:10:27\tSPEAKER_04\n I just roughly looked at what kinds of digit strings are out there, and they're usually grouped into either two, three, or four digits at a time.\n\n0:10:35\tSPEAKER_04\n And they can have, I mean, actually, things are getting longer and longer.\n\n0:10:40\tSPEAKER_04\n In the old days, you probably only had three sequences.\n\n0:10:44\tSPEAKER_04\n Telephone numbers were less and so forth.\n\n0:10:47\tSPEAKER_04\n So there's between, well, if you look at it, there are between like three and five groups.\n\n0:10:52\tSPEAKER_04\n And each one has between two and four groupings.\n\n0:10:56\tSPEAKER_04\n I purposely didn't want them to look like they're in any kind of pattern.\n\n0:11:02\tSPEAKER_06\n And which group appears as picked randomly and what the numbers are are picked randomly?\n\n0:11:07\tSPEAKER_06\n So unlike the previous one, which I simply replicated to T.I. digits, this is generated randomly.\n\n0:11:12\tSPEAKER_08\n Oh, OK.\n\n0:11:15\tSPEAKER_04\n But I think it would be great to be able to compare digits, whether it's these digits or T.I. digits to speakers, and compare that to their spontaneous speech.\n\n0:11:24\tSPEAKER_04\n And then we do need a fair amount of digit data because you might be wearing a different microphone.\n\n0:11:31\tSPEAKER_04\n So it's nice to have the digits replicated many times, especially for speakers that don't talk a lot.\n\n0:11:40\tSPEAKER_04\n So for adaptation, no, I'm serious.\n\n0:11:43\tSPEAKER_04\n So we have a problem with acoustic adaptation.\n\n0:11:46\tSPEAKER_04\n And we're not using the digit data now, but not for adaptation.\n\n0:11:52\tSPEAKER_04\n We were running adaptation only on the data that we ran recognition on.\n\n0:11:56\tSPEAKER_04\n And as soon as someone started to read transcript number, that's red speech.\n\n0:11:59\tSPEAKER_04\n And I thought, well, we're going to do better on that.\n\n0:12:01\tSPEAKER_04\n It's not fair to use.\n\n0:12:03\tSPEAKER_04\n Oh, yeah, that's true.\n\n0:12:03\tSPEAKER_04\n Absolutely.\n\n0:12:04\tSPEAKER_04\n It might be fair to use the data for adaptation.\n\n0:12:07\tSPEAKER_04\n So those speakers who are very quiet shy.\n\n0:12:11\tSPEAKER_04\n Right.\n\n0:12:11\tSPEAKER_04\n Like adapting on, yeah.\n\n0:12:13\tSPEAKER_04\n Well, I mean, it's the same microphone.\n\n0:12:15\tSPEAKER_04\n See, the nice thing is we have that in the same meeting.\n\n0:12:18\tSPEAKER_04\n Right.\n\n0:12:19\tSPEAKER_04\n Same acoustic, same channels.\n\n0:12:21\tSPEAKER_04\n Right.\n\n0:12:21\tSPEAKER_04\n And so I still like the idea of having some kind of good.\n\n0:12:25\tSPEAKER_07\n Yeah, I mean, for the acoustic research, for the signal processing, far field stuff, I see it as the place that we started.\n\n0:12:35\tSPEAKER_07\n But I mean, it'd be nice to have 20 hours of digit data.\n\n0:12:39\tSPEAKER_07\n But the truth is, I'm hoping that the stuff that you guys have been doing is continue that.\n\n0:12:47\tSPEAKER_07\n We get the best we can do on this spontaneous stuff.\n\n0:12:53\tSPEAKER_07\n And then we do a lot of the testing of the algorithms on the digits for the far field.\n\n0:13:00\tSPEAKER_07\n At some point, when we feel it's mature, and we understand what's going on, we can then we have to do the spontaneous data with the far field.\n\n0:13:09\tSPEAKER_04\n The only thing that we don't have, I know this sounds weird.\n\n0:13:13\tSPEAKER_04\n And maybe it's completely stupid.\n\n0:13:14\tSPEAKER_04\n But we don't have any overlapping digits.\n\n0:13:17\tSPEAKER_06\n Yeah.\n\n0:13:18\tSPEAKER_06\n We talked about that a couple of times.\n\n0:13:19\tSPEAKER_04\n I know it's weird.\n\n0:13:20\tSPEAKER_06\n But the problem I see with trying to do over lapping digits is the cognitive load.\n\n0:13:26\tSPEAKER_04\n I know everybody's laughing.\n\n0:13:27\tSPEAKER_04\n OK.\n\n0:13:28\tSPEAKER_04\n No, it's stupid.\n\n0:13:29\tSPEAKER_04\n It's just, I'm just talking for the stuff that I can't do.\n\n0:13:31\tSPEAKER_04\n You try to do it.\n\n0:13:32\tSPEAKER_04\n I mean, here, let's try it.\n\n0:13:34\tSPEAKER_06\n You read the line.\n\n0:13:35\tSPEAKER_06\n I'll read the first line.\n\n0:13:37\tSPEAKER_04\n These are all the same forms.\n\n0:13:39\tSPEAKER_04\n OK.\n\n0:13:39\tSPEAKER_06\n So you read the last line.\n\n0:13:41\tSPEAKER_06\n I'll read the first line.\n\n0:13:42\tSPEAKER_06\n You plug your ears.\n\n0:13:43\tSPEAKER_06\n Oh, I guess you plug your ears.\n\n0:13:44\tSPEAKER_06\n You could do it.\n\n0:13:44\tSPEAKER_06\n But then you don't get the same effects.\n\n0:13:47\tSPEAKER_04\n Well, what I mean is actually not the overlaps that are well governed linguistically, but the actual fact that there's speech coming from two people, beam forming stuff, all the acoustic stuff that like Dan Ellison and company want to do, digits are nice and well-behaved.\n\n0:14:04\tSPEAKER_04\n I mean, anyway, it's just a thought.\n\n0:14:07\tSPEAKER_04\n I think so.\n\n0:14:07\tSPEAKER_04\n It would go faster.\n\n0:14:10\tSPEAKER_04\n We take one over and.\n\n0:14:12\tSPEAKER_08\n It's the remake of DigitRea.\n\n0:14:13\tSPEAKER_04\n Well, looking a little strife.\n\n0:14:16\tSPEAKER_04\n I mean, I was sort of serious, but I really, I mean, I don't feel strongly enough that it's a good idea.\n\n0:14:22\tSPEAKER_06\n I do the last line.\n\n0:14:23\tSPEAKER_06\n I'll do the first line.\n\n0:14:25\tSPEAKER_06\n 6-1-6-2-1-8-6-1-0.\n\n0:14:28\tSPEAKER_06\n That's not bad.\n\n0:14:30\tSPEAKER_06\n No, I can do it.\n\n0:14:31\tSPEAKER_04\n And that probably was great.\n\n0:14:33\tSPEAKER_04\n By the way, I think it was numbers, but I'm not sure.\n\n0:14:35\tSPEAKER_04\n It just sort of sounded like a duet or something.\n\n0:14:39\tSPEAKER_08\n Performance, OK.\n\n0:14:40\tSPEAKER_07\n Let's try three.\n\n0:14:41\tSPEAKER_07\n You'll pick one in the middle.\n\n0:14:43\tSPEAKER_04\n OK.\n\n0:14:45\tSPEAKER_06\n 6-1-6-2-1-8-6-1-0.\n\n0:14:48\tSPEAKER_06\n I'm sorry.\n\n0:14:50\tSPEAKER_06\n I mean, I think it was doable.\n\n0:14:52\tSPEAKER_06\n Of course, transcribers.\n\n0:14:53\tSPEAKER_04\n So we could have a round where you do two at a time, and then the next person picks up when the first hit is done\n\n0:14:58\tSPEAKER_00\n or something.\n\n0:14:59\tSPEAKER_04\n Like a, what do you call it? This pair was.\n\n0:15:01\tSPEAKER_04\n Around.\n\n0:15:02\tSPEAKER_04\n Like, yeah.\n\n0:15:02\tSPEAKER_04\n Yeah, like that.\n\n0:15:05\tSPEAKER_04\n Then it would go like twice as fast.\n\n0:15:08\tSPEAKER_04\n A third is fast.\n\n0:15:09\tSPEAKER_04\n Anyway, it's just a thought.\n\n0:15:10\tSPEAKER_04\n I'm actually sort of serious if it would help people do that.\n\n0:15:13\tSPEAKER_04\n But the people who want to work in it, we should talk to them.\n\n0:15:16\tSPEAKER_07\n I don't think we're going to say the best amount of data that way.\n\n0:15:20\tSPEAKER_07\n Having a little bit might at least be fun for somebody like Dan.\n\n0:15:24\tSPEAKER_06\n I think maybe if we wanted to do that, we would do it as a separate session, something like that, rather than doing a real meeting and, you know, do two people at a time, then three people at a time, and things like that.\n\n0:15:34\tSPEAKER_04\n Can try it out.\n\n0:15:35\tSPEAKER_04\n If we have nothing.\n\n0:15:35\tSPEAKER_04\n So you see what Dan says.\n\n0:15:36\tSPEAKER_04\n We have no agenda.\n\n0:15:37\tSPEAKER_07\n Do it some week.\n\n0:15:39\tSPEAKER_07\n OK.\n\n0:15:39\tSPEAKER_07\n It's been the whole time reading.\n\n0:15:41\tSPEAKER_07\n I thought this was going to happen.\n\n0:15:42\tSPEAKER_00\n Another question about this.\n\n0:15:43\tSPEAKER_00\n So there are these digits, which are detached digits.\n\n0:15:46\tSPEAKER_00\n But there are other words that contain the same general phoneme sequences, like wonderful, has one in it.\n\n0:15:54\tSPEAKER_00\n And Victor Borja had a piece on this where he inflated the digits.\n\n0:15:59\tSPEAKER_00\n Well, I wonder if there would be a value in having digits that are in essence embedded in real words to compare in terms of the articulation of one and wonderful versus one as a digit being read.\n\n0:16:14\tSPEAKER_07\n That's too bad.\n\n0:16:18\tSPEAKER_04\n I'm all for it.\n\n0:16:20\tSPEAKER_01\n Not after I ate that.\n\n0:16:25\tSPEAKER_07\n I don't know what work is well, isn't it?\n\n0:16:30\tSPEAKER_07\n How does nine work in it?\n\n0:16:32\tSPEAKER_05\n Nine.\n\n0:16:33\tSPEAKER_05\n You scream in German?\n\n0:16:34\tSPEAKER_01\n Yes, there's a German.\n\n0:16:35\tSPEAKER_01\n Oh.\n\n0:16:38\tSPEAKER_03\n Ellis, I was good when you scream at them.\n\n0:16:41\tSPEAKER_07\n Everybody's a little punchy here.\n\n0:16:43\tSPEAKER_00\n Well, I mean, I just wanted to offer that as a possible task because we were to each read this embedded numbers words in sentences because it's like an entire sketchy does.\n\n0:16:53\tSPEAKER_00\n And I wouldn't take the inflated version.\n\n0:16:55\tSPEAKER_00\n So he talks about the woman being two to fall in.\n\n0:16:59\tSPEAKER_00\n But if it were to be deflated just the normal word, it would be like a little story that we could read.\n\n0:17:06\tSPEAKER_00\n I don't know if that would be useful for comparison, but it's embedded numbers.\n\n0:17:12\tSPEAKER_06\n I think for something like that would be better off doing like Tim, it.\n\n0:17:16\tSPEAKER_07\n Well, I think the question is what the research is.\n\n0:17:18\tSPEAKER_07\n So I mean, I presume that the reason that you wanted to have these digits this way is because you wanted to actually do some research looking at the exotic form here.\n\n0:17:29\tSPEAKER_04\n Right.\n\n0:17:29\tSPEAKER_07\n Yeah.\n\n0:17:31\tSPEAKER_07\n So if somebody wanted to do that, if they wanted to look at the difference in the phones and the digits in the context or a non-digit word versus in the digit word, that would be a good thing to do.\n\n0:17:45\tSPEAKER_07\n But I think someone would have to express interest in that.\n\n0:17:47\tSPEAKER_07\n I see.\n\n0:17:48\tSPEAKER_07\n OK.\n\n0:17:50\tSPEAKER_07\n Maybe you were interested in doing that.\n\n0:17:53\tNone\n OK.\n\n0:17:53\tSPEAKER_00\n Thank you.\n\n0:17:54\tSPEAKER_06\n Yeah, we know digits.\n\n0:17:59\tSPEAKER_06\n We have ASR results from Liz transcripts asked from Jane and disk space and storage formats from Don.\n\n0:18:05\tSPEAKER_06\n Do we have any preference on which way we want to go?\n\n0:18:10\tSPEAKER_04\n Well, I was actually going to skip the ASR results part in favor of getting the transcription stuff talked about since I think that's more important to moving forward.\n\n0:18:20\tSPEAKER_04\n But I mean, Morgan has this paper copy.\n\n0:18:23\tSPEAKER_04\n And if people have questions, it's pretty preliminary in terms of ASR results because we didn't do anything fancy.\n\n0:18:30\tSPEAKER_04\n But I think just having the results there and pointing out some main conclusions, like it's not the speaking style that differs.\n\n0:18:41\tSPEAKER_04\n It's the fact that there's overlap, that causes recognition errors.\n\n0:18:45\tSPEAKER_04\n And the fact that it's almost all insertion errors, which you would expect.\n\n0:18:50\tSPEAKER_04\n But you might also think that in the overlap regions, you would get substitutions and so forth, leads us to believe that doing a better segmentation like your channel-based segmentation or some kind of echo cancellation to get basically back down to the individual speaker utterances would be probably all that we would need to be able to do good recognition on the close documents.\n\n0:19:16\tSPEAKER_06\n Why don't you have a hard copy?\n\n0:19:18\tSPEAKER_06\n Why don't you email it to the list?\n\n0:19:20\tSPEAKER_04\n But this is Morgan has this paper.\n\n0:19:23\tSPEAKER_04\n Oh, it's in the paper.\n\n0:19:24\tSPEAKER_04\n It's that paper.\n\n0:19:25\tSPEAKER_04\n Yeah.\n\n0:19:26\tSPEAKER_04\n Everybody's going to know.\n\n0:19:27\tSPEAKER_04\n OK, then it's already done.\n\n0:19:28\tSPEAKER_04\n Basically did a lot of work on that.\n\n0:19:31\tSPEAKER_04\n And it's, let's see, I guess the other neat thing is it shows for sure that the lapel within speaker is bad.\n\n0:19:41\tSPEAKER_04\n And it's bad because it picks up the overlapping speech.\n\n0:19:44\tSPEAKER_02\n So your results were run on the channel synchronized?\n\n0:19:50\tSPEAKER_04\n Yes, because that's all that had been transcribed at the time.\n\n0:19:54\tSPEAKER_04\n But as we, I mean, I wanted to hear more about the transcription, if we can get the channel asynchronous or the closer to that would be very interesting for us.\n\n0:20:05\tSPEAKER_07\n Because we use the part from which you had about the all over the channels or mixed channels.\n\n0:20:13\tSPEAKER_08\n So if there was a segment of speech this long,\n\n0:20:17\tSPEAKER_06\n someone said, oh, in the front. Oh, in the front.\n\n0:20:19\tSPEAKER_08\n Oh, the whole thing was passed to the record.\n\n0:20:22\tSPEAKER_04\n That's right.\n\n0:20:22\tSPEAKER_04\n In fact, I pulled out a couple classic examples in case you want to use them in your talk of Chuck on the lapel.\n\n0:20:29\tSPEAKER_04\n So Chuck wore the lapel three out of four times.\n\n0:20:31\tSPEAKER_04\n I noticed that Chuck was early on.\n\n0:20:34\tSPEAKER_04\n And I wore the lapel once.\n\n0:20:35\tSPEAKER_04\n And for me, the lapel was OK.\n\n0:20:38\tSPEAKER_04\n I mean, I still, and I don't know why.\n\n0:20:40\tSPEAKER_04\n But for you, it was for who was next to me.\n\n0:20:45\tSPEAKER_03\n And where you were sitting probably affected.\n\n0:20:47\tSPEAKER_04\n Right.\n\n0:20:48\tSPEAKER_04\n But when Chuck wore the lapel and Morgan was talking, there are a couple of really long utterances where Chuck is saying a few things inside.\n\n0:20:55\tSPEAKER_04\n And it's picking up all of Morgan's words pretty well.\n\n0:20:58\tSPEAKER_04\n And so the error rates, because of insertions aren't bounded.\n\n0:21:03\tSPEAKER_04\n So with a one word utterance and 10 insertions, you've got huge error rate.\n\n0:21:08\tSPEAKER_04\n And that's where the problems come in.\n\n0:21:09\tSPEAKER_04\n So this is sort of what we expected.\n\n0:21:11\tSPEAKER_04\n But it's nice to be able to show it.\n\n0:21:13\tSPEAKER_04\n And also, I just wanted to mention briefly that Andreas, when I called up Dan, Alice, who's still stuck in Switzerland.\n\n0:21:21\tSPEAKER_04\n We were going to ask him if there was out there in terms of echo cancellation and things like that, not that we were going to do it, but we wanted to know what would need to be done.\n\n0:21:32\tSPEAKER_04\n And we've given him the data we have so far.\n\n0:21:35\tSPEAKER_04\n So these synchronous cases where there are overlap.\n\n0:21:38\tSPEAKER_04\n And he's going to look into trying to run some things that are out there and see how all it can do.\n\n0:21:45\tSPEAKER_04\n Because right now, we're not able to actually report on recognition in a real paper, like a Euro-Speed Paper, because it would look sort of premature.\n\n0:21:53\tSPEAKER_08\n So the idea is that you would take this big hunk where somebody's only speaking a small amount in it, and then try to figure out where they're speaking based on.\n\n0:22:04\tSPEAKER_04\n Right.\n\n0:22:04\tSPEAKER_04\n Or at any point in time, who's the foreground speaker, who's the background speaker?\n\n0:22:08\tSPEAKER_06\n I thought we were just going to move the boundary.\n\n0:22:10\tSPEAKER_06\n Well, that's sort of hand stuff.\n\n0:22:11\tSPEAKER_06\n So there's, how would you do that automatically?\n\n0:22:14\tSPEAKER_02\n Well, there's actually done some experiments with cross correlation.\n\n0:22:18\tSPEAKER_02\n And it seems to work pretty well to get that sort of thing.\n\n0:22:22\tSPEAKER_04\n Yeah, exactly.\n\n0:22:23\tSPEAKER_08\n So why do you want to do echo cancellation?\n\n0:22:28\tSPEAKER_04\n It would be techniques used from adaptive echo cancellation, which I don't know enough about to talk about.\n\n0:22:33\tSPEAKER_04\n It's just a journey to remove cross-down.\n\n0:22:35\tSPEAKER_04\n But right.\n\n0:22:37\tSPEAKER_04\n And that would be similar to what you're also trying to do, but using more than energy.\n\n0:22:43\tSPEAKER_04\n I don't know what exactly would go into it.\n\n0:22:46\tSPEAKER_04\n So the idea is to basically run this on the whole meeting and get the locations, which gives you also the time of dreams.\n\n0:22:53\tSPEAKER_08\n To do sort of what he's already, what he's trying to do.\n\n0:22:55\tSPEAKER_04\n Right.\n\n0:22:56\tSPEAKER_04\n Except that there are many techniques for the kinds of cues that you can use to do that.\n\n0:23:02\tSPEAKER_04\n I see.\n\n0:23:02\tSPEAKER_04\n Yeah.\n\n0:23:03\tSPEAKER_07\n If Dave is also going to be using the foreground with echo cancellation for the near field, far field stuff.\n\n0:23:11\tSPEAKER_04\n And I guess S-pen?\n\n0:23:13\tSPEAKER_04\n Is he here too?\n\n0:23:14\tSPEAKER_04\n May also be.\n\n0:23:15\tSPEAKER_04\n So that's really the next step, because we can't do too much in terms of recognition results, knowing that this is a big problem, until we can do that kind of processing.\n\n0:23:28\tSPEAKER_04\n And so once we have some reviewers and we'll move on.\n\n0:23:34\tSPEAKER_08\n I think this also ties in to one of the things that Jane's going to talk about, too.\n\n0:23:38\tSPEAKER_06\n I also want to say I have done all this chopping up of digits.\n\n0:23:43\tSPEAKER_06\n So I have some naming conventions that we should try to agree on.\n\n0:23:46\tSPEAKER_04\n Oh, right.\n\n0:23:46\tSPEAKER_04\n So let's do that offline.\n\n0:23:47\tSPEAKER_04\n We don't do it during the year.\n\n0:23:48\tSPEAKER_04\n Right.\n\n0:23:48\tSPEAKER_04\n Definitely.\n\n0:23:50\tSPEAKER_06\n And I've scripts that will extract it out from key files and do all the naming automatically.\n\n0:23:55\tSPEAKER_06\n So I'll do it by hand.\n\n0:23:57\tSPEAKER_03\n Great.\n\n0:23:58\tSPEAKER_03\n So let's do this.\n\n0:23:58\tSPEAKER_03\n You compile the list of speaker names.\n\n0:24:01\tSPEAKER_03\n And OK.\n\n0:24:02\tSPEAKER_03\n Not names, but.\n\n0:24:03\tSPEAKER_03\n Yep.\n\n0:24:03\tSPEAKER_06\n Not names.\n\n0:24:04\tSPEAKER_06\n Names to IDs.\n\n0:24:05\tSPEAKER_06\n So you do it.\n\n0:24:06\tSPEAKER_06\n And it does all sorts of matches, because the way people fill out names is different on every single file.\n\n0:24:11\tSPEAKER_04\n So it does a very fuzzy sort of match.\n\n0:24:13\tSPEAKER_04\n So at this point, we can sort of finalize the naming and so forth.\n\n0:24:16\tSPEAKER_04\n And we're going to basically rewrite out these waveforms that we did, because as you notice in the paper, your MO4 and one meeting and MO2 and another meeting, and we just need to standardize the.\n\n0:24:27\tSPEAKER_04\n That was my fault.\n\n0:24:28\tSPEAKER_04\n No.\n\n0:24:30\tSPEAKER_04\n No, I didn't notice that.\n\n0:24:31\tSPEAKER_04\n That's why those comments are in there.\n\n0:24:33\tSPEAKER_06\n So I now have a script that you could just say, basically, look up Morgan, and it will give you a second.\n\n0:24:39\tSPEAKER_04\n Great.\n\n0:24:39\tSPEAKER_06\n Great.\n\n0:24:40\tSPEAKER_06\n Terrific.\n\n0:24:42\tSPEAKER_06\n All right.\n\n0:24:43\tSPEAKER_06\n Do we, Dawn, you had disk space and storage formats?\n\n0:24:46\tSPEAKER_06\n Is that something we need to talk about at the meeting, or should you just talk with Chuck?\n\n0:24:51\tSPEAKER_03\n At some other time.\n\n0:24:51\tSPEAKER_03\n I had some general questions just about the compression algorithms of shortening waveforms.\n\n0:24:57\tSPEAKER_03\n And I don't know exactly who to ask.\n\n0:24:59\tSPEAKER_03\n I thought maybe you would be the person to talk to.\n\n0:25:02\tSPEAKER_03\n So is it a lossless compression when you compress?\n\n0:25:05\tSPEAKER_03\n So entropy coding.\n\n0:25:07\tSPEAKER_03\n It just uses entropy coding.\n\n0:25:08\tSPEAKER_03\n OK.\n\n0:25:09\tSPEAKER_03\n So I mean, I guess my question would be, is I just got this new 18 gig drive installed.\n\n0:25:15\tSPEAKER_03\n Yeah.\n\n0:25:16\tSPEAKER_06\n And I think half of it is scratch and half of it is.\n\n0:25:19\tSPEAKER_03\n I'm not exactly sure how they partitioned it.\n\n0:25:21\tSPEAKER_03\n Yeah.\n\n0:25:22\tSPEAKER_03\n Yeah.\n\n0:25:23\tSPEAKER_03\n I don't know what's typical here, but it's local, though.\n\n0:25:26\tSPEAKER_06\n So that doesn't matter.\n\n0:25:28\tSPEAKER_06\n But you can access it from anywhere in XC.\n\n0:25:31\tSPEAKER_06\n OK.\n\n0:25:32\tSPEAKER_03\n In fact, how do you do that?\n\n0:25:34\tSPEAKER_04\n Drive versus the thing is the 18 gig.\n\n0:25:36\tSPEAKER_04\n It was a spare that day pattern.\n\n0:25:38\tSPEAKER_06\n Slash N slash machine name slash XC.\n\n0:25:41\tSPEAKER_03\n OK.\n\n0:25:42\tSPEAKER_03\n All right.\n\n0:25:43\tSPEAKER_06\n I didn't know.\n\n0:25:44\tSPEAKER_06\n So the only question is how much of it, the distinction between scratch and non-scratch is whether it's backed up or not.\n\n0:25:49\tSPEAKER_06\n Right.\n\n0:25:50\tSPEAKER_06\n So what you want to do is use the scratch for stuff that you can regenerate.\n\n0:25:53\tSPEAKER_06\n OK.\n\n0:25:54\tSPEAKER_06\n So stuff that isn't backed up, it's not a big deal because disks don't crash very frequently as long as you can regenerate it.\n\n0:26:00\tSPEAKER_03\n Right.\n\n0:26:01\tSPEAKER_03\n I mean, all the stuff can be regenerated.\n\n0:26:02\tSPEAKER_06\n It's just going to put it all on scratch because where XC is model next to buy back up.\n\n0:26:07\tSPEAKER_06\n Yeah.\n\n0:26:08\tSPEAKER_04\n So all the transcripts should be backed up.\n\n0:26:11\tSPEAKER_04\n But all the waveforms should not be backed.\n\n0:26:14\tSPEAKER_03\n Right.\n\n0:26:15\tSPEAKER_03\n The ones that you write out.\n\n0:26:16\tSPEAKER_03\n OK.\n\n0:26:17\tSPEAKER_03\n So I mean, I guess the other question was, then, should we shorten them, downsample them, or keep them in their original form?\n\n0:26:22\tSPEAKER_06\n It just depends on your tools.\n\n0:26:24\tSPEAKER_06\n I mean, because it's not backed up and it's just on scratch, if your tools can't take short and format, I would leave them expanded.\n\n0:26:31\tSPEAKER_06\n So you don't have to un-shorten them every single time you want to do anything.\n\n0:26:34\tSPEAKER_03\n OK.\n\n0:26:35\tSPEAKER_04\n We can downsample them.\n\n0:26:36\tSPEAKER_03\n Do you think that would be OK?\n\n0:26:38\tSPEAKER_03\n Yeah.\n\n0:26:39\tSPEAKER_04\n To downsample them.\n\n0:26:40\tSPEAKER_04\n Yeah, we get the same performance.\n\n0:26:41\tSPEAKER_04\n OK.\n\n0:26:42\tSPEAKER_04\n I mean, the front end on the SRI recognize are just downsamples them on the fly.\n\n0:26:45\tSPEAKER_03\n Yeah.\n\n0:26:46\tSPEAKER_03\n I guess the only argument against downsampling is to preserve just the original files in case we want to experiment with different filtering techniques.\n\n0:26:51\tSPEAKER_07\n Yeah.\n\n0:26:52\tSPEAKER_07\n I'm sorry.\n\n0:26:53\tSPEAKER_07\n Yeah.\n\n0:26:54\tSPEAKER_07\n Overall, our data, we want to not downsample.\n\n0:26:56\tSPEAKER_04\n You want to not.\n\n0:26:57\tSPEAKER_04\n OK.\n\n0:26:58\tSPEAKER_04\n So what we're doing is we're writing out, I mean, this is just a question.\n\n0:27:00\tSPEAKER_04\n We're writing out these individual segments that wherever there's a time boundary from T-load or James transcribers, we chop it there.\n\n0:27:09\tSPEAKER_04\n And the reason is that we can feed it to the recognizer and throw out ones that we're not using and so forth.\n\n0:27:14\tSPEAKER_04\n And those are the ones that we're storing.\n\n0:27:16\tSPEAKER_04\n Yeah.\n\n0:27:17\tSPEAKER_06\n So it's regenerateable.\n\n0:27:18\tSPEAKER_06\n Yeah.\n\n0:27:19\tSPEAKER_06\n What I would do is take downsample it and compress it.\n\n0:27:23\tSPEAKER_06\n However, the SRI recognize or wants to take it in.\n\n0:27:26\tSPEAKER_06\n So we can't shorten them.\n\n0:27:27\tSPEAKER_04\n We can downsample them.\n\n0:27:28\tSPEAKER_04\n Yeah, I mean, I'm sorry.\n\n0:27:29\tSPEAKER_07\n As long as there is a form that we can come from again, that's not downsample.\n\n0:27:33\tSPEAKER_04\n Yeah, that's why we need more dis space because we're basically duplicating the originals.\n\n0:27:38\tSPEAKER_04\n That's fine.\n\n0:27:39\tSPEAKER_07\n But for future research, we're doing different microphones.\n\n0:27:42\tSPEAKER_04\n Oh, yeah.\n\n0:27:43\tSPEAKER_04\n No, we always have the original long ones.\n\n0:27:44\tSPEAKER_08\n So the SRI front end won't take a large audio file name and then a list of segments to chop out from that large audio file.\n\n0:27:54\tSPEAKER_08\n They actually have to be chopped out already.\n\n0:27:57\tSPEAKER_04\n It's better if they're chopped out and it will be, yeah.\n\n0:28:02\tSPEAKER_04\n We could probably write something to do that, but it's actually convenient to have them chopped out.\n\n0:28:06\tSPEAKER_04\n Because you can run them in different orders.\n\n0:28:09\tSPEAKER_04\n You can actually move them around.\n\n0:28:11\tSPEAKER_04\n And that's a whole point of opinion.\n\n0:28:12\tSPEAKER_04\n You can get rid of vengeance.\n\n0:28:13\tSPEAKER_04\n It's a lot faster.\n\n0:28:14\tSPEAKER_06\n Yeah, it's a lot faster.\n\n0:28:15\tSPEAKER_06\n English speaking.\n\n0:28:16\tSPEAKER_06\n All the native speakers and all the non-adjustable.\n\n0:28:17\tSPEAKER_06\n You can grab everything with the word that we're in.\n\n0:28:19\tSPEAKER_04\n And it's a lot quicker than actually trying to access the way file each time, find the time boundaries.\n\n0:28:25\tSPEAKER_04\n So in principle, yeah, you could do that.\n\n0:28:27\tSPEAKER_04\n Well, that's really right.\n\n0:28:28\tSPEAKER_08\n But it's not right now.\n\n0:28:30\tSPEAKER_05\n It's just not right now.\n\n0:28:32\tSPEAKER_05\n These are long.\n\n0:28:33\tSPEAKER_01\n These are long.\n\n0:28:34\tSPEAKER_06\n So for example, what if you wanted to run all the native speakers?\n\n0:28:40\tSPEAKER_06\n So if you did it that way, you would have to generate a program that looks in a database somewhere or extracts out the language, finds the time marks for that particular one, do it that way.\n\n0:28:50\tSPEAKER_06\n The way they're doing it, you have that already extracted and it's embedded in the file name.\n\n0:28:54\tSPEAKER_06\n And so you know, you just say.\n\n0:28:56\tSPEAKER_06\n Yeah, that's part of it.\n\n0:28:57\tSPEAKER_06\n So that's part of it.\n\n0:29:00\tSPEAKER_06\n You just say, you know, asterisk eAsterisk.wave and you get what you want.\n\n0:29:02\tSPEAKER_04\n Right.\n\n0:29:03\tSPEAKER_04\n And the other part is just that once they're written out, it is a lot faster to process it.\n\n0:29:07\tSPEAKER_04\n Rather than doing seeks.\n\n0:29:09\tSPEAKER_06\n So.\n\n0:29:10\tSPEAKER_06\n Through the file.\n\n0:29:11\tSPEAKER_04\n Otherwise, you're just accessing.\n\n0:29:12\tSPEAKER_06\n This is all just temporary access.\n\n0:29:13\tSPEAKER_06\n So I don't, I think it's all just, it's fine.\n\n0:29:15\tSPEAKER_06\n You know.\n\n0:29:16\tSPEAKER_06\n You're wanting to do it however is convenient.\n\n0:29:18\tSPEAKER_06\n Right.\n\n0:29:19\tSPEAKER_07\n I mean, it just depends up if the file is file-sits in memory you can do it.\n\n0:29:22\tSPEAKER_04\n The other thing is that believe it or not, I mean, we have some, so we're also looking at these in waves like for the alignment.\n\n0:29:29\tSPEAKER_04\n And so forth.\n\n0:29:30\tSPEAKER_04\n You can't load an hour of speech into x-waves.\n\n0:29:32\tSPEAKER_04\n Yeah.\n\n0:29:33\tSPEAKER_04\n You need to have these small files.\n\n0:29:34\tSPEAKER_04\n And in fact, even for the transcriber program.\n\n0:29:37\tSPEAKER_08\n Yeah, you can give waves a start in an end time.\n\n0:29:40\tSPEAKER_04\n Yeah, if you try to load really long waveform into x-waves, you'll be waiting there.\n\n0:29:44\tSPEAKER_04\n No, I'm not suggesting you load a long waveform.\n\n0:29:46\tSPEAKER_08\n I'm just saying you give it a start in an end time.\n\n0:29:48\tSPEAKER_08\n And it'll just go and pull out that section.\n\n0:29:51\tSPEAKER_06\n The transcribers didn't have any problem with that. Did they, Jane?\n\n0:29:54\tSPEAKER_00\n What's the loading process? They load it to some problem.\n\n0:29:57\tSPEAKER_06\n It takes a very long time.\n\n0:29:59\tSPEAKER_02\n Yeah, just to load the transcription to a little bit.\n\n0:30:02\tSPEAKER_02\n Right. It takes a long time.\n\n0:30:03\tSPEAKER_02\n But not to the waveform.\n\n0:30:04\tSPEAKER_02\n The waveform is there immediately.\n\n0:30:06\tSPEAKER_02\n Yeah.\n\n0:30:07\tSPEAKER_06\n Are you talking about transcriber or x-waves?\n\n0:30:09\tSPEAKER_06\n Yeah.\n\n0:30:10\tSPEAKER_04\n Actually, you're talking about transcriber, right?\n\n0:30:12\tSPEAKER_04\n Yeah.\n\n0:30:13\tSPEAKER_04\n There's also true of the digit test, which is what it's supposed to do.\n\n0:30:15\tSPEAKER_06\n We need x-waves to do the digits.\n\n0:30:16\tSPEAKER_06\n Yeah.\n\n0:30:17\tSPEAKER_06\n And they were loading the form x-waves in and it didn't seem to be any problem.\n\n0:30:20\tSPEAKER_04\n I agree.\n\n0:30:21\tSPEAKER_04\n Well, we have a problem with that time wise.\n\n0:30:24\tSPEAKER_04\n It's a lot slower to load in a long file.\n\n0:30:27\tSPEAKER_04\n It seems really good.\n\n0:30:28\tSPEAKER_04\n And also to check the file.\n\n0:30:30\tSPEAKER_04\n So if you have a transcript.\n\n0:30:32\tSPEAKER_04\n Well, regardless, it's still there.\n\n0:30:34\tSPEAKER_04\n I mean, it's, I think overall you could get everything to work by accessing the same waveform and trying to find two, you know, the beginning and end times.\n\n0:30:45\tSPEAKER_04\n But I think it's more efficient if we have the storage space.\n\n0:30:48\tSPEAKER_04\n To have the small ones.\n\n0:30:51\tSPEAKER_06\n And it's no problem, right?\n\n0:30:52\tSPEAKER_06\n Because it's not backed up.\n\n0:30:53\tSPEAKER_04\n Yeah.\n\n0:30:54\tSPEAKER_06\n So it's just, if we don't have a spare to sitting around, we go out and we buy ourselves an 80 gigabyte drive and make it all scratch space.\n\n0:31:00\tSPEAKER_06\n It's not a big deal.\n\n0:31:03\tSPEAKER_00\n You're right about the backup being a bottleneck.\n\n0:31:05\tSPEAKER_00\n It's good to.\n\n0:31:06\tSPEAKER_00\n Yeah, so these won't be scratch.\n\n0:31:07\tSPEAKER_04\n It's a first batch.\n\n0:31:08\tSPEAKER_04\n Yeah.\n\n0:31:09\tSPEAKER_06\n Right.\n\n0:31:10\tSPEAKER_06\n So remind me afterward and I'll, and we'll look at your disk.\n\n0:31:13\tSPEAKER_06\n You can see where to put stuff.\n\n0:31:14\tSPEAKER_06\n All right.\n\n0:31:16\tSPEAKER_03\n And I can just do it to a, do you on it?\n\n0:31:18\tSPEAKER_03\n Right.\n\n0:31:19\tSPEAKER_03\n And just see which, how much is on each?\n\n0:31:20\tSPEAKER_03\n Yep.\n\n0:31:21\tSPEAKER_06\n Each partition.\n\n0:31:22\tSPEAKER_06\n And you want to use either XA or scratch.\n\n0:31:24\tSPEAKER_06\n Okay.\n\n0:31:25\tSPEAKER_06\n Well, X question mark.\n\n0:31:26\tSPEAKER_06\n Anything starting with X is scratch.\n\n0:31:28\tSPEAKER_06\n Okay.\n\n0:31:29\tSPEAKER_00\n With two digits.\n\n0:31:30\tSPEAKER_00\n Two digits, right?\n\n0:31:31\tSPEAKER_06\n XA, XB, XC.\n\n0:31:35\tSPEAKER_06\n Okay.\n\n0:31:36\tSPEAKER_00\n Jane.\n\n0:31:37\tSPEAKER_00\n Okay. So I got a little print on here.\n\n0:31:39\tSPEAKER_00\n So three on this side.\n\n0:31:40\tSPEAKER_00\n Three on this side.\n\n0:31:42\tSPEAKER_00\n And I stable them.\n\n0:31:45\tNone\n Okay.\n\n0:31:48\tSPEAKER_00\n All right.\n\n0:31:49\tSPEAKER_00\n So first of all, there was an interest in the transcribe transcription checking procedures.\n\n0:31:57\tSPEAKER_00\n And I can tell you first to go through the steps, although you've probably seen them.\n\n0:32:03\tSPEAKER_00\n As you might imagine, when you're dealing with, really, a fair number of words and natural speech, which means self-repairs and all these other factors that there are lots of things to be standardized and streamlined and checked on.\n\n0:32:20\tSPEAKER_00\n And so I did a bunch of checks.\n\n0:32:26\tSPEAKER_00\n And the first thing I did was obviously a spell check.\n\n0:32:29\tSPEAKER_00\n And at that point, I discovered certain things like accommodate with one M, that kind of thing.\n\n0:32:35\tSPEAKER_00\n And then in addition to that, I did an exhaustive listing of the forums in the data file, which included detecting things like faulty punctuation and things.\n\n0:32:44\tSPEAKER_08\n I'm sorry to interrupt you.\n\n0:32:45\tSPEAKER_08\n Could I just back up a little bit?\n\n0:32:46\tSPEAKER_08\n Sure, please, please, please.\n\n0:32:47\tSPEAKER_00\n So you're doing these.\n\n0:32:48\tSPEAKER_08\n So the whole process is that the transcribers get the conversation and they do their pass over it.\n\n0:32:55\tSPEAKER_08\n Yes.\n\n0:32:56\tSPEAKER_08\n And then when they're finished with it, it comes to you and you begin these.\n\n0:32:59\tSPEAKER_08\n Exactly.\n\n0:33:00\tSPEAKER_00\n I do these checks.\n\n0:33:01\tSPEAKER_00\n These quality checks.\n\n0:33:02\tSPEAKER_00\n Uh-huh, exactly.\n\n0:33:03\tSPEAKER_00\n Yeah, thank you.\n\n0:33:04\tSPEAKER_00\n And so do an exhaustive listing of the forums.\n\n0:33:07\tSPEAKER_00\n Actually, I will go through this in order.\n\n0:33:09\tSPEAKER_00\n So if we can maybe wait and stick.\n\n0:33:11\tSPEAKER_00\n Keep that for a second because we're not ready for that.\n\n0:33:13\tSPEAKER_00\n So on the fifth page.\n\n0:33:14\tSPEAKER_00\n Exactly, exactly.\n\n0:33:16\tSPEAKER_00\n All right.\n\n0:33:17\tSPEAKER_00\n So, uh, spelling check first.\n\n0:33:19\tSPEAKER_00\n Then an exhaustive listing of the, uh, all the forums in the data with punctuation attached.\n\n0:33:24\tSPEAKER_00\n And at that point, I pick up things like, oh, you know, word followed by two commas.\n\n0:33:28\tSPEAKER_00\n And then, uh, another check involves, uh, being sure that every utterance has an identifiable speaker.\n\n0:33:34\tSPEAKER_00\n And if not, then that gets checked.\n\n0:33:36\tSPEAKER_00\n Then there's this issue of glossing, so-called spoken forums.\n\n0:33:40\tSPEAKER_00\n So they're- most for the most part, we're keeping it standard, we're-we're level transcription.\n\n0:33:45\tSPEAKER_00\n But there's- and that's done with the assumption that pronunciation variants can be handled.\n\n0:33:50\tSPEAKER_00\n So for things like, and the fact that someone doesn't say the D, uh, that's not important enough to capture in the transcription because of a good pronunciation, uh, you know, model, we'll be able to handle that.\n\n0:34:01\tSPEAKER_00\n However, things like, because, where you're lacking an entire very prominent for a syllable.\n\n0:34:05\tSPEAKER_00\n And furthermore, it's a forum that's specific to spoken language.\n\n0:34:09\tSPEAKER_00\n Those are reasons- for- for those reasons, I-I kept that separate and used the convention of using C, U, Z for that forum.\n\n0:34:16\tSPEAKER_00\n However, glossing it so that it's possible with a script to plug in the full orthographic forum for that one.\n\n0:34:22\tSPEAKER_00\n And a couple of others, not many.\n\n0:34:24\tSPEAKER_00\n So, Wana is another one going- Gona is another one with just the assumption again that this- these are things which it's not really fair to consider expected at pronunciation model to handle.\n\n0:34:34\tSPEAKER_00\n And Chuck, you- you indicated that, and this is- is one of those that's handled in a different way also.\n\n0:34:39\tSPEAKER_00\n Didn't you? Did I?\n\n0:34:40\tSPEAKER_00\n I don't remember.\n\n0:34:41\tSPEAKER_00\n Okay, so I was- it might not have been- it might not have been you.\n\n0:34:44\tSPEAKER_00\n But someone told me that in fact, Cuzz has treated differently in, um, in this context because of that reason that, um, it's a little bit farther than a pronunciation variant.\n\n0:34:54\tSPEAKER_00\n Okay, so after that, let's see.\n\n0:34:56\tSPEAKER_08\n Um, so that was part of the spell check or is that- that was after the spell check?\n\n0:35:00\tSPEAKER_00\n Well, so when I get the exhaust- so the spell check picks up those words because they're not in the dictionary, so it gets Cuzz and Wana and that-\n\n0:35:07\tSPEAKER_06\n And then you gloss them.\n\n0:35:08\tSPEAKER_00\n Yeah, I've run it through- I have a said, you know, so I do a side script saying whenever you see Gona- convert it to Gona, you know, gloss equals quote, going to quote, you know.\n\n0:35:18\tSPEAKER_00\n And with all of these things being in curly brackets, so they're always distinctive.\n\n0:35:22\tSPEAKER_00\n Okay, I also wrote a script which will, um, retrieve anything in curly brackets or anything which I've classified as an acronym and it pronounced acronym.\n\n0:35:34\tSPEAKER_00\n And the way I take- pronounced acronyms is that I have underscores between the component.\n\n0:35:39\tSPEAKER_00\n So if it's ACL, then it's A underscores C underscore L.\n\n0:35:43\tSPEAKER_00\n And-\n\n0:35:44\tSPEAKER_06\n So your list here are these ones that actually occurred in the meetings?\n\n0:35:47\tSPEAKER_00\n Yes, huh? Yeah.\n\n0:35:49\tSPEAKER_00\n Okay, so now- We are asking-\n\n0:35:51\tSPEAKER_04\n Can I ask a question about the glossing of the before we go on? So for a word like, because is it that it's always predictably because- I mean, is CUSE always meaning because?\n\n0:36:04\tSPEAKER_00\n Yes, but not the reverse.\n\n0:36:05\tSPEAKER_00\n So sometimes people will say because in the meeting.\n\n0:36:07\tSPEAKER_00\n And if they actually said because, then it's written as because with no- with cause doesn't even figure into the equation.\n\n0:36:14\tSPEAKER_00\n Because-\n\n0:36:15\tSPEAKER_07\n But not eating as people don't say, hey, cause. Right, right, right, right, yeah.\n\n0:36:19\tSPEAKER_04\n Yeah.\n\n0:36:20\tSPEAKER_04\n So, I guess so from the point of view of- The only problem is that with- For the recognition we map it to B cause.\n\n0:36:30\tSPEAKER_04\n And so we know that CUSE is the- Well, don't have the gloss.\n\n0:36:32\tSPEAKER_06\n But you have the gloss forms, you always replace it.\n\n0:36:35\tSPEAKER_06\n Exactly.\n\n0:36:36\tSPEAKER_06\n If that's what you want to do.\n\n0:36:37\tSPEAKER_00\n Uh-huh.\n\n0:36:38\tSPEAKER_00\n And Don knows this, and he's been- Yeah, I replaced the cause with B cause if it's lost.\n\n0:36:41\tSPEAKER_04\n Right, but- If it's okay.\n\n0:36:43\tSPEAKER_04\n But then there are other glosses that we don't replace, right?\n\n0:36:47\tSPEAKER_00\n Because- Yes, and that's why there are different tags on the glosses.\n\n0:36:50\tSPEAKER_00\n Okay, so- On the different types of comments, which we'll see in just a second.\n\n0:36:54\tSPEAKER_00\n So the pronounceable acronyms get underscores.\n\n0:36:57\tSPEAKER_00\n The things in curly brackets are viewed as comments.\n\n0:36:59\tSPEAKER_00\n They're comments of four types.\n\n0:37:00\tSPEAKER_00\n So it's a good time to introduce that.\n\n0:37:02\tSPEAKER_00\n Four types.\n\n0:37:03\tSPEAKER_00\n And maybe we'll expand that.\n\n0:37:04\tSPEAKER_00\n But the- But the comments are- Four types, mainly right now.\n\n0:37:08\tSPEAKER_00\n One of them is- Um, the gloss type we just mentioned.\n\n0:37:12\tSPEAKER_00\n Another type is-\n\n0:37:14\tSPEAKER_06\n So are we done with acronyms? Because I had a question on what- What does this mean?\n\n0:37:18\tSPEAKER_00\n I'm still doing the overview.\n\n0:37:19\tSPEAKER_00\n I haven't actually gotten here yet.\n\n0:37:20\tSPEAKER_00\n Awesome.\n\n0:37:21\tSPEAKER_00\n Okay, so glosses things like- glosses things like replacing the full form with the, um, more abbreviated one to the left.\n\n0:37:30\tSPEAKER_00\n Then you have- If it's- There's a couple different types of elements that can happen that aren't really properly words.\n\n0:37:36\tSPEAKER_00\n And some of them are laughs and breeze.\n\n0:37:39\tSPEAKER_00\n So we have- That's prepended with a tag of VOC.\n\n0:37:42\tSPEAKER_00\n And the non-vulgones are like door slams and tapping.\n\n0:37:45\tSPEAKER_00\n And that's prepended with a- So the non-vulgination- So the end being curly braces or something else?\n\n0:37:50\tSPEAKER_00\n Oh yeah, so this would- Let's just take one example.\n\n0:37:53\tSPEAKER_00\n Oh, oh, oh.\n\n0:37:54\tSPEAKER_00\n And then the non-vulgization would be something like a door slam.\n\n0:37:58\tSPEAKER_00\n They always end.\n\n0:37:59\tSPEAKER_00\n So it's like they're paired curly brackets.\n\n0:38:01\tSPEAKER_00\n And then the third type right now is things that fall in the category of comments about what's happening.\n\n0:38:08\tSPEAKER_00\n So it could be something like, you know, referring to so-and-so, talking about such and such, you know, looking at so-and-so.\n\n0:38:15\tSPEAKER_00\n So on the middle-\n\n0:38:16\tSPEAKER_08\n So in the first case that gloss applies to the word to the left. Yeah.\n\n0:38:20\tSPEAKER_00\n And this gets so- In the middle two, it's not applying anything, right?\n\n0:38:23\tSPEAKER_00\n No, they're events.\n\n0:38:24\tSPEAKER_00\n They're actually- The quality-\n\n0:38:26\tSPEAKER_06\n The quality is applying to the left.\n\n0:38:28\tSPEAKER_08\n Right, I just meant the middle two.\n\n0:38:30\tSPEAKER_00\n Yeah. Well, and actually it is true that with respect to laugh, there's another one which is while laughing.\n\n0:38:38\tSPEAKER_00\n And that is- An argument could be made for this turning that into a qualitative statement because it's talking about the thing that preceded it.\n\n0:38:47\tSPEAKER_00\n But at present we haven't been coding the exact scope of laughing, you know?\n\n0:38:53\tSPEAKER_00\n And so to have while laughing, you know that it happened somewhere in there, which could well mean that it occurred separately and following, or, you know, including some of the utterances to the left.\n\n0:39:02\tSPEAKER_00\n Haven't been awfully precise about that.\n\n0:39:04\tSPEAKER_00\n But I have here- Now we're about to get to this now.\n\n0:39:06\tSPEAKER_00\n I have frequencies.\n\n0:39:07\tSPEAKER_00\n So you'll see how often these different things occur.\n\n0:39:10\tSPEAKER_00\n But the very front page deals with this final aspect of standardization which has to do with the spoken forms like mm-hmm, and ha, and uh-uh, and all these different types.\n\n0:39:24\tSPEAKER_00\n And someone pointed out to me- This might have been Chuck.\n\n0:39:29\tSPEAKER_00\n About how a recognizer if it's looking for mm-hmm with 3M's, and it's transcribed with 2M's, that it might increase the air rate, which should really be a shame, because I personally would not be able to make a claim that those are dramatically different items.\n\n0:39:48\tSPEAKER_00\n So right now I've standardized across all the existing data with these spoken forms.\n\n0:39:52\tSPEAKER_00\n I should say all existing data except 30 minutes which got found today.\n\n0:39:57\tSPEAKER_00\n So I know- I'm going to check.\n\n0:39:59\tSPEAKER_00\n Yeah, actually, yeah, it was stored in a place I didn't expect.\n\n0:40:03\tSPEAKER_00\n So, and we reconstructed how to happen.\n\n0:40:08\tSPEAKER_00\n And this would be great.\n\n0:40:11\tSPEAKER_00\n So I'll be able to get through that tonight and then actually later today, really.\n\n0:40:15\tSPEAKER_00\n And so then we'll have everything following these conventions.\n\n0:40:17\tSPEAKER_00\n But notice it's a really rather small set of these kinds of things.\n\n0:40:21\tSPEAKER_00\n And I made it so that these are- With a couple exceptions, but things that you wouldn't find in the spell checker so that they'll show up really easily.\n\n0:40:29\tSPEAKER_03\n And- Jane, can I ask you a question?\n\n0:40:34\tSPEAKER_00\n Well, does that very last one correspond to?\n\n0:40:35\tSPEAKER_00\n Yeah, yeah.\n\n0:40:36\tSPEAKER_00\n That's only hers once and I'm thinking of changing that.\n\n0:40:38\tSPEAKER_00\n Is that like someone's warning or something?\n\n0:40:40\tSPEAKER_00\n I haven't heard it actually.\n\n0:40:41\tSPEAKER_00\n I need to listen to that.\n\n0:40:42\tSPEAKER_04\n Actually, we gave this to our pronunciation person.\n\n0:40:44\tSPEAKER_04\n She's like, I don't know what that is either.\n\n0:40:46\tSPEAKER_04\n Did she actually hear it?\n\n0:40:48\tSPEAKER_04\n No, we had- We gave her a list of words that weren't in our dictionary.\n\n0:40:52\tSPEAKER_04\n And so of course it picked up stuff like this.\n\n0:40:54\tSPEAKER_04\n And she just didn't listen.\n\n0:40:55\tSPEAKER_04\n So if she didn't know, we're just waiting on it.\n\n0:40:58\tSPEAKER_00\n Yeah, I'm curious to see what it is, but I didn't want to change it to something else until- You can't hear it.\n\n0:41:02\tSPEAKER_00\n Well, you know-\n\n0:41:03\tSPEAKER_03\n But that's not really like- Yeah.\n\n0:41:05\tSPEAKER_03\n No one really says arg.\n\n0:41:06\tSPEAKER_03\n Right, no- It's a- I said the highest ass, that's right.\n\n0:41:11\tSPEAKER_05\n That's a big problem when we talk about that.\n\n0:41:12\tSPEAKER_05\n We're going to never recognize this meeting.\n\n0:41:13\tSPEAKER_05\n Money ties on the art.\n\n0:41:14\tSPEAKER_06\n Well, yeah.\n\n0:41:16\tSPEAKER_06\n Well, or if you're a see programmer.\n\n0:41:18\tSPEAKER_04\n Yeah, that's right.\n\n0:41:19\tSPEAKER_04\n The art, see, and art, see, and art.\n\n0:41:20\tSPEAKER_04\n That's right.\n\n0:41:21\tSPEAKER_04\n It has a different pros.\n\n0:41:22\tSPEAKER_06\n It has arch-max, arch-max.\n\n0:41:24\tSPEAKER_05\n So Jane, what's-\n\n0:41:25\tSPEAKER_04\n Maybe tie- So I have one question about the EH versus like the AH and U-A.\n\n0:41:31\tSPEAKER_00\n That's partly a non-native native thing, but I have found EH and the native speakers too.\n\n0:41:36\tSPEAKER_00\n But it's mostly non-native.\n\n0:41:37\tSPEAKER_00\n Okay.\n\n0:41:38\tSPEAKER_00\n That's A versus A.\n\n0:41:39\tSPEAKER_04\n A.\n\n0:41:40\tSPEAKER_04\n A, yeah, right, because there were some speakers that did definite A's, but right now we- There were the Canadians, right?\n\n0:41:50\tSPEAKER_04\n So it's actually probably good for us to know the difference between the real A and the one that- Exactly.\n\n0:41:56\tSPEAKER_04\n Because in switchboard you would see all of these forms, but they all were like, ah.\n\n0:42:02\tSPEAKER_06\n I mean, just the single letter A has in the particles group.\n\n0:42:07\tSPEAKER_04\n No, no, I mean like the UH or the UH EH were all the same.\n\n0:42:13\tSPEAKER_04\n And then we have this additional non-native version of A.\n\n0:42:17\tSPEAKER_03\n All the EHs I've seen have been like that.\n\n0:42:19\tSPEAKER_03\n They've been like, eh, like that has been transcribed to EH.\n\n0:42:23\tSPEAKER_03\n And sometimes it's stronger, like A, which is like closer to EH, but- Yeah.\n\n0:42:30\tSPEAKER_06\n I'm just these poor transcribers, I know.\n\n0:42:32\tSPEAKER_00\n Well, we're not doing- We're not doing- We're not doing clause for us.\n\n0:42:35\tSPEAKER_00\n That's right.\n\n0:42:36\tSPEAKER_00\n Who knows?\n\n0:42:37\tSPEAKER_04\n And your native German speaker, so not a- Not an issue for-\n\n0:42:43\tSPEAKER_06\n It's only- Thick-thick Canadians.\n\n0:42:45\tSPEAKER_04\n Not only if you don't have black swallows, I guess, right?\n\n0:42:50\tSPEAKER_00\n That's my sense.\n\n0:42:53\tSPEAKER_00\n That's my sense.\n\n0:42:54\tSPEAKER_00\n That's my sense.\n\n0:42:55\tSPEAKER_00\n Yeah, and so, you know, I mean, I have- There are some Americans who are using this A2, and I haven't listened to it systematically.\n\n0:43:02\tSPEAKER_00\n Maybe with some of them, they'd end up being us, but- My spot checking has made me think that we do have A and also American data represented here.\n\n0:43:12\tSPEAKER_00\n But, in any case, this is reduced down from really quite a long- Much longer list.\n\n0:43:16\tSPEAKER_00\n Yeah, this is great.\n\n0:43:17\tSPEAKER_00\n This is really, really helpful.\n\n0:43:18\tSPEAKER_00\n Functionally pretty, you know, also.\n\n0:43:19\tSPEAKER_00\n It was fascinating.\n\n0:43:20\tSPEAKER_00\n I was listening to some of these, I guess, two nights ago, and it's just hilarious to listen to- To do a search for the m-hms, and you get m-hm, and do- Everybody's doing it.\n\n0:43:29\tSPEAKER_00\n Just doing it.\n\n0:43:30\tSPEAKER_00\n I think it would be fun to make a montage of it, because- Performance are just a extract.\n\n0:43:35\tSPEAKER_00\n Right.\n\n0:43:36\tSPEAKER_00\n It's really, it's really fun to listen.\n\n0:43:38\tSPEAKER_00\n All these different vocal tracks, you know, but it's the same item, it's very interesting.\n\n0:43:42\tSPEAKER_00\n Okay.\n\n0:43:43\tSPEAKER_00\n Then the acronyms, and the ones in parentheses are ones which the transgarber wasn't sure of, and I haven't been able to listen to it to clarify.\n\n0:43:49\tSPEAKER_00\n But you can see that the parentheses convention makes it very easy to find them, because it's the only question mark for- The question mark is punctuation, so they said that- Oh.\n\n0:43:58\tSPEAKER_00\n D-C?\n\n0:43:59\tSPEAKER_00\n So it's PLP?\n\n0:44:00\tSPEAKER_00\n Exactly.\n\n0:44:01\tSPEAKER_00\n Exactly.\n\n0:44:02\tSPEAKER_00\n Yeah, so the only- Well, and I do have a stress marker here.\n\n0:44:06\tSPEAKER_00\n Sometimes the contrast to a stress is showing up, and-\n\n0:44:08\tSPEAKER_07\n That's right, I got lost here. What's the difference between the parenthesis acronym and the non-prenthesis?\n\n0:44:13\tSPEAKER_00\n The parenthesis is something that the transgarber thought was A and N, but wasn't entirely sure.\n\n0:44:18\tSPEAKER_00\n So I'd need to go back, or someone needs to go back and say, you know, yes or no, and then get rid of the parentheses.\n\n0:44:23\tSPEAKER_00\n But the parentheses are used only in that context in the transcripts of- I've noticed- Noticing that there's something uncertain.\n\n0:44:29\tSPEAKER_00\n Yeah, I mean, they have no idea right.\n\n0:44:31\tSPEAKER_04\n If you hear CTPD, I mean, they do pretty well, but it's- I don't recognize- You know, how are they gonna know?\n\n0:44:37\tSPEAKER_06\n I think a lot of them are the networks we think.\n\n0:44:39\tSPEAKER_00\n I think that's true.\n\n0:44:40\tSPEAKER_00\n Yeah, absolutely.\n\n0:44:41\tSPEAKER_00\n In fact, a lot of these are coming from them.\n\n0:44:43\tSPEAKER_00\n I listen to some of that.\n\n0:44:44\tSPEAKER_03\n Although we don't have that many acronyms, comparatively.\n\n0:44:47\tSPEAKER_03\n In this meeting, it's not a bad thing.\n\n0:44:49\tSPEAKER_00\n And robustness is a fair amount, but the NSA group is just very, very many.\n\n0:44:53\tSPEAKER_04\n The recognizeer is funny.\n\n0:44:55\tSPEAKER_04\n kept getting PTA for PTA.\n\n0:44:57\tSPEAKER_04\n This is supposed to rain, and the PTA wasn't these topics about children.\n\n0:45:03\tSPEAKER_04\n That's interesting.\n\n0:45:05\tSPEAKER_00\n Is the PTA working?\n\n0:45:08\tSPEAKER_00\n Sometimes I mean, you see a couple of these are actually OK's.\n\n0:45:11\tSPEAKER_00\n So it's- it's- it's maybe that they got to the point where it was low enough, understandable- and stand-ability that they weren't entirely sure the person said OK.\n\n0:45:18\tSPEAKER_00\n You know, so it isn't really necessarily a- an undes ifable acronym, but it just needs to be double-checked.\n\n0:45:23\tSPEAKER_00\n Now we get to the comments.\n\n0:45:24\tSPEAKER_07\n The number to the left is the number of consonants.\n\n0:45:26\tSPEAKER_00\n The number of times out of the entire database, except for that last 30 minutes I haven't checked yet.\n\n0:45:30\tSPEAKER_06\n So CTS is really good.\n\n0:45:32\tSPEAKER_02\n Yeah, I wonder what it is.\n\n0:45:34\tSPEAKER_02\n So what is- I just between papers, rostling and drostling papers.\n\n0:45:37\tSPEAKER_00\n I'd have to listen.\n\n0:45:38\tSPEAKER_00\n I- I agree.\n\n0:45:39\tSPEAKER_00\n I'd like to standardize these down farther, but, um, to me that sounds equivalent.\n\n0:45:46\tSPEAKER_00\n I'm a little hesitant to- to collapse cross categories unless I actually listen to them.\n\n0:45:51\tSPEAKER_06\n Oh, I'm sure we've said XML more than five times.\n\n0:45:56\tSPEAKER_06\n Well, at least now.\n\n0:45:58\tSPEAKER_01\n That's a least six times.\n\n0:46:01\tSPEAKER_01\n OK, well- I'm so preferential.\n\n0:46:07\tSPEAKER_04\n Yes, it's very bad.\n\n0:46:08\tSPEAKER_04\n Well, this is exactly how people will prove that these meetings do differ because we're recording, right?\n\n0:46:11\tSPEAKER_04\n Yes.\n\n0:46:12\tSPEAKER_04\n Normally you don't go around saying, now you've said it six times.\n\n0:46:17\tSPEAKER_00\n But you notice that there were 785 instances of OK.\n\n0:46:20\tSPEAKER_00\n Yeah.\n\n0:46:21\tSPEAKER_00\n And that's not the right one.\n\n0:46:22\tSPEAKER_00\n And that's not the right one.\n\n0:46:23\tSPEAKER_00\n And that's not the right one.\n\n0:46:24\tSPEAKER_00\n The first question.\n\n0:46:25\tSPEAKER_00\n So, yeah.\n\n0:46:27\tSPEAKER_00\n On the page two acronyms.\n\n0:46:28\tSPEAKER_03\n Yeah.\n\n0:46:29\tSPEAKER_03\n Is this after- Like, did you do some replacements for all the different forms of OK to this?\n\n0:46:33\tSPEAKER_00\n OK.\n\n0:46:34\tSPEAKER_00\n So, that's the single existing convention for OK.\n\n0:46:37\tSPEAKER_08\n Wait a minute.\n\n0:46:38\tSPEAKER_08\n It's not worth a 788.\n\n0:46:40\tSPEAKER_03\n Although, there's one with a slash after it.\n\n0:46:43\tSPEAKER_03\n Yeah.\n\n0:46:44\tSPEAKER_00\n That's kind of disturbing.\n\n0:46:45\tSPEAKER_00\n I look for that one.\n\n0:46:46\tSPEAKER_00\n I actually explicitly look for that one.\n\n0:46:48\tSPEAKER_00\n And I think that I'm not exactly sure about that.\n\n0:46:51\tSPEAKER_08\n Is that somewhere where they were going to say new speakers or something?\n\n0:46:54\tSPEAKER_00\n No, I look for that.\n\n0:46:55\tSPEAKER_00\n That doesn't actually exist.\n\n0:46:57\tSPEAKER_00\n And maybe- I can't explain that.\n\n0:46:59\tSPEAKER_03\n That's all right.\n\n0:47:00\tSPEAKER_00\n It's only- It's the only pattern that has a slash after it.\n\n0:47:03\tSPEAKER_00\n And I think it's not-\n\n0:47:04\tSPEAKER_06\n I was just looking at the bottom of page three. Is that 2B or not 2B?\n\n0:47:07\tSPEAKER_06\n Yeah.\n\n0:47:08\tSPEAKER_01\n There's no tilde in front of it.\n\n0:47:11\tSPEAKER_01\n That's funny.\n\n0:47:12\tSPEAKER_00\n Yeah.\n\n0:47:13\tSPEAKER_00\n OK.\n\n0:47:14\tSPEAKER_00\n Anyways.\n\n0:47:16\tSPEAKER_06\n There is one.\n\n0:47:17\tSPEAKER_06\n There is one.\n\n0:47:18\tSPEAKER_06\n It's no on topic, Adam.\n\n0:47:19\tSPEAKER_00\n Well, let's- Let's legitimate- So, now, comments you can see they're listed again.\n\n0:47:25\tSPEAKER_00\n Same deal with the exhaustive listing of everything found and everything except for these final 30 minutes.\n\n0:47:29\tSPEAKER_06\n OK. So, on some of these quals- Yeah.\n\n0:47:34\tSPEAKER_06\n Are they really quals or are they glosses?\n\n0:47:36\tSPEAKER_06\n So, like, there's a- Qual TCL?\n\n0:47:39\tSPEAKER_00\n TCL. Where do you see that?\n\n0:47:41\tSPEAKER_00\n Uh-oh.\n\n0:47:42\tSPEAKER_00\n The reason is because it was said tickle.\n\n0:47:45\tSPEAKER_06\n Oh, I see, I see.\n\n0:47:46\tSPEAKER_06\n So, it's not gloss.\n\n0:47:47\tSPEAKER_06\n OK, I see.\n\n0:47:48\tSPEAKER_06\n Yeah.\n\n0:47:49\tSPEAKER_03\n It wasn't said TCL.\n\n0:47:50\tSPEAKER_03\n Should it be called TIC-KLE or something?\n\n0:47:52\tSPEAKER_03\n Like, it's not-\n\n0:47:53\tSPEAKER_00\n In the actual script, in the actual transcript, I-so this happens in the very first one.\n\n0:47:59\tSPEAKER_00\n I actually wrote it as tickle.\n\n0:48:01\tSPEAKER_00\n OK.\n\n0:48:02\tSPEAKER_00\n Because they didn't say TCL, they said tickle.\n\n0:48:04\tSPEAKER_00\n Yeah.\n\n0:48:05\tSPEAKER_00\n And then, following that is, Qual TCL.\n\n0:48:07\tSPEAKER_00\n Oh, I see.\n\n0:48:08\tSPEAKER_03\n OK.\n\n0:48:09\tSPEAKER_03\n I forget what's Qual.\n\n0:48:10\tSPEAKER_00\n Qualifier.\n\n0:48:11\tSPEAKER_00\n Just comment about what they said.\n\n0:48:13\tSPEAKER_08\n Comment.\n\n0:48:14\tSPEAKER_00\n Yeah.\n\n0:48:15\tSPEAKER_00\n Comment, dirt, text, your comment.\n\n0:48:16\tSPEAKER_08\n So, they didn't mean tickle as in, Elmo, then tickle.\n\n0:48:21\tSPEAKER_08\n But at some point, we probably-\n\n0:48:23\tSPEAKER_04\n We should add it to the dictionary. No, it's the pronunciation model.\n\n0:48:27\tSPEAKER_04\n What did I say?\n\n0:48:28\tSPEAKER_06\n Language.\n\n0:48:29\tSPEAKER_06\n Well, both.\n\n0:48:30\tSPEAKER_06\n We can add it to the language model.\n\n0:48:32\tSPEAKER_04\n Yeah, but it's the pronunciation model.\n\n0:48:35\tSPEAKER_04\n It has to have a pronunciation of TIC-KLE.\n\n0:48:38\tSPEAKER_06\n Well, TIC-KLE was pronounced TIC-KLE.\n\n0:48:40\tSPEAKER_06\n Right.\n\n0:48:41\tSPEAKER_06\n What do you say?\n\n0:48:42\tSPEAKER_06\n It's pronounced the same as the verb.\n\n0:48:45\tSPEAKER_06\n So, I think it's the language model that makes it different.\n\n0:48:48\tSPEAKER_06\n Oh, sorry.\n\n0:48:49\tSPEAKER_04\n What I meant is that there should be a pronunciation tickle for TCL as a word.\n\n0:48:55\tSPEAKER_04\n And that word stays in the language model wherever it was.\n\n0:48:58\tSPEAKER_04\n Right.\n\n0:48:59\tSPEAKER_04\n Yeah, you never would put tickle in the language model in that form.\n\n0:49:02\tSPEAKER_04\n Right.\n\n0:49:03\tSPEAKER_04\n There's actually a bunch of cases like this.\n\n0:49:05\tSPEAKER_08\n So, how would there be a problem for doing the language model and then with our transcripts over here?\n\n0:49:09\tSPEAKER_04\n Yes.\n\n0:49:10\tSPEAKER_04\n Yeah.\n\n0:49:11\tSPEAKER_04\n Yeah, so there's a few cases like that where the word needs to be spelled out in a consistent way as it would appear in the language, but there's not very many of these.\n\n0:49:23\tSPEAKER_04\n Tickles one of them.\n\n0:49:24\tSPEAKER_04\n And you'll have to do it synchronously.\n\n0:49:26\tSPEAKER_04\n Right.\n\n0:49:27\tSPEAKER_06\n So, whoever's creating the new models will have to also go through the transcripts and choose them synchronously.\n\n0:49:34\tSPEAKER_04\n Right.\n\n0:49:35\tSPEAKER_04\n We have this, there is this thing I was going to talk to you at some point about, you know, what do we do with the dictionary as we're updating the dictionary?\n\n0:49:43\tSPEAKER_04\n These changes have to be consistent with what's in the, like spelling people's names and so forth.\n\n0:49:49\tSPEAKER_04\n If we make a spelling correction to their name, like someone had Deborah Tannen's name, Miss Bell, and since we know who that is, you know, we can correct it, but we need to make sure we have the misspell, if it doesn't get corrected, we have to have a pronunciation as a misspell word in the dictionary, it's like that.\n\n0:50:05\tSPEAKER_00\n Well, of course now the, the Tannen, the spelling, I pick those up in the frequency check.\n\n0:50:11\tSPEAKER_00\n Right.\n\n0:50:12\tSPEAKER_04\n Right.\n\n0:50:13\tSPEAKER_04\n So, if there's things that get corrected before we get them, it's not an issue.\n\n0:50:16\tSPEAKER_04\n If there's things that we change later, then we always have to keep our dictionary up to date.\n\n0:50:24\tSPEAKER_04\n And then, yeah, in the case of tickle, I guess we would just have a word TCL, which, which normally would be an acronym, you know, TCL, but just has another pronunciation.\n\n0:50:35\tSPEAKER_04\n Yeah.\n\n0:50:36\tSPEAKER_00\n XCs is one of those that sometimes people pronounce and sometimes they say I see a sign.\n\n0:50:40\tSPEAKER_00\n So, those that are listed in the acronyms, I actually know they were said as letters.\n\n0:50:45\tSPEAKER_00\n The others, those really do need to be listened to, because I haven't been able to go to all the XC things.\n\n0:50:52\tSPEAKER_00\n And until they've been listened to, they stay as ICSI.\n\n0:50:54\tSPEAKER_00\n Right.\n\n0:50:55\tSPEAKER_07\n Don and I were just noticing, love this one over on page three.\n\n0:51:00\tSPEAKER_07\n Vocal gesture mimicking sound, obscuring something to head to whole blanket place.\n\n0:51:05\tSPEAKER_07\n It's great.\n\n0:51:06\tSPEAKER_07\n It was me.\n\n0:51:08\tSPEAKER_06\n It was, in fact, it was.\n\n0:51:10\tSPEAKER_06\n Yeah.\n\n0:51:11\tSPEAKER_06\n A lot of these are me.\n\n0:51:12\tSPEAKER_06\n He said he said he said with a high pitch and lengthening.\n\n0:51:15\tSPEAKER_06\n That was the, I was imitating beeping out.\n\n0:51:18\tSPEAKER_06\n Perfect.\n\n0:51:19\tSPEAKER_04\n Oh, there is something.\n\n0:51:20\tSPEAKER_04\n I spelled out BEEE.\n\n0:51:21\tSPEAKER_04\n Yeah.\n\n0:51:22\tSPEAKER_04\n That's been changed.\n\n0:51:23\tSPEAKER_04\n Thank you.\n\n0:51:24\tSPEAKER_04\n Because he was saying, how many of these do I have to allow?\n\n0:51:27\tSPEAKER_03\n You need a lot of qualification in it.\n\n0:51:29\tSPEAKER_03\n That's been changed.\n\n0:51:30\tSPEAKER_00\n So, exactly.\n\n0:51:31\tSPEAKER_00\n That's where the lengthening comment can't get in.\n\n0:51:33\tSPEAKER_00\n Right.\n\n0:51:34\tSPEAKER_00\n Right.\n\n0:51:35\tSPEAKER_00\n So, the vocalization.\n\n0:51:36\tSPEAKER_00\n And those, of course, get picked up on the frequency check, because CBE, and you know, I mean, it gets kicked out in the spelling and also gets kicked out in the frequency listing.\n\n0:51:45\tSPEAKER_00\n And I have the various things like breathe versus breath versus inhale.\n\n0:51:49\tSPEAKER_00\n And, you know, I don't know.\n\n0:51:51\tSPEAKER_00\n I think they don't have any implications for anything else.\n\n0:51:54\tSPEAKER_00\n So, it's like I'm tempted to leave them for now.\n\n0:51:56\tSPEAKER_00\n And it's easy enough to find them when they're in curly brackets.\n\n0:51:58\tSPEAKER_00\n We can always get an exhaustive listing of these things and find them and change them.\n\n0:52:01\tSPEAKER_07\n Things finale types on.\n\n0:52:03\tSPEAKER_07\n Yeah.\n\n0:52:04\tSPEAKER_00\n This is the first meeting.\n\n0:52:05\tSPEAKER_00\n Yeah, but I don't actually remember what it was, but that was Eric did that.\n\n0:52:09\tSPEAKER_06\n Yeah.\n\n0:52:10\tSPEAKER_06\n So, on.\n\n0:52:11\tSPEAKER_06\n Ta-da.\n\n0:52:12\tSPEAKER_00\n I think maybe something like that.\n\n0:52:13\tSPEAKER_00\n Maybe, yeah.\n\n0:52:14\tSPEAKER_00\n I'll take a call if I want.\n\n0:52:16\tSPEAKER_06\n On the glosses for numbers.\n\n0:52:18\tSPEAKER_00\n Yeah.\n\n0:52:19\tSPEAKER_06\n It seems like they're lost in different ways it's being done.\n\n0:52:23\tSPEAKER_00\n Yes.\n\n0:52:24\tSPEAKER_00\n Okay.\n\n0:52:25\tSPEAKER_00\n Now, first of all, very important.\n\n0:52:26\tSPEAKER_00\n Check, check lead to refinement here, which is to add numbs if these are parts of the red numbers.\n\n0:52:31\tSPEAKER_00\n Now, you already know that I had places where they hadn't transcribed numbers, put numbers in place of any kind of numbers, but there were places where they, this convention came later and at the very first digits task in some transcripts, they actually transcribed numbers and, um, check point out that this is a red speech and it's nice to have the option of ignoring it for certain other pop things.\n\n0:52:55\tSPEAKER_00\n And that's why there's this other tag here which occurs a 105, or 305 times right now, which is just, well, and numbs by itself, which means this is part of the numbers task.\n\n0:53:04\tSPEAKER_00\n I may change it to digits.\n\n0:53:05\tSPEAKER_00\n I mean, with the said command, you can really just change it however you want because it's systematically encoded.\n\n0:53:10\tSPEAKER_00\n Yeah.\n\n0:53:11\tSPEAKER_00\n You have to think about what's the best for the overall purposes, but in any case, numbers and numbs are part of this digits task thing.\n\n0:53:19\tSPEAKER_00\n Now, then I have these numbers that have quotation marks around them.\n\n0:53:23\tSPEAKER_00\n I didn't want to put them in its gloss comments because then you get the substitution.\n\n0:53:27\tSPEAKER_00\n And actually, the reason I did it this way was because I initially started out with the other version.\n\n0:53:33\tSPEAKER_00\n You have the numbers and you have the full form and the print of these.\n\n0:53:35\tSPEAKER_00\n However, sometimes people stumble over these numbers they're saying.\n\n0:53:38\tSPEAKER_00\n So you say, 78.2 or whatever.\n\n0:53:42\tSPEAKER_00\n And there's no way of capturing that if you're putting the numbers off to the side.\n\n0:53:45\tSPEAKER_00\n So what's the whole left of these?\n\n0:53:47\tSPEAKER_00\n The left is, so example, the very first one, it would be spelled out in words.\n\n0:53:52\tSPEAKER_06\n Okay, that's what I was asking.\n\n0:53:54\tSPEAKER_00\n 0.5.\n\n0:53:55\tSPEAKER_00\n Right.\n\n0:53:56\tSPEAKER_00\n Only it's spelled out in words.\n\n0:53:58\tSPEAKER_00\n So this is also spelled out in words.\n\n0:54:00\tSPEAKER_00\n 0.5.\n\n0:54:01\tSPEAKER_00\n Good.\n\n0:54:02\tSPEAKER_00\n And then in here, numbs.\n\n0:54:04\tSPEAKER_00\n So it's not going to be mistaken as a gloss.\n\n0:54:07\tSPEAKER_00\n It comes out as numbs.\n\n0:54:09\tSPEAKER_00\n Quote.5.\n\n0:54:10\tSPEAKER_06\n Okay, now the other example is in the glosses right there.\n\n0:54:14\tSPEAKER_06\n Gloss.1.1-130.\n\n0:54:16\tSPEAKER_06\n Oh, no.\n\n0:54:17\tSPEAKER_00\n What's the left of that?\n\n0:54:18\tSPEAKER_00\n In that case, it's people saying things like 1.1.1-so-so or they're saying 2.0, whatever.\n\n0:54:26\tSPEAKER_00\n And in that case, it's part of the numbers task and it's not going to be included in the red digits anyway.\n\n0:54:31\tSPEAKER_00\n So there will be a numbs tag on those lines?\n\n0:54:33\tSPEAKER_08\n There is.\n\n0:54:34\tSPEAKER_00\n Yeah.\n\n0:54:35\tSPEAKER_00\n I've added that all now too.\n\n0:54:36\tSPEAKER_00\n There's a numbers tag.\n\n0:54:37\tSPEAKER_03\n I'm sorry, I didn't follow that last thing.\n\n0:54:39\tSPEAKER_00\n So gloss.\n\n0:54:40\tSPEAKER_00\n In the same line that would have a gloss, quote, 1.1.1-130.\n\n0:54:43\tSPEAKER_00\n Right.\n\n0:54:44\tSPEAKER_00\n You'd have a gloss at the end of the line saying curly bracket, numbs curly bracket.\n\n0:54:48\tSPEAKER_00\n So if you did a graph minus V numbs, so you get rid of anything that was red.\n\n0:54:54\tSPEAKER_04\n So there wouldn't be something like, if somebody said something like, boy, I'm really tired, OK, and then started reading.\n\n0:55:01\tSPEAKER_04\n That would be in a separate line.\n\n0:55:02\tSPEAKER_04\n Yes.\n\n0:55:03\tSPEAKER_04\n OK, great.\n\n0:55:04\tSPEAKER_04\n Because I was doing the graph minus V quick and dirty and looked like that was working OK.\n\n0:55:08\tSPEAKER_04\n Good.\n\n0:55:09\tSPEAKER_04\n Great.\n\n0:55:10\tSPEAKER_04\n Now, why do we, what's the reason for having like the 0.5 have the numbs on it?\n\n0:55:15\tSPEAKER_04\n Is it just like when they're talking about their data or something?\n\n0:55:17\tSPEAKER_00\n This is more because, yeah, oh, these are all these, the numbs point side.\n\n0:55:21\tSPEAKER_00\n These are all where they're saying point.\n\n0:55:23\tSPEAKER_00\n It's something or other.\n\n0:55:24\tSPEAKER_00\n And the other thing too is for readability, the transcript.\n\n0:55:27\tSPEAKER_00\n I mean, if you're trying to follow this while you're reading it, it's really hard to read.\n\n0:55:31\tSPEAKER_00\n So in the data column 5 has 1.5 compared to 79.6.\n\n0:55:38\tSPEAKER_00\n It's like, when you see the words, it's really hard to follow the argument.\n\n0:55:41\tSPEAKER_00\n And this is just really a way of someone who would handle the data in a more discoracy way to be able to follow what's being said.\n\n0:55:48\tSPEAKER_00\n So this is where it chucks overall architecture comes in, where we're going to have a master file of the channelized data.\n\n0:55:57\tSPEAKER_00\n There will be scripts that are written to convert it into these main two uses.\n\n0:56:01\tSPEAKER_00\n And some scripts will take it down into a format that's usable for the recognizer.\n\n0:56:07\tSPEAKER_00\n Other scripts will take it to a form that's usable for linguistics and discourse analysis.\n\n0:56:13\tSPEAKER_00\n And the implication that I have is that the master copy will stay unchanged.\n\n0:56:18\tSPEAKER_00\n These will just be things that are generated.\n\n0:56:20\tSPEAKER_00\n And by using scripts, when things change, then the script will change.\n\n0:56:24\tSPEAKER_00\n But there won't be stored copies in different versions of things.\n\n0:56:28\tSPEAKER_04\n So I guess I'd have one request here, which is just maybe to make it more robust, that the tag, whatever you would choose for this type of numbs, where it's inside the spontaneous speech is different than the tag that you use for the red speech.\n\n0:56:42\tSPEAKER_04\n That would argue for changing the other ones.\n\n0:56:44\tSPEAKER_04\n That way, if we make a mistake parsing or something, we don't see the.5 or it's not there, then we just, and actually for things like 7-8th, or people do fractions too, I guess, maybe you want one overall tag for sort of that would be similar to that.\n\n0:57:00\tSPEAKER_04\n Or as long as there's different strings that will make our processing more robust, because we really will get rid of everything that has the numbs string in it.\n\n0:57:10\tSPEAKER_08\n I suppose what you could do is just make sure that you get rid of everything that has curly brace numbs, curly brace.\n\n0:57:16\tSPEAKER_08\n Exactly. That would be that. That was my motivation.\n\n0:57:19\tSPEAKER_00\n And these can be changed, like I said.\n\n0:57:22\tSPEAKER_00\n As I said, I was considering changing it to digits.\n\n0:57:25\tSPEAKER_00\n And it's just a matter of deciding on whatever it is and being sure the scripts know.\n\n0:57:29\tSPEAKER_04\n It would probably be safer if you're willing to have a separate tag, just because then we know for sure, and we can also do counts on them without having to do the processing.\n\n0:57:38\tSPEAKER_04\n But you're right, we could do it this way. It should work.\n\n0:57:41\tSPEAKER_04\n Yeah, and it makes it, I guess, the thing about... Probably not hard for a person to tell the difference, because one's in the context of a transcribed word.\n\n0:57:50\tSPEAKER_00\n The thing is you can get really so minute with these things and increase the size of the files and decrease of readability such an extent by simply something like percent.\n\n0:57:59\tSPEAKER_00\n Now, I could have adopted a similar convention for percent, but somehow percent is not so hard.\n\n0:58:04\tSPEAKER_00\n When you have these points and you're trying to figure out where the decimal voices are, percent's easy to detect. Point, however, is a word that has a couple different meanings, and you'll find both of those in one of these meetings.\n\n0:58:15\tSPEAKER_00\n We're saying the first point I want to make is so-and-so on.\n\n0:58:17\tSPEAKER_00\n Those two four points and also has all these decimals.\n\n0:58:20\tSPEAKER_08\n So, Liz, what does the recognizer do?\n\n0:58:23\tSPEAKER_08\n What is the SRA recognizer output for things like that?\n\n0:58:26\tSPEAKER_08\n 7.5. Does it output the word...\n\n0:58:28\tSPEAKER_08\n 7.5.\n\n0:58:29\tSPEAKER_04\n Right, the word 7?\n\n0:58:30\tSPEAKER_08\n The number 7?\n\n0:58:31\tSPEAKER_08\n The word 7.\n\n0:58:32\tSPEAKER_08\n Yeah.\n\n0:58:33\tSPEAKER_04\n And actually, you know, the language...\n\n0:58:34\tSPEAKER_04\n What we talk about point...\n\n0:58:35\tSPEAKER_04\n The same point, actually, the word 2 and the word...\n\n0:58:38\tSPEAKER_04\n They're going to and to go to.\n\n0:58:41\tSPEAKER_04\n Those are two different twos.\n\n0:58:43\tSPEAKER_04\n So, there's no distinction there.\n\n0:58:45\tSPEAKER_04\n It's just the word point.\n\n0:58:47\tSPEAKER_04\n Every word has only one version, even if it's...\n\n0:58:55\tSPEAKER_04\n Actually, even like the word read and read, those are two different words.\n\n0:58:59\tSPEAKER_04\n They're spelled the same way.\n\n0:59:01\tSPEAKER_04\n They're still going to be transcribed as R-E-A-D.\n\n0:59:04\tSPEAKER_04\n So, yeah, I like the idea of having this in there.\n\n0:59:07\tSPEAKER_04\n I was a little bit worried that the tag for removing the red speech.\n\n0:59:12\tSPEAKER_04\n Because what if we have like red letters or red...\n\n0:59:15\tSPEAKER_04\n We might want to just send them to the tag.\n\n0:59:17\tSPEAKER_01\n It says it's red.\n\n0:59:18\tSPEAKER_04\n Yeah, basically.\n\n0:59:20\tSPEAKER_04\n But other than that, it sounds great.\n\n0:59:23\tSPEAKER_06\n Okay.\n\n0:59:24\tSPEAKER_06\n Are we done?\n\n0:59:25\tSPEAKER_00\n Well, I wanted to say also regarding the channelized data that...\n\n0:59:29\tSPEAKER_00\n Yeah.\n\n0:59:30\tSPEAKER_00\n We requested that we get some segments done by hand to reduce the size of the time.\n\n0:59:36\tSPEAKER_00\n It's what was Chuck was mentioning earlier.\n\n0:59:39\tSPEAKER_00\n That if you said, oh, and it was in part of a really long complex overlapping segment, that the same starting end times would be held for that one, for the longer utterances.\n\n0:59:51\tSPEAKER_06\n We did that for one meeting, right?\n\n0:59:53\tSPEAKER_06\n So, you have that data, don't you?\n\n0:59:54\tSPEAKER_06\n Yeah, that's a training data.\n\n0:59:56\tSPEAKER_00\n He requested that there be similar samples done for five minute stretches, involving a variety of speakers and overlapping sections.\n\n1:00:04\tSPEAKER_00\n He gave me...\n\n1:00:05\tSPEAKER_00\n He did the very nice...\n\n1:00:06\tSPEAKER_00\n He did some shopping through the data and found segments that would be useful.\n\n1:00:09\tSPEAKER_00\n And at this point, all four of the ones that he specified have been done in addition.\n\n1:00:13\tSPEAKER_00\n I have the transcribers expanding the amount that they're doing, actually.\n\n1:00:17\tSPEAKER_00\n So, right now, I know that as of today, we got an extra 15 minutes of that type.\n\n1:00:22\tSPEAKER_00\n And I'm having them expand the realm on either side of these places where they've already started.\n\n1:00:27\tSPEAKER_02\n Okay.\n\n1:00:28\tSPEAKER_00\n But if...\n\n1:00:29\tSPEAKER_00\n And he's going to give me some more sections that he thinks would be useful for this purpose.\n\n1:00:33\tSPEAKER_00\n Because it's true.\n\n1:00:34\tSPEAKER_00\n I mean, if we could do the more fine grain tuning of this using an algorithm, that would be so much more efficient.\n\n1:00:41\tSPEAKER_00\n And so, this is going to be...\n\n1:00:44\tSPEAKER_02\n I thought we should perhaps try to start with those channelized versions, just to try to give one transcriber the channelized version of my speech and on speech detection.\n\n1:00:58\tSPEAKER_02\n And look, if that's helpful for them or just let them try, if that's better.\n\n1:01:05\tSPEAKER_02\n You mean to start from scratch and brand new transcriber?\n\n1:01:07\tSPEAKER_00\n That'd be excellent.\n\n1:01:08\tSPEAKER_00\n Yeah, that'd be really great.\n\n1:01:09\tSPEAKER_00\n As it stands, we're still on the phase of sort of cleaning up the existing data, getting things in more tightly, time in the line.\n\n1:01:17\tSPEAKER_00\n I also want to tell...I also want to bring the issue that...\n\n1:01:20\tSPEAKER_00\n Okay, so there's this idea we're going to have this master copy, the transcript, it's going to be modified by scripts into these two different functions.\n\n1:01:26\tSPEAKER_00\n And actually the master...\n\n1:01:28\tSPEAKER_00\n Two or more to...\n\n1:01:29\tSPEAKER_00\n...to our more.\n\n1:01:30\tSPEAKER_00\n And the master is going to be the channelized version.\n\n1:01:32\tSPEAKER_00\n Right.\n\n1:01:33\tSPEAKER_00\n So right now, we've taken this initial one.\n\n1:01:34\tSPEAKER_00\n It was a single channel, basically, the way it was input.\n\n1:01:37\tSPEAKER_00\n And now, thanks to the advances made in the interface, we can, from now on, use the channelized part and any changes that are made in the channelized version, anything.\n\n1:01:47\tSPEAKER_00\n But I wanted to get all the finishes and the checks.\n\n1:01:49\tSPEAKER_00\n So that has implications for your scripts.\n\n1:01:50\tSPEAKER_03\n So have those...the 10 hours that have been transcribed already, have those been channelized?\n\n1:01:56\tSPEAKER_03\n Yes they have.\n\n1:01:57\tSPEAKER_00\n And I've seen they've been channelized.\n\n1:01:59\tSPEAKER_00\n Except for the missing 30 minutes.\n\n1:02:01\tSPEAKER_03\n Right.\n\n1:02:02\tSPEAKER_03\n And they've been...has the time...have the time marking been adjusted?\n\n1:02:05\tSPEAKER_00\n For a total of like 20...for the total of the C-Pros, total of about 30 minutes, that's been the case.\n\n1:02:14\tSPEAKER_00\n And plus the training.\n\n1:02:15\tSPEAKER_03\n I guess, I mean, I don't know if we should talk about this now or now.\n\n1:02:18\tSPEAKER_03\n But that's just where...\n\n1:02:19\tSPEAKER_03\n Missing T.\n\n1:02:20\tSPEAKER_03\n Yeah, I know.\n\n1:02:21\tSPEAKER_03\n No, but I mean my question is, like, should I wait until all of those are processed and channelized like the time markings are adjusted before I do all the processing?\n\n1:02:28\tSPEAKER_03\n And we start like branching off into the...into our layer of...\n\n1:02:32\tSPEAKER_00\n Well, you know, the problem is that some...\n\n1:02:35\tSPEAKER_00\n some of the adjustments that they're making are to bring...\n\n1:02:38\tSPEAKER_00\n are to combine bins that were...\n\n1:02:40\tSPEAKER_00\n time bins, which were previously separate.\n\n1:02:42\tSPEAKER_00\n And the reason they do that is sometimes there's a word that's cut off.\n\n1:02:45\tSPEAKER_00\n Right.\n\n1:02:46\tSPEAKER_00\n And so it's true that it's likely to be adjusted in the way that the words are more complete.\n\n1:02:51\tSPEAKER_00\n And...\n\n1:02:52\tSPEAKER_00\n Okay.\n\n1:02:53\tSPEAKER_00\n No, I know that adjusting those things is going to make it better.\n\n1:02:56\tSPEAKER_03\n Yeah.\n\n1:02:57\tSPEAKER_03\n I'm going to be more reliable in that.\n\n1:02:58\tSPEAKER_03\n I'm not sure.\n\n1:02:59\tSPEAKER_03\n I'm not sure.\n\n1:03:00\tSPEAKER_03\n Yeah.\n\n1:03:01\tSPEAKER_03\n I'm going to be more reliable in that.\n\n1:03:02\tSPEAKER_00\n It's going to make it better.\n\n1:03:03\tSPEAKER_00\n Yeah.\n\n1:03:04\tSPEAKER_00\n I'm going to be more reliable in that.\n\n1:03:05\tSPEAKER_00\n Yeah.\n\n1:03:06\tSPEAKER_00\n And it will be to apply an algorithm because...\n\n1:03:08\tSPEAKER_00\n Yeah.\n\n1:03:09\tSPEAKER_00\n This takes time.\n\n1:03:10\tSPEAKER_00\n You know, it takes a couple hours to do 10 minutes.\n\n1:03:13\tSPEAKER_03\n Yeah, I don't doubt it.\n\n1:03:15\tSPEAKER_03\n So...\n\n1:03:17\tSPEAKER_08\n So right now, what you're doing is you're taking the...\n\n1:03:21\tSPEAKER_08\n the original version and you're sort of channelizing yourself.\n\n1:03:24\tSPEAKER_08\n Yeah.\n\n1:03:25\tSPEAKER_03\n I'm doing it myself.\n\n1:03:26\tSPEAKER_03\n I mean, if the time markings aren't different across channels, like the channelized version really doesn't have any more information.\n\n1:03:32\tSPEAKER_03\n So I was just... I mean, originally I had done it before, like the channelized versions were coming out.\n\n1:03:38\tSPEAKER_03\n Right.\n\n1:03:39\tSPEAKER_03\n And so it's a question of...\n\n1:03:41\tSPEAKER_08\n I think probably the way it'll go is that, you know, when we make this first general version and then start working on the script, that script that will be made, you know, primarily come from what you've done, we'll need to work on a channelized version of those originals.\n\n1:03:57\tSPEAKER_08\n And so it should be pretty much identical to what you have to...\n\n1:04:01\tSPEAKER_08\n except for the one that they've already tightened the boundaries.\n\n1:04:04\tSPEAKER_08\n Right.\n\n1:04:05\tSPEAKER_08\n Yeah.\n\n1:04:06\tSPEAKER_08\n So...\n\n1:04:07\tSPEAKER_08\n And then probably what will happen is as the transcribers finish tightening more and more, you know, that original version will get updated and we'll rerun the script and produce better versions.\n\n1:04:17\tSPEAKER_08\n Okay.\n\n1:04:18\tSPEAKER_08\n But I guess the effect for you guys, because you're pulling out the little waveforms into separate ones, that would mean these boundaries are constantly changing.\n\n1:04:26\tSPEAKER_08\n You definitely constantly rerun that.\n\n1:04:28\tSPEAKER_08\n Right.\n\n1:04:29\tSPEAKER_04\n But that's not hard.\n\n1:04:31\tSPEAKER_04\n I think the harder part is making sure that the transcription...\n\n1:04:35\tSPEAKER_04\n So if you merge two things, then you know that it's a sum of the transcripts.\n\n1:04:39\tSPEAKER_04\n But if you split inside something, you don't know where the word, which words moved.\n\n1:04:44\tSPEAKER_04\n And that's where it becomes a little bit having to rerun the processing.\n\n1:04:49\tSPEAKER_04\n The cutting of the waveform is pretty trivial.\n\n1:04:52\tSPEAKER_03\n I mean, as long as it can all be done automatically, I mean, then that's not a concern.\n\n1:04:56\tSPEAKER_03\n So if I just have to run three scripts to extract it, I'll let it run on my computer for an hour and a half, or however long it takes to parse and create all the reference files, it's not a problem.\n\n1:05:07\tSPEAKER_03\n So yeah, as long as we're at that point, and I know exactly what steps, what work, what's going on in the editing process.\n\n1:05:14\tSPEAKER_03\n Okay.\n\n1:05:17\tSPEAKER_00\n So that's...\n\n1:05:18\tSPEAKER_00\n I mean, I could...\n\n1:05:19\tSPEAKER_00\n There were other checks that I did, but it's...\n\n1:05:20\tSPEAKER_00\n I think that we...\n\n1:05:21\tSPEAKER_00\n Unless you think there's anything else I think that I covered it.\n\n1:05:23\tSPEAKER_00\n I can't give...\n\n1:05:24\tSPEAKER_02\n Any other...\n\n1:05:26\tNone\n Okay.\n\n1:05:27\tNone\n Okay.\n\n1:05:28\tNone\n Okay.\n\n1:05:29\tSPEAKER_01\n Oh.\n\n", "summary": [{"summary_text": "SPEAKER_06 collected an agenda, a speaker form, a key file and an hour's worth of transcribed digits. Speakers have filled out their speaker forms. They are slowly trickling in. Speaker_06 has to edit some files and wait for more people to turn in their forms. "}]}