{"filename": "./data/Bmr015.txt", "transcript": "0:00:00\tSPEAKER_06\n We're not crashing anymore.\n\n0:00:14\tSPEAKER_06\n It really bothers me.\n\n0:00:16\tSPEAKER_06\n I crashed.\n\n0:00:17\tSPEAKER_06\n You crashed this morning?\n\n0:00:18\tSPEAKER_06\n I did not crash this morning.\n\n0:00:19\tSPEAKER_05\n Oh, well, maybe it's just how many times you crashed in a day.\n\n0:00:25\tSPEAKER_05\n First time in the day.\n\n0:00:26\tSPEAKER_09\n Maybe it's one to do enough meeting to a crash.\n\n0:00:31\tSPEAKER_09\n No matter of experience.\n\n0:00:33\tSPEAKER_04\n Yeah.\n\n0:00:34\tSPEAKER_05\n That's great.\n\n0:00:35\tSPEAKER_05\n Do we have an agenda?\n\n0:00:37\tSPEAKER_05\n I have an address.\n\n0:00:38\tSPEAKER_05\n Can't come.\n\n0:00:39\tSPEAKER_06\n I have a agenda and it's all me because no one sent me anything else.\n\n0:00:43\tSPEAKER_09\n Did they send the messages to you?\n\n0:00:45\tSPEAKER_06\n I have no idea, but I just got a few minutes ago, right when you were in my office it arrived.\n\n0:00:52\tSPEAKER_06\n Does anybody have any agenda items other than me?\n\n0:00:56\tSPEAKER_06\n I have one more also which is to talk about the digits.\n\n0:00:59\tSPEAKER_05\n Great.\n\n0:01:00\tSPEAKER_05\n I'm just going to talk briefly about the NSFITR.\n\n0:01:03\tSPEAKER_05\n Oh, great.\n\n0:01:04\tSPEAKER_05\n You won't see much, but you said one time about digits.\n\n0:01:10\tSPEAKER_06\n I have a short thing about digits and then I want to talk a little bit about naming conventions, although it's unclear whether this is the right place to talk about it.\n\n0:01:18\tSPEAKER_06\n Maybe just talk about it very briefly and take the details to the people for whom it's relevant.\n\n0:01:23\tSPEAKER_02\n I could always say something about transcription.\n\n0:01:28\tSPEAKER_05\n Well, if we, yeah, we shouldn't add things and just add things in.\n\n0:01:31\tSPEAKER_05\n I actually pre-visit you, so if we're short meeting, would we find?\n\n0:01:36\tSPEAKER_06\n So the only thing I want to say about digits is we are pretty much done with the first test set.\n\n0:01:41\tSPEAKER_06\n There are probably forms here and there that are marked as having been read that weren't really read.\n\n0:01:46\tSPEAKER_06\n So I won't really know until I go through all the transcriber forms and extract out pieces that are an error.\n\n0:01:52\tSPEAKER_06\n So two things.\n\n0:01:53\tSPEAKER_06\n The first is what should we do about digits that were misread?\n\n0:01:57\tSPEAKER_06\n My opinion is we should just throw them out completely and have them read again by someone else.\n\n0:02:04\tSPEAKER_06\n The grouping is completely random, so it's perfectly fine to put a group together again of errors and have them read just to finish out the test set.\n\n0:02:13\tSPEAKER_06\n The other thing you could do is change the transcript to match what they really said.\n\n0:02:20\tSPEAKER_06\n So there's the two options.\n\n0:02:22\tSPEAKER_05\n But there's often things where people do false starts.\n\n0:02:24\tSPEAKER_05\n I know I've done it where I say, say, yeah.\n\n0:02:26\tSPEAKER_06\n What the transcribers did with that is if they did a correction and they eventually did read the right string, you extract the right string.\n\n0:02:33\tSPEAKER_06\n Wait, were they completely wrong?\n\n0:02:34\tSPEAKER_06\n Yeah, didn't correct.\n\n0:02:35\tSPEAKER_06\n And didn't notice, which happens in a few places.\n\n0:02:38\tSPEAKER_06\n So, so.\n\n0:02:39\tSPEAKER_02\n So, so.\n\n0:02:44\tNone\n Correct.\n\n0:02:44\tSPEAKER_06\n And so the two options are change the transcript to match what they really said.\n\n0:02:49\tSPEAKER_06\n But then the transcript isn't the error test set anymore.\n\n0:02:53\tSPEAKER_06\n I don't think that really matters because the conditions are so different.\n\n0:02:57\tSPEAKER_06\n And that would be a little easier.\n\n0:02:58\tSPEAKER_09\n How many are, how often is that happen?\n\n0:03:00\tSPEAKER_06\n Five or six times.\n\n0:03:01\tSPEAKER_09\n Oh, so it's not very much.\n\n0:03:02\tSPEAKER_09\n No, it's not much at all.\n\n0:03:04\tSPEAKER_09\n There's a question just change the transcript.\n\n0:03:06\tSPEAKER_09\n Yeah.\n\n0:03:07\tSPEAKER_05\n Okay.\n\n0:03:09\tSPEAKER_05\n Yeah, it's five or six times out of thousands.\n\n0:03:11\tSPEAKER_05\n Four thousand.\n\n0:03:12\tSPEAKER_05\n Four thousand.\n\n0:03:13\tSPEAKER_05\n Yeah, I would do the easy way.\n\n0:03:16\tSPEAKER_05\n Okay.\n\n0:03:17\tSPEAKER_05\n Yeah.\n\n0:03:18\tSPEAKER_05\n It's kind of nice.\n\n0:03:19\tSPEAKER_05\n I mean, who knows what studies people will be doing on speaker dependent things.\n\n0:03:23\tSPEAKER_05\n And so I think having having it all the speakers who we had is least interesting.\n\n0:03:29\tSPEAKER_09\n So, how many digits have been transferred?\n\n0:03:33\tSPEAKER_06\n And so, I think that's a thousand lines in each line is between one and about ten digits.\n\n0:03:38\tSPEAKER_06\n I didn't compute the average.\n\n0:03:39\tSPEAKER_06\n I think the average was around four or five.\n\n0:03:41\tSPEAKER_05\n So that's a couple hours of speech probably.\n\n0:03:44\tSPEAKER_05\n Yeah.\n\n0:03:45\tSPEAKER_05\n Which is a reasonable, reasonable test set.\n\n0:03:49\tSPEAKER_06\n And Jane, I do have a set of forms which I think you have copies of somewhere.\n\n0:03:54\tSPEAKER_06\n Oh, you do.\n\n0:03:55\tSPEAKER_06\n Oh, okay, good.\n\n0:03:56\tSPEAKER_06\n Good.\n\n0:03:57\tSPEAKER_06\n I thought I had had all of them back from you.\n\n0:03:59\tSPEAKER_06\n And then the other thing is that the forms in front of us here that we're going to read later, were suggested by Liz because she wanted to elicit some different prosotics from digits.\n\n0:04:08\tSPEAKER_06\n And so, I just wanted people to take a quick look at the instructions and the way it worked and see if it makes sense.\n\n0:04:14\tSPEAKER_06\n And if anyone has any comments on it.\n\n0:04:19\tSPEAKER_05\n I see.\n\n0:04:23\tSPEAKER_05\n And the decision here was to continue with the words rather than the numerics.\n\n0:04:32\tSPEAKER_06\n Yes, although we could switch it back.\n\n0:04:35\tSPEAKER_06\n The problem was 0 and 0.\n\n0:04:38\tSPEAKER_06\n Although we could switch it back and tell them always to say 0 or always to say 0.\n\n0:04:42\tSPEAKER_05\n Or neither, but it's just two things ways that you can say it.\n\n0:04:46\tSPEAKER_05\n Sure.\n\n0:04:51\tSPEAKER_05\n That's the only thought I have because if you start talking about these, you know, she's trying to get it natural groupings.\n\n0:04:58\tSPEAKER_05\n But there's nothing natural about reading numbers this way.\n\n0:05:03\tSPEAKER_05\n I mean, if you saw telephone number, you would never see it this way.\n\n0:05:06\tSPEAKER_06\n The problem also is she did want to stick with digits.\n\n0:05:08\tSPEAKER_06\n I mean, I'm speaking for her.\n\n0:05:09\tSPEAKER_06\n She's not here.\n\n0:05:10\tSPEAKER_06\n But the other problem we were thinking about is if you just put the numerals, they might say 43 instead of 43.\n\n0:05:19\tSPEAKER_02\n Well, the space though between them.\n\n0:05:22\tSPEAKER_02\n When you space them out, they don't look like 43 anymore.\n\n0:05:25\tSPEAKER_06\n Well, she and I were talking about it.\n\n0:05:27\tSPEAKER_06\n And she felt that it's very, very natural to do that sort of.\n\n0:05:31\tSPEAKER_06\n She's right.\n\n0:05:32\tSPEAKER_05\n It's a different problem.\n\n0:05:34\tSPEAKER_05\n I mean, it's an interesting problem.\n\n0:05:36\tSPEAKER_05\n I mean, we've done stuff with numbers before.\n\n0:05:38\tSPEAKER_05\n And yeah, sometimes people, if you say 3981, sometimes people will say 3981 or 3891.\n\n0:05:45\tSPEAKER_05\n I don't think they'd say that.\n\n0:05:47\tSPEAKER_05\n Not very frequently.\n\n0:05:48\tSPEAKER_05\n But certainly could.\n\n0:05:49\tSPEAKER_05\n Yeah.\n\n0:05:50\tSPEAKER_05\n 3891 is probably how they do that.\n\n0:05:53\tSPEAKER_06\n So, I mean, this is something that Liz and I spoke about.\n\n0:05:56\tSPEAKER_06\n Nice.\n\n0:05:57\tSPEAKER_06\n This was something that Liz asked for specifically.\n\n0:06:01\tSPEAKER_06\n I think we need to defer to her.\n\n0:06:03\tSPEAKER_05\n Okay. Well, we're probably going to be collecting meetings for a while.\n\n0:06:05\tSPEAKER_05\n If we decide we still want to do some digits later, we might be able to do some different versions.\n\n0:06:09\tSPEAKER_05\n But this is the next suggestion.\n\n0:06:11\tSPEAKER_05\n Okay.\n\n0:06:18\tSPEAKER_05\n Okay. So, I guess, let me get my short thing out about the NSF.\n\n0:06:23\tSPEAKER_05\n I said this.\n\n0:06:25\tSPEAKER_05\n Actually, this is maybe a little side thing.\n\n0:06:27\tSPEAKER_05\n I sent to what I thought we had in some previous mail as the right joint thing to send to.\n\n0:06:35\tSPEAKER_05\n It was.\n\n0:06:36\tSPEAKER_05\n MTG, our CDR hyphen joint.\n\n0:06:38\tSPEAKER_05\n Yep.\n\n0:06:39\tSPEAKER_05\n But then I got some sort of funny mail saying that the moderator was going to.\n\n0:06:44\tSPEAKER_06\n That's because they set the one up at UW.\n\n0:06:46\tSPEAKER_06\n That's not on our side.\n\n0:06:47\tSPEAKER_06\n That's on the UW website.\n\n0:06:48\tSPEAKER_06\n Oh.\n\n0:06:49\tSPEAKER_06\n And so UW set it up as a moderated list.\n\n0:06:51\tSPEAKER_06\n Oh.\n\n0:06:52\tSPEAKER_06\n And I have no idea whether it actually ever goes to anyone.\n\n0:06:55\tSPEAKER_06\n So you might want to just mail to Mari.\n\n0:06:57\tSPEAKER_05\n No, I got a little excited notes from Mari and Jeff and so on.\n\n0:07:01\tSPEAKER_05\n Okay. Good.\n\n0:07:02\tSPEAKER_06\n Yeah.\n\n0:07:03\tSPEAKER_06\n So the moderator actually did repost it.\n\n0:07:04\tSPEAKER_06\n Yeah.\n\n0:07:05\tSPEAKER_06\n Because I had sent one earlier.\n\n0:07:06\tSPEAKER_06\n Actually, the same thing happened to me.\n\n0:07:07\tSPEAKER_06\n I had sent one earlier.\n\n0:07:09\tSPEAKER_06\n The message says you'll be informed and then I was never informed.\n\n0:07:11\tSPEAKER_06\n But I got replies from people indicating that they had gotten it.\n\n0:07:14\tSPEAKER_06\n Right.\n\n0:07:15\tSPEAKER_06\n It's just to prevent spam.\n\n0:07:17\tSPEAKER_06\n I see.\n\n0:07:18\tSPEAKER_05\n Yeah.\n\n0:07:19\tSPEAKER_05\n So, okay.\n\n0:07:20\tSPEAKER_05\n Anyway, I guess everybody here, you are on that list, right?\n\n0:07:23\tSPEAKER_05\n So you got to know.\n\n0:07:24\tSPEAKER_05\n Yeah.\n\n0:07:25\tSPEAKER_05\n Okay.\n\n0:07:26\tSPEAKER_05\n So this was a proposal that we put in before on more, more higher level issues in meetings from, I guess, higher level from my point of view.\n\n0:07:38\tSPEAKER_05\n Yeah.\n\n0:07:39\tSPEAKER_05\n And meeting mappings.\n\n0:07:41\tSPEAKER_05\n And so it was a proposal for the ITR program, the Information Technology Research Program, as part of the National Science Foundation.\n\n0:07:52\tSPEAKER_05\n It's the second year of there doing these grants.\n\n0:07:56\tSPEAKER_05\n There are a lot of them, some of them anyway, but they're larger grants than usual, small NSF grants.\n\n0:08:03\tSPEAKER_05\n So they're very competitive and they have a first phase where you put in pre-proposals and we got through that.\n\n0:08:11\tSPEAKER_05\n And so the next phase will be, you will actually be doing a larger proposal.\n\n0:08:15\tSPEAKER_05\n And I hope to be doing very little of it, which was also true for the pre-proposals.\n\n0:08:22\tSPEAKER_05\n So, there are a bunch of people working on it.\n\n0:08:26\tSPEAKER_06\n When's the full proposal, Tim?\n\n0:08:28\tSPEAKER_05\n I think April 9th or something.\n\n0:08:30\tSPEAKER_05\n So that's about a month.\n\n0:08:33\tSPEAKER_06\n And they said, end of business day, you could check on the reviewer forms.\n\n0:08:37\tSPEAKER_05\n Tomorrow.\n\n0:08:38\tSPEAKER_05\n Tomorrow, March 2nd.\n\n0:08:39\tSPEAKER_06\n Might be in a day off all week.\n\n0:08:41\tSPEAKER_06\n I guess that's a good thing, because I mean, I got my papers on.\n\n0:08:46\tSPEAKER_05\n So it's amazing you showed up at this meeting.\n\n0:08:47\tSPEAKER_06\n It is, it is actually quite amazing.\n\n0:08:49\tSPEAKER_09\n Let me just see the reviewers comment.\n\n0:08:52\tSPEAKER_09\n Yeah.\n\n0:08:53\tSPEAKER_05\n Yeah.\n\n0:08:54\tSPEAKER_05\n My favorite is when one reviewer says, this should be far more detailed.\n\n0:08:59\tSPEAKER_05\n And the next reviewer says, there's way too much detail.\n\n0:09:02\tSPEAKER_05\n Yes.\n\n0:09:03\tSPEAKER_06\n This is way too general.\n\n0:09:06\tSPEAKER_06\n The other reviewer says this is way too specific.\n\n0:09:09\tSPEAKER_06\n Yeah.\n\n0:09:10\tSPEAKER_06\n It's way too hard.\n\n0:09:11\tSPEAKER_05\n Way too easy.\n\n0:09:12\tSPEAKER_05\n We'll see.\n\n0:09:13\tSPEAKER_06\n Maybe there'll be something useful.\n\n0:09:14\tSPEAKER_06\n Well, it sounded like the first gate was pretty easy.\n\n0:09:18\tSPEAKER_06\n Is that right?\n\n0:09:19\tSPEAKER_06\n That they didn't reject a lot of the pre-proposals.\n\n0:09:21\tSPEAKER_05\n Do you know anything about the numbers?\n\n0:09:23\tSPEAKER_09\n No.\n\n0:09:24\tSPEAKER_09\n I don't think that's true.\n\n0:09:27\tSPEAKER_09\n He said the next phase will be very competitive because we didn't want to weed out much in the first phase.\n\n0:09:34\tSPEAKER_09\n Well, I have to see what the numbers are.\n\n0:09:38\tSPEAKER_09\n Yeah.\n\n0:09:39\tSPEAKER_09\n But they have to weed out enough so that they have enough reviewers.\n\n0:09:44\tSPEAKER_05\n Right.\n\n0:09:45\tSPEAKER_05\n So maybe they weed out as much as they want.\n\n0:09:49\tSPEAKER_05\n But it's usually pretty.\n\n0:09:54\tSPEAKER_05\n Yeah, it's certainly not.\n\n0:09:56\tSPEAKER_05\n I'm sure that it's not down to one and two or something.\n\n0:09:59\tSPEAKER_05\n Right.\n\n0:10:00\tSPEAKER_05\n It was left.\n\n0:10:01\tSPEAKER_05\n I'm sure it's.\n\n0:10:02\tSPEAKER_06\n How many awards are there?\n\n0:10:04\tSPEAKER_05\n Well, there's different numbers of awards for different size.\n\n0:10:07\tSPEAKER_05\n They have three size grants.\n\n0:10:09\tSPEAKER_05\n Let's find this one.\n\n0:10:10\tSPEAKER_05\n Let's see.\n\n0:10:12\tSPEAKER_05\n The small ones are less than 500,000 total over three years.\n\n0:10:16\tSPEAKER_05\n And that they have a fair number of them.\n\n0:10:19\tSPEAKER_05\n And the large ones are.\n\n0:10:22\tSPEAKER_05\n Oh, I forget.\n\n0:10:23\tSPEAKER_05\n I think more than.\n\n0:10:26\tSPEAKER_05\n More than a million and a half, more than two million or something like that.\n\n0:10:31\tSPEAKER_05\n And we're in the middle.\n\n0:10:33\tSPEAKER_05\n Middle category.\n\n0:10:34\tSPEAKER_05\n I think we're.\n\n0:10:35\tSPEAKER_05\n I forget it was.\n\n0:10:37\tSPEAKER_05\n But.\n\n0:10:38\tSPEAKER_05\n I don't remember.\n\n0:10:39\tSPEAKER_05\n But it's probably.\n\n0:10:41\tSPEAKER_05\n I don't remember.\n\n0:10:42\tSPEAKER_05\n But it's probably along the line.\n\n0:10:46\tSPEAKER_05\n I could be wrong in this.\n\n0:10:47\tSPEAKER_05\n It would probably along lines of 15, that they'll find the 20.\n\n0:10:50\tSPEAKER_05\n I mean, when they, do you know how many they funded when they've been in, in, in Chucks?\n\n0:10:54\tSPEAKER_05\n They got.\n\n0:10:55\tSPEAKER_05\n I see.\n\n0:10:56\tSPEAKER_05\n Yeah.\n\n0:10:57\tSPEAKER_06\n I thought it was smaller and that was like four or five.\n\n0:11:00\tSPEAKER_06\n Well, they fun.\n\n0:11:01\tSPEAKER_05\n They, yeah.\n\n0:11:02\tSPEAKER_05\n I mean, we'll find out one more.\n\n0:11:05\tSPEAKER_05\n Yeah.\n\n0:11:06\tSPEAKER_05\n I mean, last time I think they just had two category small and big.\n\n0:11:09\tSPEAKER_05\n And this time they came up with a middle one.\n\n0:11:11\tSPEAKER_05\n So it'll, they'll be more of them that they fund than of the big.\n\n0:11:15\tSPEAKER_09\n If we end up getting.\n\n0:11:17\tSPEAKER_09\n What will it be in the context in terms of where will the money go to what we'll be doing with it?\n\n0:11:25\tNone\n Exactly.\n\n0:11:26\tSPEAKER_06\n We say in the proposal.\n\n0:11:28\tSPEAKER_09\n I mean, I was far enough.\n\n0:11:30\tSPEAKER_05\n You know, none of it will go for the yachts that we've been talking about.\n\n0:11:39\tSPEAKER_05\n Well, you know, I mean, it's just for the research.\n\n0:11:42\tSPEAKER_09\n It's extending the research, right?\n\n0:11:46\tSPEAKER_06\n Because the other higher level stuff than we've been talking about for a record.\n\n0:11:50\tSPEAKER_05\n Yeah.\n\n0:11:51\tSPEAKER_05\n Yeah.\n\n0:11:52\tSPEAKER_05\n Yeah.\n\n0:11:53\tSPEAKER_05\n The other things that we have been working on with the communicator, especially with the newer things, with the more acoustically oriented things, are lower level.\n\n0:12:03\tSPEAKER_05\n And this is dealing with mapping on the level of the conversation, mapping the conversation to different kind of planes.\n\n0:12:14\tSPEAKER_05\n So.\n\n0:12:15\tSPEAKER_05\n But so it's all stuff that none of us are doing right now.\n\n0:12:21\tSPEAKER_05\n None of us are funded for.\n\n0:12:22\tSPEAKER_05\n So it's, so it's, it would be new.\n\n0:12:24\tSPEAKER_09\n So assuming everybody's busy now.\n\n0:12:26\tSPEAKER_09\n I mean, it's going to be higher more students.\n\n0:12:29\tSPEAKER_05\n Well, there's evenings in this room.\n\n0:12:34\tSPEAKER_05\n Yeah, there would be, there would be cars.\n\n0:12:37\tSPEAKER_05\n And there would be expansion.\n\n0:12:39\tSPEAKER_05\n But also, there's always, for everybody, there's always things that are dropping off, grants that are renting or other things.\n\n0:12:45\tSPEAKER_05\n So there's a continual need to bring in new things.\n\n0:12:49\tSPEAKER_05\n But there definitely would be new students and so forth, both of them.\n\n0:12:54\tSPEAKER_06\n Are there any students in your class who are expressing interest?\n\n0:12:58\tSPEAKER_05\n Not clear yet.\n\n0:13:01\tSPEAKER_05\n Other than the one who's already here.\n\n0:13:03\tSPEAKER_05\n I mean, we got, yeah, two in the, two in the, two in the class already here.\n\n0:13:08\tSPEAKER_05\n And then, and then there's a third who's doing a project here.\n\n0:13:13\tSPEAKER_05\n But he won't be in the country that long.\n\n0:13:16\tSPEAKER_05\n Maybe another one.\n\n0:13:18\tSPEAKER_05\n Yeah, actually, there's one other guy who's looking at that, that, that, Jeremy, I think.\n\n0:13:25\tSPEAKER_05\n Anyway, yeah, that's, that's how I was going to say is that, that's, you know, that's nice and we're sort of proceeding to next step.\n\n0:13:31\tSPEAKER_05\n And it'll mean some more work, you know, in March and getting a proposal out.\n\n0:13:35\tSPEAKER_05\n And then it's, you know, we'll see what happens.\n\n0:13:40\tSPEAKER_05\n The last one was that he had their whistle naming.\n\n0:13:44\tSPEAKER_06\n Yeah, it just, we've been cutting up sound files and, for both digits and for doing recognition.\n\n0:13:51\tSPEAKER_06\n And Liz had some suggestions on naming and it just brought up the whole issue that hasn't really been resolved about naming.\n\n0:13:57\tSPEAKER_06\n So one thing she would like to have is for all the names to be the same length.\n\n0:14:02\tSPEAKER_06\n So that sorting is easier.\n\n0:14:06\tSPEAKER_06\n Same number of characters so that when you're sorting file names, you can easily extract out bits and pieces that you want.\n\n0:14:12\tSPEAKER_06\n That's easy enough to do.\n\n0:14:13\tSPEAKER_06\n And I don't think we have so many meetings that that's a big deal just to change the names.\n\n0:14:16\tSPEAKER_06\n So that means instead of calling it MR1, MR2, you call it MRM001, MRM002, things like that, just so that they're all the same length.\n\n0:14:27\tSPEAKER_02\n But you know, when you do things like that, you can always, as long as you have, you can always search from the beginning of the end of the string.\n\n0:14:35\tSPEAKER_06\n The problem is that there are a lot of fields.\n\n0:14:38\tSPEAKER_06\n Right, so we have, we're going to have the speaker ID, the session, information on the microphones, information on the channels and all that.\n\n0:14:49\tSPEAKER_06\n And so if each one of those is a fixed length, the sorting comes a lot easier.\n\n0:14:53\tSPEAKER_01\n She wanted to keep the same length across different meetings also.\n\n0:14:57\tSPEAKER_01\n So like the NSA meeting links, file names are going to be the same length as the media recording meeting names.\n\n0:15:02\tSPEAKER_06\n And as I said, we just don't have that many that that's a big deal.\n\n0:15:06\tSPEAKER_06\n And so at some point we have to sort of take a few days off, like the transcribers have a few days off, make sure no one's touching the data and reorganize the file structures.\n\n0:15:16\tSPEAKER_06\n And when we do that, we can also rationalize some of the naming.\n\n0:15:19\tSPEAKER_02\n I would think though that the transcribes themselves wouldn't need to have such lengthy names.\n\n0:15:25\tSPEAKER_02\n So I mean, you're dealing with a different domain there, I mean, with starting n times and all that, channels and stuff.\n\n0:15:31\tSPEAKER_06\n So the only thing we would change with that is just the directory names, I would change them to match.\n\n0:15:36\tSPEAKER_06\n So instead of being MR1, it would be MRM001, but I don't think it's a big deal.\n\n0:15:40\tSPEAKER_06\n So for the meetings, we were thinking about three letters and three numbers for meeting IDs, for speakers, M or F, and then three numbers.\n\n0:15:49\tSPEAKER_06\n And that also brings up the point that we have to start assembling a speaker database so that we get those links back and forth and keep it consistent.\n\n0:16:00\tSPEAKER_06\n And then the microphone issues, we want some way of specifying more than looking in the key file, what channel and what mic, what channel, what mic, and what broadcast, or I don't know how to say it.\n\n0:16:16\tSPEAKER_06\n So with this one, it's this particular headset, with this particular transmitter, as a wireless, and you know, that one is a different headset and different channel.\n\n0:16:25\tSPEAKER_06\n And so we just need some naming conventions on that. And that's going to be come especially important once we start changing the microphone setup.\n\n0:16:35\tSPEAKER_06\n We have some new microphones that I'd like to start trying out once I test them, and then we'll need to specify that somewhere.\n\n0:16:42\tSPEAKER_06\n So I was just going to do a fixed list of microphones and types.\n\n0:16:48\tSPEAKER_05\n As I said, yeah. I'm sure it's such a short agenda list, I guess I will ask how are the transcription skills.\n\n0:16:57\tSPEAKER_02\n But the news is that I switched to start my news sense. I switched to doing the channel by channel transcriptions to provide a tighter time bins for partly for use in Teal's work and also its environments and other people in the project.\n\n0:17:15\tSPEAKER_02\n And I discovered in the process a couple of interesting things, which one of them is that it seems that there are time lags involved in doing this using an interface that has so much more complexity to it.\n\n0:17:34\tSPEAKER_02\n And I wanted to maybe ask Chuck to help me with some of the questions and efficiency. I was thinking maybe the best way to do this in the long run, maybe to give them single channel parts and then piece them together later.\n\n0:17:45\tSPEAKER_02\n And I have a script I can piece them together. So it's like I know that I can take them apart and put them together and end up with the representation, which is where the real power of that interface is.\n\n0:17:53\tSPEAKER_02\n And it may be it's faster to transcribe the channel at a time with only one sound violin, one set of utterances to check through.\n\n0:18:03\tSPEAKER_05\n I'm a little confused. I thought that that one of the reasons we thought we were so much faster than than the other transcription thing was that that we were using the mix.\n\n0:18:16\tSPEAKER_02\n Oh yes. Okay. But with the mix, when you have an overlap, you only have a choice of one start and end time for that entire overlap, which means that you're not tightly tuning the individual parts of that overlap by your foot speaker.\n\n0:18:31\tSPEAKER_02\n So someone may have only said two words in that entire big chunk of overlap. And for purposes of things like, well, some things like training the speech non speech segmentation thing.\n\n0:18:43\tSPEAKER_02\n It's necessary to have it more tightly tuned than that. And you know, it would be wonderful if it's possible then to use that algorithm to more tight be tying all the channels after that.\n\n0:18:54\tSPEAKER_02\n But I don't know exactly where that's going at this point, but I was experimenting with doing this by hand. And I really do think that it's wise that we've had them start the way we have with working off the mix signal, having the interface that doesn't require them to do the type, the type in every single channel.\n\n0:19:17\tSPEAKER_02\n The entire interaction. I did discover a couple other things by doing this though. And one of them is that once in a while a back channel will be overlooked by the transgarber as you might expect because when a back channel could well happen in a very densely populated overlap.\n\n0:19:35\tSPEAKER_02\n And if we're going to study types of our laps, which is what I want to do analysis of that, then that really tests require listening to every single channel all the way through the entire length for all the different speakers. Now, for only four speakers, that's not going to be too much time. But if it's nine speakers, then that is more time.\n\n0:19:50\tSPEAKER_02\n So it's like, you know, kind of wondering. And I think again, it's like this, it's really valuable that he was working on the speech non-speech segmentation because maybe we can close it out without having to actually go to the time that would take to listen to every single channel from start to finish the every single need.\n\n0:20:05\tSPEAKER_07\n Yeah, but those spectacles will always be a problem. I think, especially if they're really short and they're not very loud. And so it can, it will always happen that also the automatic detection system will miss some of them.\n\n0:20:19\tSPEAKER_02\n Also, then maybe the answer is to listen, especially densely in places of overlap, just so that there is not a overlooked because of that and count on accuracy during the sparse faces.\n\n0:20:31\tSPEAKER_02\n Because there are large spaces at a, that's a good point. There are large spaces where there's no overlap at all. Someone's giving a presentation.\n\n0:20:37\tSPEAKER_02\n Yeah. Whatever. That's a good, that's a good point. And let's see, there was only a thing I was going to say.\n\n0:20:42\tSPEAKER_02\n I think it's really interesting data to work with. I have to say it's very enjoyable. Really, not a problem spending time with these data.\n\n0:20:49\tSPEAKER_02\n I'm not just because I'm in there.\n\n0:20:52\tSPEAKER_05\n Well, I think it's a short meeting. You're still on the midst of what you're doing from the script last time, I assume.\n\n0:21:06\tSPEAKER_03\n I have a result, but I'm continuing working with the mix side now, after the last experience.\n\n0:21:15\tSPEAKER_03\n And I tried to adjust to improve in our own city, the test, that I implement.\n\n0:21:28\tSPEAKER_03\n But I have a problem because I get very much harmonics now.\n\n0:21:35\tSPEAKER_03\n I'm only possible harmonics. And now I'm trying to find some kind of help using the energy to distinguish between possible harmonics and other frequency picks.\n\n0:21:57\tSPEAKER_03\n And I have to talk with you, with the group, about the instantaneous frequency, because I have an algorithm.\n\n0:22:10\tSPEAKER_03\n And I get similar results, like the paper that I am following. But the rules that people use in the paper to distinguish the harmonics doesn't work well.\n\n0:22:30\tSPEAKER_03\n And I'm not sure that the way to obtain the instantaneous frequency is right. It's not right.\n\n0:22:42\tSPEAKER_03\n I haven't enough feeling to distinguish what happened.\n\n0:22:48\tSPEAKER_05\n I'd like to talk with you about it. If I don't have enough time, and you want to discuss with someone else, besides us, that you might want to talk to, might be Stefan.\n\n0:23:06\tSPEAKER_09\n I'm not going to do experience for this. The experience is not enough.\n\n0:23:21\tSPEAKER_03\n I don't process the fundamental. I calculate the phase derivate using the F50. The algorithm said that if you change the frequency X using the instantaneous frequency, you can find how in several frequencies, the rest of the frequency picks, the frequency picks, the frequency harmonic, and if you compare the instantaneous frequency of the continuous filters, the use to get the instantaneous frequency is probably to you can find that instantaneous frequency for continuous output continuous filters are brilliant.\n\n0:24:30\tSPEAKER_05\n I'd have to look at that and think about it. I haven't worked with that either. The simple-minded way I suggested was what Doug was just saying is that you can make a sieve.\n\n0:24:48\tSPEAKER_05\n Let's hypothesize that it's this frequency. Maybe you could use some other cute methods to shortcut it by making some guesses.\n\n0:25:07\tSPEAKER_05\n I mean, you could make some guesses from the autocorrelation or something, but then, given those guesses, try only looking at the energy at multiples of that frequency and seeing how much it takes to one that's maximum.\n\n0:25:26\tSPEAKER_03\n Using the energy of the multiples of frequencies. You have to do some kind of low pass filter before you do that. I don't use.\n\n0:25:38\tSPEAKER_03\n I know many people use low pass filter to get the pitch.\n\n0:25:58\tSPEAKER_09\n I'm going to try the vocal track, the response of the vocal track. Just looking at the energy and those, that's the harmonic.\n\n0:26:10\tSPEAKER_05\n The thing is that this is for a...\n\n0:26:32\tSPEAKER_05\n I don't need to get rid of it. I mean, that'd be nice, but I don't know if it's essential. I mean, because I think the main thing is that you're trying... what are you doing this for?\n\n0:26:45\tSPEAKER_05\n You're trying to distinguish between the case where there are more than one speaker. And the case where there's only one speaker.\n\n0:27:04\tSPEAKER_05\n You're not distinguishing voice to non-voice. If you don't care about that, see if you also want to determine whether it's on voice, then I think you want to look at high frequencies also because the fact that there's more energy in high frequencies is going to be sort of obvious cue that it's on voice.\n\n0:27:27\tSPEAKER_05\n But other than that, I guess, as far as the one person versus two persons, it would be primarily low frequency phenomenon.\n\n0:27:37\tSPEAKER_05\n And if you look at the low frequencies, yes, the higher frequencies are going to be a spectral slope. The higher frequencies would be lower energy.\n\n0:27:47\tSPEAKER_03\n I would be there for the next week, all my results about the Dharmonicity and we try to comment on this case here because I have enough feeling to understand what happened with so many peaks.\n\n0:28:10\tSPEAKER_03\n I see Dharmonics in many times, but there are a lot of peaks that have no harmonics.\n\n0:28:18\tSPEAKER_03\n I have to discover what is the best way to...\n\n0:28:25\tSPEAKER_05\n I don't think you're not going to be able to look at every frame. I really thought that the best way to do it, and I'm speaking with no experience on this to a good point, but my impression was the best way to do it was however you use instantaneous frequency, however you clope with your candidates, you want to see how much of the energy is in that.\n\n0:28:48\tSPEAKER_05\n It's supposed to all of the total energy. And if it's voiced, I guess so. So I think maybe you do need a voiced and voiced determination too, but if it's voiced and the fraction of the energy that's in the harmonic sequence that you're looking at is relatively low, then it should be more likely to be an overlap.\n\n0:29:15\tSPEAKER_03\n This is the idea I had to compare the ratio of the energy of the harmonics with the total energy in the spectrum, try to get the ratio to distinguish between overlap and speech.\n\n0:29:32\tSPEAKER_05\n But you're looking at... let's take a second of this. You're looking at the phase derivative in what domain... I mean this is in bands or...\n\n0:29:49\tSPEAKER_03\n No, no, no. Just overall...\n\n0:29:52\tSPEAKER_03\n The band is from 0 to 4 kilohertz. You just take the instantaneous frequency.\n\n0:30:02\tSPEAKER_03\n I use two methods. One, basically, on FFT to FFT to obtain the... or to study the harmonics from the spectrum directly, and to study the energy and the multiples of frequency. And another... another algorithm I have is the instantaneous frequency.\n\n0:30:23\tSPEAKER_03\n I use FFT to calculate the phase derivative in the time. I mean, I have two algorithms. But in my opinion, the instantaneous frequency, the behavior was very interesting, because I saw how the spectrum concentrates around the harmonic.\n\n0:30:49\tSPEAKER_03\n When I apply the rule of the instantaneous frequency of the continuous filter, the rule that people propose in the paper doesn't work, and I don't know why.\n\n0:31:04\tSPEAKER_05\n The instantaneous frequency wouldn't give you something more like the central frequency of the way most of the energy is. I mean, I think, why would it correspond to pitch?\n\n0:31:19\tSPEAKER_03\n I'm not sure. I try to... First, I calculate using the FFT, I get the spectrum, I represent all the frequency.\n\n0:31:42\tSPEAKER_03\n When I obtain the instantaneous frequency, and I change the disease using the instantaneous frequency here.\n\n0:31:55\tSPEAKER_03\n I use a scaling along that axis according to the instantaneous frequency. I use this frequency. The range is different, and the resolution is different.\n\n0:32:12\tSPEAKER_03\n More or less, seeing like this. And the paper said that these frequencies are probably harmonics.\n\n0:32:30\tSPEAKER_03\n But they used a rule based on the... Because to calculate the instantaneous frequency, they used a handing window.\n\n0:32:48\tSPEAKER_03\n They said that if these big harmonics, the instantaneous frequency of the continuous filters are very near.\n\n0:33:05\tSPEAKER_03\n I don't know what is the distance. I try to put different distance, to put different length of the window, different frequency.\n\n0:33:29\tSPEAKER_05\n I guess I'm not following enough. I'm not going to have time to do any of these.\n\n0:33:44\tSPEAKER_02\n I get it in the return of the transition. There's one third thing I wanted to raise is an issue, which is how to handle breaths.\n\n0:34:01\tSPEAKER_02\n The reason I asked the question is, aside from the fact that there are times when we took code, the fact that I have the indication from down ellis in the email that I sent to you.\n\n0:34:15\tSPEAKER_02\n I think that the question is, whether it would be possible to eliminate them from the audio signal, which would be the ideal situation.\n\n0:34:34\tSPEAKER_02\n I don't think it would be ideal. We're dealing with real speech. We're trying to have these real as possible and breaths are part of real speech.\n\n0:34:49\tSPEAKER_02\n We're hearing you breathing as if you're hearing our ear. It's like, I mean, breath is natural, but not...\n\n0:35:04\tSPEAKER_06\n I think the BDA application would have to cope with breath. The BDA might not have to, but more people than just BDA users are interested in this corpus.\n\n0:35:19\tSPEAKER_06\n We could remove it, but I think we don't want to remove it from the corpus in terms of delivering it because people will want it in there.\n\n0:35:29\tSPEAKER_05\n If it gets in the way of what somebody is doing with it, then you might want to have some method which will allow you to block it, but it's real data.\n\n0:35:41\tSPEAKER_05\n If there's a little bit of noise out there and somebody is talking about something they're doing, that's part of what we accept is part of a real meeting.\n\n0:35:50\tSPEAKER_05\n We have the fan and the projector up there. This is actual stuff that we want to work with.\n\n0:36:01\tSPEAKER_02\n This is very interesting because it shows very clearly the contrast between speech recognition research and discourse research.\n\n0:36:10\tSPEAKER_02\n Discourse in linguistic research is what's communicative. Once in a while, breath is communicative, but very rarely.\n\n0:36:21\tSPEAKER_02\n I had a discussion with Chuck about the data structure and the idea is that the transcripts will get stored as a master.\n\n0:36:27\tSPEAKER_02\n There will be a master transcript which has in it everything that's needed for both of these uses.\n\n0:36:31\tSPEAKER_02\n The one that's used for speech recognition will be processed by a script. Don's been writing scripts and two processes for speech recognition side.\n\n0:36:40\tSPEAKER_02\n Discourse side will have this side over here. The discourse side will have a script which will strip away the things which are non-communicative.\n\n0:36:51\tSPEAKER_02\n Let's think about the practicalities of how we get to that master copy with reference to breaths. What I would wonder is would it be possible to encode those automatically?\n\n0:37:04\tSPEAKER_02\n Could we get a breath detector?\n\n0:37:07\tSPEAKER_06\n Just to save the transcribers.\n\n0:37:09\tSPEAKER_02\n You just have no idea. If you're getting a breath several times every minute and just simply the keystrokes it takes to negotiate to put the boundaries in to type it in, it's just a huge amount of time.\n\n0:37:22\tSPEAKER_02\n You want to be sure it's used and you want to be sure it's done as efficiently as possible and it's done automatically. That would be ideal.\n\n0:37:27\tSPEAKER_05\n What if you put it in but put the boundaries?\n\n0:37:32\tSPEAKER_02\n You just know it's between these other things. The time boundaries could mark off words from non-words. That would be extremely time effective if that's sufficient.\n\n0:37:45\tSPEAKER_05\n If it's too hard for us to annotate the breaths per se, we are going to be building up models for these things and these things are somewhat self-aligning.\n\n0:37:55\tSPEAKER_05\n If we say there is some kind of a thing which we call a breath or a breath in or breath out, the models will learn that sort of thing.\n\n0:38:03\tSPEAKER_05\n But you do want them to point them at some region where the breaths really are.\n\n0:38:08\tSPEAKER_02\n That would maybe include a pause as well and that wouldn't be a problem.\n\n0:38:12\tSPEAKER_05\n There's this dynamic tension between marking absolutely everything and marking just a little bit and touting on the statistical methods.\n\n0:38:23\tSPEAKER_05\n Basically the more we can mark the better. But if there seems to be a lot of effort for a small amount of reward in some area, this might be one like this.\n\n0:38:30\tSPEAKER_05\n Although I'd be interested to get input from those Andreas on this to see if they've got lots of experience with breaths in...\n\n0:38:37\tSPEAKER_05\n I have lots of experience breathing.\n\n0:38:40\tSPEAKER_05\n Well, yes, they do but we can handle that without it here. But you're going to say something about that.\n\n0:38:46\tSPEAKER_09\n I think one possible way to handle it is that as the transcribers are going through and if they get a hunk of speech, they're going to transcribe it.\n\n0:38:58\tSPEAKER_09\n They're going to transcribe it because there's words in there or whatnot.\n\n0:39:01\tSPEAKER_09\n If there's a breath in there, they could transcribe that.\n\n0:39:05\tSPEAKER_02\n That's what they've been doing.\n\n0:39:06\tSPEAKER_02\n So within overlap segments.\n\n0:39:08\tSPEAKER_09\n But if there's a big hunk of speech, let's say on Morgan's mic where he's not talking at all, don't worry about that.\n\n0:39:16\tSPEAKER_09\n So what we're saying is there's no guarantee that...\n\n0:39:20\tSPEAKER_09\n So for the chunks that are transcribed, everything's transcribed.\n\n0:39:23\tSPEAKER_09\n But outside of those boundaries, there could have been stuff that wasn't transcribed.\n\n0:39:27\tSPEAKER_09\n So you just... somebody can't rely on that data and say that's perfectly clean data.\n\n0:39:32\tSPEAKER_09\n Do you see what I'm saying?\n\n0:39:34\tSPEAKER_09\n I haven't said, don't tell the transcribe anything that's outside of...\n\n0:39:38\tSPEAKER_05\n That sounds like a reasonable compromise.\n\n0:39:41\tSPEAKER_08\n And that's quite a corresponds to the way I try to train the speech and speech detector.\n\n0:39:48\tSPEAKER_08\n I really try not to detect those breaths, which are not with a speech-strung, but with just an silence region.\n\n0:39:59\tSPEAKER_08\n So they hopefully won't be mocked in those channel-specific files.\n\n0:40:05\tSPEAKER_05\n I wanted to comment a little more just for clarification about this business, about the different purposes.\n\n0:40:10\tSPEAKER_05\n In a way, this is a really key point.\n\n0:40:12\tSPEAKER_05\n That for speech recognition research, it's not just a minor part.\n\n0:40:20\tSPEAKER_05\n In fact, I would say the core thing that we're trying to do is to recognize the actual meaningful component.\n\n0:40:28\tSPEAKER_05\n The meaningful components in the midst of other things that are not meaningful.\n\n0:40:33\tSPEAKER_05\n So it's critical, it's not just incidental, it's critical for us to get these other components that are not meaningful.\n\n0:40:40\tSPEAKER_05\n Because that's what we're trying to pull the other out. That's our problem.\n\n0:40:44\tSPEAKER_05\n If we had only linguistically relevant things, if we only had changes in the spectrum that were associated with words with different spectral components, and we didn't have noise, we didn't have convolutional errors, we didn't have extraneous behaviors and so forth, moving your head and all these sorts of things, then actually speech recognition isn't that bad right now.\n\n0:41:08\tSPEAKER_05\n I mean, you know, it's the technology has come along pretty well.\n\n0:41:12\tSPEAKER_05\n The reason we so complain about it is because when you have more realistic conditions, then things fall apart.\n\n0:41:19\tSPEAKER_02\n Okay, I guess what I was wondering is what at what level does the breathing aspect enter into the problem?\n\n0:41:26\tSPEAKER_02\n Because if it were likely that a PDA would be able to be built, which would get rid of the breathing, so it wouldn't even have to be processed at this computational, it would have to be computationally processed, rid of it.\n\n0:41:37\tSPEAKER_02\n But if there were likely on the frontier, a good breath extractor, then...\n\n0:41:43\tSPEAKER_02\n So that's a research question, you know?\n\n0:41:46\tSPEAKER_05\n I've seen that's what I wouldn't know. And we don't either.\n\n0:41:49\tSPEAKER_05\n So the thing is, right now it's just data that we're collecting, and so we don't want to presuppose that people will be able to get rid of particular degradation, because that's actually the research that we're trying to feed.\n\n0:42:00\tSPEAKER_05\n So, you know, maybe in five years it'll work really well, and it'll only mess up 10% of the time, but then we would still want to account for that 10%.\n\n0:42:09\tSPEAKER_02\n I guess there's another aspect which is that as we've improved our micro-technique, we have a lot less breadth in the more recent recordings. So it's in a way it's an artifact that there's so much on the earlier ones.\n\n0:42:20\tSPEAKER_09\n I see.\n\n0:42:21\tSPEAKER_09\n One of the... just to add to this, one of the ways that we will be able to get rid of breath is by having models, I mean that's what a lot of people do now.\n\n0:42:29\tSPEAKER_09\n In order to build a model, you need to have some amount of it, right?\n\n0:42:33\tSPEAKER_09\n I don't think we need to worry a lot about breaths that are happening outside of a conversation.\n\n0:42:41\tSPEAKER_09\n You don't have to go and search for them to mark them at all, but they're there while they're transcribing some comfort that put them in possible.\n\n0:42:50\tNone\n Okay.\n\n0:42:51\tSPEAKER_02\n It's also the fact that they do for a lot in one channel to the other because of the way the microphone suggests.\n\n0:43:01\tSPEAKER_05\n Should we do a diddys?\n\n0:43:02\tSPEAKER_05\n Yep.\n\n0:43:03\tSPEAKER_06\n Okay, this is transcript. L173, 4368, 136593, 7308, 591761, 56010, 6395, 038510, 868, 64651, 878, 873, 482434, 6432, 0259, 42086, 289, 671, 2916, 4399, 76303, 277, 556, 390.\n\n0:43:56\tSPEAKER_09\n Transcript L-257, 6200, 0129, 0236, 7034, 6368, 463, 236, 418, 0649, 58, 2316, 775, 907, 724, 4, 014, 264, 845, 1, 877, 45, 872, 2, 495, 41015, 5105, 022, 0206, 6556, 1, 858,\n\n0:44:54\tSPEAKER_03\n 1, 888, 1, 877, 1, 847, 234, 603, 939, 25, 666, 640, 3, 8, 8, 8, 8, 975, 3-4, 6-0-3, 9-39-25, 6-6, 6-4-0, 3-5-13, 9-8, 6-5-3, 3-7-1-3-0, 5-6-0-1, 4-9-8-7, 7-29, 6-1-1, 4-6-3, 4-3-5, 1-6-9-1-0, 0-2, 9-0, 0-0, 3-1, 7-3.\n\n0:45:51\tSPEAKER_08\n Transcript L559, 4-2, 9-1, 8-8, 4-2, 2-9, 5-2, 3-5, 2-8, 3-6, 3-8, 6-8, 4-9, 1-4, 7-1, 5-6, 4-8-3, 7-2, 4-1-8-0, 0-1-1-3, 5-2-1-6, 3-4, 7-5-07, 3-5-20, 1-19-1, 0-9, 7-0-5-1, 2-5-1-3, 5-2-7, 3-4-6-3, 5-3-0-7, 4-0-1-2, 1-8-0, 5-9-5, 9-3-9.\n\n0:46:47\tSPEAKER_05\n Transcript L493, 9-3-4, 6-8, 5-2-6-8, 0-4-3, 8-6-4, 2-3-9-5, 4-9-2, 1-1-0, 8-7-1-0, 9-5-3, 0-3-0, 6-8-4, 8-5-7-1, 5-0-9-2, 9-3-8-9, 8-3-2-1, 3-1-2-9, 2-7-3-6, 9-9-8-9, 9-5-7-4, 7-3-0-5-4-3-5-3-3-1, 6-6-1-3-9-5-5-4-2, 6-5-1-9-5-8-9-3-8-5.\n\n0:47:41\tSPEAKER_00\n Transcript L-31, 3-271-9-6-6-5, 6-08-3-1-6-8-8-5-1-1, 7-09-4-9-2-1-6-9-7, 4-7-01-4-9-9-0-2-5, 3-7-9-2-4-2-7-9-0, 8-6-1-6-4-0-7-3-8, 5-8-6-4-4-3-8-7-7, 2-8-7-6-8-5-9-9-2, 4-8-6-8-5, 0-8-1-6-3-9-1-6-8-9.\n\n0:48:33\tSPEAKER_02\n Transcript L-6-2-1, 0-2-3-1-9-5-8-5-4, 1-5-0-1-1-8-8-3, 9-6-6-3-2-5-7-8-7-9, 2-0-6-4-3-4-6-6-0, 3-6-2-3-6-8-3-5-2-4, 1-7-2-6-1-9-7-2-6-5, 8-9-8-7-3-2-2-1-3-8, 2-3-3-7-7-1-9-5, 4-8-8-7-6-1-3-5-3-3-5-7, 9-5-8-5-1-5-4-2-2.\n\n", "summary": [{"summary_text": "SPEAKER_06 crashed this morning for the first time in the day. The group is not crashing anymore. They are going to talk about the NSFITR, digits, naming conventions and transcribing the first test set. They will talk about it briefly and take details to the people for whom it's relevant."}]}