{"filename": "./data/Bmr027.txt", "transcript": "0:00:00\tSPEAKER_06\n Okay, Adam, what is the mic that Jeremy's wearing?\n\n0:00:04\tSPEAKER_06\n It's the earplug mic.\n\n0:00:06\tSPEAKER_02\n It's the earplug.\n\n0:00:08\tSPEAKER_06\n Is that a wireless or no?\n\n0:00:10\tSPEAKER_06\n No, it's wired.\n\n0:00:12\tSPEAKER_02\n Is that old school?\n\n0:00:14\tSPEAKER_02\n You can't hear anything during the meeting.\n\n0:00:16\tSPEAKER_07\n What?\n\n0:00:17\tSPEAKER_07\n What?\n\n0:00:18\tSPEAKER_07\n Should we close the door?\n\n0:00:20\tSPEAKER_05\n It's a fairly good mic actually.\n\n0:00:24\tSPEAKER_05\n Well, I shouldn't say it's a good mic.\n\n0:00:28\tSPEAKER_05\n All I really know is that the signal level is okay.\n\n0:00:30\tSPEAKER_05\n It's a quality.\n\n0:00:32\tSPEAKER_07\n That's a...\n\n0:00:34\tSPEAKER_07\n Oh, necessary.\n\n0:00:36\tSPEAKER_05\n So, I can send out agenda items because until five minutes ago we only had one agenda item and now we have two.\n\n0:00:42\tSPEAKER_05\n Okay.\n\n0:00:44\tSPEAKER_07\n So, just to repeat the thing that we said last week, there was this suggestion of alternating weeks on more automatic speed recognition related or not.\n\n0:00:55\tSPEAKER_07\n Right.\n\n0:00:56\tSPEAKER_07\n So, what sort of division?\n\n0:00:58\tSPEAKER_05\n So, which week are we in?\n\n0:01:00\tSPEAKER_05\n Well, we haven't really started, but I thought we were more or less did meeting recorder stuff last week, so I thought we could do...\n\n0:01:08\tSPEAKER_07\n I thought we had a thing about speed recognition last week too.\n\n0:01:12\tSPEAKER_05\n But I think you're also, if they're short agenda items, we could also do a little bit of each.\n\n0:01:16\tSPEAKER_05\n Yeah.\n\n0:01:18\tSPEAKER_05\n It seemed to be having difficulty getting this adjusted.\n\n0:01:20\tSPEAKER_05\n Here we go.\n\n0:01:22\tSPEAKER_05\n So, as most of you should know, I did send out the consent form thingies.\n\n0:01:26\tSPEAKER_05\n And so far no one has made any comments on them.\n\n0:01:32\tSPEAKER_05\n So, no one has bleeped out anything.\n\n0:01:34\tSPEAKER_05\n So, yeah.\n\n0:01:36\tSPEAKER_05\n I don't expect anyone to, but...\n\n0:01:38\tSPEAKER_07\n So, what follows at some point you go around and get people to sign something?\n\n0:01:44\tSPEAKER_05\n No. We had spoken about this before and we had decided that they only needed to sign once.\n\n0:01:50\tSPEAKER_05\n And the agreement that they already signed simply said that we would give them an opportunity.\n\n0:01:54\tSPEAKER_05\n So, as long as we do that, we're covered.\n\n0:01:56\tSPEAKER_07\n And how long of an opportunity did you tell them?\n\n0:01:58\tSPEAKER_05\n July 15th.\n\n0:02:00\tSPEAKER_07\n July 15th.\n\n0:02:02\tSPEAKER_07\n Oh, so they have a plenty of time.\n\n0:02:04\tSPEAKER_07\n Yeah. Given that it's that long, why was that day chosen?\n\n0:02:08\tSPEAKER_07\n You just felt like...\n\n0:02:09\tSPEAKER_05\n Jane told me July 15th.\n\n0:02:10\tSPEAKER_05\n So, that's what I said.\n\n0:02:12\tSPEAKER_02\n I just meant that that was the release date that you had on the data.\n\n0:02:16\tSPEAKER_05\n Oh, I didn't understand that there was something specific.\n\n0:02:20\tSPEAKER_05\n I had heard July 15th, so that's what I put.\n\n0:02:24\tSPEAKER_07\n The only mention I recall about that was just that July 15th or so is when this meeting starts.\n\n0:02:30\tSPEAKER_07\n That's why.\n\n0:02:32\tSPEAKER_07\n Oh, I see.\n\n0:02:34\tSPEAKER_02\n You said you wanted it to be available then.\n\n0:02:36\tSPEAKER_02\n You mean it to be the hard deadline.\n\n0:02:38\tSPEAKER_02\n It's fine with me if it is or a week.\n\n0:02:40\tSPEAKER_02\n But I thought it might be good to remind people two weeks prior to that.\n\n0:02:44\tSPEAKER_02\n So, by the way, what's your last?\n\n0:02:46\tSPEAKER_07\n We probably should have talked about it.\n\n0:02:48\tSPEAKER_07\n Because if we want to be able to give it to people July 15th, if somebody is going to come back and say, okay, I don't want this and this and this and this used.\n\n0:02:57\tSPEAKER_07\n Clearly, we need some time to respond to that.\n\n0:03:00\tSPEAKER_05\n Yeah, as I said, I just got one date and that's the one I used.\n\n0:03:03\tSPEAKER_05\n So, but I can send a follow-up.\n\n0:03:05\tSPEAKER_05\n I mean, it's almost all us.\n\n0:03:07\tSPEAKER_05\n I mean, the people who are in this meeting was...\n\n0:03:11\tSPEAKER_05\n These meetings that were in set one.\n\n0:03:14\tSPEAKER_06\n Was my response okay?\n\n0:03:15\tSPEAKER_06\n I just replied to the email saying they were all fine.\n\n0:03:17\tSPEAKER_05\n That's fine.\n\n0:03:18\tSPEAKER_05\n My understanding of what we had agreed upon when we had spoken about this months ago was that we don't actually need a reply.\n\n0:03:28\tSPEAKER_05\n We just need to tell them that they can do it if they want.\n\n0:03:30\tSPEAKER_05\n I just didn't remember.\n\n0:03:31\tSPEAKER_05\n And so, no reply is no changes.\n\n0:03:34\tSPEAKER_02\n And he's got it.\n\n0:03:35\tSPEAKER_02\n So, the default thing you see when you look at the page is okay.\n\n0:03:38\tSPEAKER_02\n So, that's very clear all the way down the page.\n\n0:03:40\tSPEAKER_02\n And they have two options.\n\n0:03:41\tSPEAKER_02\n They can change it to one of them is sensor.\n\n0:03:44\tSPEAKER_02\n And the other one is incorrect.\n\n0:03:46\tSPEAKER_02\n Which means also we get feedback on if there's something that needs to be adjusted.\n\n0:03:54\tSPEAKER_02\n Because these are very highly technical things.\n\n0:03:57\tSPEAKER_02\n I mean, it's an added level of checking on the accuracy of the transcription as I see it.\n\n0:04:01\tSPEAKER_02\n But in any case, people can agree to things that are wrong.\n\n0:04:04\tSPEAKER_05\n So, the reason I did that was just so that people would not ask to have stuff removed because it was transcribed incorrectly.\n\n0:04:11\tSPEAKER_02\n And the reason I liked it was because it gives them the option of being able to correct it.\n\n0:04:19\tSPEAKER_02\n Very.\n\n0:04:20\tSPEAKER_02\n Approved and corrected.\n\n0:04:22\tSPEAKER_02\n And so, you have it nicely set up so they email you and...\n\n0:04:29\tSPEAKER_05\n When they submit the form, it gets processed and emailed to me.\n\n0:04:33\tSPEAKER_02\n And I wanted to say the meetings that are involved in that set are robustness and meeting recorder.\n\n0:04:37\tSPEAKER_02\n The German ones will be ready for next week.\n\n0:04:40\tSPEAKER_02\n Those are three of those different set of people.\n\n0:04:42\tSPEAKER_02\n And we can move on.\n\n0:04:43\tSPEAKER_02\n German ones?\n\n0:04:44\tSPEAKER_02\n Well.\n\n0:04:45\tSPEAKER_07\n NSA.\n\n0:04:46\tSPEAKER_02\n Okay, I spoke loosely.\n\n0:04:48\tSPEAKER_02\n The German French... sorry, the German Dutch and Spanish ones.\n\n0:04:52\tSPEAKER_06\n All those are the NSA's.\n\n0:05:04\tSPEAKER_02\n The German Dutch and Spanish.\n\n0:05:31\tSPEAKER_05\n That's a month, which is...\n\n0:05:34\tSPEAKER_05\n The only thing I said in the email is that the data is going to be released on the 15th.\n\n0:05:36\tSPEAKER_05\n I didn't give any other deadline.\n\n0:05:38\tSPEAKER_05\n So, my feeling is if someone after the 15th says, wow, I suddenly found something, we'll delete it from our record.\n\n0:05:44\tSPEAKER_05\n We just won't delete it from whatever has already been released.\n\n0:05:47\tSPEAKER_02\n That's a little bit difficult.\n\n0:05:51\tSPEAKER_05\n What else can we do?\n\n0:05:53\tSPEAKER_05\n If someone says, hey, look, I found something in this meeting and it's libelous and I want it removed.\n\n0:05:59\tSPEAKER_05\n What can we do?\n\n0:06:01\tSPEAKER_02\n We have to remove it.\n\n0:06:02\tSPEAKER_02\n It's true.\n\n0:06:03\tSPEAKER_02\n I agree with that part.\n\n0:06:04\tSPEAKER_02\n But I think that we need to have a message to them very clearly that beyond this date, you can't make additional changes.\n\n0:06:14\tSPEAKER_07\n I mean, I think that somebody might request something even though we say that, but I think it's good to at least start someplace like that.\n\n0:06:25\tSPEAKER_07\n So, if we agreed, okay, how long is a reasonable amount of time for people to have if we say two weeks or if we say a month?\n\n0:06:32\tSPEAKER_07\n I think we should just say that, say that, you know, as...\n\n0:06:36\tSPEAKER_07\n or the page you signed, you have the ability to look over this stuff, so forth.\n\n0:06:43\tSPEAKER_07\n And because we...\n\n0:06:46\tSPEAKER_07\n I would imagine it's a certain generic thing, I would say, because we will continually be making these things available through other researchers.\n\n0:06:56\tSPEAKER_07\n This can't be open-ended, and so please give us back your response within this, you know, within this amount of time.\n\n0:07:02\tSPEAKER_05\n Well, did you rep-email and look at the pages, I sent?\n\n0:07:05\tSPEAKER_05\n Did I know?\n\n0:07:06\tSPEAKER_05\n I haven't.\n\n0:07:07\tSPEAKER_05\n Okay, well, why don't you do that and then make comments on what you want me to change?\n\n0:07:10\tSPEAKER_07\n No, no, I'm not saying that you should change anything.\n\n0:07:13\tSPEAKER_07\n But I'm trying to spark a discussion, hopefully, with people who have ever had it, so that you can decide on something.\n\n0:07:20\tSPEAKER_07\n So, I'm not telling you what to decide.\n\n0:07:22\tSPEAKER_07\n I'm just saying you should decide something.\n\n0:07:24\tSPEAKER_05\n I already did decide something, and that's what's in the email.\n\n0:07:26\tSPEAKER_05\n And if you disagree with it, why don't you read it and give me comments on it?\n\n0:07:29\tSPEAKER_02\n I think that there's one missing line.\n\n0:07:31\tSPEAKER_07\n Well, the one thing that I did read that you just repeated to me was that you gave the specific date of July 15th.\n\n0:07:37\tSPEAKER_07\n And you also just said that the reason you said that was because someone said it to you.\n\n0:07:41\tSPEAKER_07\n Right. So, what I'm telling you is that what you should do is come up with a length of time that you guys think is enough, and you should use that rather than the state that you just got from somewhere.\n\n0:07:52\tSPEAKER_07\n That's all I'm saying.\n\n0:07:53\tSPEAKER_07\n Okay.\n\n0:07:54\tSPEAKER_02\n I have one question.\n\n0:07:55\tSPEAKER_02\n This isn't the summer period, and presumably people may be out of town, but we can make the assumption can't we that they will be receiving email most of the month, right?\n\n0:08:07\tSPEAKER_07\n Well, you're right. Sometimes somebody will be away, and for any length of time that you choose, there is some person, sometimes who will not end up reading it.\n\n0:08:20\tSPEAKER_07\n It's just a certain risk to take.\n\n0:08:23\tSPEAKER_01\n So maybe when am I on by the way?\n\n0:08:27\tSPEAKER_01\n I don't know.\n\n0:08:28\tSPEAKER_01\n You should be.\n\n0:08:29\tSPEAKER_05\n Hello.\n\n0:08:30\tSPEAKER_05\n You should be Channel B.\n\n0:08:32\tSPEAKER_01\n Okay. All right. So maybe we should say in when the whole thing starts, when they sign the agreement that specified exactly how they will be contacted, and they can be asked to give a phone number and an email address or both.\n\n0:08:54\tSPEAKER_01\n And then say very clearly that if they don't hear from them, as more suggested by a certain time or after a certain period, after we contact them, that is a bliss of the giving their agreement.\n\n0:09:11\tSPEAKER_05\n Well, they've already signed a form.\n\n0:09:13\tSPEAKER_05\n And the form was approved by human subjects, so if that's going to be a little hard to modify.\n\n0:09:21\tSPEAKER_02\n Well, the form doesn't say if you don't respond by X number of days or X number of weeks.\n\n0:09:27\tSPEAKER_01\n So what does it say about the process of the review process?\n\n0:09:32\tSPEAKER_02\n That you'll be provided access to the transcripts and then allowed to remove things that you'd like to remove before it goes to the general larger audience.\n\n0:09:42\tSPEAKER_05\n Yeah, you can read what you already signed.\n\n0:09:44\tSPEAKER_03\n I guess when I read it, I'm not as diligent as Chuck, but I had the feeling I should probably respond until Adam, like, I got this and I will do it by this date.\n\n0:09:54\tSPEAKER_03\n And if you don't hear from me by then, in other words, responding to your email once, right away, saying, as soon as you get this, could you please respond.\n\n0:10:02\tSPEAKER_03\n And then if the person thinks they'll need more time because they're out of town or whatever, they can tell you at that point because...\n\n0:10:10\tSPEAKER_05\n Oh, I just didn't want to do that because I don't want to have a discussion with every person if I can avoid it.\n\n0:10:16\tSPEAKER_05\n So what I wanted to do was just send it out and say on the 15th of the date is released if you want to do something about it, do something about it, but that's it.\n\n0:10:24\tSPEAKER_03\n I kind of like this.\n\n0:10:26\tSPEAKER_03\n Okay, so we're assuming that...\n\n0:10:28\tSPEAKER_01\n That would be great, but you should probably have a legal person look at this and make sure it's okay.\n\n0:10:33\tSPEAKER_01\n Because if you do this and then there's this put later and someone who understands these matters concludes that they didn't have enough opportunity to actually exercise their right.\n\n0:10:51\tSPEAKER_03\n Or they might never have gotten the email because although they sign this, they don't know by which date to expect your email.\n\n0:10:58\tSPEAKER_03\n So someone who's machine is down or whatever, I mean we have no internally that people...\n\n0:11:04\tSPEAKER_05\n Well, okay, let me reverse this.\n\n0:11:06\tSPEAKER_05\n So let's say someone I send this out and someone doesn't respond.\n\n0:11:10\tSPEAKER_05\n Do we delete every meeting that they were in?\n\n0:11:14\tSPEAKER_03\n I don't think so.\n\n0:11:16\tSPEAKER_05\n We're hoping that doesn't happen, but that's why there's such a dangerous, dirt mail.\n\n0:11:20\tSPEAKER_05\n That will absolutely happen because people don't read their email or they'll read and say I don't care about that, I'm not going to delete anything and they just won't reply to it.\n\n0:11:27\tSPEAKER_01\n So we have mailing addresses for these people?\n\n0:11:29\tSPEAKER_05\n No. We have what they put on the speaker form which was just generic contact information.\n\n0:11:34\tSPEAKER_02\n But the ones that we're dealing with now are all local except the ones who...\n\n0:11:37\tSPEAKER_02\n We're totally in contact with all the ones in those two years.\n\n0:11:40\tSPEAKER_02\n So maybe...\n\n0:11:42\tSPEAKER_02\n That's not that many people and if there is an advantage to having them admit and if I can help with processing that, I will.\n\n0:11:50\tSPEAKER_02\n There is an advantage having them be on record as having received the mail and indicated.\n\n0:11:54\tSPEAKER_05\n I thought we had discussed this like a year ago.\n\n0:11:57\tSPEAKER_05\n And so it seems like this is a little odd for it to be coming up yet again.\n\n0:12:01\tSPEAKER_07\n Well, we haven't experienced it before.\n\n0:12:04\tSPEAKER_03\n You'll either wonder at the beginning or you'll wonder at the end.\n\n0:12:08\tSPEAKER_03\n I mean there's no way to get around.\n\n0:12:11\tSPEAKER_03\n It's pretty much the same amount of work except for an additional email just saying they got the email.\n\n0:12:16\tSPEAKER_03\n And maybe it's better legally to wonder before a little bit earlier than.\n\n0:12:21\tSPEAKER_02\n It's much easier to explain.\n\n0:12:24\tSPEAKER_05\n Morgan can talk to our lawyer about it and find out what the status is on this because I don't want to do something that we don't need to.\n\n0:12:30\tSPEAKER_05\n Because what I'm telling you, people won't respond to the email.\n\n0:12:34\tSPEAKER_05\n No matter what you do, they're going to be people who you're going to have to make a lot of effort to get in contact with.\n\n0:12:40\tSPEAKER_05\n And do we want to spend that?\n\n0:12:42\tSPEAKER_04\n It's kind of like signing up for a mailing list. They have opt-in and opt out.\n\n0:12:44\tSPEAKER_04\n And there are two different ways.\n\n0:12:46\tSPEAKER_04\n I mean in either way works probably.\n\n0:12:48\tSPEAKER_02\n Except I really think in this case, I agree with Liz that we need to be in the clear and not have to after the fact say, oh but I assumed.\n\n0:12:56\tSPEAKER_02\n And oh I'm sorry that your email address was just accumulating mail without notifying you.\n\n0:13:01\tSPEAKER_07\n If this is a purely administrative task, we can actually have administration do it.\n\n0:13:05\tSPEAKER_07\n But the thing is that I think without going through a whole expensive thing with our lawyers from my previous conversations within my sense very much is that we would want something on record.\n\n0:13:17\tSPEAKER_07\n Yes.\n\n0:13:18\tSPEAKER_07\n Is indicating that they actually were aware of this.\n\n0:13:22\tSPEAKER_05\n Well we had talked about this before and I thought that we had even gone by the lawyers asking about that and they said, you have to, they've already signed away with that form.\n\n0:13:31\tSPEAKER_05\n They've already signed once.\n\n0:13:33\tSPEAKER_02\n I don't remember that this issue of the time period allowed for response was ever covered.\n\n0:13:39\tSPEAKER_07\n Okay. We never really talked about that.\n\n0:13:41\tSPEAKER_03\n Or the data which they would be receiving the email.\n\n0:13:43\tSPEAKER_03\n Yeah.\n\n0:13:44\tSPEAKER_03\n Or how they would indicate.\n\n0:13:45\tSPEAKER_07\n We certainly didn't talk a bit with them at all about the manner of them being.\n\n0:13:50\tSPEAKER_07\n We do it like with the materials available.\n\n0:13:53\tSPEAKER_07\n That was something that was sort of just within our implementation.\n\n0:13:55\tSPEAKER_01\n We can use a, we can use a, like they use to, you know, when they serve like, you know, like deadbeat, bats, they make it look like they want something in the lottery and then they open that love with that.\n\n0:14:11\tSPEAKER_01\n Right. And then the thing is served. So you just make it, you know, you want, you know, go to this website and you've.\n\n0:14:19\tSPEAKER_03\n That's why you never open these things.\n\n0:14:21\tSPEAKER_05\n Well, it's just we've gone from one extreme to the other where at one point a few months ago, Morgan was you were saying, let's not do anything.\n\n0:14:29\tSPEAKER_05\n And now we're, we're saying we have to follow up each person and get a signature. I mean, what are we doing here?\n\n0:14:35\tSPEAKER_01\n And then this is perfectly, you know, this is enough to give us the basis to just assume their consent if they don't reply.\n\n0:14:43\tSPEAKER_01\n But I'm not, you know, me not being a lawyer, I wouldn't just want to do that without having the the expert.\n\n0:14:51\tSPEAKER_05\n I think we had better find out so that we can find out.\n\n0:14:53\tSPEAKER_02\n These people are either email almost all the time.\n\n0:14:56\tSPEAKER_02\n Right.\n\n0:14:57\tSPEAKER_02\n I really don't see that it's a problem. I think that it's a common courtesy to ask them to expect for them to be able to have.\n\n0:15:06\tSPEAKER_02\n Try to contact them in just in case they had.\n\n0:15:09\tSPEAKER_02\n I think they appreciate it.\n\n0:15:11\tSPEAKER_07\n Yeah, my, my view before was about the nature of what was of the presentation of how my, the things that were questioning were along the lines of how easy.\n\n0:15:23\tSPEAKER_07\n How, how much implication would there be that it's likely you're going to be changing something as opposed to that was the kind of dispute I was making before.\n\n0:15:32\tSPEAKER_07\n But the attorneys, I guarantee you the attorneys will always come back with, we have to decide how stringent we want to be in these things, but they will always come back saying that you need to, you want to have something, some paper trail, or which includes electronic trail, that they have in fact, OK, did.\n\n0:15:52\tSPEAKER_07\n So I think that if you, if we send the email as you have it, if there's half the people say who don't respond at all by some period of time, we can just make a list of these people and hand it to, you know, just give it to me, you know, hand to the minister, or whatever, and they'll just call them up and say, you know, have you, is this OK? Would you please mail, mail, Adam that it is if it is or not.\n\n0:16:20\tSPEAKER_03\n So the other thing that there's a psychological effect that leads to most people that if they've responded to your email saying, yes, I will do it or yes, I got your email, they're more likely to actually do it later, then to just ignore it.\n\n0:16:33\tSPEAKER_03\n And of course, we don't want them to bleep things out, but it's a little bit better for getting their final response once they've answered you once, then if they never answer you at all, at all.\n\n0:16:45\tSPEAKER_03\n So I mean, it's not completely lost work because it might benefit us in terms of getting responses, you know, an official OK from somebody is better than no answer, even if they've responded that they got your email, and they're probably more likely to do that once they've responded that they got the email.\n\n0:17:02\tSPEAKER_02\n I also think they just simply appreciate it. I think it's a good way of fostering good will on our subjects.\n\n0:17:09\tSPEAKER_07\n I think the main thing is, I mean, what lawyers do is they always look at worst cases. So that's what they're paid to do. And so it is certainly possible that somebody's server would be down or something and they wouldn't actually hear from us and then they find this thing is in there and we've already distributed someone.\n\n0:17:24\tSPEAKER_07\n So what it says in there, in fact, is that they will be given an opportunity to blah, blah, blah.\n\n0:17:29\tSPEAKER_07\n But in fact, if we sent them something, we thought we sent them something, but they didn't actually receive it for some reason, then we haven't given them.\n\n0:17:39\tSPEAKER_05\n So how far do we have to go? Do we need to get someone's signature or is email enough? Do we have to have it noterized? I mean.\n\n0:17:44\tSPEAKER_07\n Email is now.\n\n0:17:47\tSPEAKER_07\n I mean, I've been through this, I mean, not a lawyer, but I've been through these things. Things are like this a few times with lawyers now. So I'm pretty comfortable with that.\n\n0:17:56\tSPEAKER_06\n Do you track when people log in?\n\n0:18:01\tSPEAKER_05\n If they submit the form, I get it. If they don't submit the form, it goes in the general web log, but that's not sufficient.\n\n0:18:08\tSPEAKER_05\n Because if someone just visits the website, that doesn't imply anything in particular.\n\n0:18:13\tSPEAKER_06\n Except that you know they got the mail, right?\n\n0:18:15\tSPEAKER_02\n That's right. I could give to you on the number five list if you want me to.\n\n0:18:18\tSPEAKER_05\n I'm already on it.\n\n0:18:19\tSPEAKER_02\n For that directory?\n\n0:18:21\tSPEAKER_02\n Okay, great.\n\n0:18:24\tSPEAKER_07\n So again, hopefully this shouldn't be quite as odious a problem either way.\n\n0:18:30\tSPEAKER_07\n Any of the extremes we've talked about because we're talking a pretty small-\n\n0:18:36\tSPEAKER_05\n For this set, I'm not worried because we basically know everyone on it. They're all more or less here or it's Eric and Dan and so on.\n\n0:18:45\tSPEAKER_05\n But for some of the others, you're talking about visitors who are gone from XC, who email addresses may or may not work.\n\n0:18:52\tSPEAKER_05\n So what are we going to do when we run into someone that we can't get in touch with?\n\n0:18:58\tSPEAKER_02\n I don't think there's so recent these visitors.\n\n0:19:01\tSPEAKER_02\n And they're also so prominent enough they're easy to find through.\n\n0:19:07\tSPEAKER_02\n Other methods?\n\n0:19:08\tSPEAKER_02\n I'll be able to, if you have any trouble finding them, I really think I could find them.\n\n0:19:11\tSPEAKER_02\n Okay.\n\n0:19:13\tSPEAKER_07\n Yeah, because what it really does promise here is that we will ask their permission.\n\n0:19:19\tSPEAKER_07\n And I think if you go into a room and close the door and ask their permission, they're not there.\n\n0:19:24\tSPEAKER_07\n It doesn't seem that's the intent of meaning here.\n\n0:19:28\tSPEAKER_05\n Well, the question is just whether how active it has to be.\n\n0:19:31\tSPEAKER_05\n I mean because they filled out a contact information and that's where I'm sending the information.\n\n0:19:35\tSPEAKER_05\n And so far everyone has done email.\n\n0:19:37\tSPEAKER_05\n There isn't anyone who did any other contact method.\n\n0:19:40\tSPEAKER_07\n Well, the way XC goes, people who were here 10 years ago still have forwards to other counts and so on.\n\n0:19:48\tSPEAKER_07\n So it's unusual.\n\n0:19:49\tSPEAKER_05\n So my original impression was that that was sufficient.\n\n0:19:53\tSPEAKER_05\n That if they give us contact information, that contact information isn't accurate.\n\n0:19:57\tSPEAKER_05\n That we've fulfilled our bird.\n\n0:20:00\tSPEAKER_07\n So if we get to a boundary case like that, then maybe I will call the attorney about it.\n\n0:20:05\tSPEAKER_07\n But hopefully we won't need to.\n\n0:20:07\tSPEAKER_02\n I just don't think we will.\n\n0:20:08\tSPEAKER_02\n All right.\n\n0:20:09\tSPEAKER_02\n For all the reasons that we've discussed.\n\n0:20:10\tSPEAKER_02\n So we'll see.\n\n0:20:11\tSPEAKER_05\n We'll see how many people respond to that email.\n\n0:20:13\tSPEAKER_05\n So far two people have.\n\n0:20:14\tSPEAKER_07\n Yeah, I think very few people will.\n\n0:20:16\tSPEAKER_07\n And people see long emails about things that they don't think.\n\n0:20:20\tSPEAKER_07\n It's going to be high priority.\n\n0:20:21\tSPEAKER_07\n They typically don't.\n\n0:20:22\tSPEAKER_07\n Don't read it or have read it.\n\n0:20:24\tSPEAKER_07\n Right.\n\n0:20:25\tSPEAKER_07\n Because people I swamped.\n\n0:20:26\tSPEAKER_02\n And actually, I didn't anticipate this.\n\n0:20:30\tSPEAKER_02\n So that's why I didn't give this comment.\n\n0:20:32\tSPEAKER_02\n And this discussion has made me think it might be nice to have a follow-up email within the next couple of days saying, by the way, we want to hear back from you by X date.\n\n0:20:46\tSPEAKER_02\n And then add what Liz said.\n\n0:20:47\tSPEAKER_02\n Please respond.\n\n0:20:48\tSPEAKER_02\n Please indicate you received this mail.\n\n0:20:50\tSPEAKER_07\n Or maybe even additionally.\n\n0:20:53\tSPEAKER_07\n Even if you've decided you have no changes you'd like to make if you could respond to that.\n\n0:20:59\tSPEAKER_03\n That would definitely work on me.\n\n0:21:02\tSPEAKER_03\n It makes you feel like if you're predicting that you might not answer.\n\n0:21:08\tSPEAKER_03\n You have a chance now to say that.\n\n0:21:11\tSPEAKER_03\n Whereas, I mean, I would be much more likely myself.\n\n0:21:14\tSPEAKER_03\n And yet, all my email to respond at that point saying, you know what, I'm probably not going to get to it or whatever.\n\n0:21:19\tSPEAKER_03\n Rather than just having seen the email thinking I might get to it and never really pushing myself to actually do it until it's too late.\n\n0:21:26\tSPEAKER_06\n I was thinking that it also lets them know that they don't have to go to the page to accept this.\n\n0:21:32\tSPEAKER_03\n Right.\n\n0:21:33\tSPEAKER_06\n That's true.\n\n0:21:34\tSPEAKER_06\n Yeah, so that way they can see from that email that if they just write back and say I got it, no changes.\n\n0:21:39\tSPEAKER_06\n They're off the hook.\n\n0:21:40\tSPEAKER_06\n They don't have to go to the webpage.\n\n0:21:41\tSPEAKER_07\n The other thing I've learned from dealing with people sending in reviews and so forth is if you say you've got three months to do this review, people do it two and seven eighths months from now.\n\n0:21:54\tSPEAKER_07\n Right.\n\n0:21:55\tSPEAKER_07\n So you've got three weeks to do this review.\n\n0:21:57\tSPEAKER_07\n They do two and seven eighths weeks from now.\n\n0:21:59\tSPEAKER_07\n They do the review.\n\n0:22:00\tSPEAKER_07\n And so if we make it a little less time, I don't think it will be that.\n\n0:22:06\tSPEAKER_05\n Well, and also if we want it ready by the 15th, that means we better give them deadline of the first.\n\n0:22:10\tSPEAKER_05\n If we have any prayer of actually getting everyone to respond in time.\n\n0:22:14\tSPEAKER_07\n There's the responding part in there is also what if, I mean, hopefully this doesn't happen.\n\n0:22:19\tSPEAKER_07\n What if there are a bunch of deletions that have to get put in the changes, then we actually have to deal with that if we want it to.\n\n0:22:25\tSPEAKER_05\n Diskspace.\n\n0:22:26\tSPEAKER_05\n Oh my god.\n\n0:22:27\tSPEAKER_05\n I hadn't thought about that for every meeting, any meeting which has any bleeps in it, we need yet another copy of.\n\n0:22:37\tSPEAKER_05\n Just get to that channel.\n\n0:22:38\tSPEAKER_05\n Oh no, we need all the channels.\n\n0:22:40\tSPEAKER_05\n Do you have to do the other close talk?\n\n0:22:43\tSPEAKER_05\n Yes, absolutely.\n\n0:22:44\tSPEAKER_05\n You could just log across talk.\n\n0:22:46\tSPEAKER_05\n Well, you have to copy the whole file, right, because we're going to be releasing the whole file.\n\n0:22:53\tSPEAKER_02\n I think at a certain point that copy that has the deletions will become the master copy.\n\n0:22:58\tSPEAKER_05\n Yeah, it's just I hate deleting any data.\n\n0:23:00\tSPEAKER_05\n So I don't want, I really would rather make a copy of it rather than bleep it out.\n\n0:23:05\tSPEAKER_07\n Are you bleeping it by adding?\n\n0:23:07\tSPEAKER_05\n Overlapping.\n\n0:23:09\tSPEAKER_05\n So it's exactly a sensor bleep.\n\n0:23:12\tSPEAKER_05\n So what I really think is bleep.\n\n0:23:14\tSPEAKER_07\n Is it summing signals or do you delete the old one and put the new one?\n\n0:23:19\tSPEAKER_07\n I delete the old one and put the new one.\n\n0:23:20\tSPEAKER_05\n There's nothing left of the original.\n\n0:23:21\tSPEAKER_07\n Because if you're summing, it could, anyway.\n\n0:23:24\tSPEAKER_05\n Yeah, it's easy to get it back again.\n\n0:23:26\tSPEAKER_02\n And then I was going to say also they, they don't have to say on the system as you know, because once it's been successfully bleeped.\n\n0:23:34\tSPEAKER_02\n We'll tell people to free.\n\n0:23:35\tSPEAKER_02\n You can hide it, yeah.\n\n0:23:36\tSPEAKER_02\n Can't you rely on the art heart?\n\n0:23:38\tSPEAKER_04\n We got that.\n\n0:23:39\tSPEAKER_04\n Yeah, that's true.\n\n0:23:40\tSPEAKER_04\n To hide it.\n\n0:23:41\tSPEAKER_04\n You can crypt it.\n\n0:23:42\tSPEAKER_07\n If you sponsor it with it, too hide it.\n\n0:23:44\tSPEAKER_07\n Here we go.\n\n0:23:45\tSPEAKER_01\n There you go.\n\n0:23:46\tSPEAKER_01\n There you go.\n\n0:23:49\tSPEAKER_01\n Like people say what they said.\n\n0:23:52\tSPEAKER_04\n And you have like subliminal.\n\n0:23:54\tSPEAKER_05\n You've seen the speech recognition system that reversed very short segments.\n\n0:23:58\tSPEAKER_05\n Did you read that paper?\n\n0:23:59\tSPEAKER_05\n No.\n\n0:24:00\tSPEAKER_05\n It wouldn't work.\n\n0:24:01\tSPEAKER_05\n The speech recognizer still works.\n\n0:24:02\tSPEAKER_05\n Yeah.\n\n0:24:03\tSPEAKER_03\n And if you do it backwards.\n\n0:24:05\tSPEAKER_06\n Yeah.\n\n0:24:06\tSPEAKER_06\n That's because they use forward backwards.\n\n0:24:07\tSPEAKER_06\n Forward backwards.\n\n0:24:08\tSPEAKER_05\n Forward backwards.\n\n0:24:09\tSPEAKER_05\n That's right.\n\n0:24:10\tSPEAKER_05\n Good point.\n\n0:24:11\tSPEAKER_05\n A point.\n\n0:24:13\tSPEAKER_05\n Well, I'm sorry if I sound a little peeved about this whole thing.\n\n0:24:15\tSPEAKER_05\n It's just we've had meeting after meeting after meeting on this.\n\n0:24:18\tSPEAKER_05\n And it seems like we've never gotten it resolved.\n\n0:24:20\tSPEAKER_07\n Well, we've never also, we've also never done it.\n\n0:24:23\tSPEAKER_07\n It's the first time we've been releasing widgets the first time through.\n\n0:24:26\tSPEAKER_07\n And I'm sorry responding without having much knowledge.\n\n0:24:29\tSPEAKER_07\n But the thing is I am like one of these people who gets the gazillion males.\n\n0:24:32\tSPEAKER_07\n Well, that's exactly why I did it the way I did it.\n\n0:24:35\tSPEAKER_05\n Which is the default is if you do nothing, we're going to release it.\n\n0:24:37\tSPEAKER_05\n Because I have my stack of emails to be done.\n\n0:24:42\tSPEAKER_05\n That 50 or 60 long.\n\n0:24:44\tSPEAKER_05\n And the ones at the top, I'm never going to get to.\n\n0:24:46\tSPEAKER_05\n Right.\n\n0:24:47\tSPEAKER_05\n So the only thing we're missing is wait and then you respond easily to say,\n\n0:24:52\tSPEAKER_07\n okay, you're going to have a mail-in deer.\n\n0:24:54\tSPEAKER_05\n Yeah, that's actually definitely a good point. The email doesn't specify that you can just reply to the email as opposed to going to the forum.\n\n0:25:03\tSPEAKER_02\n And it also doesn't give a specific, I didn't think of it.\n\n0:25:06\tSPEAKER_02\n So I think it's a good idea.\n\n0:25:08\tSPEAKER_02\n And explicit time by which this will be considered.\n\n0:25:11\tSPEAKER_02\n Yeah, release.\n\n0:25:12\tSPEAKER_02\n And it has to be time earlier than that endpoint.\n\n0:25:14\tSPEAKER_02\n Yeah.\n\n0:25:15\tSPEAKER_07\n It's converging.\n\n0:25:17\tSPEAKER_01\n I've seen this recently.\n\n0:25:19\tSPEAKER_01\n I got the email.\n\n0:25:20\tSPEAKER_01\n And if I use a mind-capable mail reader, it actually says, you know, click on this button to confirm receipt of the mail.\n\n0:25:30\tSPEAKER_01\n Oh, that's interesting.\n\n0:25:32\tSPEAKER_05\n You can, a lot of mailers support return receipt.\n\n0:25:35\tSPEAKER_01\n Right.\n\n0:25:36\tSPEAKER_05\n But it doesn't confirm that they've read it.\n\n0:25:37\tSPEAKER_01\n No, no, this is different.\n\n0:25:38\tSPEAKER_01\n This is not, so I know you can tell, you know, the mail delivery agent to confirm that the mail was delivered to your mailbox.\n\n0:25:45\tSPEAKER_01\n But no, this was different.\n\n0:25:47\tSPEAKER_01\n In the mail, there was a...\n\n0:25:49\tSPEAKER_01\n Oh, just a button.\n\n0:25:51\tSPEAKER_01\n There was a button that when you clicked on it, it would send, you know, actual acknowledgments to the center that you had actually looked at the mail.\n\n0:26:00\tSPEAKER_01\n Yeah, we could do that, but I hate that.\n\n0:26:02\tSPEAKER_01\n But it only works for, you know, mind-capable, you know, if you use a landscape or something.\n\n0:26:06\tSPEAKER_07\n It does respond to the mail.\n\n0:26:08\tSPEAKER_07\n And we actually need a third thing.\n\n0:26:09\tSPEAKER_07\n It's not that you've looked at it.\n\n0:26:10\tSPEAKER_07\n And you've looked at it and agree with one of the possible actions, right?\n\n0:26:15\tSPEAKER_01\n No, no, you can do that.\n\n0:26:16\tSPEAKER_01\n You can put this button anywhere you want.\n\n0:26:18\tSPEAKER_01\n Oh, I see.\n\n0:26:19\tSPEAKER_01\n And say here by clicking on this, I agree.\n\n0:26:22\tSPEAKER_07\n I acknowledge my first born children are yours.\n\n0:26:26\tSPEAKER_07\n Yeah.\n\n0:26:27\tSPEAKER_07\n Yeah.\n\n0:26:28\tSPEAKER_03\n Quick question.\n\n0:26:29\tSPEAKER_05\n Well, I could put a URL in there without any difficulty.\n\n0:26:32\tSPEAKER_05\n And even pretty simple mind readers can do that.\n\n0:26:35\tSPEAKER_02\n But why shouldn't they just email back?\n\n0:26:37\tSPEAKER_02\n Yeah, reply.\n\n0:26:38\tSPEAKER_02\n It's very nice. I like the high tech aspect.\n\n0:26:41\tSPEAKER_01\n I actually don't.\n\n0:26:42\tSPEAKER_01\n Appreciate it.\n\n0:26:43\tSPEAKER_01\n I'm not.\n\n0:26:44\tSPEAKER_05\n I use a text mail.\n\n0:26:45\tSPEAKER_03\n You use Vi?\n\n0:26:46\tSPEAKER_07\n Oh, that's my guy.\n\n0:26:49\tSPEAKER_05\n You use the VI?\n\n0:26:51\tSPEAKER_01\n Yeah.\n\n0:26:52\tSPEAKER_01\n There's these logos that you can put at the bottom of your webpage, like powered by Vi.\n\n0:26:57\tSPEAKER_01\n Yeah.\n\n0:26:58\tSPEAKER_01\n Wow.\n\n0:26:59\tSPEAKER_05\n You can put web bugs in the email.\n\n0:27:01\tSPEAKER_03\n There were three meetings this time or six, but of different people.\n\n0:27:06\tSPEAKER_03\n So I guess if you're in both these types of meetings, you'd have a lot.\n\n0:27:09\tSPEAKER_03\n But how, I mean, it also depends on how many, like, if we release this time, it's a fairly small number of meetings.\n\n0:27:16\tSPEAKER_03\n But what if we release like 25 meetings to people?\n\n0:27:19\tSPEAKER_05\n Well, what my expectation is is that we'll send out one of these emails every time a meeting has been checked and is ready.\n\n0:27:26\tSPEAKER_05\n Oh, okay.\n\n0:27:27\tSPEAKER_05\n So that was my intention.\n\n0:27:28\tSPEAKER_05\n It's just, yeah, that we just happen to have a bunch all at once.\n\n0:27:31\tSPEAKER_05\n That's a good idea.\n\n0:27:32\tSPEAKER_05\n I mean, maybe is that the way it's going to be, Jane?\n\n0:27:34\tSPEAKER_02\n We could do it. I'd be happy with either way.\n\n0:27:36\tSPEAKER_02\n Batch wise, what I was thinking, so this one, that was exactly right, that we had a...\n\n0:27:40\tSPEAKER_02\n I had wanted to get the entire set of 12 hours ready.\n\n0:27:44\tSPEAKER_02\n Don't have it.\n\n0:27:45\tSPEAKER_02\n But this was the biggest clump I could do by a time where I thought it was reasonable.\n\n0:27:49\tSPEAKER_02\n People would be able to check it and still have it ready by then.\n\n0:27:51\tSPEAKER_02\n I was thinking that with the NSA meetings, I liked there are three of them.\n\n0:27:56\tSPEAKER_02\n And there...\n\n0:27:57\tSPEAKER_02\n I will have them done by Monday.\n\n0:28:00\tSPEAKER_02\n Unfortunately, the time is later and I don't know how that's going to work out.\n\n0:28:03\tSPEAKER_02\n But I thought it'd be good to have that release as a clump too, because then, you know, they have a...\n\n0:28:08\tSPEAKER_02\n It's in a category.\n\n0:28:09\tSPEAKER_02\n It's not quite so distracting to them is what I was thinking and so on and once.\n\n0:28:12\tSPEAKER_02\n But after that, when we're caught up a bit on this process, then I could imagine sending them out periodically as they become available.\n\n0:28:20\tSPEAKER_02\n I could do it either way.\n\n0:28:21\tSPEAKER_02\n I mean, it's a question of how distracting these to the people who have to do the checking.\n\n0:28:26\tSPEAKER_07\n You hear anything?\n\n0:28:29\tSPEAKER_06\n Maybe I'm...\n\n0:28:33\tSPEAKER_06\n Let's see.\n\n0:28:34\tSPEAKER_06\n Right.\n\n0:28:35\tSPEAKER_06\n So we got the transcript back from that one meeting.\n\n0:28:36\tSPEAKER_06\n Everything seemed fine.\n\n0:28:37\tSPEAKER_06\n Adam had a script that will put everything back together and there was one small problem, but it was a simple thing to fix.\n\n0:28:43\tSPEAKER_06\n And then, I sent him pointer to three more.\n\n0:28:48\tSPEAKER_06\n And so he's off and working...\n\n0:28:52\tSPEAKER_05\n Now we haven't actually had anyone go through that meeting to see whether the transcript is correct and to see how much was missed and all that sort of stuff.\n\n0:28:58\tSPEAKER_05\n So at some point, you need to do that.\n\n0:29:00\tSPEAKER_02\n Oh, that's on my list.\n\n0:29:01\tSPEAKER_06\n Yeah, it's going to have to go through our regular...\n\n0:29:04\tSPEAKER_05\n I mean, the one thing I noticed is it did miss a lot of back channels.\n\n0:29:06\tSPEAKER_05\n There are a fair number of yes and a-huzz that it's just that aren't in there.\n\n0:29:10\tSPEAKER_07\n But I think, yeah, you see, that's going to be our standard process.\n\n0:29:15\tSPEAKER_07\n That's what the transcript was doing.\n\n0:29:17\tSPEAKER_07\n I would imagine once.\n\n0:29:18\tSPEAKER_07\n Yes, absolutely.\n\n0:29:19\tSPEAKER_02\n One question about the back channels.\n\n0:29:21\tSPEAKER_02\n Do you suppose that was because they weren't caught by the pre-segmenter?\n\n0:29:24\tSPEAKER_02\n Yes, absolutely.\n\n0:29:25\tSPEAKER_05\n Oh, interesting.\n\n0:29:26\tSPEAKER_05\n Yeah, they're not in the segment.\n\n0:29:29\tSPEAKER_05\n It's not that the IBM people didn't do it.\n\n0:29:32\tSPEAKER_05\n Okay.\n\n0:29:33\tSPEAKER_02\n Just they didn't get marked.\n\n0:29:34\tSPEAKER_02\n Okay, so maybe when the detector for that, it's better or something.\n\n0:29:37\tSPEAKER_02\n There's another issue, which is this...\n\n0:29:39\tSPEAKER_02\n We've been contacted by University of Washington now, of course, to...\n\n0:29:43\tSPEAKER_02\n We sent them the transcripts that correspond to those six meetings.\n\n0:29:46\tSPEAKER_02\n And they're downloading the audio files.\n\n0:29:50\tSPEAKER_02\n So I'll be doing that.\n\n0:29:51\tSPEAKER_02\n Check...\n\n0:29:52\tSPEAKER_02\n Check that...\n\n0:29:53\tSPEAKER_02\n Put that in.\n\n0:29:54\tSPEAKER_06\n I pointed them to the set that Andreas put on the web so that they want to compare directly with his results they can.\n\n0:30:03\tSPEAKER_06\n And then once...\n\n0:30:05\tSPEAKER_06\n We can also point them at the original meetings.\n\n0:30:10\tSPEAKER_06\n They can grab those too with...\n\n0:30:12\tSPEAKER_03\n Do you put the reference files?\n\n0:30:14\tSPEAKER_06\n No, no.\n\n0:30:15\tSPEAKER_06\n They wanted the audio.\n\n0:30:16\tSPEAKER_06\n Jane sent them the transcripts.\n\n0:30:17\tSPEAKER_03\n I mean, I have the transcripts.\n\n0:30:19\tSPEAKER_03\n Well, we can talk about offline.\n\n0:30:23\tSPEAKER_05\n There's another meeting in here, what, at four.\n\n0:30:26\tSPEAKER_05\n Right?\n\n0:30:27\tSPEAKER_05\n Yes, so we have to finish by 345.\n\n0:30:29\tSPEAKER_01\n So the...\n\n0:30:30\tSPEAKER_01\n Does UW want to use the state of for recognition or something else?\n\n0:30:35\tSPEAKER_06\n For recognition.\n\n0:30:36\tSPEAKER_03\n I think they're doing what...\n\n0:30:37\tSPEAKER_03\n Didn't they want to do language modeling on, you know, recognition compatible transcripts?\n\n0:30:41\tSPEAKER_02\n This is to show you some of the things that turn up during the checking procedure.\n\n0:30:46\tSPEAKER_02\n So this is from one of the NSA meetings.\n\n0:30:48\tSPEAKER_02\n And if you're familiar with the DIF format, the arrow to the left is what it was.\n\n0:30:52\tSPEAKER_02\n And the arrow to the right is what it was changed to.\n\n0:30:55\tSPEAKER_02\n So, now the first one.\n\n0:30:57\tSPEAKER_02\n Okay, so then we start at weekly meeting.\n\n0:30:59\tSPEAKER_02\n The last time on the transcriber thought little too much, but really it was we learned too much, which makes more sense syntactically as well.\n\n0:31:09\tSPEAKER_02\n And these departancies were...\n\n0:31:11\tSPEAKER_02\n Oh, that's the convention for indicating uncertain.\n\n0:31:13\tSPEAKER_02\n So the transcriber was right.\n\n0:31:15\tSPEAKER_02\n You know, she was uncertain about that.\n\n0:31:17\tSPEAKER_02\n Okay.\n\n0:31:18\tSPEAKER_02\n She's right to be uncertain.\n\n0:31:19\tSPEAKER_02\n And it's also a good indication of the next one.\n\n0:31:22\tSPEAKER_02\n This was about Claudia, and she'd been really busy with stuff such as waivers.\n\n0:31:28\tSPEAKER_02\n Okay.\n\n0:31:29\tSPEAKER_02\n Next one.\n\n0:31:31\tSPEAKER_02\n This was an interesting one.\n\n0:31:33\tSPEAKER_02\n So the original was...\n\n0:31:34\tSPEAKER_02\n So Claudia is not the bad master here.\n\n0:31:37\tSPEAKER_02\n And then he'll ask, but it's really a lot of master.\n\n0:31:40\tSPEAKER_02\n And he's another type of uncertainty, which is, you know, they just didn't know what to make out of that.\n\n0:31:45\tSPEAKER_02\n So instead of split upon unknown, it's split in principle.\n\n0:31:48\tSPEAKER_04\n So I'm saying these are from IBM, the top line.\n\n0:31:50\tSPEAKER_02\n No, no, these are local transcriptions of the NSA meetings.\n\n0:31:54\tSPEAKER_02\n Transcribers version versus the checked version.\n\n0:31:57\tSPEAKER_02\n Oh, I see.\n\n0:31:58\tSPEAKER_02\n My checked version, which I go through it.\n\n0:32:00\tSPEAKER_02\n Then you get down here.\n\n0:32:02\tSPEAKER_02\n Sometimes some speakers will insert foreign language terms.\n\n0:32:05\tSPEAKER_02\n That's the next example, the next one.\n\n0:32:07\tSPEAKER_02\n The version beyond this is so instead of saying, or especially those words, also in older and some other ones, those sneak in.\n\n0:32:17\tSPEAKER_02\n The next one.\n\n0:32:18\tSPEAKER_02\n This is called...\n\n0:32:19\tSPEAKER_02\n This is called...\n\n0:32:20\tSPEAKER_02\n Sorry, what?\n\n0:32:21\tSPEAKER_01\n Discourse on...\n\n0:32:22\tSPEAKER_01\n This is called...\n\n0:32:23\tSPEAKER_02\n And it makes sense because it's like below this...\n\n0:32:24\tSPEAKER_02\n It's a little subliminal there.\n\n0:32:26\tSPEAKER_02\n Okay, next one.\n\n0:32:28\tSPEAKER_02\n This is a term, a problem with terminology.\n\n0:32:30\tSPEAKER_02\n Description with...\n\n0:32:31\tSPEAKER_02\n The transcriber is X as an advance, but really it's QS in advance.\n\n0:32:36\tSPEAKER_02\n I mean, I've benefited from some of these cross-group meetings.\n\n0:32:39\tSPEAKER_02\n Okay, then you got...\n\n0:32:41\tSPEAKER_02\n Instead of from something or other cards, it's for a multi-cast.\n\n0:32:45\tSPEAKER_02\n Instead of...\n\n0:32:47\tSPEAKER_02\n And system related, it's in system related.\n\n0:32:49\tSPEAKER_02\n This was changed to an acronym initially and it shouldn't have been.\n\n0:32:52\tSPEAKER_02\n And then you can see here, GPS was misinterpreted.\n\n0:32:57\tSPEAKER_02\n It's just totally understanding.\n\n0:32:59\tSPEAKER_02\n This is a lot of jargon.\n\n0:33:01\tSPEAKER_02\n And the final one, the transcriber in the core network itself, or the exit unknown, not the internet unknown, and it comes through as in the core network itself of the access provider, not the internet backbone core.\n\n0:33:14\tSPEAKER_02\n This is a lot of terminology.\n\n0:33:16\tSPEAKER_02\n And they're generally extremely good.\n\n0:33:18\tSPEAKER_02\n But, you know, in this area, it really does pay to double check.\n\n0:33:22\tSPEAKER_02\n And I'm hoping that when the checked versions are run through the recognizer that you'll see substantial improvements in performance, because there are a lot of these in there.\n\n0:33:31\tSPEAKER_05\n Yeah, but I bet they're acoustically challenging parts anyway, though.\n\n0:33:35\tSPEAKER_05\n I actually know.\n\n0:33:36\tSPEAKER_02\n Oh, really?\n\n0:33:37\tSPEAKER_05\n Oh, so it's just jargon.\n\n0:33:38\tSPEAKER_02\n It's jargon.\n\n0:33:39\tSPEAKER_02\n Yeah, I mean, this is because, you know, you don't realize in daily life how much you have top-down influences in what you're hearing.\n\n0:33:45\tSPEAKER_02\n And it's jargon coupled with a foreign accent.\n\n0:33:47\tSPEAKER_01\n But we don't, I mean, our language model right now doesn't know about these words anyhow.\n\n0:33:51\tSPEAKER_01\n So, you know, until you actually get a decent language model, add up a certain one to your problem.\n\n0:33:57\tSPEAKER_01\n It's a different one.\n\n0:33:58\tSPEAKER_01\n But it's definitely good that these are fixed, I mean, obviously.\n\n0:34:02\tSPEAKER_02\n Well, also from the standpoint of getting people's approval, because if someone sees a page full of barely desirable sentences, and then it's asked to prove it or not, it's not.\n\n0:34:12\tSPEAKER_02\n Yeah.\n\n0:34:13\tSPEAKER_07\n Yeah, that would be the same with people.\n\n0:34:15\tSPEAKER_07\n So, well, I don't approve it because it's not what I said.\n\n0:34:18\tSPEAKER_05\n Well, that's exactly right.\n\n0:34:19\tSPEAKER_05\n The extra option in.\n\n0:34:20\tSPEAKER_05\n It's that I was afraid people would say, let's censor that because it's wrong, and I don't want them to do that.\n\n0:34:25\tSPEAKER_02\n Yeah.\n\n0:34:26\tSPEAKER_02\n And then I also, the final thing I have for transcription is that I made a purchase of some other headphones because of the problem of low gain and the originals.\n\n0:34:33\tSPEAKER_02\n And they very much prefer the new ones.\n\n0:34:37\tSPEAKER_02\n Actually, I think that there will be fewer things to correct because of the choice.\n\n0:34:41\tSPEAKER_02\n We originally chosen very expensive headsets, but they're just not as good as these with respect to this particular test.\n\n0:34:51\tSPEAKER_05\n It's probably impeding, smatching problems.\n\n0:34:54\tSPEAKER_02\n I don't know, but we chose them because that's what's been used here by prominent projects in transcription.\n\n0:34:58\tSPEAKER_02\n So, every reason they think they would work.\n\n0:35:01\tSPEAKER_02\n Yes, spare headsets.\n\n0:35:02\tSPEAKER_05\n They're just earphones.\n\n0:35:03\tSPEAKER_05\n They're not headsets.\n\n0:35:04\tSPEAKER_05\n They're not microphones.\n\n0:35:05\tSPEAKER_01\n No, no, I mean earphones.\n\n0:35:08\tSPEAKER_01\n Because I could use one of my workstations just to do something I have to listen to audio files and I don't have to go borrow it from someone.\n\n0:35:18\tSPEAKER_02\n Actually, I have...\n\n0:35:20\tSPEAKER_02\n The thing is that if we have four people come to work for a day, I was hanging on to the others for spare spare.\n\n0:35:26\tSPEAKER_02\n No, but if you knew it, just get it.\n\n0:35:28\tSPEAKER_07\n Yeah, we should get it.\n\n0:35:29\tSPEAKER_07\n Yeah, I need it.\n\n0:35:31\tSPEAKER_07\n It's just something to get a pair too.\n\n0:35:33\tSPEAKER_04\n They're pretty inexpensive.\n\n0:35:34\tSPEAKER_04\n I'm using one of these.\n\n0:35:35\tSPEAKER_04\n Two or three or four X-ray.\n\n0:35:36\tSPEAKER_01\n I think I haven't had that I brought from home, but it's just from you.\n\n0:35:39\tSPEAKER_01\n Just buy them.\n\n0:35:40\tSPEAKER_07\n Where do you buy these from?\n\n0:35:42\tSPEAKER_02\n Cambridge Soundworks.\n\n0:35:43\tSPEAKER_02\n Just down the street.\n\n0:35:44\tSPEAKER_02\n You just go and...\n\n0:35:45\tSPEAKER_02\n Oh, yeah.\n\n0:35:46\tSPEAKER_02\n They want to have them stock.\n\n0:35:47\tSPEAKER_05\n Good idea.\n\n0:35:48\tSPEAKER_05\n Do you email out the brand?\n\n0:35:49\tSPEAKER_05\n Oh, sure.\n\n0:35:50\tSPEAKER_05\n Yeah.\n\n0:35:51\tSPEAKER_05\n It sounds like people are interested.\n\n0:35:52\tSPEAKER_02\n Yeah, it's made a difference in...\n\n0:35:54\tSPEAKER_07\n I realize something I should talk about.\n\n0:35:56\tSPEAKER_07\n So, what's the other thing on the agenda?\n\n0:35:58\tSPEAKER_05\n The only one was Don wanted to talk about disc space yet again.\n\n0:36:02\tSPEAKER_04\n Yeah.\n\n0:36:03\tSPEAKER_04\n Yeah, it's short.\n\n0:36:04\tSPEAKER_04\n I mean, if you want to go, we just want to go.\n\n0:36:05\tSPEAKER_04\n No, no, no, no, no, no.\n\n0:36:06\tSPEAKER_04\n It's short.\n\n0:36:07\tSPEAKER_04\n Well, you met the disc space.\n\n0:36:08\tSPEAKER_05\n No, we know the disc space.\n\n0:36:09\tSPEAKER_03\n That's a great ambiguity.\n\n0:36:10\tSPEAKER_03\n Yeah.\n\n0:36:11\tSPEAKER_03\n It's one of the...\n\n0:36:12\tSPEAKER_03\n It's social and it's level.\n\n0:36:14\tSPEAKER_03\n Yeah.\n\n0:36:15\tSPEAKER_03\n It's great.\n\n0:36:16\tSPEAKER_03\n Yeah.\n\n0:36:17\tSPEAKER_03\n It was really cool.\n\n0:36:18\tSPEAKER_03\n See if I had that little crack head, I would have made an X there.\n\n0:36:21\tSPEAKER_05\n Well, we'll give you one, man.\n\n0:36:23\tSPEAKER_04\n Yeah.\n\n0:36:24\tSPEAKER_04\n So, without thinking about it, when I offered up my hard drive last week, oh no.\n\n0:36:30\tSPEAKER_04\n That's not a big surprise.\n\n0:36:33\tSPEAKER_04\n No, I realized that we're going to be doing a lot of experiments for this paper we're writing.\n\n0:36:41\tSPEAKER_04\n So, we're probably going to need a lot more.\n\n0:36:43\tSPEAKER_04\n We're probably going to need that disc space that we had on the 18 gig hard drive.\n\n0:36:47\tSPEAKER_04\n But we also have someone else coming in that's going to help us out with some stuff.\n\n0:36:50\tSPEAKER_07\n We just ordered a hundred gigabytes.\n\n0:36:52\tSPEAKER_03\n Okay.\n\n0:36:53\tSPEAKER_03\n We just need to...\n\n0:36:54\tSPEAKER_03\n We just need to...\n\n0:36:55\tSPEAKER_07\n We're getting 336s.\n\n0:36:56\tSPEAKER_07\n Okay.\n\n0:36:57\tSPEAKER_07\n That are going into the main file.\n\n0:37:00\tSPEAKER_04\n Mark, well, you're so...\n\n0:37:01\tSPEAKER_04\n Yeah, I mean, I guess the thing is, is all I need is to hang it off like the person who's coming in, so now all these computer...\n\n0:37:07\tSPEAKER_01\n You mean the...\n\n0:37:08\tSPEAKER_01\n The disc...\n\n0:37:09\tSPEAKER_01\n Or we can move them.\n\n0:37:10\tSPEAKER_01\n Or machines that we just got?\n\n0:37:11\tSPEAKER_01\n No.\n\n0:37:12\tSPEAKER_01\n Or...\n\n0:37:13\tSPEAKER_04\n These are going to go on to discs.\n\n0:37:14\tSPEAKER_04\n So, are we going to move the stuff off of my hard drive onto that when those come in?\n\n0:37:16\tSPEAKER_04\n Let's take a minute.\n\n0:37:17\tSPEAKER_06\n Sure.\n\n0:37:18\tSPEAKER_06\n Okay.\n\n0:37:19\tSPEAKER_06\n Do you find it one of those plan for?\n\n0:37:20\tSPEAKER_06\n They should be...\n\n0:37:21\tSPEAKER_06\n I imagine next week or something.\n\n0:37:22\tSPEAKER_06\n Okay.\n\n0:37:23\tSPEAKER_05\n So, for desperate, I have some space on my drive, but I...\n\n0:37:27\tSPEAKER_05\n I think if I...\n\n0:37:29\tSPEAKER_04\n I vacillate between no space free and a few gigs.\n\n0:37:30\tSPEAKER_04\n Yeah, I think I can find something if I'm desperate.\n\n0:37:32\tSPEAKER_04\n And in the meantime, I'll just hold out.\n\n0:37:33\tSPEAKER_04\n That was the only thing I wanted to bring out.\n\n0:37:34\tSPEAKER_04\n It should be soon.\n\n0:37:35\tSPEAKER_07\n Okay.\n\n0:37:36\tSPEAKER_07\n So, there's another hundred gigs.\n\n0:37:37\tSPEAKER_04\n All right. Great.\n\n0:37:38\tSPEAKER_07\n That's it.\n\n0:37:39\tSPEAKER_07\n It's great to be able to do that.\n\n0:37:40\tSPEAKER_07\n I just say, oh yeah.\n\n0:37:41\tSPEAKER_05\n Yeah.\n\n0:37:42\tSPEAKER_03\n A hundred gig year, 100 gig there.\n\n0:37:43\tSPEAKER_03\n It's eventually.\n\n0:37:44\tSPEAKER_03\n Yeah.\n\n0:37:45\tSPEAKER_05\n Real disc space.\n\n0:37:46\tSPEAKER_05\n Yeah.\n\n0:37:47\tNone\n Yeah.\n\n0:37:48\tSPEAKER_07\n Yeah.\n\n0:37:49\tSPEAKER_07\n I was just going to comment that I'm going to be on the phone with Mark.\n\n0:37:52\tSPEAKER_07\n I'm going to be on the phone with Marie tomorrow.\n\n0:37:54\tSPEAKER_07\n Good afternoon.\n\n0:37:55\tSPEAKER_07\n We're supposed to get together and talk about where we are on things.\n\n0:38:01\tSPEAKER_07\n There's this meeting coming up.\n\n0:38:03\tSPEAKER_07\n And there's also an annual report.\n\n0:38:05\tSPEAKER_07\n And I never actually...\n\n0:38:06\tSPEAKER_07\n I was asking about this.\n\n0:38:07\tSPEAKER_07\n I don't really quite understand this.\n\n0:38:09\tSPEAKER_07\n She was referring to it as...\n\n0:38:12\tSPEAKER_07\n I think this actually didn't just come from her, but this is what the ARPA had asked for.\n\n0:38:18\tSPEAKER_07\n She was referring to it as an annual report for the fiscal year.\n\n0:38:21\tSPEAKER_07\n Of course, the fiscal year starts in October.\n\n0:38:23\tSPEAKER_07\n So I don't quite understand how we do an annual report that...\n\n0:38:27\tSPEAKER_07\n She's either related really early.\n\n0:38:29\tSPEAKER_05\n Or she's getting good early start.\n\n0:38:32\tSPEAKER_07\n I think basically it's none of those meetings in July.\n\n0:38:35\tSPEAKER_07\n So the so-dabr to said do an annual report.\n\n0:38:38\tSPEAKER_07\n So anyway, I'll be putting together stuff.\n\n0:38:42\tSPEAKER_07\n I'll do it as much as I can without bothering people just by looking at papers and status reports.\n\n0:38:47\tSPEAKER_07\n I mean, the status reports you do are very helpful.\n\n0:38:49\tSPEAKER_07\n So I can grab stuff there.\n\n0:38:51\tSPEAKER_07\n If I have some questions.\n\n0:38:53\tSPEAKER_07\n Yeah, if people could do it as soon as you can if you haven't done one.\n\n0:38:57\tSPEAKER_07\n Recently.\n\n0:38:59\tSPEAKER_07\n But, you know, I'm sure before it's all done on debugging people for more clarification about stuff.\n\n0:39:07\tSPEAKER_07\n But I don't know.\n\n0:39:09\tSPEAKER_07\n I guess I know pretty much what people have been doing.\n\n0:39:13\tSPEAKER_07\n We have these meetings and there's the status reports.\n\n0:39:18\tSPEAKER_07\n But, yeah, so that wasn't a long one just to tell you that.\n\n0:39:24\tSPEAKER_07\n And if something hasn't...\n\n0:39:26\tSPEAKER_07\n I'll be talking to you later tomorrow afternoon.\n\n0:39:28\tSPEAKER_07\n If something hasn't been in the status report and you think it's an important thing to mention.\n\n0:39:32\tSPEAKER_07\n This kind of thing just popped me online.\n\n0:39:35\tSPEAKER_07\n And I'll have it in front of me for the phone conversation.\n\n0:39:41\tSPEAKER_07\n I guess you're still packing away at the demos and all that.\n\n0:39:49\tSPEAKER_05\n And Donna's gonna be helping out with that.\n\n0:39:53\tSPEAKER_05\n Do you want to talk about that this afternoon?\n\n0:39:55\tSPEAKER_04\n I'm here, but later today.\n\n0:39:57\tSPEAKER_04\n We should probably talk offline about when we're gonna talk offline.\n\n0:40:01\tSPEAKER_07\n Okay.\n\n0:40:02\tSPEAKER_07\n Yeah, I might want to get updated about it in about a week.\n\n0:40:05\tSPEAKER_07\n Because I'm actually gonna have a few days off the following week after the picnic.\n\n0:40:12\tSPEAKER_07\n Okay.\n\n0:40:15\tSPEAKER_07\n So I had...\n\n0:40:17\tSPEAKER_05\n So we were gonna do sort of status of speech transcription, automatic transcription, but we're kind of running late.\n\n0:40:25\tSPEAKER_03\n How long does it take you to save the data?\n\n0:40:27\tSPEAKER_05\n 15 minutes.\n\n0:40:28\tSPEAKER_05\n Yeah.\n\n0:40:29\tSPEAKER_05\n So, if you want to do a quick 10 minute.\n\n0:40:33\tSPEAKER_03\n It's really should stop like 20 oh, that the latest.\n\n0:40:36\tSPEAKER_03\n We have never a meeting coming in that they want to record.\n\n0:40:39\tSPEAKER_07\n And there's the digits to do.\n\n0:40:41\tSPEAKER_07\n Well, we can skip the digits.\n\n0:40:42\tSPEAKER_07\n Maybe we could five minute reporters.\n\n0:40:45\tSPEAKER_03\n Up to you.\n\n0:40:46\tSPEAKER_03\n Whatever you want.\n\n0:40:47\tSPEAKER_07\n Yeah.\n\n0:40:48\tSPEAKER_05\n Oh, we'd love to hear about this message.\n\n0:40:49\tSPEAKER_07\n I'm interested.\n\n0:40:50\tSPEAKER_07\n Yeah, well, I'm gonna be on the phone tomorrow.\n\n0:40:51\tSPEAKER_07\n So this is just a good example of sort of thing I'd like to hear about.\n\n0:40:54\tSPEAKER_07\n Wait, why is everybody looking at me?\n\n0:40:56\tSPEAKER_07\n Sorry.\n\n0:40:57\tSPEAKER_07\n Because he looked at you and she was just catching.\n\n0:40:59\tSPEAKER_01\n I'm not sure what you're doing.\n\n0:41:01\tSPEAKER_01\n Are we supposed to have done something?\n\n0:41:03\tSPEAKER_05\n We're just talking before about alternating the subject of the meeting.\n\n0:41:07\tSPEAKER_05\n And this week we were going to try to do automatic transcription status.\n\n0:41:11\tSPEAKER_05\n Oh, we sort of failed.\n\n0:41:13\tSPEAKER_05\n Right?\n\n0:41:14\tSPEAKER_05\n No.\n\n0:41:15\tSPEAKER_05\n Did we?\n\n0:41:16\tSPEAKER_05\n Did we?\n\n0:41:17\tSPEAKER_05\n Okay.\n\n0:41:18\tSPEAKER_05\n Okay, so now we have the schedule.\n\n0:41:19\tSPEAKER_05\n So next week we'll do automatic transcription status plus anything that's real timely.\n\n0:41:22\tSPEAKER_07\n Okay.\n\n0:41:23\tSPEAKER_07\n Okay, shoot update.\n\n0:41:24\tSPEAKER_07\n I was going to stop that bullet.\n\n0:41:26\tSPEAKER_07\n Nicely done, there's.\n\n0:41:27\tSPEAKER_02\n I'll move on a few words.\n\n0:41:34\tSPEAKER_07\n But lots of pros.\n\n0:41:38\tSPEAKER_07\n Okay.\n\n0:41:39\tSPEAKER_01\n We really haven't done anything.\n\n0:41:43\tSPEAKER_01\n Excuse me?\n\n0:41:44\tSPEAKER_01\n Sorry.\n\n0:41:45\tSPEAKER_01\n The next thing on our agenda is to go back and look at the automatic alignments because I got some.\n\n0:41:54\tSPEAKER_01\n I learned from Tilo what data we can use as a benchmark to see how well we're doing automatic alignments.\n\n0:42:03\tSPEAKER_01\n So after that, I have the foreground speech with background speech.\n\n0:42:06\tSPEAKER_01\n Yeah.\n\n0:42:07\tSPEAKER_03\n And then I guess the new data that Dunn will start to process that when you can get these, you know, before we were working with these segments that were all synchronized and that caused a lot of problems.\n\n0:42:19\tSPEAKER_03\n Oh, right.\n\n0:42:24\tSPEAKER_03\n So sort of a stage two of trying the same kinds of alignments with the tighter boundaries.\n\n0:42:28\tSPEAKER_03\n Right.\n\n0:42:29\tSPEAKER_03\n Really the next step.\n\n0:42:30\tSPEAKER_03\n We did get our, I guess, good news.\n\n0:42:32\tSPEAKER_03\n We got our abstract accepted for this conference workshop, isco workshop in New Jersey.\n\n0:42:49\tSPEAKER_03\n But we're hoping to have a paper for that as well, which should be an interesting.\n\n0:42:52\tSPEAKER_03\n What's it to?\n\n0:42:53\tSPEAKER_03\n The tapers and do until August, the abstracts were already due, so it's that kind of workshop.\n\n0:42:57\tSPEAKER_03\n But I mean, the good news is that that will have sort of the European experts in pros.\n\n0:43:01\tSPEAKER_03\n It's sort of a different crowd.\n\n0:43:03\tSPEAKER_03\n I think we're the only people working on pros in meeting so far, so that should be interesting.\n\n0:43:07\tSPEAKER_03\n What's the name of the meeting?\n\n0:43:09\tSPEAKER_03\n It's, it's go workshop on pros in speech recognition and understanding or something like that, some generic.\n\n0:43:19\tSPEAKER_03\n So it's focused on using pros in automatic systems and there's a web page.\n\n0:43:26\tSPEAKER_07\n You're going to your speech?\n\n0:43:29\tSPEAKER_05\n I don't have a paper, but I kind of like to go if I could.\n\n0:43:33\tSPEAKER_05\n Is that all right?\n\n0:43:34\tSPEAKER_05\n We'll discuss it.\n\n0:43:35\tSPEAKER_06\n Okay.\n\n0:43:36\tSPEAKER_06\n My car needs a good wash.\n\n0:43:38\tSPEAKER_07\n Hey, that's what it takes.\n\n0:43:41\tSPEAKER_08\n I'll pick up your dry cleaning tape.\n\n0:43:49\tSPEAKER_05\n All right.\n\n0:43:59\tSPEAKER_05\n 890-14495-1-4147-9206-888-893-407-0537-326-587-997-9670-3944-33-267-05671-265-06-647161-20229401-correction-0544.\n\n0:44:27\tSPEAKER_01\n Okay, I'm going to exit because I have to be there.\n\n0:44:30\tSPEAKER_01\n Go for it.\n\n0:44:31\tSPEAKER_01\n Transcript L-184-686-686-8-2261-213295-30817519-78111410-9627372719-6402-0860-4473.\n\n0:44:54\tSPEAKER_01\n 733-448075-25404-9726537-0373-614260.\n\n0:45:08\tSPEAKER_04\n Transcript L-185-804-1609371-377747.\n\n0:45:17\tSPEAKER_04\n 1-3-7-4-9-509 9-7-6-0-19-7-9-7-5 8-9-7-9-9-3-0-09 2-7-4-7-2-1-9-1-4-1 9-1-7-1-6-286 1-583-19-364-4\n\n0:45:42\tSPEAKER_00\n Transcript L-187 9-369-6-0-7-5-0-0 8-9-5-3-6-997-8-3-90 0-784-29-0-555-1 6-8-7-9-4-246 1049-7-9-8-6 317-47-87-36 1-8-80-76-43-84 9-271-6-446-6-128\n\n0:46:28\tSPEAKER_03\n Transcript L-188-2-30-383-317 8-8-8-8-092-5-25-066-459-1 00421-7-336-915-03-384-6 7-8-95-34-57-30 574-237-435 5923-46-04-53\n\n0:46:58\tSPEAKER_06\n Transcript L-180 807-39-3837 1988-4996 1916-0229-2294 07-436-727 747-327-7-914 765-07-1443 890-858-285 413-425-9572\n\n0:47:34\tSPEAKER_07\n Transcript L-181-116123-8588 6624-99997-204 4963-57-2507 6470-63-1107 908-880-959 533-711-485-4 619-07-180-2442 2238-6338-8114\n\n0:48:11\tSPEAKER_02\n Transcript L-182-0066-3352 442-116-315 933-05-728-0 632-04-8202 7205-7205-544-853 1667-745-563-674-61-8159-8025-92-7316\n\n0:48:43\tSPEAKER_07\n Thank you. So you get to be the one who has all the paper wrestling.\n\n", "summary": [{"summary_text": "Jeremy is wearing a wired earplug mic. It's a fairly good mic, but the signal level is okay. Speaker sent out the consent form thingies and so far no one has made any comments on them. There was a suggestion of alternating weeks on more automatic speed recognition related topics."}]}