{"filename": "./data/Bmr025.txt", "transcript": "0:00:00\tSPEAKER_03\n Yep.\n\n0:00:02\tSPEAKER_03\n So if we can't, we can.\n\n0:00:04\tSPEAKER_03\n But we're trying to make this abbreviated meeting because the next documents are pushing for it.\n\n0:00:12\tSPEAKER_03\n So.\n\n0:00:17\tSPEAKER_03\n So, gendith, according to this, is transcription status, DARPA demos, XML tools, disks, backups, et cetera, and crosspads.\n\n0:00:29\tSPEAKER_05\n Does anyone have anything to add to the agenda?\n\n0:00:33\tSPEAKER_03\n OK.\n\n0:00:35\tSPEAKER_03\n We're just going order transcription status.\n\n0:00:37\tSPEAKER_03\n That's probably.\n\n0:00:39\tSPEAKER_03\n I'm going to get quickly.\n\n0:00:39\tSPEAKER_01\n I have several more transcribers and making more.\n\n0:00:41\tSPEAKER_01\n Seven?\n\n0:00:42\tSPEAKER_01\n Several.\n\n0:00:43\tSPEAKER_01\n Oh.\n\n0:00:44\tSPEAKER_01\n I'm sorry.\n\n0:00:45\tSPEAKER_01\n And I've been finishing up the double checking.\n\n0:00:53\tSPEAKER_01\n I hope to have that done by today, but it's going\n\n0:00:55\tSPEAKER_05\n to take one more week. As a somewhat segue into the next topic, could I get a hold of the data, even if it's not really corrected yet, just so I can get the data formats and make sure the information retrieval stuff is working?\n\n0:01:11\tSPEAKER_05\n So can just, oh, it is.\n\n0:01:13\tSPEAKER_05\n OK, just so transcripts.\n\n0:01:15\tSPEAKER_05\n Is the sub directory?\n\n0:01:16\tSPEAKER_05\n Yes.\n\n0:01:17\tSPEAKER_05\n OK.\n\n0:01:17\tSPEAKER_05\n So I'll probably just make some copies of those rather than use the ones that are there.\n\n0:01:23\tSPEAKER_05\n And then just we'll have to remember to delete them once the corrections are made.\n\n0:01:30\tSPEAKER_01\n OK.\n\n0:01:32\tSPEAKER_02\n I also got a shoulder mark to transcription.\n\n0:01:35\tSPEAKER_02\n I just processed the first five e-meaning since they are chunked up.\n\n0:01:40\tSPEAKER_02\n So they probably can be sent to IBM whenever they want them.\n\n0:01:45\tSPEAKER_02\n Well, the second one of those is already at IBM.\n\n0:01:48\tSPEAKER_04\n But the other one that we're waiting to hear from them on.\n\n0:01:52\tSPEAKER_01\n These are separate from the ones that.\n\n0:01:54\tSPEAKER_04\n They're the IBM set.\n\n0:01:55\tSPEAKER_04\n Yeah.\n\n0:01:56\tSPEAKER_04\n Excellent.\n\n0:01:57\tSPEAKER_04\n So as soon as we hear from Brian that this one is OK, and we get the transcript back, and we find out that hopefully there are no problems matching the transcripts with what we gave.\n\n0:02:10\tSPEAKER_04\n Then we'll be ready to go and we'll just send them the next four as a big back.\n\n0:02:15\tSPEAKER_04\n I'm going to work on that.\n\n0:02:16\tSPEAKER_05\n And so we're doing those as disjoint from the ones we're transcribing here?\n\n0:02:19\tSPEAKER_04\n Yes.\n\n0:02:20\tSPEAKER_04\n Exactly.\n\n0:02:20\tSPEAKER_04\n We're sort of doing things in parallel by way we can get as much time.\n\n0:02:22\tSPEAKER_05\n Yeah, I think that's the right way to do it, especially for the information retrieval stuff.\n\n0:02:28\tSPEAKER_05\n Anything else on transcription says?\n\n0:02:31\tSPEAKER_03\n OK.\n\n0:02:32\tSPEAKER_03\n There are pedagogues where you had the sub meeting the other day.\n\n0:02:34\tSPEAKER_05\n Right.\n\n0:02:34\tSPEAKER_05\n Which, so I've been working on using the Thistle tools to do information retrieval on meeting data.\n\n0:02:41\tSPEAKER_05\n And the Thistle tools are, there are two sets.\n\n0:02:44\tSPEAKER_05\n There's a back end and a front end.\n\n0:02:45\tSPEAKER_05\n So the front end is the user interface and the back end is the indexing tool and the querying tool.\n\n0:02:51\tSPEAKER_05\n And so I've written some tools to convert everything into the right phyiformats and the demand line version of the indexing and the querying is now working.\n\n0:03:02\tSPEAKER_05\n So at least on the one meeting that I had the transcript for, conveniently, you can now do information retrieval on it, do type in a string and get back a list of start end times for the meeting of hits.\n\n0:03:14\tSPEAKER_04\n And then what does that look like?\n\n0:03:15\tSPEAKER_04\n The string that you type in?\n\n0:03:16\tSPEAKER_04\n Are you the keywords?\n\n0:03:17\tSPEAKER_04\n Keywords.\n\n0:03:19\tSPEAKER_05\n Right.\n\n0:03:20\tSPEAKER_05\n And then it munges it to pass it to the Thistle YR, which uses an SGML-like format for everything.\n\n0:03:27\tSPEAKER_03\n And then does it play something back?\n\n0:03:29\tSPEAKER_05\n Right now, I have a tool that will do that on a command line using our standard tools.\n\n0:03:35\tSPEAKER_05\n But my intention is to do a prettier user interface based either.\n\n0:03:39\tSPEAKER_05\n So that's the other thing I want to discuss is, well, what should we do for the user interface?\n\n0:03:43\tSPEAKER_05\n We have two tools that have already been written.\n\n0:03:46\tSPEAKER_05\n The soft sound guys did a web-based one, which I haven't used, haven't looked at.\n\n0:03:51\tSPEAKER_05\n Dan says it's pretty good, but it does mean you need to be running a web server.\n\n0:03:56\tSPEAKER_05\n And so it's pretty big and complex.\n\n0:04:00\tSPEAKER_05\n And it would be difficult to port to Windows because it means porting the web server to Windows.\n\n0:04:05\tSPEAKER_05\n The other option is Dan did the Tickle TK Thistle GUI front end for broadcast news, which I think looks great.\n\n0:04:11\tSPEAKER_05\n I think that's a nice demo.\n\n0:04:13\tSPEAKER_05\n And that would be much easier to port to Windows.\n\n0:04:16\tSPEAKER_05\n And so I think that's the way we should go.\n\n0:04:18\tSPEAKER_01\n Can I ask a question?\n\n0:04:20\tSPEAKER_01\n So as it stands within the channel trans-interface, it's possible to do a fine play.\n\n0:04:26\tSPEAKER_01\n You can find a search string in play.\n\n0:04:28\tSPEAKER_01\n So you're adding like, I don't know, are they fuzzy matches or are they?\n\n0:04:33\tSPEAKER_05\n It's a sort of standard text retrieval based.\n\n0:04:37\tSPEAKER_05\n So it's term frequency inverse document frequency scoring.\n\n0:04:42\tSPEAKER_05\n And then there are all sorts of metrics for spacing.\n\n0:04:44\tSPEAKER_05\n How far apart they have to be in things like that.\n\n0:04:47\tSPEAKER_05\n So it's a lot more sophisticated.\n\n0:04:49\tSPEAKER_05\n It's like doing a Google query or anything else like that.\n\n0:04:54\tSPEAKER_05\n So it produces an index ahead of time so you're not doing a linear search through all the documents.\n\n0:05:00\tSPEAKER_05\n Because you can imagine if we have the 60 hours worth, you wouldn't want to do a search.\n\n0:05:05\tSPEAKER_05\n You have to do a pre-indexing.\n\n0:05:06\tSPEAKER_05\n And so these tools do all that.\n\n0:05:09\tSPEAKER_05\n And so the work to get the front end to work would be porting it, well, to get it to work on the Unix systems our side is just rewriting them and modifying them to work for meetings.\n\n0:05:20\tSPEAKER_05\n So that it understands that they're different speakers and that it's one big audiophile instead of a bunch of little ones and just sort of things like that.\n\n0:05:28\tSPEAKER_04\n So what does the user see as the result of the query?\n\n0:05:31\tSPEAKER_05\n On which tool?\n\n0:05:32\tSPEAKER_05\n The Thistle.\n\n0:05:34\tSPEAKER_05\n The Thistle GUI tool, which is the one that Dan wrote, TIGLTK.\n\n0:05:38\tSPEAKER_05\n You type in a query and then you get back a list of hits.\n\n0:05:42\tSPEAKER_05\n And you can type on them and listen to them.\n\n0:05:44\tSPEAKER_05\n Click on them rather with a mouse.\n\n0:05:46\tSPEAKER_04\n So if you typed in small heads or something.\n\n0:05:48\tSPEAKER_04\n Right.\n\n0:05:49\tSPEAKER_04\n You get something that will make you feel like a system audio where that's going to work.\n\n0:05:54\tSPEAKER_04\n You get a little step.\n\n0:05:55\tSPEAKER_05\n Beep.\n\n0:05:56\tNone\n That was a really good look.\n\n0:05:57\tSPEAKER_03\n It's too early.\n\n0:05:58\tSPEAKER_03\n It didn't get to work.\n\n0:05:59\tSPEAKER_03\n It didn't get to work.\n\n0:06:00\tSPEAKER_06\n Guess who I practice on.\n\n0:06:01\tSPEAKER_01\n It's not what we're going to do to say what that private joke is.\n\n0:06:06\tSPEAKER_03\n Yeah.\n\n0:06:07\tSPEAKER_03\n And then again, maybe not.\n\n0:06:09\tSPEAKER_03\n So that sounds reasonable.\n\n0:06:12\tSPEAKER_03\n Right.\n\n0:06:13\tSPEAKER_03\n My recollection of it's a pretty reasonable.\n\n0:06:16\tSPEAKER_03\n That sounds really nice.\n\n0:06:17\tSPEAKER_05\n That sounds really nice.\n\n0:06:18\tSPEAKER_05\n It'd be minimal effort to get it to work minimally.\n\n0:06:20\tSPEAKER_05\n And then we want to add things like query by speaker and by meeting and all that sort of stuff.\n\n0:06:25\tSPEAKER_05\n Dave Gilbert expressed some interest in working on that.\n\n0:06:27\tSPEAKER_05\n So I'll work with him on it.\n\n0:06:29\tSPEAKER_05\n And it's looking pretty good.\n\n0:06:30\tSPEAKER_05\n The fact that I got the query system working.\n\n0:06:33\tSPEAKER_05\n So if we want to just do a video based one, I think that'll be easy.\n\n0:06:36\tSPEAKER_05\n If we want to get it to Windows, it's going to be a little more work because the Thistle I are the information retrieval tools.\n\n0:06:44\tSPEAKER_05\n I had difficulty just compiling them on Solaris.\n\n0:06:47\tSPEAKER_05\n So getting them to compile on Windows might be challenging.\n\n0:06:51\tSPEAKER_04\n You were saying that there's that set of tools, the signal tools.\n\n0:06:56\tSPEAKER_05\n It certainly helps.\n\n0:06:57\tSPEAKER_05\n I mean, without those, I wouldn't even attempt it.\n\n0:07:01\tSPEAKER_05\n But what those do is provide sort of the BSD compatibility layer so that the normal Unix function calls all work.\n\n0:07:08\tSPEAKER_05\n But the problem is that the Thistle Tools didn't use anything like AutoConf.\n\n0:07:14\tSPEAKER_05\n So you have the normal porting problems of different header files and some things are defined and some things aren't.\n\n0:07:21\tSPEAKER_05\n And different compiler work around and so on.\n\n0:07:24\tSPEAKER_05\n So the fact that it took me a day to get a compile under Solaris means it's probably going to take me significantly more than that to get it to compile under Windows.\n\n0:07:33\tSPEAKER_05\n Well, I'm going to run under free BSD.\n\n0:07:36\tSPEAKER_05\n Free BSD would probably be easier.\n\n0:07:38\tSPEAKER_07\n All you need to do is say to Dan, gee, it would be nice if this worked under Underconf and it'll be done in a day.\n\n0:07:43\tSPEAKER_07\n That's true.\n\n0:07:45\tSPEAKER_05\n Actually, no, I should check because he did port it to SproutCore.\n\n0:07:49\tSPEAKER_07\n So you might have done that already.\n\n0:07:51\tSPEAKER_07\n I wouldn't be surprised.\n\n0:07:53\tSPEAKER_05\n So I'll check it.\n\n0:07:54\tSPEAKER_03\n But I would serve both purposes as you contact him and ask him if he's already done it.\n\n0:07:59\tSPEAKER_03\n Yeah, right.\n\n0:08:00\tSPEAKER_03\n If he has, then you learn, if he hasn't, then he'll do it.\n\n0:08:03\tSPEAKER_03\n Right.\n\n0:08:04\tSPEAKER_04\n I hope he never listens.\n\n0:08:11\tSPEAKER_05\n I've been corresponding with Dan and also with SoftSound guy, Blinking on his name.\n\n0:08:19\tSPEAKER_05\n Tony Robinson.\n\n0:08:20\tSPEAKER_05\n Do I mean Tony?\n\n0:08:21\tSPEAKER_05\n I guess I do.\n\n0:08:22\tSPEAKER_05\n Or Steve Reynolds.\n\n0:08:23\tSPEAKER_05\n Steve Reynolds.\n\n0:08:24\tSPEAKER_07\n Do I mean Steve Reynolds?\n\n0:08:25\tSPEAKER_07\n Steve Reynolds is not a soft sound, is he?\n\n0:08:26\tSPEAKER_05\n No.\n\n0:08:27\tSPEAKER_05\n My brain is not working.\n\n0:08:28\tSPEAKER_07\n I don't remember who I've been corresponding with.\n\n0:08:30\tSPEAKER_07\n Steve Reynolds wrote this whole IR.\n\n0:08:32\tSPEAKER_05\n Bennett Steve Reynolds.\n\n0:08:34\tSPEAKER_05\n So just getting documentation and format.\n\n0:08:38\tSPEAKER_05\n So that's all going pretty well.\n\n0:08:39\tSPEAKER_04\n And I think we'll be able to do this.\n\n0:08:41\tSPEAKER_04\n So this is a playing sound file between the two platforms.\n\n0:08:45\tSPEAKER_05\n We have, well that's a good point too.\n\n0:08:48\tSPEAKER_07\n Here's a crazy idea.\n\n0:08:49\tSPEAKER_07\n I don't know.\n\n0:08:50\tSPEAKER_07\n Actually, why don't you try and merge Transcriber and this will IR?\n\n0:08:54\tSPEAKER_07\n Well, this is one of the interfaces.\n\n0:08:56\tSPEAKER_05\n This is one of the reasons that I can have Dave Gilbart having him volunteer to work on I just a really good thing because he's worked on the Transcriber stuff.\n\n0:09:05\tSPEAKER_05\n Right.\n\n0:09:06\tSPEAKER_07\n And he's more familiar with that.\n\n0:09:07\tSPEAKER_07\n So Windows media playing for free.\n\n0:09:10\tSPEAKER_05\n Well, that's snack, not transcriber.\n\n0:09:13\tSPEAKER_07\n Right.\n\n0:09:14\tSPEAKER_07\n But the point is that the transcriber uses snack and then you can use a lot of the same functionality.\n\n0:09:18\tSPEAKER_05\n Yeah, I mean, I think this will, this will gooey probably use a snack.\n\n0:09:24\tSPEAKER_05\n And so my intention was just to base it on that.\n\n0:09:29\tSPEAKER_07\n Yeah.\n\n0:09:30\tSPEAKER_07\n Well, my thought was, it would be nice to have the running transcripts from a speaker to speaker.\n\n0:09:36\tSPEAKER_07\n Right.\n\n0:09:37\tSPEAKER_07\n You have a speaker mark here and a speaker mark.\n\n0:09:40\tSPEAKER_05\n Right.\n\n0:09:41\tSPEAKER_05\n We'll have to figure out a user interface for that.\n\n0:09:43\tSPEAKER_07\n Well, my thought was if you had like multi-trans or whatever, do it.\n\n0:09:47\tSPEAKER_05\n Yeah.\n\n0:09:48\tSPEAKER_05\n It might be fairly difficult to get that to work in the little short segments we'd be talking about and having the search tools and so on.\n\n0:09:57\tSPEAKER_05\n We can look into it.\n\n0:09:58\tSPEAKER_03\n But the thing I was asking about with the FreeBSD is that it might be easier to get PowerPoint shows running in FreeBSD than to get the other package running in.\n\n0:10:09\tSPEAKER_05\n Yeah, I mean, we have to, I have to sit down and try it before I make too many judgments.\n\n0:10:16\tSPEAKER_05\n My experience with the GNU compatibility library is really, it's just as hard and just as easy to port to any system.\n\n0:10:24\tSPEAKER_05\n The Windows system isn't any harder because it looks like a BSD system.\n\n0:10:28\tSPEAKER_05\n It's just, you know, just like all of them, the include files are a little different.\n\n0:10:31\tSPEAKER_05\n The function calls are a little different.\n\n0:10:33\tSPEAKER_05\n It might be a little easier, but it's not going to be a lot easier.\n\n0:10:37\tNone\n Okay.\n\n0:10:38\tSPEAKER_03\n So there was that demo, which was one of the main ones.\n\n0:10:40\tSPEAKER_03\n And then we talked about some other stuff which would basically be showing off the transcriber interface itself.\n\n0:10:48\tSPEAKER_03\n And as you say, maybe we could even merge those in some sense.\n\n0:10:52\tSPEAKER_03\n But in part of that, we're showing off with the speech non-speech stuff that TLo has done.\n\n0:11:00\tSPEAKER_03\n Yeah.\n\n0:11:01\tSPEAKER_01\n Looks like.\n\n0:11:02\tSPEAKER_01\n So with the answer, you end up with somewhat prioritized.\n\n0:11:06\tSPEAKER_05\n Right.\n\n0:11:07\tSPEAKER_05\n Excellent.\n\n0:11:08\tSPEAKER_06\n So another idea I've just now actually for the demo was whether it might be of interest to show some of the prosody work that Don's been doing.\n\n0:11:21\tSPEAKER_06\n Actually show some of the features and then show, for instance, a task like finding sentence boundaries or finding turn boundaries.\n\n0:11:28\tSPEAKER_06\n You can show that graphically sort of what the features are doing.\n\n0:11:33\tSPEAKER_06\n It doesn't work great, but it's definitely giving us something.\n\n0:11:36\tSPEAKER_06\n I don't know if that would be of interest.\n\n0:11:38\tSPEAKER_03\n At the very least, we're going to want something illustrative of that because I'm going to want to talk about it.\n\n0:11:42\tSPEAKER_03\n And so if there's something that shows it graphically, it's much better than me just having a bullet point pointing at something.\n\n0:11:49\tSPEAKER_06\n I mean, you're looking at this now.\n\n0:11:51\tSPEAKER_06\n Are you looking at waves?\n\n0:11:52\tSPEAKER_06\n I'm at it.\n\n0:11:53\tSPEAKER_00\n I'm starting to.\n\n0:11:54\tSPEAKER_00\n Yeah, we can probably find some examples of different type of prosotic events going\n\n0:12:02\tSPEAKER_03\n on. So when we hear having this demo meeting, what we're sort of coming up with is that we want to have all these pieces together the first order by the end of the month.\n\n0:12:10\tSPEAKER_03\n And then that will give us a little bit of this month or next month.\n\n0:12:12\tSPEAKER_06\n Oh, do you mean like today?\n\n0:12:13\tSPEAKER_06\n Oh, sorry.\n\n0:12:14\tSPEAKER_06\n Next month.\n\n0:12:15\tSPEAKER_05\n Next month.\n\n0:12:16\tSPEAKER_05\n This is it.\n\n0:12:17\tSPEAKER_03\n That will give us a week or so to port things over to my laptop and make sure that works.\n\n0:12:25\tSPEAKER_03\n I think I mean, we're not be here.\n\n0:12:27\tSPEAKER_06\n Yeah, if Don can sort of talk to whoever's because we're doing this anyway as part of our, the research, visualizing what these features are doing.\n\n0:12:35\tSPEAKER_06\n And so either might not be integrated, but it could potentially be in it.\n\n0:12:40\tSPEAKER_03\n Yeah, this is to an audience of researchers.\n\n0:12:43\tSPEAKER_03\n So I mean, let's go ahead and let them know what it is we're doing.\n\n0:12:46\tSPEAKER_06\n I don't think anyone's done this on meeting data, so it might be neat.\n\n0:12:49\tSPEAKER_06\n Yeah.\n\n0:12:50\tNone\n Yeah.\n\n0:12:51\tSPEAKER_03\n Done with that?\n\n0:12:55\tSPEAKER_05\n XML tools?\n\n0:12:57\tSPEAKER_05\n So I've been doing a bunch of XML tools where we're sort of moving to XML as the general format for everything.\n\n0:13:03\tSPEAKER_05\n And I think that's definitely the right way to go because there are a lot of tools that let you do extraction and reformatting of XML tools.\n\n0:13:12\tSPEAKER_05\n So yet again, we should probably meet to talk about transcription formats in XML because I'm not particularly happy with what we have now.\n\n0:13:19\tSPEAKER_05\n I mean, it works with transcriber, but it's a pain to use in other tools because it doesn't mark starting end of each utterance.\n\n0:13:29\tSPEAKER_05\n So it's implicit in there, but you have to do a lot of processing to get it.\n\n0:13:33\tSPEAKER_05\n And so, and also I'd like to do the indirect timeline business.\n\n0:13:37\tSPEAKER_05\n But regardless, I mean, that's something that you and me and Jane can talk about later.\n\n0:13:41\tSPEAKER_05\n And I've installed XML tools of various sorts and various languages.\n\n0:13:45\tSPEAKER_05\n And so if people are interested in doing extracting any information from any of these files, either information on users because the user databases that way, I'm converting the key files to XML so you can extract various sort of information on individual meetings and then also the transcripts.\n\n0:14:04\tSPEAKER_05\n And so let me know there.\n\n0:14:05\tSPEAKER_05\n It's mostly Java and Pearl, but we can get other languages too if that's desirable.\n\n0:14:11\tSPEAKER_06\n Quick question.\n\n0:14:12\tSPEAKER_06\n Do we have the seat information in the key files?\n\n0:14:16\tSPEAKER_05\n The seat information is on the key files for the ones which it's been recorded.\n\n0:14:20\tSPEAKER_05\n For the new one.\n\n0:14:21\tSPEAKER_05\n Okay.\n\n0:14:22\tSPEAKER_05\n Seat?\n\n0:14:23\tSPEAKER_03\n Yeah.\n\n0:14:24\tSPEAKER_03\n Where you're sitting.\n\n0:14:25\tSPEAKER_03\n Oh, not the quality, you're right.\n\n0:14:26\tSPEAKER_05\n Right.\n\n0:14:27\tSPEAKER_05\n It's pretty soft and squishy.\n\n0:14:28\tSPEAKER_05\n Yeah.\n\n0:14:29\tSPEAKER_05\n Okay.\n\n0:14:30\tSPEAKER_05\n That might just be me.\n\n0:14:31\tSPEAKER_05\n All right.\n\n0:14:32\tSPEAKER_06\n I'm just trying to figure out, you know, when we use the keys on someone's microphone.\n\n0:14:39\tSPEAKER_06\n Are they next to him or are they crushed?\n\n0:14:41\tSPEAKER_04\n Where is it in the key file?\n\n0:14:44\tSPEAKER_05\n The square bracket.\n\n0:14:45\tSPEAKER_06\n Because I mean, I haven't been putting it in and you haven't been putting it in.\n\n0:14:49\tSPEAKER_06\n Right.\n\n0:14:50\tSPEAKER_03\n I have not.\n\n0:14:51\tSPEAKER_05\n And some of these are missing, aren't they?\n\n0:14:52\tSPEAKER_06\n Yeah.\n\n0:14:53\tSPEAKER_05\n So we can go back and fill them in for the ones we have.\n\n0:14:55\tSPEAKER_06\n I mean, they're on the right, these, but I just hadn't ever been putting it in the key files and I don't think Chuck was either.\n\n0:15:00\tSPEAKER_06\n I never knew we were supposed to put it in.\n\n0:15:01\tSPEAKER_05\n I had told you guys about it.\n\n0:15:02\tSPEAKER_04\n Oh, sorry.\n\n0:15:03\tSPEAKER_04\n Sorry.\n\n0:15:04\tSPEAKER_05\n So this is why I want to use a tool to do it rather than the plain text because with the plain text, it's very easy to skip those things.\n\n0:15:12\tSPEAKER_05\n So if you use the edit key or key edit, I think it's edit key.\n\n0:15:18\tSPEAKER_05\n Command, did I show you guys that?\n\n0:15:19\tSPEAKER_05\n I did show it to you, but I think you both said no.\n\n0:15:22\tSPEAKER_05\n You'll just use text file.\n\n0:15:25\tSPEAKER_05\n It has it in there.\n\n0:15:26\tSPEAKER_05\n I placed a fill it in.\n\n0:15:27\tSPEAKER_04\n Oh, okay.\n\n0:15:28\tSPEAKER_05\n Yeah.\n\n0:15:29\tSPEAKER_05\n And so if you don't fill it in, you're not going to get it in the meetings.\n\n0:15:32\tSPEAKER_05\n Right.\n\n0:15:33\tSPEAKER_06\n Well, I just realized I hadn't been doing it in probably.\n\n0:15:35\tSPEAKER_06\n So.\n\n0:15:36\tSPEAKER_05\n And then the other thing also that TLo noticed is on the microphone on channel zero, it says handheld mic or a crown mic.\n\n0:15:43\tSPEAKER_05\n You actually have to say which one.\n\n0:15:44\tSPEAKER_06\n I know.\n\n0:15:45\tSPEAKER_06\n Yeah, I usually delete the.\n\n0:15:46\tSPEAKER_06\n Oh, okay.\n\n0:15:47\tSPEAKER_06\n Maybe I forgot to.\n\n0:15:48\tSPEAKER_06\n It's almost.\n\n0:15:49\tSPEAKER_06\n Yeah, that's because.\n\n0:15:50\tSPEAKER_05\n I know.\n\n0:15:51\tSPEAKER_05\n I know.\n\n0:15:52\tSPEAKER_06\n I know.\n\n0:15:53\tSPEAKER_06\n I know.\n\n0:15:54\tSPEAKER_06\n I was like, it's Chuck's like, oh, what did Chuck do?\n\n0:15:57\tSPEAKER_06\n Okay, I'll do that.\n\n0:15:59\tSPEAKER_05\n And then also in a couple of places, instead of filling the participants under participants, they were filled in under description.\n\n0:16:08\tSPEAKER_05\n And so that's also a problem.\n\n0:16:10\tSPEAKER_05\n So anyway, we will do better.\n\n0:16:13\tSPEAKER_05\n Oh, also I'm working on another version of this tool, the one that shows up here that will flash yellow if the mic isn't connected.\n\n0:16:23\tSPEAKER_05\n And it's not quite ready to go yet because it's hard to tell whether the mic's connected or not because the best quality ones, the crown ones, are about the same level if they're off or if they're on and no one's talking.\n\n0:16:38\tSPEAKER_05\n These ones are much easier.\n\n0:16:40\tSPEAKER_05\n There's a bigger difference.\n\n0:16:42\tSPEAKER_05\n So I'm working on that and it sort of works.\n\n0:16:44\tSPEAKER_05\n And so eventually we will change to that and then you'll be able to see graphically if your mic is dropping in or out.\n\n0:16:49\tSPEAKER_00\n That also included batteries dying?\n\n0:16:51\tSPEAKER_00\n Yep, just anytime the mic's putting out zeros basically.\n\n0:16:54\tSPEAKER_00\n Yep.\n\n0:16:55\tSPEAKER_05\n Now, we're off the screensaver too.\n\n0:16:59\tSPEAKER_05\n The thing is, as I've said before, it is actually on the thing.\n\n0:17:03\tSPEAKER_05\n There's a little level meter, but of course no one ever pays attention to it.\n\n0:17:06\tSPEAKER_05\n So I think having it on the screen is more easy to notice.\n\n0:17:10\tSPEAKER_01\n It'll be nice if these have little light indicators.\n\n0:17:14\tSPEAKER_05\n Buzzer.\n\n0:17:15\tSPEAKER_03\n Bam, bam.\n\n0:17:17\tSPEAKER_03\n Small shocks.\n\n0:17:18\tSPEAKER_03\n Yeah.\n\n0:17:19\tSPEAKER_03\n It's a leaf.\n\n0:17:20\tSPEAKER_03\n Minister to the.\n\n0:17:21\tSPEAKER_03\n Okay.\n\n0:17:22\tSPEAKER_03\n Okay.\n\n0:17:23\tSPEAKER_05\n Dispack up the center.\n\n0:17:24\tSPEAKER_05\n I spoke with Dave Johnson about putting all the meeting recorder stuff on non-backed of disk to save the overhead of backup.\n\n0:17:31\tSPEAKER_05\n And he pretty much said, yeah, you could do that if you want, but he thought it was a bad idea.\n\n0:17:36\tSPEAKER_05\n In fact, what he said is doing the manual one, doing a NW archive to copy it is a good idea and we should do that and have it backed up.\n\n0:17:46\tSPEAKER_05\n He's a firm believer in lots of different modalities of backup.\n\n0:17:50\tSPEAKER_05\n I mean, his point was well taken.\n\n0:17:51\tSPEAKER_05\n The state cannot be recovered.\n\n0:17:54\tSPEAKER_05\n And so if a mistake is made and we lose the backup, we should have the archive.\n\n0:17:59\tSPEAKER_05\n And if the mistake is made and we lose the archive, we should have the backup.\n\n0:18:02\tSPEAKER_03\n Well, I guess it is true that even with something that's backed up, it's not going to, if it's stationary, it's not going to go through you increment.\n\n0:18:11\tSPEAKER_03\n It's not going to burden things in the incremental.\n\n0:18:13\tSPEAKER_03\n Just the monthly full.\n\n0:18:14\tSPEAKER_03\n Yeah.\n\n0:18:15\tSPEAKER_03\n So the monthly full will be a bearer.\n\n0:18:17\tSPEAKER_05\n He said that we shouldn't worry too much about that.\n\n0:18:22\tSPEAKER_05\n That we're getting a new backup system and we're far enough away from saturation on the full backups that it's probably okay.\n\n0:18:29\tSPEAKER_05\n And so the only issue here is the timing between getting more disks and recording meetings.\n\n0:18:40\tSPEAKER_03\n So I guess the idea is that we would be reserving the non-backed up space for things that took less than 24 hours to recreate or something like that.\n\n0:18:49\tSPEAKER_05\n Things that are recreatible easily and also, yeah, basically, things that are recreatible.\n\n0:18:54\tSPEAKER_05\n They expanded files and things like that.\n\n0:18:57\tSPEAKER_05\n They take a lot more room anyway.\n\n0:18:59\tSPEAKER_05\n Yeah.\n\n0:19:00\tSPEAKER_05\n But we do need more disk.\n\n0:19:02\tSPEAKER_05\n So we can get more disk.\n\n0:19:04\tSPEAKER_05\n Yeah.\n\n0:19:05\tSPEAKER_05\n And I think I agree with him.\n\n0:19:06\tSPEAKER_05\n His point was well taken.\n\n0:19:08\tSPEAKER_05\n If we lose one of these, we cannot get it back.\n\n0:19:10\tSPEAKER_03\n Okay.\n\n0:19:11\tSPEAKER_05\n I don't think there was any other, et cetera, there.\n\n0:19:16\tSPEAKER_03\n Well, that was allowing someone else to come up with something related that they had done.\n\n0:19:21\tSPEAKER_07\n I thought you guys were going to burn CDs.\n\n0:19:25\tSPEAKER_05\n Unfortunately, we could burn CDs, but first of all, it's a pain because you have to copy it down to the PC and then burn it and that's a multi-step procedure.\n\n0:19:33\tSPEAKER_05\n And second of all, the right ones, burners, as opposed to a professional press, don't last.\n\n0:19:39\tSPEAKER_05\n So I think burning them for distribution is fine, but burning them for backup is not a good idea.\n\n0:19:44\tSPEAKER_05\n I see.\n\n0:19:45\tSPEAKER_05\n Because they, they, they all after a couple of years.\n\n0:19:49\tSPEAKER_00\n All right.\n\n0:19:50\tSPEAKER_01\n I want to ask, I know that, that T.L., you were bringing the channel trends in your face onto the Windows machine.\n\n0:20:01\tSPEAKER_01\n Yeah, it's basically, it's done.\n\n0:20:04\tSPEAKER_01\n It's all done.\n\n0:20:05\tSPEAKER_05\n It's wonderful.\n\n0:20:06\tSPEAKER_05\n Great.\n\n0:20:07\tSPEAKER_05\n And it runs on it basically, things will just work.\n\n0:20:10\tSPEAKER_02\n Yeah, it was just from with the SNEC version and the transcribed version, but it's soft.\n\n0:20:15\tSPEAKER_01\n So.\n\n0:20:16\tSPEAKER_01\n And that, does that mean?\n\n0:20:17\tSPEAKER_01\n I think I shouldn't have this, but I don't.\n\n0:20:19\tSPEAKER_01\n Does this mean that this could be ported to a think pad note or is some other type of?\n\n0:20:25\tSPEAKER_02\n Yeah, basically, I didn't install it on my laptop and, yeah, you were.\n\n0:20:30\tSPEAKER_02\n Hmm.\n\n0:20:31\tNone\n Good.\n\n0:20:32\tNone\n Crosspads?\n\n0:20:33\tSPEAKER_05\n I got an email from James Landay, who basically said, if you're not using them, could you return them?\n\n0:20:42\tSPEAKER_05\n So he said he doesn't need them.\n\n0:20:43\tSPEAKER_05\n He just periodically, at the end of each term, sends out email to everyone who has recorded this having them and asks them if they're still using them.\n\n0:20:51\tSPEAKER_03\n So we've never used them.\n\n0:20:53\tSPEAKER_05\n We used them a couple times, but yeah, we have two.\n\n0:20:58\tSPEAKER_05\n So my opinion on it is, first, I never take notes anyway, so I'm not going to use it.\n\n0:21:05\tSPEAKER_05\n And second, it's another level of infrastructure that we have to deal with.\n\n0:21:09\tSPEAKER_01\n And I have, so my feeling on it is that I think in principle, it's a really nice idea and you have the time tags, which makes it better than just taking raw notes.\n\n0:21:19\tSPEAKER_01\n On the other hand, the downside for me was that I think the pen is really noisy.\n\n0:21:24\tSPEAKER_01\n So you have a couple of, and I don't know if it's audible on the, I sort of thought it was a disadvantage.\n\n0:21:30\tSPEAKER_01\n I do take notes, I mean I could be taking notes on these things.\n\n0:21:33\tSPEAKER_01\n And I guess the plus, the crosspads would be the time markings, but...\n\n0:21:38\tSPEAKER_02\n What is it, crosspads?\n\n0:21:40\tSPEAKER_03\n So it's a regular pad, just a regular pad of paper, but there's this pen, which indicates position.\n\n0:21:48\tSPEAKER_03\n And so you have time and position stuff stored so that you can, you have a record of whatever it is you've written.\n\n0:21:55\tSPEAKER_05\n Okay.\n\n0:21:56\tSPEAKER_05\n And then you can download it and they have OCR and searching and all sorts of things.\n\n0:22:01\tSPEAKER_05\n So if you take notes, it's a great little device, but I don't take notes.\n\n0:22:06\tSPEAKER_03\n And one of the reasons that it was brought up originally was because we were interested in higher level things, not just the microphone stuff, but also summarization and so forth in the question is if you were going to go to some gold standard of what was it that happened in the meeting, where would it come from?\n\n0:22:24\tSPEAKER_03\n And I think that was one of the things, right?\n\n0:22:28\tSPEAKER_03\n And so it seemed like a neat idea.\n\n0:22:30\tSPEAKER_03\n Well have a scribe, have somebody take good notes and then that's part of the record of the meeting.\n\n0:22:36\tSPEAKER_03\n And then we did it once or twice.\n\n0:22:37\tSPEAKER_03\n Yep, and I'm just sort of dying out.\n\n0:22:39\tSPEAKER_03\n I've been chose to write, but...\n\n0:22:40\tSPEAKER_03\n Yeah, that's right.\n\n0:22:41\tSPEAKER_01\n But I guess the other thing I'm thinking is we wanted that kind of thing.\n\n0:22:47\tSPEAKER_01\n I wonder if we lose that much by having someone be as scribe by listening to the recording afterwards, taking notes.\n\n0:22:55\tSPEAKER_01\n I mean we're transcribing it anyway.\n\n0:22:57\tSPEAKER_04\n Because that's summary.\n\n0:22:59\tSPEAKER_06\n I think there's also, there's this use that...\n\n0:23:03\tSPEAKER_06\n Summarize it from the transcript.\n\n0:23:05\tSPEAKER_06\n Well what if you're sitting there and you just want to make an X and you don't want to take notes and you just want to get the summary of the transcript from this time location like, you know, and then while you're bored you don't do anything in once in a while.\n\n0:23:16\tSPEAKER_06\n Maybe there's a joke and you put an X.\n\n0:23:19\tSPEAKER_06\n But in other words you can use that just to highlight times in a very simple way.\n\n0:23:24\tSPEAKER_06\n Also with, I was thinking, I know Morgan disagrees with me on this, but suppose you have a group in here and you want to let them note whenever they think there might be something later that they might not want to distribute in terms of content.\n\n0:23:36\tSPEAKER_06\n They could just sort of make an X near that point or a question mark that sort of alerts them that when they get the transcript back they get some red flags in that transcript region and they can then look at it.\n\n0:23:47\tSPEAKER_06\n So I know we haven't been using it, but I can imagine it being useful just for sort of marking time periods, would you then get back in a transcript?\n\n0:23:58\tSPEAKER_03\n So what makes one thing is maybe we should actually schedule some periods where people go over something later and put some kind of summary or something, you know, to be some scribe who would actually listen, who would agree to actually listen to the whole thing, not transcribe it, but just sort of write down things that struck them as important.\n\n0:24:19\tSPEAKER_03\n But then you don't have the time reference that you have if you had it live.\n\n0:24:25\tSPEAKER_06\n And you don't have a lot of other cues that might be...\n\n0:24:29\tSPEAKER_05\n I mean, that was one of the issues we talked about originally and that's part of the difficulty is that we need an infrastructure for using the time, the cross-pads.\n\n0:24:37\tSPEAKER_05\n So that means synchronizing the time, you know, you want to pretty close and there's a form on a skew because it's a handheld unit with a battery.\n\n0:24:46\tSPEAKER_05\n And so you have to synchronize at the beginning of each meeting all the pads that are being used so that it's synchronized with the time on that.\n\n0:24:54\tSPEAKER_05\n And then you have to download to an application and then you have to figure out what the data formats are and convert it over if you want to do anything with this information.\n\n0:25:03\tSPEAKER_05\n And so there's a lot of infrastructure which...\n\n0:25:06\tSPEAKER_05\n There is an alternative.\n\n0:25:07\tSPEAKER_01\n I mean, still, you know, your point stands about there being need to be an infrastructure, but it doesn't have to be synchronized with a little clock timer on it.\n\n0:25:17\tSPEAKER_01\n When I did it, I synchronized it by voice by whispering 1, 2, 3, 4 into the microphone.\n\n0:25:23\tSPEAKER_05\n Well, but then there's the infrastructure at the other end, which someone has to listen to that and find that point and then mark it.\n\n0:25:30\tSPEAKER_05\n So...\n\n0:25:31\tSPEAKER_06\n Well, could we keep one of these things for another year?\n\n0:25:35\tSPEAKER_06\n I mean, is there a big problem?\n\n0:25:36\tSPEAKER_05\n We keep up.\n\n0:25:37\tSPEAKER_06\n Just in case we...\n\n0:25:39\tSPEAKER_06\n Just in case we...\n\n0:25:40\tSPEAKER_06\n Even maybe some of the transcribers who might be wanting to annotate...\n\n0:25:44\tSPEAKER_06\n There's a bunch of things that might be neat to do, but it might not be the case that we can actually synchronize them and do all the infrastructure, but we can at least try it out.\n\n0:25:53\tSPEAKER_03\n Well, one thing that we might try is on some set of meetings, some collection of meetings, maybe EDU is the right one or maybe something else, we get somebody to buy into the idea of doing this as part of the task.\n\n0:26:10\tSPEAKER_03\n I mean, part of the reason...\n\n0:26:12\tSPEAKER_03\n I think part of the reason that Adam was so interested in the speech quarter sort of idea from the beginning is he set the beginning, he had you taking notes and so forth.\n\n0:26:21\tSPEAKER_03\n And Jane is more into it, but I don't know if you want to really do this all the time.\n\n0:26:26\tSPEAKER_03\n So I think the thing is to get someone to actually buy into it and have at least some series of meetings where we do it.\n\n0:26:34\tSPEAKER_03\n And if so, it's probably worth having one.\n\n0:26:37\tSPEAKER_03\n The problem with the more extended view, all these other, you know, with equibbling about particular applications of it is that it looks like it's hard to get people to routinely use it.\n\n0:26:49\tSPEAKER_03\n I mean, it just hasn't happened anyway.\n\n0:26:51\tSPEAKER_03\n Maybe if we can get a person.\n\n0:26:52\tSPEAKER_06\n Yeah, I don't think it has to be part of what everybody does in a meeting, but it might be a useful, neat part of the project that we can, you know, show off as a mechanism for synchronizing events in time that happen that you just want to make a note of, like what Jane was talking about, with some later browsing just as a convenience, even if it's not a full-blown note-taking substitute.\n\n0:27:16\tSPEAKER_07\n If you wanted to do that, maybe the right architecture for it is to get a PDA with a wireless card.\n\n0:27:21\tSPEAKER_07\n And that way you can synchronize very easily with the meeting because you'll be synchronized with the Linux server.\n\n0:27:31\tSPEAKER_06\n And so what kind of input would you be?\n\n0:27:33\tSPEAKER_06\n So, I mean, if you're not worried about it.\n\n0:27:35\tSPEAKER_07\n You just be pressing like, well, you have a PDA and you could have the same sort of X interface or whatever.\n\n0:27:40\tSPEAKER_07\n I mean, you'd have to do a little bit of coding to do it.\n\n0:27:44\tSPEAKER_07\n But you could imagine, I mean, if all you really wanted was you didn't want this secondary note-taking channel, but just sort of being able to use markers of some sort, a PDA with a lot of wireless card would be probably the right way to go.\n\n0:27:57\tSPEAKER_07\n I mean, even buttons you could do, sort of, I mean-\n\n0:28:00\tSPEAKER_05\n I mean, for what you've been describing buttons would be more convenient than anything else,\n\n0:28:04\tSPEAKER_06\n right? That would be fine too.\n\n0:28:06\tSPEAKER_06\n I mean, I don't have, you know, grandiose ideas in mind, but I'm just sort of thinking, well, we're getting into the next year now.\n\n0:28:12\tSPEAKER_06\n We have a lot of these things worked out in terms of the speech.\n\n0:28:14\tSPEAKER_06\n Maybe somebody will be interested in this.\n\n0:28:16\tSPEAKER_03\n I do like, if you have a couple buttons where one button was, oh, another button was that's great.\n\n0:28:24\tSPEAKER_06\n Or like, this is my, I'm supposed to do this kind of button.\n\n0:28:27\tSPEAKER_06\n I better remember it.\n\n0:28:28\tSPEAKER_06\n Action item.\n\n0:28:29\tSPEAKER_06\n Yeah, something like that or.\n\n0:28:31\tSPEAKER_05\n I mean, I think the cross-border idea is a good one.\n\n0:28:34\tSPEAKER_05\n It's just a question of getting people to use it and getting the infrastructure set up in such a way that it's not a lot of extra work.\n\n0:28:40\tSPEAKER_05\n I mean, that's part of the reason why it hasn't happened is that it's been a lot of extra work for me.\n\n0:28:46\tSPEAKER_01\n It's also, it has this problem of having to go from an analog to a digital record, too,\n\n0:28:53\tSPEAKER_05\n isn't it? Well, it's digital, but it's in a format that is not particularly standard.\n\n0:28:58\tSPEAKER_01\n If you're writing notes in it, it can't do handwriting recognition.\n\n0:29:03\tSPEAKER_03\n No, no, but it's just storing the pixel information, information, it's how digital.\n\n0:29:09\tSPEAKER_01\n I guess what I'm thinking is that the PDA solution, you have it already, without needing to go to pixelization to that.\n\n0:29:17\tSPEAKER_03\n Right.\n\n0:29:18\tSPEAKER_07\n The transfer function is less errorful.\n\n0:29:20\tSPEAKER_07\n Yeah.\n\n0:29:21\tSPEAKER_06\n Yeah.\n\n0:29:22\tSPEAKER_06\n Well, and also it's maybe realistic because people are supposed to be bringing their PDAs to the meeting eventually, right?\n\n0:29:27\tSPEAKER_06\n That's why we have this little, I don't know what I don't want to cause more work for anyone, but I can imagine some interesting things that you could do with it.\n\n0:29:36\tSPEAKER_06\n And so if we don't have to return it and we can keep it for a year, I don't know.\n\n0:29:41\tSPEAKER_05\n We certainly don't have to return it.\n\n0:29:44\tSPEAKER_05\n As I said, all he said is that if you're not using it, could you return it if you are using it, feel free to keep it?\n\n0:29:48\tSPEAKER_05\n The point is that we haven't used it at all, and are we going to?\n\n0:29:52\tSPEAKER_03\n So we have note, I would suggest you return one.\n\n0:29:56\tSPEAKER_03\n Yeah.\n\n0:29:57\tSPEAKER_03\n Because we haven't used it at all.\n\n0:29:59\tSPEAKER_03\n Why would probably-\n\n0:30:00\tSPEAKER_06\n Maybe we could do like a student project, maybe someone who wants to do this as their main project for something would be cool.\n\n0:30:08\tSPEAKER_05\n And if we had them out and sitting on the table, people might use them a little more.\n\n0:30:12\tSPEAKER_03\n Are there any incidents and meetings and press a button when somebody laughs?\n\n0:30:16\tSPEAKER_03\n Well, yeah, that's not a bad.\n\n0:30:19\tSPEAKER_06\n Jeremy is going to be- he's a new student starting on modeling breath and laughter, actually, which sounds funny, but I think it should be cool.\n\n0:30:27\tSPEAKER_05\n Sounds breathy to me.\n\n0:30:28\tSPEAKER_05\n Ha-ha.\n\n0:30:29\tSPEAKER_05\n Ha-ha.\n\n0:30:31\tSPEAKER_05\n Oh dear.\n\n0:30:33\tSPEAKER_05\n Um, that reminded me of something, oh well, too late.\n\n0:30:38\tSPEAKER_05\n It flipped out.\n\n0:30:39\tSPEAKER_05\n Are you going to tease me?\n\n0:30:41\tSPEAKER_05\n Okay.\n\n0:30:42\tSPEAKER_05\n Well, I'm always going to do that.\n\n0:30:44\tSPEAKER_05\n We ordered more wireless, and so they should be coming in at some point.\n\n0:30:49\tSPEAKER_05\n And then at the same time, I'll probably rewire the room as per Jane's suggestion, so that the first end channels are wireless, are the closed talking in the next stand, are far-field.\n\n0:31:00\tSPEAKER_03\n You know what he means, but isn't that funny, something?\n\n0:31:03\tSPEAKER_03\n We ordered more wireless.\n\n0:31:04\tSPEAKER_03\n It's like wires are the thing, so you're ordering- you're- you're- you're- we ordered more absence of the thing.\n\n0:31:10\tSPEAKER_06\n That's a very philosophical- It's sort of an acronym, am I right?\n\n0:31:18\tSPEAKER_06\n That's great.\n\n0:31:20\tSPEAKER_05\n Should we do digits?\n\n0:31:21\tSPEAKER_05\n Do we have anything else?\n\n0:31:22\tSPEAKER_03\n Yeah.\n\n0:31:23\tSPEAKER_03\n I mean, there's all this stuff going on between Andreas and- and Dave and Chuck and others with various kinds of runs.\n\n0:31:34\tSPEAKER_03\n Recognition runs trying to figure things out about the features, but it's all sort of in process, so it's not much to say.\n\n0:31:41\tSPEAKER_03\n Right now.\n\n0:31:42\tSPEAKER_03\n When we start with our esteemed guest.\n\n0:31:49\tSPEAKER_07\n Okay.\n\n0:31:50\tSPEAKER_07\n All right.\n\n0:31:51\tSPEAKER_05\n So just a transcript number, and then the-\n\n0:31:53\tSPEAKER_07\n Yes, this is number two for me today.\n\n0:31:55\tSPEAKER_03\n The idea to do is go away to move way up and-\n\n0:31:57\tSPEAKER_06\n You can do simultaneous. Initiate him.\n\n0:32:00\tSPEAKER_06\n Should we do simultaneous?\n\n0:32:02\tSPEAKER_06\n Well, I'm just thinking, are you going to try to save the data before this next group comes in?\n\n0:32:06\tSPEAKER_05\n Yeah, absolutely.\n\n0:32:07\tSPEAKER_06\n Yes, we might want to do a simultaneous.\n\n0:32:09\tSPEAKER_03\n Right, so- Okay, so let's do a simultaneous one.\n\n0:32:12\tSPEAKER_03\n We might need to do that, actually.\n\n0:32:13\tSPEAKER_03\n Okay.\n\n0:32:14\tSPEAKER_03\n Are you ready?\n\n0:32:15\tSPEAKER_03\n You have to plug your ears by the way.\n\n0:32:17\tSPEAKER_03\n Why?\n\n0:32:18\tSPEAKER_03\n You start laughing.\n\n0:32:19\tSPEAKER_03\n Okay.\n\n0:32:20\tSPEAKER_03\n One, two, and three.\n\n0:32:22\tSPEAKER_03\n Transformation.\n\n0:32:23\tSPEAKER_03\n Transformation.\n\n0:32:24\tSPEAKER_03\nformation.\n\n0:32:27\tNone\n Form 6400 West six four 7 Four seven five four seven five zero five of two coach six six six nine five six five five two store five four five set of 10 four service zero one six nine six seven four five twenty six five three two two four five three five five four five four five five six five five six seven four five seven three three four five seven three four four five seven seven five four four five seven four four five five\n\n0:32:47\tNone\n seven six four five six five seven five seven seven seven seven seven seven pode seven seven eight nine eight n jagu 426-744-2-426-499-666\n\n0:33:00\tSPEAKER_03\n OK, battle, take 5.\n\n", "summary": [{"summary_text": "SPEAKER_03 is going to order transcription status, DARPA demos, XML tools, disks, backups, and crosspads. He has several transcribers and is making more. He will probably make some copies of the data, even if it's not really corrected yet, just to get the data formats and make sure the information retrieval stuff is working."}]}