{"filename": "./data/Bmr021.txt", "transcript": "0:00:00\tSPEAKER_01\n popular. I'm on seven. I think we pre-crashed. So it should be a really short meeting. I hope agenda items number one. I want to talk since we were just discussing that as microphone issues.\n\n0:00:13\tSPEAKER_01\n What the heck are we going to do about microphones? So I got passed on that the EDU group doesn't like the microphone. I do. I think I find it very comfortable. But it seems to depend on your head shape.\n\n0:00:27\tSPEAKER_00\n So you guys need to start going to the EDU meeting. I prefer these.\n\n0:00:32\tSPEAKER_04\n Yep. I prefer these but I don't mind using them.\n\n0:00:36\tSPEAKER_01\n Those are intimidating. So apparently they like it has one good effect that people are trying to get there early because the people get there early. People who show up late have to use these.\n\n0:00:48\tSPEAKER_01\n So we should probably get different mics. So the question is the easiest thing to do is certainly just get two more Sony mics, just two more of those. And that's easy and that will certainly work.\n\n0:01:00\tSPEAKER_01\n The other option is to try yet another mic. Find one we like and potentially get six all the same.\n\n0:01:06\tSPEAKER_02\n I have a question about this. Are the auditory qualities much different between this kind and the\n\n0:01:12\tSPEAKER_01\n fancy ones? These are better if they're worn correctly. Those are better than the Sony's? Yeah. Have you listened to them? Yeah. So I mean they're not a lot better but they are a little\n\n0:01:24\tSPEAKER_05\n better. Are they more directional? The microphones?\n\n0:01:26\tSPEAKER_01\n As far as more directional, a little better error noise cancellation and also you can really get it right in front of your mouth like this. What does that want to avoid? Breath noise you really have to put it at the side. So you seem to get better signal with this one.\n\n0:01:39\tSPEAKER_02\n The other thing is is it just a few people who don't like them and they do your clips?\n\n0:01:43\tSPEAKER_01\n I don't know but you know in sort of random polling. This said something that\n\n0:01:49\tSPEAKER_00\n leaves me believing that nobody likes them.\n\n0:01:58\tSPEAKER_02\n It seems to seem to discard them if they're in their auditory quality and they're only a few people\n\n0:02:02\tSPEAKER_04\n who just who object. That's why I was saying if we could just unplug them.\n\n0:02:06\tSPEAKER_01\n Well I mean that's the other option is that we could switch the form so it's more obvious the distinction between channel and mic and then get duplicates. I mean there's no problem with that.\n\n0:02:18\tSPEAKER_01\n It's just what should we get just more Sony ones? I hate the Sony ones.\n\n0:02:22\tSPEAKER_01\n The ones are those? The ones you want to.\n\n0:02:24\tSPEAKER_01\n The ones are nice. Because it pinches which is the temples too much. I mean so if you wear it\n\n0:02:29\tSPEAKER_02\n sort of around the back it's not too bad. Yeah. I hate it because it's hard to adjust the microphone. Right. I spend all this time fumbling around a bit and it's still not reasonable.\n\n0:02:37\tSPEAKER_01\n Right. So I mean we could try another mic but then we have the wiring issue and so I don't know what to do. What do people think? The problem is like on the plucker.\n\n0:02:46\tSPEAKER_01\n The pluck is proprietary so that's why I was saying getting more Sony ones is trivial because we can just go out and buy them. Any other ones we have to buy them in pigtail versions and get them wired.\n\n0:02:59\tSPEAKER_02\n Okay maybe I just don't know this but are the only two possibilities from Sony the two that we've\n\n0:03:05\tSPEAKER_01\n tried or is there not? Yes. So the only possibilities from Sony are that one and the lapel mic. So this isn't Sony. This is crown. The one we're wearing. And so we had these wired for us.\n\n0:03:18\tSPEAKER_04\n It seems like right now if what they're complaining about are those if we just got two more of these.\n\n0:03:23\tSPEAKER_01\n I think that's probably the right first step is just get two more immediately and have them available.\n\n0:03:28\tSPEAKER_04\n And then they can just unplug those from the transmitter.\n\n0:03:31\tSPEAKER_01\n Sure that you write down crown or Sony on the mic number which will change to mic type or something like that.\n\n0:03:39\tSPEAKER_02\n It might be good to double check at the end of the meeting too because that would be a easy place for air and data. Yep.\n\n0:03:48\tSPEAKER_01\n Well it'll be me it'll be whoever setting up the meeting who fills out the key file.\n\n0:03:52\tSPEAKER_01\n So it has the same potential for errors everything else.\n\n0:03:55\tSPEAKER_02\n Yeah but I mean to have the user fill it out when you use it.\n\n0:03:59\tSPEAKER_01\n No no we definitely would not have the user fill it out. It would be me chuckered Liz depending on which meeting it is. Okay so we'll definitely go ahead and do that.\n\n0:04:06\tSPEAKER_04\n How much is it just to buy the mic? A couple hundred. Really?\n\n0:04:11\tSPEAKER_01\n It depends on how good the mic is. Well that's way more than I thought.\n\n0:04:13\tSPEAKER_01\n For one of these? Yeah. Well the crown ones were like two fifty. I think those are like 190.\n\n0:04:20\tSPEAKER_04\n Oops. Wow. Is there any educational discounts?\n\n0:04:24\tSPEAKER_01\n No. Yeah good mics are expensive.\n\n0:04:30\tSPEAKER_04\n And when I was at computer motion we used sure the SM10A's and I think they were only like 80 bucks or something. Yeah 80 or 90 for the shores. Yeah but they were nice and pretty good.\n\n0:04:40\tSPEAKER_01\n I mean the Sony ones are expensive because they're proprietary so they can try to try to keep them on. These are expensive because they're quite high. Right. So we should buzz that out if we send the data to Sony.\n\n0:04:54\tSPEAKER_01\n Well I'm just joking. You do not have to beat that out. I don't mind if Sony knows my opinion.\n\n0:05:01\tSPEAKER_01\n So also we're I want to double check with Morgan. He did say yes before I went to Japan on buying another wireless system so that we can go all wireless instead of the mix of wired and wireless.\n\n0:05:15\tSPEAKER_04\n And I think that's the right thing to do. So then all those red channels there would be\n\n0:05:20\tSPEAKER_01\n come wireless ones? Yeah. Cool. Yeah. Before more wireless. And also I'm going to probably replace the Andrean mic with a sure but I'll test it sometime today or tomorrow to make sure the shore one really works because I have an extra shore in my office. The Andrean mic? Yeah. Yeah. Apparently it's had some causing problems soon. Which one is the Andrean mic?\n\n0:05:42\tSPEAKER_04\n A wired one? Yeah. A wired one. Well if you're going to go to all wireless. Oh you mean in the meantime?\n\n0:05:47\tSPEAKER_01\n In the meantime. Ah because it'll probably take a couple weeks to get it delivered from Sony anyway.\n\n0:05:53\tSPEAKER_04\n Yeah. I haven't in the meetings that I record it's always been at most six people so I've never had to.\n\n0:05:59\tSPEAKER_04\n Oh really? Yeah. Recently I haven't had to use any of the wired ones at all.\n\n0:06:02\tSPEAKER_01\n Because everyone's been out of town probably over the summer it'll be the same because it tends to be less fewer people. Um, file done with microphone issues?\n\n0:06:12\tSPEAKER_02\n Do you want? I'm thinking I don't know about the acoustic systems.\n\n0:06:18\tSPEAKER_01\n And this way we can get a door slam in. Yeah. That's right.\n\n0:06:24\tSPEAKER_01\n Oh well not quite a slam. There's some knock.\n\n0:06:29\tSPEAKER_00\n Can I have a special phone for that?\n\n0:06:32\tSPEAKER_00\n Hmm. All right. A door slam phone. Yeah. You got a special phone?\n\n0:06:36\tSPEAKER_01\n No we could add one. I think we could add the phone phone.\n\n0:06:45\tSPEAKER_01\n A file reorganization. This is something we were talking about before I left and saying we should probably wait till after or I'm back and now I'm back so we should do that at some point. So we should get ourselves a list of everything we want to do to reorganize the file structure.\n\n0:06:58\tSPEAKER_00\n Can I just mention something? Sure. I think file reorganization also in other issues there's this space probably. Right. So I know that the files that you've been cutting up for us for the recognition experiments. One way one really brain, brain that way of of not causing any trouble but saving this space is to use this the sphere, the NIST W and code program to encode, you know, to compress them. Sure. Is that the same? Yeah. But it does it so it happens so that the program that reads the waveforms does the un-shortening transparently.\n\n0:07:44\tSPEAKER_01\n Well, okay. You mean it's built into the SRI because we have the same thing with shortened in the sound tools. So I guess but it... So it's just a question of what decompression is built\n\n0:07:58\tSPEAKER_00\n into your tools. Well, it's actually built into the sphere library that NIST delivers. Oh really? I did. Right. And actually the sound tools don't understand that. At least FIQAQ doesn't so... No, it's not a sound tool. But since these files are made to be used with the SRI recognizer and the SRI front end uses the sphere library which in turn does this transparently, that would be a quick and easy way to just get, you know, be able to use more.\n\n0:08:32\tSPEAKER_05\n The other thing I can do to relieve some of the pressure is just move everything to my 18 gig\n\n0:08:37\tSPEAKER_00\n disk which is local. But that's going to be only temporary. Well, I mean I don't know. I should do that too probably. Yeah, it is kind of a temporary solution. And also just run the short and everything.\n\n0:08:48\tSPEAKER_00\n Well, actually the what you do is you run... Oh no, yeah. Use a little. The way I recently used it and there might be better ways. So the program is called W and code and I think the type you say I think dash t and then there are different, different encoding methods. But if you want to use the shortened one, you say minus t shortened and then the old way file and the new way file.\n\n0:09:20\tSPEAKER_00\n And then, and then I check, you know, if this works so you can use the shell and operator or something then I just move the new way file to the, you know, to the old way file and then you have replaced the old one with one that behaves identically as long as your programs that use it know how to decode it on the fly. And that, okay, that just saved my butt because I actually was running in a different experiment. I had segmented, I was processing the whole switch for two corpus, which is 280 hours of speech and I was noticing as I was almost finishing the processing that I was running out of this space. And so I had this flash of inspiration of just the same, the same disk had the segmented waveforms on them so I, while this other thing was still going on, I was running this thing and long behold, I gained three gig of space.\n\n0:10:22\tSPEAKER_01\n Wow, did you have to re-nice one of the processes to make sure that this was fast enough?\n\n0:10:27\tSPEAKER_00\n This is very fast. This really runs quickly. And that's, that was very suspenseful.\n\n0:10:33\tSPEAKER_00\n That was the most excitement I had all week and for it came on just fine.\n\n0:10:39\tSPEAKER_04\n You know, I don't know if this would mess other things up, but it seems like kind of a pain to have all these split up files around what would be easier would be like pointers, you know, lists, like original wave files start end. Yeah, the only reason we do this is because the,\n\n0:10:58\tSPEAKER_00\n the SRI front and doesn't have a way to, to go into a longer file within the C's segment on the file. So I suppose someone could try to put a hack like that into the, it would be easy.\n\n0:11:14\tSPEAKER_01\n It wouldn't be hard at all. Someone just needs to sit down and do it as some time.\n\n0:11:17\tSPEAKER_00\n So, but there's also some, I guess.\n\n0:11:22\tSPEAKER_01\n And that way we wouldn't have multiple versions floating around.\n\n0:11:26\tSPEAKER_01\n About the only difficulty with that is if it's compressed, then you really do have to decompress it first.\n\n0:11:31\tSPEAKER_01\n That's true.\n\n0:11:32\tSPEAKER_01\n That's true.\n\n0:11:33\tSPEAKER_01\n Because the pointers are, you don't know how much it's going to be.\n\n0:11:36\tSPEAKER_04\n Is there a, is there a, is there a nistroutine which can seek in a compressed file, but with uncompressed indices?\n\n0:11:44\tSPEAKER_03\n I don't think so.\n\n0:11:47\tSPEAKER_00\n No, no, I mean, if you, if you can operate on the full, if you don't have the segment at, then there would be less of a reason to do the compression because you don't have that wasted, right?\n\n0:11:58\tSPEAKER_00\n Extra copy.\n\n0:11:58\tSPEAKER_00\n Right.\n\n0:11:58\tSPEAKER_04\n I mean, the original switchboard files are not compressed, right?\n\n0:12:01\tSPEAKER_04\n Right.\n\n0:12:01\tSPEAKER_04\n So we could leave those as they are.\n\n0:12:03\tSPEAKER_01\n Well, I mean, it just depends on how much disk space is a problem.\n\n0:12:05\tSPEAKER_01\n I mean, the way you could do is decompress it to a temporary place and then operate on it and then delete it.\n\n0:12:10\tSPEAKER_00\n I mean, the segmentation also saves you space in the sense that you cut out all the non-speech regions.\n\n0:12:16\tSPEAKER_00\n And if you have, you know, 20 channels, I don't find it.\n\n0:12:19\tSPEAKER_04\n Well, assuming you, yeah, assuming that you then offload the original switchboard files.\n\n0:12:24\tSPEAKER_04\n So, yeah.\n\n0:12:26\tSPEAKER_01\n Well, it seems like just shortening in as a good choice in the solution.\n\n0:12:30\tSPEAKER_01\n So we don't have to do any coding.\n\n0:12:31\tSPEAKER_05\n But I think kind of we've had, there was a big disc crash when you were gone and\n\n0:12:35\tSPEAKER_01\n No, it was, I was still here. It was the day I left.\n\n0:12:37\tSPEAKER_05\n Oh, it was at the day I left.\n\n0:12:38\tSPEAKER_05\n It's suspicious.\n\n0:12:39\tSPEAKER_04\n He did it on purpose.\n\n0:12:40\tSPEAKER_04\n Yeah.\n\n0:12:41\tSPEAKER_04\n He leaves Japan the day.\n\n0:12:42\tSPEAKER_01\n Yeah, I did it on purpose.\n\n0:12:44\tSPEAKER_01\n I would have timed it right after, right?\n\n0:12:45\tSPEAKER_01\n Yeah.\n\n0:12:47\tSPEAKER_05\n But, yeah, so Chuck helped me out in regenerating all the different channels for like a few meetings, for like six meetings.\n\n0:12:56\tSPEAKER_05\n I think they're split up even further.\n\n0:12:57\tSPEAKER_05\n It's kind of even more disorganized now since we moved some of the meetings to different directories.\n\n0:13:03\tSPEAKER_05\n They're on a different disk, even, right?\n\n0:13:05\tSPEAKER_05\n I think they?\n\n0:13:05\tSPEAKER_05\n You didn't expand them to XE on Abbott.\n\n0:13:08\tSPEAKER_05\n XE.\n\n0:13:09\tSPEAKER_05\n No, the ones that you put them on, where you put them on XE, I don't remember why.\n\n0:13:14\tSPEAKER_05\n I think you put them on XE.\n\n0:13:16\tSPEAKER_05\n Okay.\n\n0:13:16\tSPEAKER_05\n So.\n\n0:13:16\tSPEAKER_02\n What we found out was that the disc that crashed was with a metadisk allocation, you had both transcripts and the short intervals and the expanded files were on XE, were on the same, sorry, the dishes are the same, physical disc.\n\n0:13:31\tSPEAKER_02\n And it's conceivable.\n\n0:13:33\tSPEAKER_02\n I mean, I don't mean, so I was told that it's possible that that might have caused additional wear on it, maybe caused it to.\n\n0:13:41\tSPEAKER_01\n Well, I think there was something else going on because Dave Johnson said that D.D.\n\n0:13:45\tSPEAKER_01\n was getting accessed frequently.\n\n0:13:48\tSPEAKER_01\n And it shouldn't be, right?\n\n0:13:49\tSPEAKER_01\n That data never gets touched because we write it once and then we never touch it.\n\n0:13:53\tSPEAKER_04\n Yeah, after each meeting, we copy the data to...\n\n0:13:55\tSPEAKER_02\n Well, it means that the way files are anything at all because the\n\n0:13:58\tSPEAKER_01\n computer is on the very smalls. Okay, this is...\n\n0:14:00\tSPEAKER_01\n And so it has to be the way files.\n\n0:14:02\tSPEAKER_01\n Yeah, there was something weird about that.\n\n0:14:03\tSPEAKER_01\n Yeah, so I asked Dave about and he hasn't looked into it yet, but we should definitely double check on it.\n\n0:14:07\tSPEAKER_04\n Yeah, like the same meeting, shortened files that we pull off of popcorn when we're done doing the recording, looked to the backup software as if they had been written, you know, every single night, if for, you know, a week in a row, which is really weird.\n\n0:14:24\tSPEAKER_01\n So at any rate, so for file reorganization, we need to first decide what we're going to do and then we're going to do it.\n\n0:14:31\tSPEAKER_01\n Yeah, so I'm not sure who isn't involved with that.\n\n0:14:34\tSPEAKER_01\n And certainly me chucking Jane, anyone else?\n\n0:14:38\tNone\n Care?\n\n0:14:40\tSPEAKER_00\n I don't know.\n\n0:14:41\tSPEAKER_02\n And I like to turn to the conventions to also, you know, it's a standard bit to hit down the last disease.\n\n0:14:46\tSPEAKER_02\n It doesn't, it gives in.\n\n0:14:48\tNone\n Right.\n\n0:14:50\tSPEAKER_01\n So maybe we should do that, not during this period.\n\n0:14:53\tSPEAKER_01\n Yeah, it's another time and just get a list of everything we're going to do.\n\n0:14:56\tSPEAKER_04\n Maybe next week if we could try to finish up the stuff.\n\n0:14:59\tSPEAKER_01\n Yeah, just update all the naming conventions and put all the files where they really belong on one disk.\n\n0:15:06\tSPEAKER_04\n That sounds a good idea.\n\n0:15:07\tSPEAKER_01\n And then we leave everything in place until the backup, until the next full backup, and then delete the old ones.\n\n0:15:12\tSPEAKER_01\n Mm-hmm.\n\n0:15:13\tSPEAKER_02\n Okay, and you're not talking about this, the X-disk, the X-disk, the back-up space.\n\n0:15:19\tSPEAKER_01\n Well, both need to be reorganized.\n\n0:15:21\tSPEAKER_01\n Okay.\n\n0:15:22\tSPEAKER_01\n So, um, various paths, I mean, this is why we have to do it in a synchronized way,\n\n0:15:28\tSPEAKER_04\n because I think we should also, at the same time, try to convert over to your new naming conventions.\n\n0:15:34\tSPEAKER_01\n Yes, exactly.\n\n0:15:34\tSPEAKER_01\n That'd be good.\n\n0:15:35\tSPEAKER_01\n So that's why I say we need to get a list of all that stuff that we want to do.\n\n0:15:39\tSPEAKER_01\n And so, I didn't really get any responses from the naming conventions that I sent out, so I assume that's all right with everything.\n\n0:15:45\tSPEAKER_01\n I actually haven't done it yet.\n\n0:15:46\tSPEAKER_04\n I haven't done it yet.\n\n0:15:47\tSPEAKER_04\n I will by next week.\n\n0:15:50\tSPEAKER_00\n Uh, I don't know about the naming.\n\n0:15:52\tSPEAKER_00\n I mean, so these names that we've been using so far with the, uh, uh, I wouldn't just want to change some, you know, without some advanced notice.\n\n0:16:05\tSPEAKER_00\n Right.\n\n0:16:06\tSPEAKER_00\n I mean, the, the segment names that we've been using, I would rather not mess with them.\n\n0:16:11\tSPEAKER_00\n Yeah.\n\n0:16:11\tSPEAKER_00\n Until we have some closure on some of the things we were currently dealing with.\n\n0:16:15\tSPEAKER_00\n Right.\n\n0:16:15\tSPEAKER_01\n How do you choose to date the naming is up to you?\n\n0:16:17\tSPEAKER_05\n Well, so, I mean, it should probably be, eventually, it should probably be consistent with what you're doing, but yeah, I kind of agree with Andreas, like I'm a little bit, I mean, these, I looked at the naming conventions and they look fine to me, but at the same time, it was just like, well, yeah, it's a rename everything would be.\n\n0:16:32\tSPEAKER_04\n If we change things, it won't really affect what you're doing.\n\n0:16:34\tSPEAKER_05\n No, but I think just to be consistent, we should also, I mean, have the same conventions.\n\n0:16:38\tSPEAKER_04\n Just so you can switch that anytime you want.\n\n0:16:39\tSPEAKER_04\n Yeah.\n\n0:16:40\tSPEAKER_05\n Yeah, I mean, it's only going to affect my work, so you're not, it's not going to, I mean, I see we're not going to go like into, you know, my director.\n\n0:16:47\tSPEAKER_00\n My family is,\n\n0:16:48\tSPEAKER_05\n so everybody, yeah, yeah.\n\n0:16:50\tSPEAKER_04\n I'm going to say, fine slash you, slash start.\n\n0:16:55\tSPEAKER_04\n MRM at all.\n\n0:16:56\tSPEAKER_05\n Yeah, that'd be great.\n\n0:16:58\tSPEAKER_05\n I'm going to enjoy that.\n\n0:17:01\tSPEAKER_02\n With no, with no advance warning.\n\n0:17:02\tSPEAKER_01\n You, well, I shouldn't say that on record.\n\n0:17:07\tSPEAKER_01\n There was a typo in some of the contracts that Morgan got that someone, one of our sponsors, did a global search, search and replace for it, between sponsor and their name.\n\n0:17:17\tSPEAKER_01\n And so it was saying, well, anyway, I won't.\n\n0:17:23\tSPEAKER_01\n I can imagine the problems that we can do.\n\n0:17:28\tSPEAKER_02\n But this name change effects is upset, doesn't it?\n\n0:17:31\tSPEAKER_02\n Right.\n\n0:17:35\tSPEAKER_01\n Um,\n\n0:17:35\tSPEAKER_03\n he'll know you had one, one short point. I've just installed a transcribed version of one of our NT machines, so it's available on the Windows now.\n\n0:17:46\tSPEAKER_00\n Who great? Actually, someone, I just got an email this week.\n\n0:17:50\tSPEAKER_03\n Yeah, I have already responded to him.\n\n0:17:52\tSPEAKER_03\n I don't know what the problem was.\n\n0:17:55\tSPEAKER_03\n It was really straightforward, really easy.\n\n0:17:58\tSPEAKER_03\n Oh, I'm sorry.\n\n0:17:59\tSPEAKER_03\n I just, so who did you talk to?\n\n0:18:01\tSPEAKER_03\n There was some guy from SRI who wanted to install, yeah, I don't think I'd have done that.\n\n0:18:06\tSPEAKER_03\n Okay. And he sent an email that he could, okay, I'm going to install it.\n\n0:18:08\tSPEAKER_03\n And I, I just described him what I did.\n\n0:18:11\tSPEAKER_03\n I was really straightforward.\n\n0:18:12\tSPEAKER_03\n Thanks.\n\n0:18:13\tSPEAKER_02\n And this is not just the transcribed.\n\n0:18:14\tSPEAKER_02\n This is the channel transcribed.\n\n0:18:15\tSPEAKER_03\n Yeah, it's a trans trans sort of, the core things that they've got.\n\n0:18:20\tSPEAKER_01\n But so you should probably talk to a sys admin and get it put in some central place.\n\n0:18:25\tNone\n On all the engines.\n\n0:18:26\tNone\n Okay.\n\n0:18:27\tSPEAKER_02\n Daniel, I guess, yeah, I see.\n\n0:18:29\tSPEAKER_02\n Even on the, on the unique side, but accessible.\n\n0:18:32\tSPEAKER_02\n Right.\n\n0:18:33\tSPEAKER_03\n Okay.\n\n0:18:34\tSPEAKER_03\n Yeah, I could do that.\n\n0:18:36\tSPEAKER_01\n So I assumed TK wasn't already on the machine.\n\n0:18:38\tSPEAKER_01\n So you had to install it.\n\n0:18:40\tSPEAKER_03\n I had to install it, yeah.\n\n0:18:41\tSPEAKER_04\n So Andreas, would it be appropriate to ask how the experiments are going?\n\n0:18:49\tSPEAKER_00\n Oh, well, yeah, I actually wasn't sure whether this is the right meeting for it, because it has very little to do with, with meeting recordings.\n\n0:18:56\tSPEAKER_00\n But, you know, I did run some recognition experiments with the X3 front end.\n\n0:19:05\tSPEAKER_00\n And then, you know, this is the joint work with Chuck.\n\n0:19:07\tSPEAKER_00\n And the, so first, you know, we had, we figured out some time last week how to, and Chuck wrote this really nice little script, Paul's script that takes a waveform, runs the feature calculation, and then dumps it out into the into a so-called capture file, which is what the SRI system uses to read features.\n\n0:19:35\tSPEAKER_00\n It's essentially a missed header waveform, you know, it looks like a waveform, except instead of samples, you have feature vectors following the header.\n\n0:19:46\tSPEAKER_00\n And that's all done by the script, and it works great.\n\n0:19:51\tSPEAKER_00\n And I first trained up to systems, because it's gendered, you know, the SRI system is gendered dependent, so to be comparable, I trained on a so-called short training set, a main system in a female system, and also for debugging purposes, and for the heck of it, I trained on the same training set, a standard system with the SRI front end from scratch, and compared the two.\n\n0:20:21\tSPEAKER_00\n So, what features did you use?\n\n0:20:24\tSPEAKER_00\n Well, we used 12 POP, so not roster, just POP.\n\n0:20:28\tSPEAKER_00\n And actually, one of the questions I had was what the roster would possibly buy us, talk about that later.\n\n0:20:36\tSPEAKER_00\n So, the baseline system, the SRI system was used, also used the 12th male capture, based on a 24 filter bank analysis.\n\n0:20:52\tSPEAKER_00\n I do not know what, so the bandwidth of the SRI front is from hundreds, hurts to 37, 50 or something like that, and I do not know what the XE front end would do.\n\n0:21:15\tSPEAKER_00\n I mean, what the bandwidth is, but the results are such that, let's see.\n\n0:21:24\tSPEAKER_04\n There's one other slight difference, right?\n\n0:21:26\tSPEAKER_04\n Or two differences?\n\n0:21:27\tNone\n Oh, yeah.\n\n0:21:27\tSPEAKER_00\n So, the SRI system also does vocal track length normalization, and we couldn't figure out how to do that yet with the XE features, so that's one difference.\n\n0:21:37\tSPEAKER_00\n And the other difference is that in the SRI system, the first, the C0, the energy feature is normalized slightly differently from the rest.\n\n0:21:51\tSPEAKER_00\n What they do is they subtract the maximum for each waveform segment, they subtract the maximum of that waveform segment from the values of that waveform, which is kind of automatic gain control.\n\n0:22:06\tSPEAKER_04\n Do they subtract the max from each one, wonder they subtract each one from the max?\n\n0:22:11\tSPEAKER_00\n They subtract.\n\n0:22:12\tSPEAKER_04\n Does it matter?\n\n0:22:13\tSPEAKER_04\n If you get a lot of negative, right?\n\n0:22:17\tSPEAKER_00\n And then, after they've done this waveform based normalization, they then do a conversation length normalization just like all the other features.\n\n0:22:25\tSPEAKER_00\n So it's a kind of two-stage normalization.\n\n0:22:28\tSPEAKER_00\n Now, I understand that the common practice here has been to just do standard mean subtraction on the waveform for the C0, right?\n\n0:22:37\tSPEAKER_00\n But in what we've done so far because we didn't have any special provision for C0, we just treated as any of the other features, we've done standard mean subtraction over the whole conversation side.\n\n0:22:49\tSPEAKER_00\n So since both SRI and XE use this sort of local normalization for C0, that's presumably, you know, someone has done some experiments to and found out that that works better.\n\n0:23:02\tSPEAKER_00\n So that's another difference, and that might account for some of the discrepancies in the results.\n\n0:23:09\tSPEAKER_00\n But, you know, so the results are, where should I start?\n\n0:23:21\tSPEAKER_00\n So there's a two, oh, I tried it with and without, so without and with adaptation.\n\n0:23:30\tSPEAKER_01\n How many iterations?\n\n0:23:36\tSPEAKER_00\n For the adaptation?\n\n0:23:38\tSPEAKER_00\n Well, we always do 3EM iterations.\n\n0:23:41\tSPEAKER_00\n And it's this quick and dirty, the phone loop adaptation, which doesn't actually require prior recognition pass.\n\n0:23:48\tSPEAKER_00\n And so this is not the best you can do with adaptation, but it gives you sort of a first idea of what you could gain with it.\n\n0:23:55\tSPEAKER_00\n And then, you know, so we have the SRI front end and the XE front end.\n\n0:24:03\tSPEAKER_00\n And other than that, the system configuration was identical.\n\n0:24:06\tSPEAKER_00\n So it was the same.\n\n0:24:08\tSPEAKER_00\n They came up with, you know, same number of Gaussian spur state cluster.\n\n0:24:15\tSPEAKER_00\n Same, the clustering used the same information loss threshold, which actually led to roughly the same number of Gaussian's overall.\n\n0:24:23\tSPEAKER_00\n So the system configuration is comparable.\n\n0:24:28\tSPEAKER_00\n And the, so without adaptation, get 49 or 8 or this is error rate.\n\n0:24:44\tSPEAKER_00\n And with adaptation, this is 47.1 and this was 52.6 and 51.3.\n\n0:25:02\tSPEAKER_00\n And then when I combine them, I can actually combine them with something like rover.\n\n0:25:07\tSPEAKER_00\n It's actually more sophisticated than rover, but it's here I got 48.5.\n\n0:25:19\tSPEAKER_00\n You got 46.5.\n\n0:25:22\tSPEAKER_01\n So combination at the utterance level.\n\n0:25:26\tSPEAKER_01\n At the utterance level, right?\n\n0:25:28\tSPEAKER_01\n Why do you think the XE front end is so much worse?\n\n0:25:30\tSPEAKER_01\n Good question.\n\n0:25:31\tSPEAKER_00\n The XE seems really odd to me.\n\n0:25:34\tSPEAKER_00\n So 1% I would attribute to the lack of VTR, about 1%.\n\n0:25:39\tSPEAKER_00\n Right. Okay. And then maybe another, I don't know how much the C0 normalization business really matters.\n\n0:25:46\tSPEAKER_00\n I can't see, I mean, can't see it.\n\n0:25:48\tSPEAKER_01\n You run the SRI just as an experiment run the SRI front end without vocal tract normalization CMS.\n\n0:25:53\tSPEAKER_00\n I could. Yeah. I could certainly do that.\n\n0:25:56\tSPEAKER_00\n Yeah.\n\n0:25:59\tSPEAKER_00\n We could also do the vocal tract length normalization with the XE features.\n\n0:26:02\tSPEAKER_00\n That's something we wanted to do.\n\n0:26:03\tSPEAKER_00\n Yeah, we could, I was actually thinking we could use the warping factors that we compute for the MFCCs and just try them with the XE front end.\n\n0:26:13\tSPEAKER_00\n Because we already have the capability to apply the warping to the Yeah, Dan had that in.\n\n0:26:19\tSPEAKER_00\n Yeah, Dan had that.\n\n0:26:21\tSPEAKER_01\n So they don't correspond one to one now.\n\n0:26:25\tSPEAKER_00\n No, but they should be close since the, I mean, the anyway, but I can certainly try the SRI front end without VTR.\n\n0:26:34\tSPEAKER_00\n That's certainly quick to do.\n\n0:26:39\tSPEAKER_00\n And so, yeah, and then there's all these, you know, the number of, you know, this front end had a fair amount of experimentation going into it, you know, how many filter banks to use, what bandwidth to use and stuff like that.\n\n0:26:59\tSPEAKER_00\n And we could play the same kind of games with the XE front end.\n\n0:27:02\tSPEAKER_00\n Right.\n\n0:27:03\tSPEAKER_00\n Actually, the analysis bandwidth played a very crucial role.\n\n0:27:05\tSPEAKER_00\n We used to use an error bandwidth and that heard us.\n\n0:27:10\tSPEAKER_00\n So this is, and this is, we now use roughly what everybody else is using.\n\n0:27:14\tSPEAKER_00\n So there's some moving from proven I figure in this and the XE front end.\n\n0:27:21\tSPEAKER_00\n So, but the good news is that even with this, with the XE system being that much worse, you still get a win out of combining the two.\n\n0:27:29\tSPEAKER_00\n So that gives some hope for the future.\n\n0:27:33\tSPEAKER_00\n Unfortunately, however, this seems to be reduced with adaptation.\n\n0:27:37\tSPEAKER_00\n So also interestingly, the difference actually widens.\n\n0:27:46\tSPEAKER_00\n I would actually expect it or hope that the adaptation reduces the difference because it might, for instance, removes some of the, you know, some, if you have some, some difference in the front end processing that is suboptimal, but can be possibly remedied by, you know, moving the, moving the models around that, but apparently that doesn't, doesn't really, actually the difference becomes larger.\n\n0:28:16\tSPEAKER_00\n So anyway, so right now what I'm doing is, well, there's several things going on.\n\n0:28:23\tSPEAKER_00\n One is that Shack is working on getting the tandem features into a form that we can train the tandem, the system on the tandem features. So that would actually be the more interesting experiment.\n\n0:28:36\tSPEAKER_00\n The other thing is I'm training, retraining the models on the large training set that we usually use to build our evaluation models. And then we can, and I actually want to do the system combination with our eVal system on some subset of the data at least, probably only for the males, because I don't have time to train both males and females. But, um, and, um,\n\n0:29:01\tSPEAKER_04\n What about cat, concatenating the two feature vectors into a single one? It gets pretty big. It does get pretty big, yeah.\n\n0:29:10\tSPEAKER_01\n And my experience with that in broadcast news was usually combining at other levels works better.\n\n0:29:18\tSPEAKER_00\n Oh, you tried that on broadcast news concatenating? Different feature sets?\n\n0:29:23\tSPEAKER_00\n Did you try it?\n\n0:29:24\tSPEAKER_01\n The M S G P O P, Rasta. I see.\n\n0:29:26\tSPEAKER_01\n So, you know, the feature sets we had available was almost always better to combine at the probability level, you know, so we'd run. Okay. Yeah, and it does become sort of unwieldy to\n\n0:29:39\tSPEAKER_00\n have these very large feature vectors and it would blow up the, you'd also have to do some sort\n\n0:29:44\tSPEAKER_01\n of normalization afterwards so that they're orthogonal. Right. So you'd want to do a linear transform also.\n\n0:29:51\tSPEAKER_00\n Right. Um, so the, yeah, and then we could start experimenting a little bit to try to get the XC front end to perform better. Um, and, and as a preliminary, just sort of diagnostic experiment, we can, I can certainly run a SRI system without VTR just to get, yeah, that's quick to do.\n\n0:30:22\tSPEAKER_01\n I was thinking about tandem system. Well, let's not talk about it here.\n\n0:30:26\tSPEAKER_01\n Some thoughts about the tandem system. Yeah, so, but things are moving ahead. So, they should we do digits? Digits. Sure. Do we have any other topics? Let's do one of the times.\n\n0:30:42\tSPEAKER_01\n What are you reading? Transcript L 105 942 32770 9997 0938 0 001 2908 5587 75 3955 734 479 627 427 38 0 865 7 0 910 352 330 953 925 293312\n\n0:31:16\tSPEAKER_00\n Transcript L 108 6 948 732 262 5587 825 210 19129 810 6 7 9 3 658 1 9 581 815 217 209 370 4 7 329 0129 6 9 9 1 3 5 5 0 1 3 5 9 5 3 1 1 6\n\n0:31:53\tSPEAKER_05\n why do you let it go first before his battery dies? Okay, Transcript L 106 2388 778 1 8049 107 2057 2 8 98 8 6 96 18 2 4 28 2 6 7 8 4 7 9 9 7 55 7 1 5 0 20 1, 5, 0, 2, 0. 1, 3, 0, 9, 7, 2, 6, 2, 4, 7, 0, 8. 2, 2, 0, 8, 5, 7, 9, 6, 2, 0, 7, 8,\n\n0:32:35\tSPEAKER_03\n 7, 8, 0, 4, 5, 3, 6, 7, 9, 8, 4, 3, 6, 7, 8, 4, 3, 6, 7, 8, 4, 5, 0, 7, 8, 7, 6, 3, 5, 1, 5, 9, 0, 2, 7, 2, 0, 5, 8, 0, 5, 6, 4, 7, 4, 9, 3, 4, 9, 3, 4, 9, 4, 9, 2, 5, 9, 6, 9, 8, 5, 7, 1, 5, 0, 7, 8, 4, 7, 7, 0, 6, 5, 7, 4, 7, 7, 5, Why? Yeah, sure. Yeah, no, I got it right, so I think...\n\n0:33:33\tSPEAKER_02\n Alright, that's the L90, 2, 3, 2, 1, 2, 4, 0, 3, 5, 8, 2, 9, 1, 1, 2, 0, 9, 1, 9, 1, 9, 0, 3, 2, 5, 9, 2, 7, 1, 2, 7, 4, 7, 3, 1, 3, 7, 6, 4, 4, 4,2, 3, 9, 3, 9, 5, 9, 9, 9, 7, 4, 3,...\n\n0:34:07\tSPEAKER_04\n Transcript L107, 191, 7L2196, Sign, 9-7-2-902-454 809-71-8002 7-6-4-991226 30816401 2131 8526 5780 303 833 874 1814 284 sorry start over 1 814 28245 4\n\n0:34:44\tSPEAKER_00\n so meeting actually have one more thing that I don't know if it's if it's allowed to bring up after the test anyway but it might be important for so Liz remarked that she had recorded a meeting where it was later found that several of the microphones were turned off and this must be a common problem especially with non-speech meetings so is there a way that the software could warn you if it gets zeros from some of the channels or probably we could probably build that in because you know it's really annoying if you go through all that trouble and then basically the meetings are unusable\n\n0:35:24\tSPEAKER_04\n what are people doing they're switching their mic software? I don't know what they\n\n0:35:27\tSPEAKER_00\n do maybe the batteries went that or they just didn't they played with the thing and didn't leave it in the on position or whatever I don't know\n\n0:35:35\tSPEAKER_01\n what would you like it to do when that happens? Well no if you I mean\n\n0:35:41\tSPEAKER_00\n obviously you always I mean there's never going to be the signal from all the channels right because or rarely but well if an unblackout channel is zero is\n\n0:35:54\tSPEAKER_01\n actually spitting out zeros you can be pretty sure it's off right because it doesn't spit out zeros it spits out the solans right because there's a little background noise the question is when the software detects it what do you\n\n0:36:05\tSPEAKER_00\n want it to do? That's a good question I don't know but is there some we can collectively think of some some mechanism that might reduce the risk of we already have visual feedback right? We'll see whether your mic is working or not right so maybe it's just to acknowledge people to actually look at the screen at the beginning of the meeting to make sure they get a signal. Test off the\n\n0:36:24\tSPEAKER_01\n screen saver during the meeting. Tell them to test their mics or yeah something yeah I don't know what to do other than you can beep if one of the channels dies\n\n0:36:32\tSPEAKER_05\n while recording. Oh yeah well we can think about what to do yeah it's pretty\n\n0:36:42\tSPEAKER_01\n clear we can detect it so okay all right\n\n", "summary": [{"summary_text": "The EDU group doesn't like the microphone. Speaker prefers the Sony mics, but he doesn't mind using the fancy ones. The other option is to try yet another mic and get six all the same. Speakers hate the Sony ones because they are hard to adjust."}]}