{"filename": "./data/Bns001.txt", "transcript": "0:00:00\tSPEAKER_00\n Okay, so we should be on and I'm going to go ahead and start by reading the digit strings just to give you an example of how to do it.\n\n0:00:12\tSPEAKER_00\n So the first thing to do is read the transcript number which is on the right hand side there.\n\n0:00:17\tSPEAKER_00\n So this is transcript 1551-1570.\n\n0:00:21\tSPEAKER_00\n 2734-500-716-844-95247-06001-2002204-4175-5368-789-009-1159-2466-205.\n\n0:00:45\tSPEAKER_00\n And so if we could just go around the table.\n\n0:00:52\tSPEAKER_01\n Okay, transcript is 1731-1750-0199013-07675-174202346187-7407-864895010303207.\n\n0:01:14\tSPEAKER_01\n So 1033-437-05302-697-787-8909.\n\n0:01:24\tSPEAKER_02\n Okay, this is the transcript 1571-1590-395-4770-59670-06001-91642-07103.\n\n0:01:41\tSPEAKER_02\n 18009-85234010017-63577-8993-9600131857-43.\n\n0:02:03\tSPEAKER_03\n Okay, transcript 1411-143-3-07646374-86647-990-00006-2280125-34602-5646815-708.\n\n0:02:33\tSPEAKER_03\n Alle 3-0353-215-3622-3840161-57235128-3455001-2775awn remember you forgot.\n\n0:02:56\tSPEAKER_05\n 6.007091.\n\n0:03:00\tSPEAKER_05\n 0309.\n\n0:03:02\tSPEAKER_05\n 066202.8518.\n\n0:03:07\tSPEAKER_05\n 2.3408.57.\n\n0:03:11\tSPEAKER_05\n 624.\n\n0:03:13\tSPEAKER_05\n 7439550.\n\n0:03:17\tSPEAKER_05\n 87727.\n\n0:03:20\tSPEAKER_05\n 98711.\n\n0:03:22\tSPEAKER_05\n 0.0011.\n\n0:03:25\tSPEAKER_05\n 32073.\n\n0:03:28\tSPEAKER_05\n 42556.\n\n0:03:31\tSPEAKER_05\n 625.\n\n0:03:34\tSPEAKER_06\n Transcript is 1491-1510.\n\n0:03:40\tSPEAKER_06\n 0056.\n\n0:03:41\tSPEAKER_06\n 0064.\n\n0:03:43\tSPEAKER_06\n 21170.\n\n0:03:45\tSPEAKER_06\n 3338.\n\n0:03:47\tSPEAKER_06\n 425535678.\n\n0:03:51\tSPEAKER_06\n 0253704.\n\n0:03:54\tSPEAKER_06\n 7456.\n\n0:03:56\tSPEAKER_06\n 1688.\n\n0:03:59\tSPEAKER_06\n 2.303.\n\n0:04:01\tSPEAKER_06\n 3951.\n\n0:04:03\tSPEAKER_06\n 4.\n\n0:04:04\tSPEAKER_06\n 6.3.\n\n0:04:05\tSPEAKER_06\n 7462.\n\n0:04:08\tSPEAKER_06\n 8539.\n\n0:04:10\tSPEAKER_06\n 0.\n\n0:04:12\tSPEAKER_08\n Transcript 1711-1730.\n\n0:04:17\tSPEAKER_08\n 9401.\n\n0:04:21\tSPEAKER_08\n 2.003199.\n\n0:04:24\tSPEAKER_08\n 4.1.\n\n0:04:26\tSPEAKER_08\n 5.216988.\n\n0:04:29\tSPEAKER_08\n 6.8.5.\n\n0:04:31\tSPEAKER_08\n 7908.\n\n0:04:33\tSPEAKER_08\n 8.069.\n\n0:04:36\tSPEAKER_08\n 9.039.\n\n0:04:38\tSPEAKER_08\n 007.\n\n0:04:40\tSPEAKER_08\n 1168522.\n\n0:04:43\tSPEAKER_08\n 2608.\n\n0:04:47\tSPEAKER_08\n 4759.\n\n0:04:49\tSPEAKER_08\n 47583967.\n\n0:04:53\tSPEAKER_08\n 94209.\n\n0:04:55\tSPEAKER_08\n Thanks.\n\n0:04:56\tSPEAKER_00\n So I wanted to just read or read because we did it to have one person come in a little later that there will be an opportunity to remove anything from the transcript that you don't want made public after it's transcribed so that will be some months off but you will have that opportunity.\n\n0:05:10\tSPEAKER_00\n Thanks.\n\n0:05:13\tSPEAKER_04\n You go start with all meeting.\n\n0:05:16\tSPEAKER_04\n Yep.\n\n0:05:17\tSPEAKER_04\n Thanks very much.\n\n0:05:18\tSPEAKER_04\n You have to stay all the time here?\n\n0:05:19\tSPEAKER_00\n I don't have to.\n\n0:05:20\tSPEAKER_00\n You want to.\n\n0:05:21\tSPEAKER_00\n Well, at the end of the meeting, don't turn off the mics.\n\n0:05:24\tSPEAKER_00\n Just leave them on.\n\n0:05:25\tSPEAKER_00\n And actually, could you call me at the end of the meeting.\n\n0:05:30\tSPEAKER_00\n I'll leave my number on the board there.\n\n0:05:32\tSPEAKER_00\n Thanks.\n\n0:05:33\tSPEAKER_01\n Hey, Adam, you know what?\n\n0:05:36\tSPEAKER_01\n It must be funny to do research on how people behave by reading these numbers.\n\n0:05:42\tSPEAKER_01\n That must be, yeah, it must be much more interesting to see that behavior.\n\n0:05:47\tSPEAKER_00\n The meetings are strange.\n\n0:05:49\tSPEAKER_00\n Oh, yeah, yeah.\n\n0:05:50\tSPEAKER_00\n People interrupt each other much more than I thought they could.\n\n0:05:55\tNone\n 2977.\n\n0:05:56\tNone\n 2977.\n\n0:05:57\tSPEAKER_04\n Okay.\n\n0:05:58\tSPEAKER_04\n I would call you there.\n\n0:05:59\tSPEAKER_04\n Thanks.\n\n0:06:00\tSPEAKER_04\n Okay.\n\n0:06:01\tSPEAKER_04\n So, let's start with...\n\n0:06:02\tSPEAKER_04\n Our weekly meetings the last time we were in too much, I believe.\n\n0:06:10\tSPEAKER_04\n So today, I have two topics.\n\n0:06:14\tSPEAKER_04\n The first topic, if you remember in our group, Miguel Sanchez, everybody knows him very well in the meantime because he's here.\n\n0:06:23\tSPEAKER_04\n Gladly the time.\n\n0:06:24\tSPEAKER_04\n And I'm saying he's talking to everybody in the meantime.\n\n0:06:28\tSPEAKER_04\n So by any way I would like, Miguel Sanchez will interview with himself a little bit concerning his background, what he intend to do.\n\n0:06:35\tSPEAKER_04\n And because I discuss him with him, many things concerning his skills and what's the...\n\n0:06:43\tSPEAKER_04\n And as a group intends to do, I hope that will be a match then for his future work.\n\n0:06:48\tSPEAKER_04\n And the second topic is to discuss the proposal in much more detail.\n\n0:06:53\tSPEAKER_04\n I believe we still haven't left our starting position and yesterday I also discussed with Wilbert some things.\n\n0:07:04\tSPEAKER_04\n And I would like to focus on the question, what problem we are going to solve as such a proposal.\n\n0:07:13\tSPEAKER_04\n Not to be where they have a common activity within the group itself and maybe with other problems outside.\n\n0:07:17\tSPEAKER_04\n But the technical problem.\n\n0:07:20\tSPEAKER_04\n But just as the second topic so first I would like to talk about his background.\n\n0:07:29\tSPEAKER_02\n Thank you.\n\n0:07:30\tSPEAKER_02\n So please.\n\n0:07:31\tSPEAKER_02\n Well, all of you know I came from Spain, from the Polytechnic University of Valentia.\n\n0:07:40\tSPEAKER_02\n And I just finished my PhD thesis about power saving techniques for wireless networking.\n\n0:07:51\tSPEAKER_02\n In fact, I have developed an algorithm to control the radio frequency power of a wireless transceiver.\n\n0:08:02\tSPEAKER_02\n And I have been working also in routing issues especially in the so-called ad hoc wireless networks where you have a set of mobile nodes and no other infrastructure, no base stations.\n\n0:08:21\tSPEAKER_02\n So all the routing functions are done by the node, by the same nodes.\n\n0:08:27\tSPEAKER_02\n So nodes act as both endpoints and routers.\n\n0:08:34\tSPEAKER_02\n I have been the study for some time, this kind of networks.\n\n0:08:39\tSPEAKER_02\n And in fact there are a lot of research articles about this kind of networks because you know infrastructure based network network has been a long topic of research.\n\n0:08:54\tSPEAKER_02\n So for example routing on wired networks is a topic still to be researched but it has an important background.\n\n0:09:03\tSPEAKER_02\n But mobile network, this kind of mobile networks is a little bit newer especially because until not so long.\n\n0:09:14\tSPEAKER_02\n The thing where too heavy to have a computer wireless transceiver on a more or less portable thing.\n\n0:09:21\tSPEAKER_02\n So with the advent of this new technology, low power, high processing capability and wireless networking capability in a really small packet, new kind of devices are being built and are appearing in the market.\n\n0:09:39\tSPEAKER_02\n And well this is more or less what I have done.\n\n0:09:43\tSPEAKER_02\n And the kind of things I am interested is more or less around this kind of networks.\n\n0:09:52\tSPEAKER_02\n But I could say in general mobile services, not only about this specific kind of networks, but in general about services over mobile or services that kind of benefit from the capability of nodes to move around.\n\n0:10:12\tSPEAKER_02\n And well I have been teaching now for 12 years at a computer science school in my university.\n\n0:10:22\tSPEAKER_02\n I have been teaching computer networks and well I am more or less knowledgeable about TCP, IP networking, ISO networking.\n\n0:10:35\tSPEAKER_02\n And all my computer guys who I am really probably more or less computer skilled, operating systems, programming languages, networking as do so this kind of things I think I am more or less well trained.\n\n0:10:56\tSPEAKER_02\n So this is I think my first presentation.\n\n0:11:02\tSPEAKER_02\n Maybe next meeting I will do a small sketch about my past work and presenting some a little bit more detail approach with some schemes and some things from previous talks.\n\n0:11:17\tSPEAKER_02\n So you can have a better idea of the kind of work I have been doing.\n\n0:11:22\tSPEAKER_02\n Thank you.\n\n0:11:23\tSPEAKER_04\n Thank you.\n\n0:11:24\tSPEAKER_04\n I will discuss it yesterday, maybe we have a talk next Tuesday, but give me a sign and I need a abstract so that I can announce it and go to the next meeting.\n\n0:11:36\tSPEAKER_04\n That's okay.\n\n0:11:37\tSPEAKER_04\n One short, other topic is Claudia did a lot of work concerning web pages since the meantime.\n\n0:11:47\tSPEAKER_04\n Despite busy stuff, it's very recent and reason and whatever, she found some time to or I had to discuss before, before the HTML stuff and we want to put it on the web pages the next day.\n\n0:12:09\tSPEAKER_04\n So I will send an email to everybody that says, check the web pages whether they are aligned with their own use and opinions of what should be presented on the web pages and anything that is appreciated.\n\n0:12:27\tSPEAKER_04\n So let's switch to the project proposal.\n\n0:12:30\tSPEAKER_04\n I mentioned that it is still.\n\n0:12:33\tSPEAKER_01\n Sorry, can I?\n\n0:12:34\tSPEAKER_01\n Maybe I can add something.\n\n0:12:35\tSPEAKER_01\n If there's anything else which we or we could add on the website, so for example if you have a small abstract or some pictures or whatever, but the work you did before, what you are planning to do here, that will be fine because then we can add some more stuff there.\n\n0:12:50\tSPEAKER_01\n Or if you have something or if somebody has some slides or articles, whatever, he wants to be popular there.\n\n0:12:57\tSPEAKER_04\n Then everybody sees a structure, how it is, a structure, really structures and maybe you can easily offer some additional input which should be presented on the web pages.\n\n0:13:07\tSPEAKER_01\n It depends.\n\n0:13:08\tSPEAKER_01\n What everybody wants to do.\n\n0:13:10\tSPEAKER_01\n So about the project will be something and about publications will be another point and yeah, additional information about how is life in Berkeley and I don't know, some hints, some websites or links which are useful when somebody arrives or stuff like that.\n\n0:13:26\tSPEAKER_05\n There's a personal homepage for everybody or is it planned or not?\n\n0:13:31\tSPEAKER_05\n Yeah, you can have it because there's an interesting business that makes work.\n\n0:13:36\tSPEAKER_04\n Everybody is obliged to do it for its own.\n\n0:13:40\tSPEAKER_04\n So there's not a lot of work to do.\n\n0:13:43\tSPEAKER_04\n No, I'm not doing it for everybody's response to the foil.\n\n0:13:50\tSPEAKER_01\n Yeah, but what is planned is that I do, I mean like previous layout and gave everybody the possibility to the chance to put his contents inside so that layout is for everybody the same so about the projects and stuff so there will be something.\n\n0:14:08\tSPEAKER_04\n Okay, thanks.\n\n0:14:11\tSPEAKER_04\n So let's switch to the proposal.\n\n0:14:13\tSPEAKER_04\n I ask everybody whether I write it in the meantime and understand everything.\n\n0:14:18\tSPEAKER_04\n Everybody say yes?\n\n0:14:20\tSPEAKER_04\n Yes, okay.\n\n0:14:23\tSPEAKER_04\n From my point of view, as I mentioned before, we still in this starting position.\n\n0:14:31\tSPEAKER_04\n I think for building blocks on the network level, we'll have really a major impact on our current available wireless networks and also for future generations.\n\n0:14:47\tSPEAKER_04\n And what's amazing thing is really what kind of problem we are, one of us, solve with such a project proposal and will, but yesterday mentioned, and he's right, that what kind of maybe service we are really going to offer.\n\n0:15:08\tSPEAKER_04\n The linkage between such kind of application, also interactive multimedia application and this kind of networking stuff is maybe not very well aligned because there will be of course a portion of mobile access to such kind of application.\n\n0:15:27\tSPEAKER_04\n By the way, there's not a majority and there's not a major focus of this kind of application anyway.\n\n0:15:36\tSPEAKER_04\n So I would like to split and point the discussions of what kind of application far away and I would like to more to focus if we have certain kind of vision concerning these building blocks in the network.\n\n0:15:52\tSPEAKER_04\n What kind of problem we are going to solve, what kind of glue between these four building blocks exists and what kind of synergy effect influence of a little server and fit very well together exists for networking stuff.\n\n0:16:07\tSPEAKER_04\n And what kind of service could we provide in that area if we will have these kind of really closely working together of these four building blocks.\n\n0:16:21\tSPEAKER_04\n So maybe we'll what you can start to discuss or to tell the group about what you mentioned yesterday concerning certain kind of ideas.\n\n0:16:33\tSPEAKER_04\n Maybe it's a brainstorming of these things and maybe we can comment later on these ideas.\n\n0:16:45\tSPEAKER_04\n And I saw you discuss this with Mark, write some stuff.\n\n0:16:50\tSPEAKER_04\n Was it also related as well as things like this?\n\n0:16:53\tSPEAKER_08\n This afternoon?\n\n0:16:54\tSPEAKER_08\n Yeah.\n\n0:16:55\tSPEAKER_08\n No, this was unrelated to things of yesterday in last week.\n\n0:17:00\tSPEAKER_04\n And maybe in one sentence before, I believe everybody fits very well in these kind of things because from the mathematical description with QS in advance, we have an expert for quality of service and Michael as an expert for MPLS and will what an expert for multi-cast.\n\n0:17:21\tSPEAKER_04\n And I discussed with Miguel maybe a little bit the shift to active routing but it is still in the area of routing.\n\n0:17:29\tSPEAKER_04\n So my idea is in principle to have independently of any funding, independently of any outer contact, such core activity in principle.\n\n0:17:40\tSPEAKER_04\n You can see how much from the outer world can fit in.\n\n0:17:44\tSPEAKER_04\n First of all, the first stage is the institution which is behind everybody.\n\n0:17:48\tSPEAKER_04\n That means KPN and UK, so in the middle of our case.\n\n0:17:53\tSPEAKER_04\n And maybe then the outer world here, other partners which are still in the proposal.\n\n0:17:57\tSPEAKER_04\n My tomorrow I will go to Cisco for instance and I will discuss.\n\n0:18:01\tSPEAKER_04\n Or this kind of things, maybe they have certain additions, their activities and their interests that are in their size, they are also benefit here.\n\n0:18:10\tSPEAKER_04\n So principle that results are available, they are not restricted in anybody.\n\n0:18:13\tSPEAKER_04\n If you have your common activity, that makes a little bit easier.\n\n0:18:17\tSPEAKER_04\n And if there is a technical linkage between such, between the outer world and us, the better it is.\n\n0:18:26\tSPEAKER_04\n But anyway, if you come to a certain kind of common work within the core of the NSA group, I think that's really benefit to everybody.\n\n0:18:38\tSPEAKER_04\n And especially if you have a mind to go and really from the project proposal view, I think we can build it on this core.\n\n0:18:52\tSPEAKER_04\n Go to the outer world and then align it in a certain way.\n\n0:18:55\tSPEAKER_04\n For instance, that it also fit maybe to KPN and the image and other companies.\n\n0:19:02\tSPEAKER_08\n It probably has to be a brainstorm right now.\n\n0:19:07\tSPEAKER_08\n What I told Jochem yesterday was that for my company I work for, they are more interested in explicit service than in core technology.\n\n0:19:19\tSPEAKER_08\n Me on the other hand, I'm more interested in core service or core technology myself.\n\n0:19:26\tSPEAKER_08\n So I was thinking about how I could combine the both of them.\n\n0:19:30\tSPEAKER_08\n KPN was interested in having six people or something working on the project for one year or maybe three people working on the project for two years.\n\n0:19:41\tSPEAKER_08\n They have a kind of a demonstration for specifically in UMTS service.\n\n0:19:47\tSPEAKER_08\n I was thinking that as a, well, not really a UMTS service, but yesterday what I discussed with Jochem was a little bit based on your ad hoc net working also.\n\n0:20:02\tSPEAKER_08\n That would be interesting to have a kind of a device where you can switch from a wavelength technology to a UMTS.\n\n0:20:11\tSPEAKER_08\n I think that in the future that will be your main competitor of UMTS to the loosened equipment has a huge scope already like 500 feet or even more sometimes.\n\n0:20:27\tSPEAKER_08\n So that it might be interesting for a service to walk into a building or whatever is available on that network.\n\n0:20:34\tSPEAKER_08\n You can switch from UMTS or to wavelength technology.\n\n0:20:40\tSPEAKER_04\n Maybe I'm going to have a few keep us on the one phone.\n\n0:20:51\tSPEAKER_08\n Of course it sounds strange for a company that does UMTS to switch, to be able to switch or provide a service to switch to wavelength.\n\n0:20:59\tSPEAKER_08\n But at the end it makes it easier for you and cheaper for your customers.\n\n0:21:06\tSPEAKER_08\n So if they don't do it, somebody else will probably do it.\n\n0:21:09\tSPEAKER_02\n And you can build a double technology adapter too.\n\n0:21:15\tSPEAKER_02\n So you can market these double technology adapters.\n\n0:21:19\tSPEAKER_02\n This can be a potential income too.\n\n0:21:26\tSPEAKER_02\n Because you just have to license a wavelength technology.\n\n0:21:30\tSPEAKER_02\n You can build the whole thing.\n\n0:21:33\tSPEAKER_02\n Yeah, you see, the UMTS wavelength makes together.\n\n0:21:37\tSPEAKER_08\n Yeah, something like that could be possible, maybe even a UMTS to wavelength gateway.\n\n0:21:42\tSPEAKER_08\n I'm not sure if that's possible.\n\n0:21:45\tSPEAKER_08\n If UMTS contains redirects or whatever like switches, I'm not sure about it.\n\n0:21:50\tSPEAKER_02\n Could be.\n\n0:21:51\tSPEAKER_02\n I think they are using different radio technologies.\n\n0:21:55\tSPEAKER_02\n So, not a physical level.\n\n0:21:58\tSPEAKER_02\n They are not compatible.\n\n0:22:00\tSPEAKER_08\n No, you could have a UMTS gateway.\n\n0:22:04\tSPEAKER_08\n It translates everything to that local.\n\n0:22:07\tSPEAKER_08\n Yeah, a few of us.\n\n0:22:10\tSPEAKER_04\n That's right.\n\n0:22:11\tSPEAKER_04\n And the basic idea is, it's a bit to switch seamlessly between wireless land technology whatever.\n\n0:22:17\tSPEAKER_04\n And UMTS, why?\n\n0:22:20\tSPEAKER_04\n Yes.\n\n0:22:21\tSPEAKER_04\n And you see the benefits that importance the customer would say a lot of money.\n\n0:22:26\tSPEAKER_04\n Because if in-house communication like wavelength or maybe, I see also in the American market, some wavelength communication in the outer world would be available.\n\n0:22:34\tSPEAKER_04\n And that is your assumption that's a more cost extensive UMTS connection could be principle used.\n\n0:22:45\tSPEAKER_04\n We like to say over wavelength and then I have a normal wavelength connection, right?\n\n0:22:50\tSPEAKER_04\n Yes.\n\n0:22:51\tSPEAKER_04\n And the router and the wavelength connection goes then to the core internet elsewhere and the connection is not dropped between the seamless hand of wavelength to say, right?\n\n0:23:04\tSPEAKER_08\n Well, if connection is lost time, I'm not sure.\n\n0:23:08\tSPEAKER_08\n Sometimes you simply have to drop a connection if you have outside connections.\n\n0:23:13\tSPEAKER_08\n Yeah.\n\n0:23:14\tSPEAKER_08\n But that's one thing of the internet, right?\n\n0:23:16\tSPEAKER_08\n It should be able to unplug a host, bring it somewhere else and everything continues like it's you to.\n\n0:23:23\tSPEAKER_08\n But if it's a, if you really have to save a connection for all applications, I don't think so.\n\n0:23:31\tSPEAKER_04\n Yeah, but it is a finer goal.\n\n0:23:33\tSPEAKER_04\n It should be as much as possible available that you do not have to break the connection if you switch between the subnet technology, right?\n\n0:23:39\tSPEAKER_02\n Yeah, but I have a point regarding this question.\n\n0:23:44\tSPEAKER_02\n Is the cost function?\n\n0:23:46\tSPEAKER_02\n I mean, what about the user who is switching from one, let's say, serial cost area network to another network where he has to pay?\n\n0:23:58\tSPEAKER_02\n It is okay for the service to continue when he switches from one network to another.\n\n0:24:04\tSPEAKER_02\n But probably the user wants to be aware that he is switching from one place, from one network to another.\n\n0:24:11\tSPEAKER_02\n Maybe while he's having, let's say, a radio conference over the wavelength, he's not paying any extra cost.\n\n0:24:22\tSPEAKER_02\n But when he continues with this service on the UMTS, he's having to cover, let's say, an important cost or some cost, non-null cost.\n\n0:24:34\tSPEAKER_02\n Yeah, non-null cost.\n\n0:24:36\tSPEAKER_02\n This can be something that probably the user wants to be aware of.\n\n0:24:40\tSPEAKER_02\n Of course, this doesn't mean that the user wants the connection to be dropped when he switches from the serial cost area network to the non-null cost area network.\n\n0:24:54\tSPEAKER_02\n But maybe some users want to do this because they say, okay, I'm not willing to pay any back for this service because I'm just watching the sports news.\n\n0:25:05\tSPEAKER_02\n So if I switch, because of my motion, I'm switching or I'm going out of the coverage of the wireless local area network, I want the service to be stopped.\n\n0:25:18\tSPEAKER_02\n And this can be some pattern that some users will follow.\n\n0:25:25\tSPEAKER_04\n But if you, I believe everybody is aware about the USAID architecture.\n\n0:25:30\tSPEAKER_04\n This one is here.\n\n0:25:31\tSPEAKER_04\n This stuff is here also related to this kind of work.\n\n0:25:33\tSPEAKER_04\n This mentioned there concerning the end system.\n\n0:25:36\tSPEAKER_04\n And then my considered end system, there's a certain kind of policy concerning how to use subnet technologies and all these kinds of things, how to use quality of service in advance because you have to pay for certain technologies and maybe for certain services.\n\n0:25:52\tSPEAKER_04\n And that should not be done automatically, but it could be done automatically.\n\n0:25:55\tSPEAKER_04\n But nevertheless, there must be a certain kind of user interaction always possible that you could set up a certain kind of mini database, how to deal with all these kinds of things.\n\n0:26:06\tSPEAKER_04\n I think that's not a problem.\n\n0:26:08\tSPEAKER_04\n But I would like to ask, will we have to discuss it yesterday?\n\n0:26:11\tSPEAKER_04\n Is it only the usage of the PCM, CIA card that you have instead of GSM today, UMTS and instead of wireless LAN today, also wireless LAN remember you for and one card concerning what is the name from data card?\n\n0:26:26\tSPEAKER_04\n No, there come.\n\n0:26:28\tSPEAKER_04\n Oh, the one I have to say.\n\n0:26:29\tSPEAKER_04\n So you can name it before technology, then you plug in and you have a laptop and then you have every four subnet layer technologies available in your laptop.\n\n0:26:39\tSPEAKER_04\n Is that the problem?\n\n0:26:40\tSPEAKER_04\n That's not the problem, right?\n\n0:26:42\tSPEAKER_08\n Well, the switching itself could be a problem.\n\n0:26:47\tSPEAKER_08\n Why?\n\n0:26:48\tSPEAKER_08\n Well, it depends, like you're not going to prop on four different networks if one of the other networks is available, maybe you are, I don't know.\n\n0:26:57\tSPEAKER_08\n So that could be a topic for which.\n\n0:26:58\tSPEAKER_04\n What is it, maybe you know more about it?\n\n0:27:00\tSPEAKER_04\n Yeah, but this is only the problem to figure out that you get at a certain location, the information that the certain coverage of the certain subnet technology is available.\n\n0:27:11\tSPEAKER_04\n And if so, then what MIGO dimensions and you are to certain kind of policy to switch or not to switch to this kind of technology, why?\n\n0:27:18\tSPEAKER_04\n Yes.\n\n0:27:19\tSPEAKER_04\n But this is end system related.\n\n0:27:21\tSPEAKER_04\n So it's not the network related.\n\n0:27:24\tSPEAKER_04\n I see no network related stuff was in this idea.\n\n0:27:30\tSPEAKER_04\n It's only to set up, for me it's like a laptop to plug one PCAM and currently I will have two PCAM-CIA-A card and I compare GSM with UMTS.\n\n0:27:41\tSPEAKER_04\n And today I would like to have GSM and then I have my GSM connectivity and I cannot use it as a technology.\n\n0:27:48\tSPEAKER_04\n Only GSM because the interface and the driver interface does not permit me to switch between the different technologies.\n\n0:27:56\tSPEAKER_04\n So if I want to go to wireless LAN, I have to stock my connection and put in my wireless LAN, PSAM-CIA-CAD and then I can go on and set up the same connection one more time.\n\n0:28:05\tSPEAKER_04\n And what you have in mind to do it a little bit more seamlessly, that makes the only sense for me, both technologies and pronsive will work close together in that sense for application.\n\n0:28:16\tSPEAKER_04\n For instance, the application would be that I have my laptop here and the work here will work my device and the kind of device and I work here in wireless LAN area and then I go outside and want to go still on leaving the coverage of wireless LAN.\n\n0:28:32\tSPEAKER_04\n And at a certain stage the device receives certain signals, that's the coverage of UMTS or GSM is available and at that stage you automatically or based on the certain kind of user profile switched to the UMTS or GSM network.\n\n0:28:49\tSPEAKER_04\n That's the only sensible application.\n\n0:28:51\tSPEAKER_04\n My understanding that means only to have a certain kind of control layer for the different drivers, which also mentioned as an USAIA and texture and then to do the switching for an existing stream or application, but we need to be transparent to this application between these both technologies.\n\n0:29:14\tSPEAKER_04\n Maybe there's more potential, I don't see it, but maybe you have additional ideas.\n\n0:29:19\tSPEAKER_04\n And I don't think that these end system device architecture, which will come automatically and I believe there's a lot of activities for our world because these seamlessly communication is always mentioned elsewhere, you listen to it.\n\n0:29:39\tSPEAKER_08\n If you can leave it out the network, this will be really cool.\n\n0:29:44\tSPEAKER_08\n What I would like to do.\n\n0:29:46\tSPEAKER_02\n But when quality of service comes to the scene, well I think we have a bigger problem because maybe this seamless migration cannot be seamless at all because maybe the quality of service we are getting when we are connected to a certain network, let's say high speed networking, cannot be sustained when we are switching to a different technology.\n\n0:30:14\tSPEAKER_02\n So this is another thing that is putting a little bit more trouble or scheme.\n\n0:30:23\tSPEAKER_04\n Now I would like not to hear only three opinions, but maybe there are other opinions and have everybody shot me the shot.\n\n0:30:33\tSPEAKER_04\n I think we should understand that everybody is.\n\n0:30:36\tSPEAKER_04\n I think we should, whether they are comments.\n\n0:30:38\tSPEAKER_06\n And this thing of seamless hand-off or hand-overs should think more maybe in different layers.\n\n0:30:47\tSPEAKER_06\n The one layers having this seamless hand-over.\n\n0:30:50\tSPEAKER_06\n It's clear if a technology doesn't provide that quality of service, you can't do magic and have it.\n\n0:30:56\tSPEAKER_06\n There are certain constraints on that.\n\n0:31:00\tSPEAKER_06\n That's still mine, but for the cases there, it is possible.\n\n0:31:06\tSPEAKER_06\n So that should be made possible then.\n\n0:31:11\tSPEAKER_02\n So can we do it?\n\n0:31:13\tSPEAKER_02\n It is just, there is still enough problem in doing it.\n\n0:31:16\tSPEAKER_02\n It's being pined at the possible problems.\n\n0:31:20\tSPEAKER_06\n It might be the wrong thing to promise 10 megabits to everywhere that you are, but saying okay, if the technology is okay, you can do that.\n\n0:31:33\tSPEAKER_02\n Yeah, in fact, if you take this lower technology of the ones you are planning to support, you can offer this throw-put as a minimum guarantee you can get.\n\n0:31:47\tSPEAKER_02\n So if everybody is asking for less than this minimum amount, no problem at all.\n\n0:31:52\tSPEAKER_02\n But in this case, maybe not too much effort should be put on providing this quality of service because you just have usually a huge bandwidth compared with what the user is using.\n\n0:32:07\tSPEAKER_02\n I mean, if you have a 10 megabits bandwidth and the user is asking 2 kilobits per second, of course you can build certain reserve mechanisms to guarantee the user 2 kilobits per second bandwidth.\n\n0:32:24\tSPEAKER_02\n Actually, it is not worth because you have so many available bandwidths that maybe it is not a problem.\n\n0:32:35\tSPEAKER_07\n Okay.\n\n0:32:36\tSPEAKER_08\n The thing is that we are looking for a research topic on those four areas.\n\n0:33:01\tSPEAKER_04\n And the building blocks.\n\n0:33:02\tSPEAKER_04\n Yeah, by the cast, not the topic.\n\n0:33:04\tSPEAKER_08\n So we went through multi-casts through this architecture with less than a wireless environment or a mobile IP environment.\n\n0:33:17\tSPEAKER_08\n Comparable to a UMTS environment, we really did not find any difficulties there on the blackboard of this.\n\n0:33:27\tSPEAKER_08\n Of course, in real life there will probably be some problems.\n\n0:33:30\tSPEAKER_02\n So have you read about this Bar One project at Berkeley University?\n\n0:33:35\tSPEAKER_02\n What are you saying yesterday?\n\n0:33:38\tSPEAKER_04\n Yeah, I did the fan the time.\n\n0:33:40\tSPEAKER_04\n Okay.\n\n0:33:41\tSPEAKER_04\n And to do so that.\n\n0:33:42\tSPEAKER_08\n You mean the iceberg project?\n\n0:33:43\tSPEAKER_08\n Bar One.\n\n0:33:44\tSPEAKER_08\n Bar One.\n\n0:33:45\tSPEAKER_08\n Yes.\n\n0:33:46\tSPEAKER_08\n How is it going?\n\n0:33:47\tSPEAKER_08\n Another one, so for renegades.\n\n0:33:48\tSPEAKER_02\n It was another related project called Didalus.\n\n0:33:53\tSPEAKER_02\n Yes.\n\n0:33:55\tSPEAKER_02\n And it seems that what they were doing was some kind of things somehow similar to this.\n\n0:34:03\tSPEAKER_08\n Did work together with Nokia?\n\n0:34:06\tSPEAKER_08\n Palo Alto.\n\n0:34:07\tSPEAKER_08\n No.\n\n0:34:08\tSPEAKER_08\n Montevideo.\n\n0:34:09\tSPEAKER_02\n I just take a quick look at the thing because I was read about this a long time ago.\n\n0:34:21\tSPEAKER_02\n And the latest report I found was in 1998.\n\n0:34:28\tSPEAKER_02\n And this report all day.\n\n0:34:29\tSPEAKER_02\n They have some slides, some papers, some a lot of things.\n\n0:34:35\tSPEAKER_02\n And well, the main thing and the quick thing I was looking at was a video available in the MPC and MPC format.\n\n0:34:51\tSPEAKER_02\n One guy with a portable computer moving across different networks.\n\n0:34:57\tSPEAKER_02\n So starting at the SCS department at Berkeley and then going out the street switching to the Acampus White network.\n\n0:35:04\tSPEAKER_02\n I think it's a network network.\n\n0:35:09\tSPEAKER_02\n Which is.\n\n0:35:10\tSPEAKER_02\n It has a free-cutcher.\n\n0:35:13\tSPEAKER_02\n That's right.\n\n0:35:14\tSPEAKER_02\n And then finally switching to, I think it was a CDP or something like this.\n\n0:35:19\tSPEAKER_02\n Okay.\n\n0:35:20\tSPEAKER_02\n As the user is moving out of the coverage area of this second network.\n\n0:35:27\tSPEAKER_02\n And what they have built is a kind of a proxious structure.\n\n0:35:33\tSPEAKER_02\n So they are putting most of the work of this adaptation layer on the side of the proxies.\n\n0:35:41\tSPEAKER_02\n So the client or the server is not changing.\n\n0:35:45\tSPEAKER_02\n It is the proxy, the one that does the work.\n\n0:35:48\tSPEAKER_02\n Okay.\n\n0:35:49\tSPEAKER_02\n So you can even, for example, use.\n\n0:35:51\tSPEAKER_04\n That's the same.\n\n0:35:52\tSPEAKER_04\n And you've got a lot of other proxies.\n\n0:35:54\tSPEAKER_04\n I like them.\n\n0:35:55\tSPEAKER_04\n Okay.\n\n0:35:56\tSPEAKER_04\n I am.\n\n0:35:57\tSPEAKER_02\n It is yesterday that, well, maybe we can take a look at maybe a more in-depth look at this project.\n\n0:36:07\tSPEAKER_02\n Just to see if we are doing the same or if we are doing something similar, it would be important for us to highlight the differences.\n\n0:36:18\tSPEAKER_02\n Because if not all they can say, oh, you are doing the same thing.\n\n0:36:20\tSPEAKER_02\n This was done.\n\n0:36:21\tSPEAKER_08\n Or maybe talk to them about, yeah, well, we are going to stay sort of, but didn't touch it.\n\n0:36:27\tSPEAKER_04\n Maybe a few comments.\n\n0:36:28\tSPEAKER_04\n First of all, we are mind-mind-migurate to avoid the name of the project.\n\n0:36:32\tSPEAKER_04\n Yeah.\n\n0:36:33\tSPEAKER_04\n I think we are going to have problems with everybody.\n\n0:36:35\tSPEAKER_04\n I would send also the pointer.\n\n0:36:37\tSPEAKER_04\n It is me who would send to me to everybody so that everybody can take a look at this project.\n\n0:36:43\tSPEAKER_04\n It was a project.\n\n0:36:44\tSPEAKER_04\n I don't know what information is available.\n\n0:36:47\tSPEAKER_04\n It is a very difficult.\n\n0:36:48\tSPEAKER_04\n It is a project of the UC.\n\n0:36:51\tSPEAKER_05\n Yeah.\n\n0:36:52\tSPEAKER_02\n UC work at Berkeley.\n\n0:36:53\tSPEAKER_02\n When did you go through this?\n\n0:36:55\tSPEAKER_02\n I have seen reports from 1996, 1997 and 1998.\n\n0:37:05\tSPEAKER_02\n Because yesterday was...\n\n0:37:06\tSPEAKER_08\n Maybe the project suddenly jumped into this project, too.\n\n0:37:09\tSPEAKER_08\n It is funny.\n\n0:37:10\tSPEAKER_08\n Yesterday was just surfing a little bit.\n\n0:37:16\tSPEAKER_08\n From Nokia, I came to this project.\n\n0:37:20\tSPEAKER_08\n I think that the leader was Professor Katz.\n\n0:37:24\tSPEAKER_08\n Professor Katz.\n\n0:37:25\tSPEAKER_08\n That is right.\n\n0:37:26\tSPEAKER_08\n He is also board in Nokia.\n\n0:37:28\tSPEAKER_08\n Okay.\n\n0:37:29\tSPEAKER_04\n We should show.\n\n0:37:30\tSPEAKER_04\n The second thing is that, down the Christlosser, the part of the Esperanto-Spanish Germany, all is doing it, but the same with the car.\n\n0:37:39\tSPEAKER_04\n They have a specific antenna for GSM or GPS and a few general antenna GSM networks and wireless LAN and other network technology.\n\n0:37:51\tSPEAKER_04\n In the roof of the car, there is a lot of service in the one-crossed car.\n\n0:37:58\tSPEAKER_04\n They collect data out of it.\n\n0:38:00\tSPEAKER_04\n It was handoff and all this kind of stuff.\n\n0:38:02\tSPEAKER_04\n They drive around, they have different airways and the same car exists here in Palo Alto.\n\n0:38:07\tSPEAKER_04\n Based on wireless LAN, GSM and other people's share networks.\n\n0:38:11\tSPEAKER_04\n They collect data.\n\n0:38:12\tSPEAKER_04\n They collect single-legged of data concerning the seamless handoffs and then it works very well with speed.\n\n0:38:19\tSPEAKER_04\n Thomas is going to build mobile IP staff in their service because they want to use current technology with a combination of mobile IP.\n\n0:38:36\tSPEAKER_04\n I think there are a lot of activities in there.\n\n0:38:40\tSPEAKER_04\n My search for something in Z-direction is quite different from the Z- here.\n\n0:38:48\tSPEAKER_04\n But anyway, maybe there is a core technology with a real product in mind.\n\n0:38:53\tSPEAKER_04\n I see some difficulty because nobody currently has here a certain kind of GSM network.\n\n0:39:01\tSPEAKER_04\n You need a definite because it must be your Bible I would like to say that you are very family members.\n\n0:39:08\tSPEAKER_04\n You want to go in that way.\n\n0:39:12\tSPEAKER_04\n As far as I know the UMTS is not aization, it is not finished yet.\n\n0:39:19\tSPEAKER_02\n Let me ask you a question about EMTS or third or possible fourth-generation wireless communication system.\n\n0:39:30\tSPEAKER_02\n From the point of view of the user, is there something more speed?\n\n0:39:40\tSPEAKER_02\n Is there any other advantage from the point of view of the user or the term?\n\n0:39:46\tSPEAKER_04\n New usage of UMTS.\n\n0:39:48\tSPEAKER_04\n You can request certain kind of QS.\n\n0:39:51\tSPEAKER_04\n You can't even request it in GPS but it is not the end-to-end quality of service.\n\n0:39:57\tSPEAKER_04\n It is only the gateways.\n\n0:40:01\tSPEAKER_04\n Within the core network there are certain kind of talent set-up.\n\n0:40:10\tSPEAKER_04\n You use some kind of talent mechanism to combine the portable, the base station, cluster control device.\n\n0:40:18\tSPEAKER_04\n This is controlled by a certain kind of port.\n\n0:40:21\tSPEAKER_04\n And you have the gate bit with the PDN, the public data network.\n\n0:40:24\tSPEAKER_04\n But in big bose there is a certain kind of talent set-up.\n\n0:40:28\tSPEAKER_02\n But in fact now at the ESM level what you have is that every voice channel you use provides a pretty fine, affixed data speed.\n\n0:40:41\tSPEAKER_02\n So we can say that every voice channel has an implied quality of service, which is 90-600, which per second, full loop, double X.\n\n0:40:58\tSPEAKER_04\n You mean all the GSM and all?\n\n0:41:01\tSPEAKER_04\n So what does the quality of service mean?\n\n0:41:06\tSPEAKER_02\n Not only because of the data speed but also about delay, you know, because GSM networks were developed with a voice service in mind, delay is also considered in these networks.\n\n0:41:25\tSPEAKER_02\n So in fact for every voice channel you have a predefined maximum delay and a specified data speed. So you can scale up this thing by using several channels.\n\n0:41:46\tSPEAKER_02\n So in fact you have using just GSM technology, you have more or less the same building blocks as you can get with the UMTS.\n\n0:41:58\tSPEAKER_02\n I mean that one thing is that the technology is a little bit different, that the base station thing is different and maybe the internal routing inside the network is different. But from the point of view of the mobile things, I'm not sure if...\n\n0:42:16\tSPEAKER_04\n It's not really circuit-switch.\n\n0:42:20\tSPEAKER_04\n UMTS you have one of the GPS as an involvement, it's a core network.\n\n0:42:25\tSPEAKER_04\n You have a principle, the parts but still is available for the GSM network because it was a principle, the same mechanism.\n\n0:42:34\tSPEAKER_04\n But you also have a packet oriented communication, that's a GPS though.\n\n0:42:40\tSPEAKER_04\n And that's also related to EPRS.\n\n0:42:43\tSPEAKER_02\n Yeah, but you know it is also being developed this year for EPRS thing, which is a packet data over the ESM.\n\n0:42:55\tSPEAKER_02\n So I mean I don't see that a lot of difference, we can expect a lot of differences from the mobile terminal point of view when UMTS be deployed.\n\n0:43:10\tSPEAKER_02\n What I'm trying to say is that well maybe it is not a big problem that any of us where UMTS expert because I don't see it.\n\n0:43:25\tSPEAKER_02\n I think that the UMTS thing is more a technology issue than a research issue.\n\n0:43:31\tSPEAKER_02\n Maybe I'm wrong, just explaining a lot of research, but the question is,\n\n0:43:38\tSPEAKER_04\n is research which does really go?\n\n0:43:41\tSPEAKER_02\n I mean to be done here, not that of course, you know. I agree with you that there are a lot of things to be developed, but the point is that this is probably not here because all you know the orientation of our group which is networks, services and applications, not wireless technology or the underlying wireless technology.\n\n0:44:06\tSPEAKER_05\n You think more about hardware technology?\n\n0:44:09\tSPEAKER_02\n Yeah, the hardware technology, the hardware technology, why not CDMA, these kind of things, or have a lot of things to be researched.\n\n0:44:18\tSPEAKER_02\n But I don't think this is not something we are doing.\n\n0:44:23\tSPEAKER_04\n But having a mind to picture is a little bit different.\n\n0:44:26\tSPEAKER_04\n The picture I have in my concern with ERTS is first of all that you use UMTS only for voice.\n\n0:44:31\tSPEAKER_04\n Like we did it when we are doing now for GSM, it's not worse to have this kind of network.\n\n0:44:36\tSPEAKER_04\n Currently in Europe, where it will be deployed first, I believe it will be very hard once we look at some money back if you have only for using voice.\n\n0:44:45\tSPEAKER_04\n Because they paid a lot of money.\n\n0:44:47\tSPEAKER_04\n So what is the point? The point is that we use the UMTS to connect to the Internet and have certain kind of services that are still not available up to now.\n\n0:44:55\tSPEAKER_04\n But the problem is that if you have the Internet, content that you have maybe your small device, and the only evolution base for this new technology is for certain mobile phones.\n\n0:45:09\tSPEAKER_04\n Then you have certain kind of product because you cannot use CD.\n\n0:45:12\tSPEAKER_04\n And that is not an answer for this kind of things.\n\n0:45:15\tSPEAKER_04\n So I believe there is a lot of research, I think also if you see the answer of the Internet, from the mobile network up to the certain kind of server, of course, one or whatever, you call this destination.\n\n0:45:26\tSPEAKER_04\n Then you have certain kind of models for instance, for the quality of server and all these kinds of things.\n\n0:45:30\tSPEAKER_04\n And then this UMTS only one link where you have a certain kind of stuff that they are technology.\n\n0:45:35\tSPEAKER_04\n And you have to perhaps use things anyway.\n\n0:45:37\tSPEAKER_04\n It's like a normal unit that whatever you see it is only an additional and something that they are technology.\n\n0:45:43\tSPEAKER_04\n And we have also things mapped towards the Internet, start with the consequences of this technology.\n\n0:45:51\tSPEAKER_04\n And so as I'm only seeing that the trend is to put more IP technology and not a certain kind of modifications and adaptation towards the access network itself.\n\n0:46:03\tSPEAKER_04\n And there is a lot of potential, I believe, for certain research work.\n\n0:46:10\tSPEAKER_04\n But the question is first of all, do we have the confidence to do something like that?\n\n0:46:15\tSPEAKER_04\n First of all, second, we are not hardware builders in that sense to set up certain kind of end systems.\n\n0:46:22\tSPEAKER_04\n We can design them from the protocol layer and then maybe essence evolutions or whatever.\n\n0:46:29\tSPEAKER_04\n But this is the final outcome really such a device.\n\n0:46:32\tSPEAKER_04\n Portaltight Linux base.\n\n0:46:34\tSPEAKER_04\n And we go around here and we have maybe a GPS base that is born by Ericsson.\n\n0:46:39\tSPEAKER_04\n It's a living on the far away.\n\n0:46:41\tSPEAKER_04\n And then maybe Wafelang connection here in our test bed.\n\n0:46:43\tSPEAKER_04\n And then figure out that it works.\n\n0:46:45\tSPEAKER_04\n So that's not enough.\n\n0:46:49\tSPEAKER_08\n But just to make the list a little bit longer.\n\n0:46:53\tSPEAKER_08\n You could also think about session management.\n\n0:46:56\tSPEAKER_08\n I do go along with the network applications and services.\n\n0:47:00\tSPEAKER_08\n You might know that if you can do it in the end systems or at specific servers, then I'm in favor of that.\n\n0:47:08\tSPEAKER_08\n It's a session management.\n\n0:47:10\tSPEAKER_08\n I mean the authentication, if you go from one network to the other, is not solved to nobody really wants a guest on your network.\n\n0:47:18\tSPEAKER_08\n Unless you get some money from Siouxway through some way.\n\n0:47:22\tSPEAKER_08\n Then there is also the session management in the sense that a lot of these things at the bar one project as you said go through proxies.\n\n0:47:30\tSPEAKER_08\n That might be kind of end offs at proxies.\n\n0:47:33\tSPEAKER_08\n Like the SIP proxy that we also discussed before a little bit.\n\n0:47:39\tSPEAKER_08\n I think also in the line of session management.\n\n0:47:43\tSPEAKER_08\n Then there is this perfect thing, the Berkeley sockets.\n\n0:47:46\tSPEAKER_08\n It's almost perfect.\n\n0:47:48\tSPEAKER_08\n They kind of skipped the layer 5 session management or session layer.\n\n0:47:54\tSPEAKER_08\n That's normally what if you do a socket programming.\n\n0:47:58\tSPEAKER_08\n It's directly the protocol on layer 4 TCP socket or layer 5 for UDP sockets.\n\n0:48:07\tSPEAKER_08\n There might also be some research.\n\n0:48:09\tSPEAKER_08\n Well, could you introduce such a session management?\n\n0:48:13\tSPEAKER_08\n No, what they do right now is they make it part of the application level protocol.\n\n0:48:19\tSPEAKER_08\n That's what they do most often.\n\n0:48:21\tSPEAKER_08\n Like session management.\n\n0:48:23\tSPEAKER_08\n For mobile application such as instant messaging or talks and so on.\n\n0:48:30\tSPEAKER_08\n Like SIP, it's just doing a reconnect.\n\n0:48:33\tSPEAKER_08\n If they think the network is different or different capabilities come into play.\n\n0:48:38\tSPEAKER_08\n They simply do a reconnect.\n\n0:48:40\tSPEAKER_08\n So, that's part of the protocol.\n\n0:48:43\tSPEAKER_08\n That's all what I think about session management.\n\n0:48:46\tSPEAKER_08\n Like part of the proxies or is it an embedded in application level protocols?\n\n0:48:52\tSPEAKER_04\n It's higher level.\n\n0:48:54\tSPEAKER_04\n It's no more related to a network.\n\n0:48:57\tSPEAKER_04\n You have even the network connection.\n\n0:49:00\tSPEAKER_04\n So, what do you want to focus on network services?\n\n0:49:04\tSPEAKER_08\n Well, network applications.\n\n0:49:07\tSPEAKER_08\n If you look at the name of the group, one thing is that the use the call a network that was if it was like distributed between two systems connected by a network.\n\n0:49:22\tSPEAKER_08\n If you look at network from the OZ layer, then it's level 2 or something.\n\n0:49:30\tSPEAKER_08\n Maybe level 3 but everything below 3.\n\n0:49:35\tSPEAKER_08\n So, there are things to different interpretations of a network.\n\n0:49:40\tSPEAKER_04\n I believe the network is if you see it really from the IP protocol suite, is then layer 1 and principle up, including layer 4.\n\n0:49:51\tSPEAKER_04\n Despite the fact that layer 4 is all either side, normally, an end system and an advocate.\n\n0:49:56\tSPEAKER_08\n But are the network applications them?\n\n0:50:00\tSPEAKER_08\n So, the name is network services and applications.\n\n0:50:03\tSPEAKER_08\n So, what could be an example of a network application if you look at the OZ stack?\n\n0:50:09\tSPEAKER_04\n We have, I think, some.\n\n0:50:12\tSPEAKER_04\n Do you see this word application related to a network?\n\n0:50:15\tSPEAKER_04\n Do you see this word independently?\n\n0:50:17\tSPEAKER_04\n That was never discussed indeed to network services and applications or ever think.\n\n0:50:22\tSPEAKER_04\n Okay.\n\n0:50:23\tSPEAKER_04\n In the world, or is the application related to the network?\n\n0:50:25\tSPEAKER_04\n For my understanding, and as far as we discussed, so such a long time, these applications, for instance, e-commerce.\n\n0:50:33\tSPEAKER_04\n Okay.\n\n0:50:34\tSPEAKER_04\n And really, you know, together, essentially?\n\n0:50:37\tSPEAKER_04\n No, no.\n\n0:50:38\tSPEAKER_04\n That is a typical application, I think, which is, of course, also related to the network, but not any application.\n\n0:50:46\tSPEAKER_04\n And we also have the aspects for security.\n\n0:50:48\tSPEAKER_04\n Maybe you mentioned here authentication and triple-a, but we do not have any expert anymore because, I think, it is a very important thing to do.\n\n0:50:58\tSPEAKER_04\n So, the problem for me still exists that we have a principle here, basic building blocks in the proposal from the networking side.\n\n0:51:06\tSPEAKER_04\n We could have a certain kind of application, and there's a lot of activities in the outside world, and I believe there's a lot of contacts, and there could be a lot of contacts with these people, especially in Georgia Tech and no one next week on Tuesday.\n\n0:51:25\tSPEAKER_04\n Tuesday, right?\n\n0:51:26\tSPEAKER_04\n We'll go to UCB, three guys.\n\n0:51:29\tSPEAKER_04\n Then Morgan mentioned one.\n\n0:51:32\tSPEAKER_04\n I do not know exactly what he is doing, but he's also interesting in some kind of collaboration.\n\n0:51:40\tSPEAKER_04\n He's also a professor at the UCB, and many universities, my Claudia mentioned, do you spoke?\n\n0:51:47\tSPEAKER_04\n And most of us at the university have some activities in that area.\n\n0:51:51\tSPEAKER_04\n We will not take care about this, but we can use them as, for field access, and maybe some support, and whatever kind of thing.\n\n0:52:02\tSPEAKER_04\n And we focus really on the networking stuff and going in more detail in this area, and the alternative is maybe what kind of TV have, or this proposal from Wilbert to go more on the smallest scope, and figure out some potential for maybe these wavelength, UMTS stuff, and starting from that, or other other success.\n\n0:52:31\tSPEAKER_05\n I think we have already so much work put into this proposal because to switch now.\n\n0:52:38\tSPEAKER_05\n So I don't see the reason for that.\n\n0:52:41\tSPEAKER_05\n Maybe the application we suggested is not the best one.\n\n0:52:46\tSPEAKER_05\n So we have to think about an application, which is for mobile users more relevant.\n\n0:52:56\tSPEAKER_05\n I don't know.\n\n0:52:57\tSPEAKER_05\n Maybe video games.\n\n0:52:58\tSPEAKER_05\n If you are travelling, it's boring to travel, and then you decide to play a video game with somebody else who is travelling.\n\n0:53:07\tSPEAKER_04\n You know, it's still mentioned in the proposal.\n\n0:53:10\tSPEAKER_04\n And I'm sure that it is a wrong place to get the foundation, while we are using this kind of application.\n\n0:53:19\tSPEAKER_04\n But the end of the text, the end of the proposal.\n\n0:53:24\tSPEAKER_04\n But it is mentioned that it is only an example, and that we use this application principle because it's very, very easy to get a certain kind of access to these kind of things.\n\n0:53:35\tSPEAKER_04\n When you have a video game server, and you want to have mobile access, you must at least have one in your consortium or as a partner or whatever, who provides this service.\n\n0:53:48\tSPEAKER_04\n And then we are playing videos of principle if you have a field try.\n\n0:53:54\tSPEAKER_04\n I think much more hard than to have a certain kind of access to the university and to this server, which is one of the campus of the university.\n\n0:54:04\tSPEAKER_04\n That is right.\n\n0:54:05\tSPEAKER_04\n You can have this to figure out all the things and how to say the requirements of these applications, using these classroom scenarios.\n\n0:54:19\tSPEAKER_04\n But now the lesson is not the best video game.\n\n0:54:22\tSPEAKER_04\n It's networking stuff.\n\n0:54:25\tSPEAKER_04\n But does anybody see certain kind of potential here to go on and to start the work, maybe in this little bit smaller scope based on these building blocks?\n\n0:54:44\tSPEAKER_04\n Because my decast is still mentioned, you mentioned that there is no potential, I think.\n\n0:54:48\tSPEAKER_04\n It's described here that's a potential if you use it for the mapping to the next generation networks.\n\n0:54:53\tSPEAKER_04\n It's a wireless, access area.\n\n0:54:56\tSPEAKER_04\n So you still have potential to map my decast because they do not use it.\n\n0:55:03\tSPEAKER_04\n And to figure out whether it's a useful, instead of using certain kind of tunneling mechanism, and to set up these tunnels, I have the mapping between a PSDN telephone number or whatever kind of numbers they are using to IP addresses and then there's a tunnel ID, and all this kind of things, that thing is very beneficial.\n\n0:55:20\tSPEAKER_04\n It has for telecommunication providers, as well as for ISPs.\n\n0:55:27\tSPEAKER_04\n I think the potential is deserial, you know, the lag on your leg-lit, but I don't think so if you're hiding that sense.\n\n0:55:35\tSPEAKER_08\n Well, I think it works, but yes, the mapping, of course, between multi-casting and the UMC has a whatever next generation.\n\n0:55:44\tSPEAKER_08\n That's our CDMA or whatever.\n\n0:55:46\tSPEAKER_08\n That's probably a thing that has to be found out.\n\n0:55:52\tSPEAKER_08\n I don't know what status is, maybe they already did it, as part of UMC, as I'm sure.\n\n0:55:57\tSPEAKER_08\n I don't have a clue.\n\n0:55:59\tSPEAKER_08\n I only know how to work on copper and like ethernet and BSPB over something, and how it works like that, but I'm wireless, I'm not sure.\n\n0:56:09\tSPEAKER_04\n Now, what do you see about KPN interests?\n\n0:56:17\tSPEAKER_04\n Because I believe the argument chain is as follows, that you are here and that you are very familiar with, or is the multi-cast stuff, and KPN is very interesting and UMTS stuff, and this is one potential target, network environment we are focusing on, but only for the IP layer technology.\n\n0:56:39\tSPEAKER_04\n Then the mapping of multi-cast, or the potential mapping of multi-cast, I think must be of major interest for the wide.\n\n0:56:48\tSPEAKER_08\n Well, yes, but if it's available, that means, so if it's already part of the UMTS standardization, then it's immediately finished, like KPN will go to Iliq Sonor Nokia and buy it, and if it's not in there yet, well, it could be a suggestion, and then the hardware people will make a part, like the Etsy or whatever UMTS is being standardized, they will go for it.\n\n0:57:21\tSPEAKER_08\n Of course, this group could do that too.\n\n0:57:23\tSPEAKER_08\n It could be, but...\n\n0:57:25\tSPEAKER_02\n I have an important doubt about the IP availability over UMTS.\n\n0:57:33\tSPEAKER_02\n I mean, you know that the carriers and some manufacturers have done an important effort in developing this web thing, and I'm not sure what they plan to do with the next generation.\n\n0:57:48\tSPEAKER_02\n I mean, are they maintaining, are they holding the same web technology, or are just discarding this technology?\n\n0:57:57\tSPEAKER_02\n I'm forgetting about the thing.\n\n0:57:59\tSPEAKER_02\n I don't know what will happen.\n\n0:58:01\tSPEAKER_02\n I don't have a clue, probably, if after searching a little bit on the net, I can get the answer, but initially, this is something to have in mind.\n\n0:58:13\tSPEAKER_02\n I mean, because maybe this UMTS thing will appear on the market without IP as a native protocol.\n\n0:58:22\tSPEAKER_02\n And if this is the case, well, this seamless integration could be strongly affected.\n\n0:58:29\tSPEAKER_02\n If you...\n\n0:58:31\tSPEAKER_02\n we want to use UMTS, and that's throwing the question.\n\n0:58:38\tSPEAKER_02\n I mean, looking for an answer, because I don't know if some of you have a clue about this.\n\n0:58:44\tSPEAKER_02\n I don't know what carriers are planning to do about this.\n\n0:58:51\tSPEAKER_08\n I'm not really sure, but I thought I had the impression that we can throw away our Nokia stuff or our webkates waste when we even go to the GPS.\n\n0:59:02\tSPEAKER_08\n So that alone UMTS.\n\n0:59:07\tSPEAKER_04\n But you're not only related now to available bad, Z not the only thing that's on this adaptation towards the capabilities of the anti-mys.\n\n0:59:16\tSPEAKER_04\n Right?\n\n0:59:17\tSPEAKER_04\n Yeah.\n\n0:59:18\tSPEAKER_04\n It's still a lot of...\n\n0:59:20\tSPEAKER_08\n It's a fundamental...\n\n0:59:22\tSPEAKER_08\n It's part of design.\n\n0:59:25\tSPEAKER_08\n The terminal has a WAP stack.\n\n0:59:29\tSPEAKER_08\n And there's a box that has also a WAP stack.\n\n0:59:32\tSPEAKER_08\n And they do sometimes, most cases, they do share an IP address.\n\n0:59:37\tSPEAKER_08\n It doesn't have to deal with IP at all.\n\n0:59:40\tSPEAKER_08\n It's just a 30-bit number that actually isn't a signed number.\n\n0:59:45\tSPEAKER_08\n But it's all only used for identification.\n\n0:59:47\tSPEAKER_08\n That's the only thing.\n\n0:59:48\tSPEAKER_08\n It's stored in a WAP cookie, much like HTTP.\n\n0:59:51\tSPEAKER_08\n In the cookie and from the WAP gateway, then it will be HTTP, a real HTTP or something.\n\n0:59:57\tSPEAKER_08\n So it's really a different type of connection.\n\n1:00:02\tSPEAKER_08\n It looks a little bit like...\n\n1:00:05\tSPEAKER_08\n Well, WML looks a little bit like HTML, but that's all what's...\n\n1:00:09\tSPEAKER_08\n It's not IP at all.\n\n1:00:11\tSPEAKER_08\n Because there is a gateway you can access with...\n\n1:00:13\tSPEAKER_08\n almost the same micro browser, the same web server.\n\n1:00:19\tSPEAKER_08\n If they provide the right content, the speed out the right...\n\n1:00:23\tSPEAKER_08\n WML language.\n\n1:00:26\tSPEAKER_08\n So it's really a different network technology, I think.\n\n1:00:29\tSPEAKER_04\n It's transparent, it's a possible word to can carry, but anyway, you have to gateway.\n\n1:00:36\tSPEAKER_04\n It must be the conversion of the media.\n\n1:00:40\tSPEAKER_04\n But the content is a possible...\n\n1:00:43\tSPEAKER_04\n I don't see that...\n\n1:00:45\tSPEAKER_04\n It's too late.\n\n1:00:47\tSPEAKER_04\n WAP was available in the beginning of GSM.\n\n1:00:50\tSPEAKER_04\n It's interesting that there's a good chance that it is where it is deployed.\n\n1:00:54\tSPEAKER_04\n But now the first generation of...\n\n1:00:56\tSPEAKER_04\n Web browsers are in the hand, and I put say, hand, so only in the mobile phones.\n\n1:01:02\tSPEAKER_04\n But the next generation of networks are still available.\n\n1:01:06\tSPEAKER_04\n And the bandwidth constraints are no more.\n\n1:01:09\tSPEAKER_08\n Right now, there is still a lot of WAP, actually.\n\n1:01:13\tSPEAKER_04\n But the high part...\n\n1:01:15\tSPEAKER_04\n Well, all users.\n\n1:01:16\tSPEAKER_04\n And you never saw a user using WAP.\n\n1:01:18\tSPEAKER_04\n Please raise your hand to his using WAP.\n\n1:01:20\tSPEAKER_08\n My colleagues are...\n\n1:01:22\tSPEAKER_08\n Yeah, very user-wap.\n\n1:01:24\tSPEAKER_04\n I don't have a mobile phone.\n\n1:01:27\tSPEAKER_08\n Well, you don't have mobile phone in the USA here?\n\n1:01:33\tSPEAKER_08\n No.\n\n1:01:34\tSPEAKER_08\n So that's maybe the reason.\n\n1:01:36\tSPEAKER_08\n And I doubt that it's not available in Germany.\n\n1:01:39\tSPEAKER_08\n It would be unbelievable to me.\n\n1:01:41\tSPEAKER_08\n Do you see the chance for WAP?\n\n1:01:43\tSPEAKER_08\n It is.\n\n1:01:45\tSPEAKER_08\n And Sweden is also there.\n\n1:01:47\tSPEAKER_08\n And in the Netherlands, it's also available.\n\n1:01:49\tSPEAKER_08\n Have you provided...\n\n1:01:50\tSPEAKER_02\n In Spain is available, but you know, my main complaint has been all the time that it's difficult to me to believe that I can do an interesting work with a four lines display.\n\n1:02:06\tSPEAKER_02\n Oh, yeah.\n\n1:02:07\tSPEAKER_02\n Maybe check the lottery results.\n\n1:02:09\tSPEAKER_02\n Or something like this.\n\n1:02:11\tSPEAKER_08\n I'm the first one to admit that it is a hype.\n\n1:02:15\tSPEAKER_08\n But I just want to say it is being used.\n\n1:02:19\tSPEAKER_08\n But if it makes sense to me, and especially to have WAP in between, no, I'm not a supporter of it.\n\n1:02:27\tSPEAKER_08\n So they have this optimized protocol to transmit a few ASCII bites that can re-fresh the screen with a different animation every...\n\n1:02:37\tSPEAKER_08\n Well, second, a few times.\n\n1:02:40\tSPEAKER_08\n So that's...\n\n1:02:42\tSPEAKER_08\n I immediately agree with the thing was you just asked, well, will it be the same? Will there be WAP for UMC as in one?\n\n1:02:49\tSPEAKER_08\n Oh.\n\n1:02:50\tSPEAKER_08\n And I don't know why.\n\n1:02:52\tSPEAKER_08\n I don't have the answer, but I thought it was not.\n\n1:02:54\tSPEAKER_08\n I'm just curious that we have to stop doing it with GPUs.\n\n1:03:00\tSPEAKER_06\n But usually WAP shouldn't...\n\n1:03:04\tSPEAKER_06\n It's so general that it can be used with UMC.\n\n1:03:07\tSPEAKER_06\n So if you still want to use WAP with UMC, you might be able to do it.\n\n1:03:14\tSPEAKER_06\n Yes.\n\n1:03:15\tSPEAKER_08\n That shouldn't be the only way.\n\n1:03:17\tSPEAKER_08\n If you want to do it in a mobile phone, you want to implement it.\n\n1:03:20\tSPEAKER_08\n Is it a light stack or something?\n\n1:03:22\tNone\n Yes.\n\n1:03:23\tSPEAKER_06\n But usually that's not the reason to have UMC as.\n\n1:03:29\tSPEAKER_08\n No.\n\n1:03:30\tSPEAKER_08\n Not if you have a big WAP or something, then there is no IP stack in it.\n\n1:03:39\tSPEAKER_04\n So maybe I would like to ask Cloud that you had a proposal at the meantime?\n\n1:03:43\tSPEAKER_04\n Yes.\n\n1:03:44\tSPEAKER_01\n But it has changed really a lot.\n\n1:03:46\tSPEAKER_01\n I'd rather like to...\n\n1:03:47\tSPEAKER_04\n Do you have some comments on it?\n\n1:03:50\tSPEAKER_04\n From the next, this is version 0.5.\n\n1:03:53\tSPEAKER_04\n Yes.\n\n1:03:54\tSPEAKER_01\n But I'd rather like to follow the discussion before I gave any comments, because it's really...\n\n1:04:00\tSPEAKER_01\n First point is, it's much more than it was before I left, so it's like, probably a week's in between, like, that big now.\n\n1:04:07\tSPEAKER_01\n And it really changed the...\n\n1:04:10\tSPEAKER_01\n I mean, I found the classroom inside, but the thing where I left the discussion was that we are talking about a classroom where everybody could log on with any kind of device and follow lectures or do exercise or whatever.\n\n1:04:26\tSPEAKER_01\n So now we are talking about something which is much more precise and the range of stuff is maybe more narrow than before.\n\n1:04:36\tSPEAKER_01\n I'd rather like to follow it a bit and then to get more into the ideas.\n\n1:04:42\tSPEAKER_08\n Can I do another one?\n\n1:04:44\tSPEAKER_08\n Like UMTS or wireless, generally, are...will be more expensive, and especially UMTS, if they want to get back the money.\n\n1:04:55\tSPEAKER_08\n So maybe a research topic to focus on the...\n\n1:04:59\tSPEAKER_08\n not really billing, of course, I mean, but at least the different application or protocol-based usage.\n\n1:05:07\tSPEAKER_08\n So you have one connection, one application uses FTP, whatever, with voice or some other...\n\n1:05:14\tSPEAKER_08\n those type of applications you might want to make more out of a megabit per second or something.\n\n1:05:20\tSPEAKER_08\n Could that be something?\n\n1:05:22\tSPEAKER_04\n As if you want to go more as a AAA.\n\n1:05:25\tSPEAKER_04\n Yeah, right.\n\n1:05:26\tSPEAKER_04\n Because...\n\n1:05:27\tSPEAKER_04\n There's a billing alone.\n\n1:05:28\tSPEAKER_04\n No words.\n\n1:05:31\tSPEAKER_04\n Billings is related to accounting, accounting is related to...\n\n1:05:34\tSPEAKER_04\n Ausceptification and consolidation.\n\n1:05:36\tSPEAKER_04\n So as soon as you're asked, that's a AAA service.\n\n1:05:39\tSPEAKER_04\n Yeah.\n\n1:05:40\tSPEAKER_04\n That's right.\n\n1:05:41\tSPEAKER_04\n Activities.\n\n1:05:43\tSPEAKER_04\n And nobody has a skills to deal with that.\n\n1:05:47\tSPEAKER_04\n And then we are leaving ours, go ahead.\n\n1:05:52\tSPEAKER_06\n My impression on this proposal is that every single block has some research done already.\n\n1:06:02\tSPEAKER_06\n So multi-cast, there are many things done.\n\n1:06:06\tSPEAKER_06\n Oh, what was the...\n\n1:06:08\tSPEAKER_06\n There was routing, mobility management.\n\n1:06:12\tSPEAKER_06\n But no one actually put them together.\n\n1:06:15\tSPEAKER_06\n That's the big problem, but the problem with this problem, I think that's too big to put all these pieces together.\n\n1:06:23\tSPEAKER_06\n What do you mean by put together?\n\n1:06:24\tSPEAKER_06\n So that you really have a complete scenario.\n\n1:06:28\tSPEAKER_06\n You have in one scenario multi-cast, quality of service, routing, and mobile networking.\n\n1:06:36\tSPEAKER_06\n Not just the island alone.\n\n1:06:39\tSPEAKER_01\n Yeah.\n\n1:06:41\tSPEAKER_01\n Hope myself back a bit with comments.\n\n1:06:44\tSPEAKER_01\n Because when I left the discussion, the discussion was to have something like a big umbrella about everybody who was at this point here.\n\n1:06:55\tSPEAKER_01\n And so the discussion was much broader than it is maybe right now.\n\n1:06:58\tSPEAKER_01\n And there I had the impression that the umbrella was this kind of classroom thing, right?\n\n1:07:04\tSPEAKER_01\n Or wrong?\n\n1:07:07\tSPEAKER_04\n Yeah, I'm responsible.\n\n1:07:08\tSPEAKER_04\n It is related to the current state.\n\n1:07:10\tSPEAKER_04\n But the net rate is more...\n\n1:07:11\tSPEAKER_01\n Yeah, it is.\n\n1:07:12\tSPEAKER_04\n Of course.\n\n1:07:13\tSPEAKER_04\n...plained in much more detail.\n\n1:07:14\tSPEAKER_04\n And the broad packages...\n\n1:07:16\tSPEAKER_04\n Better identity, or what could be derived for broad packages.\n\n1:07:19\tSPEAKER_04\n Yeah, yeah.\n\n1:07:20\tSPEAKER_01\n That's clear.\n\n1:07:22\tSPEAKER_01\n But that has not changed.\n\n1:07:23\tSPEAKER_01\n Yeah, that's clear.\n\n1:07:24\tSPEAKER_01\n But then I don't get...\n\n1:07:25\tSPEAKER_01\n Because when we were discussing this stuff weeks ago, I had the impression that everything of these work packages fit together under this one big umbrella.\n\n1:07:40\tSPEAKER_01\n And now it sounds different.\n\n1:07:42\tSPEAKER_01\n So that's what I don't understand.\n\n1:07:46\tSPEAKER_01\n But it's also because I missed the last four weeks.\n\n1:07:50\tSPEAKER_04\n The problem is...\n\n1:07:51\tSPEAKER_01\n It's a bit hard for me to follow the development what happened last four weeks, why...\n\n1:07:56\tSPEAKER_01\n Maybe one sentence.\n\n1:07:57\tSPEAKER_04\n...the one sentence.\n\n1:07:58\tSPEAKER_04\n If you're focusing on the argument chain as follows, I have an application.\n\n1:08:03\tSPEAKER_04\n This application has certain kind of requirements.\n\n1:08:06\tSPEAKER_04\n These requirements are maybe multi-cast and then quality of service and mobility access and mobility management.\n\n1:08:15\tSPEAKER_04\n And that is what I want to focus on.\n\n1:08:18\tSPEAKER_04\n Then you have a mind that you must have in mind that all other applications and all other networking stuff is not affected by this.\n\n1:08:27\tSPEAKER_04\n That you can use it with every application.\n\n1:08:29\tSPEAKER_04\n And if you introduce some new mechanism in the network that is not related only to interactive multimedia application that's a classroom, it must be fit and to end.\n\n1:08:38\tSPEAKER_04\n And if you assume something like we discussed it very hard with multi-cast, that you assume that multi-cast will be available certain portions of the network or you want to have it end to end.\n\n1:08:51\tSPEAKER_04\n This mechanism must be applied really from the outside the internet.\n\n1:08:55\tSPEAKER_04\n It makes no sense and then we can't do the conclusion.\n\n1:08:58\tSPEAKER_04\n Okay, multi-cast, we must deal with both approaches.\n\n1:09:02\tSPEAKER_04\n That you have application layer multi-cast as well as maybe some multi-cast and maybe really multi-cast.\n\n1:09:10\tSPEAKER_04\n And then the point is how to select these mechanisms if you want to have not a certain kind of access to the server, elsewhere in the network, you want to use any application.\n\n1:09:22\tSPEAKER_01\n So if I understand it right, what has changed just before we were focusing on, so because what's difficult for me is what is meant by application.\n\n1:09:31\tSPEAKER_01\n So because I have sometimes the impression that everybody is defining application in a different way.\n\n1:09:36\tSPEAKER_01\n So what exactly is meant by application?\n\n1:09:40\tSPEAKER_04\n The application for instance here, that's the interactive class rule.\n\n1:09:44\tSPEAKER_04\n But because we have any application in any kind of video or whatever kind of interactive multimedia, especially down streaming applications, maybe video on demand, then whatever kind of application you can consider.\n\n1:10:02\tSPEAKER_01\n So what has changed is that we're not only focusing on this intelligent classroom but on everything.\n\n1:10:09\tSPEAKER_04\n Not on aerosic, that's not true.\n\n1:10:12\tSPEAKER_04\n That's why we say here that we have a certain kind of possibility to change in the access networks.\n\n1:10:21\tSPEAKER_04\n That means the wireless networks, because that provides and responsibility.\n\n1:10:27\tSPEAKER_04\n And you see that there's a trend to provide IP functionality and more in these kind of networks.\n\n1:10:33\tSPEAKER_04\n But the problem is that you could not focus on these kind of technology only for the access network.\n\n1:10:40\tSPEAKER_04\n You have to have in mind all the way to end scope.\n\n1:10:43\tSPEAKER_04\n And if you see for instance we have for outing algorithm and different protocols and whatever kind of things, especially also for multi-cast.\n\n1:10:51\tSPEAKER_04\n Different things really for different providers.\n\n1:10:54\tSPEAKER_04\n And it's very easy to change it maybe in the access network or normal things.\n\n1:11:01\tSPEAKER_04\n For instance, that's one provider domain and you can say, why not use active routing instead of provider domain.\n\n1:11:07\tSPEAKER_04\n So we'll pick it up and the information you do that have separation of routing and then the programming process.\n\n1:11:13\tSPEAKER_04\n It's impossible to deal with that in the whole internet because security reasons and whatever kind of things make it impossible.\n\n1:11:20\tSPEAKER_04\n So how to combine these potential extension in the access networks without losing the end-to-end scope in the internet.\n\n1:11:34\tSPEAKER_04\n Then you can have certain novel features, give the providers like VPN or whatever, the potential and principle to see the building blocks for their future networks because there's a switch, search generation like UMTS, a fourth generation, more IP related.\n\n1:11:52\tSPEAKER_04\n There will be a fifth generation, I'm sure.\n\n1:11:54\tSPEAKER_04\n And then you derive a certain kind of building blocks for the internet, if you have really a full IP ant2a.\n\n1:12:02\tSPEAKER_04\n But nevertheless, you can only focus on, okay, I provide this mechanism because you are accessing a certain kind of server and load in the internet using any application.\n\n1:12:12\tSPEAKER_04\n And then this mechanism must fit in there.\n\n1:12:14\tSPEAKER_04\n But nevertheless, the internet backbone is in the meantime based on its success, impossible to change.\n\n1:12:20\tSPEAKER_04\n You see the difficulty of this IP version 6.\n\n1:12:23\tSPEAKER_04\n You see the difficulty of this multiclass.\n\n1:12:25\tSPEAKER_04\n It's a very discussed since 10 years or whatever.\n\n1:12:28\tSPEAKER_04\n It's a specification, how are the stable and available.\n\n1:12:32\tSPEAKER_04\n But we have only islands in it.\n\n1:12:34\tSPEAKER_04\n We cannot assume that everything is ant2a and available.\n\n1:12:37\tSPEAKER_04\n And so we have to have in mind that certain kind of mechanisms are maybe at a certain stage ant2a and available.\n\n1:12:45\tSPEAKER_04\n Maybe you have a lucky set, the islands are connected to each other.\n\n1:12:48\tSPEAKER_04\n It's the same place for MPL, S for instance.\n\n1:12:51\tSPEAKER_04\n Maybe they are only portions available.\n\n1:12:53\tSPEAKER_04\n How to deal with the islands is not available.\n\n1:12:56\tSPEAKER_04\n And maybe nothing is available.\n\n1:12:59\tSPEAKER_04\n But you have to select it because I have a mobile phone, a mobile note, or whatever kind of device.\n\n1:13:04\tSPEAKER_04\n And I want to contact a certain kind of content in the internet.\n\n1:13:08\tSPEAKER_04\n So is it possible to have certain kind of novel features in the access network without losing the ant2a and scope with these difficult as we are dealing with?\n\n1:13:17\tSPEAKER_04\n I always say that the success of the internet makes it unfluxable.\n\n1:13:21\tSPEAKER_04\n It's impossible to change something very easily.\n\n1:13:25\tSPEAKER_04\n It's easy maybe more than the access network as an internet network.\n\n1:13:28\tSPEAKER_04\n So that is an overall picture that we have in mind with these things.\n\n1:13:33\tSPEAKER_04\n And we can not, we are six people, seven or whatever.\n\n1:13:37\tSPEAKER_04\n We are not able to solve the problems in a few years or whatever.\n\n1:13:44\tSPEAKER_04\n What the whole internet community has done since a decade.\n\n1:13:51\tSPEAKER_04\n But we can pick up some potential and to start with something.\n\n1:13:59\tSPEAKER_04\n And that's my missing point.\n\n1:14:01\tSPEAKER_04\n The half-year principle really is a description of these problems.\n\n1:14:05\tSPEAKER_04\n I mentioned.\n\n1:14:06\tSPEAKER_04\n And focus really on the reason that it's size of the project, maybe in the first stage for the NSA core itself.\n\n1:14:13\tSPEAKER_04\n And maybe possible extension from, for instance, if KP hands against it's great.\n\n1:14:19\tSPEAKER_04\n It's a light direction.\n\n1:14:20\tSPEAKER_04\n We will support it.\n\n1:14:21\tSPEAKER_04\n And as even say, okay, great.\n\n1:14:22\tSPEAKER_04\n We will support it.\n\n1:14:23\tSPEAKER_04\n And then we'll do it.\n\n1:14:25\tSPEAKER_04\n You can diversity of Berlin is something and maybe you will be able to do it one language, use programming, Spain or whatever.\n\n1:14:30\tSPEAKER_04\n Say, yes, we have also similar project.\n\n1:14:33\tSPEAKER_04\n Then you have only to take care about it.\n\n1:14:35\tSPEAKER_04\n It's a little bit aligned that is sometimes parents.\n\n1:14:37\tSPEAKER_04\n You can certainly see the result.\n\n1:14:39\tSPEAKER_04\n The activities are a little bit going in the same pace.\n\n1:14:46\tSPEAKER_04\n So that's a basic idea.\n\n1:14:47\tSPEAKER_04\n But really it's to figure out certain kinds of smaller activities where we can start.\n\n1:14:53\tSPEAKER_04\n And if you get some funding back, and we have certain potential partners in the boat, we can go to a broader scope of this.\n\n1:15:02\tSPEAKER_02\n Let me propose a reasoning way.\n\n1:15:06\tSPEAKER_02\n Let's assume that we are successful with this proposal.\n\n1:15:10\tSPEAKER_02\n So we get the funding to do whatever we want to do.\n\n1:15:15\tSPEAKER_02\n So my question is what we want to do is, let's assume that we have the funding.\n\n1:15:21\tSPEAKER_02\n What will be our first and second steps?\n\n1:15:26\tSPEAKER_02\n What kind of things we will buy?\n\n1:15:31\tSPEAKER_02\n What kind of things we will program?\n\n1:15:35\tSPEAKER_02\n Or we will deploy.\n\n1:15:38\tSPEAKER_02\n Because answering these questions, we can know much better what the application we want.\n\n1:15:48\tSPEAKER_04\n So let's assume the problem is the funding is a second step.\n\n1:15:54\tSPEAKER_08\n Well, I'm not sure.\n\n1:15:55\tSPEAKER_08\n I think I agree with him.\n\n1:15:57\tSPEAKER_08\n Right now we're looking at it.\n\n1:16:00\tSPEAKER_08\n You want to do a big thing instead of a great thing.\n\n1:16:03\tSPEAKER_08\n So if you assume that it should connect really good to Siemens and to KPN, then it starts to get big.\n\n1:16:11\tSPEAKER_08\n And we should all go to the same direction.\n\n1:16:13\tSPEAKER_08\n If you already assume, well, they paid money.\n\n1:16:16\tSPEAKER_08\n And now you think, what's the great thing you want to do?\n\n1:16:20\tSPEAKER_08\n And gives you more freedom to think about this great thing you want to do.\n\n1:16:26\tSPEAKER_04\n But they have no carbon or public funding.\n\n1:16:31\tSPEAKER_08\n But you don't get one if you try to align KPN with Siemens, for instance.\n\n1:16:37\tSPEAKER_06\n But for theoretically or for a historical reason, it's a really good question.\n\n1:16:41\tSPEAKER_06\n This we would have the money.\n\n1:16:43\tSPEAKER_06\n What would we do with that?\n\n1:16:45\tSPEAKER_06\n So if we don't know what we would like to do with the money, we probably wouldn't get any money to do what we don't know.\n\n1:16:54\tSPEAKER_06\n So that's why I think it's a good question.\n\n1:16:57\tSPEAKER_04\n Now that's a point where I'm focusing on more on the, I want to have really the activities.\n\n1:17:03\tSPEAKER_04\n What is really the problem?\n\n1:17:05\tSPEAKER_04\n What is really the problem we are going to solve?\n\n1:17:07\tSPEAKER_04\n That's a my question.\n\n1:17:08\tSPEAKER_04\n If you have identified this block, then it is possible to raise some money.\n\n1:17:14\tSPEAKER_06\n Let's just the same question.\n\n1:17:16\tSPEAKER_02\n Let me put an example.\n\n1:17:18\tSPEAKER_02\n Some days ago, I bought some of you these kind of things.\n\n1:17:24\tSPEAKER_02\n This is a BDA, a three-comb file, a combined, nothing, nothing that great, but it has some possibility of being expanded.\n\n1:17:34\tSPEAKER_02\n But the only, the only, the only thing I can put on this is just this Omni-Sky Modem, which is, I think it is a subscription based thing.\n\n1:17:48\tSPEAKER_02\n You have to pay every month.\n\n1:17:51\tSPEAKER_02\n And of course, I cannot imagine that tomorrow I'll be able to buy a different thing with four different networks, four different providers on it.\n\n1:18:03\tSPEAKER_02\n Maybe I'm wrong, but if I have the funding, I say, well, I can buy this or even I can buy a mobile computer, a notebook.\n\n1:18:11\tSPEAKER_02\n A lot more expensive, but that's okay.\n\n1:18:14\tSPEAKER_02\n I have the funding.\n\n1:18:15\tSPEAKER_02\n Then I can add a couple of cards at most, the majority of the notebooks only have two PC card type two slots.\n\n1:18:25\tSPEAKER_02\n So in the better case, maybe I'm only able to add two different networks to this thing.\n\n1:18:33\tSPEAKER_02\n So the difficulty I see is that if you want to think in three, four different technologies, maybe we are too advanced to, let's say, two in advance for the current technology, which is not bad, but I'm just saying that it will be able, sorry, it will be difficult for us to develop a reasonable test bed with the available technology.\n\n1:19:06\tSPEAKER_02\n If somebody tells us, okay, now here you have the thing and just put this four networks you want on the thing.\n\n1:19:12\tSPEAKER_02\n How can I do it?\n\n1:19:14\tSPEAKER_02\n Now.\n\n1:19:15\tSPEAKER_02\n So I'm still trying to, you know, to get used to all the ideas and to see that all the things are really connecting because this is the most difficult thing I see to get this alignment to this connection point among the different things we are trying to align.\n\n1:19:39\tSPEAKER_02\n So that's why I was proposing this question.\n\n1:19:42\tSPEAKER_02\n Let's ask you, we have the funding.\n\n1:19:44\tSPEAKER_02\n Now, let's proceed.\n\n1:19:46\tSPEAKER_02\n What kind of things we can buy, we can put together, we can program.\n\n1:19:50\tSPEAKER_02\n Because at the end, somebody will be asking us, okay, did you do your homework?\n\n1:19:57\tSPEAKER_02\n Did you do what you...\n\n1:19:59\tSPEAKER_04\n So, for my point of view, in the beginning, one more time, if I see the four building blocks and I could speak only for my skills, I believe to derive a certain kind of course, advanced scheme, much more general as it is done for us, I.A.\n\n1:20:33\tSPEAKER_04\n But mapped generally to design network, subnet layer technologies.\n\n1:20:38\tSPEAKER_04\n But for different networks?\n\n1:20:41\tSPEAKER_04\n Yes, for point of view.\n\n1:20:43\tSPEAKER_04\n No, for UMTS, but first of all, it's generic system, but because you can have several mechanisms, really using certain kind of quantitative description, you can have more qualitative description, you can have taken into account moving patterns and whatever kind of thing.\n\n1:21:04\tSPEAKER_04\n There are a lot of ways to have certain kind of course, elevation and advanced.\n\n1:21:08\tSPEAKER_04\n I see it's definitely necessary to have this one.\n\n1:21:11\tSPEAKER_04\n If I want, in mobile and I want to have not an introduction of that in my application, quality of service.\n\n1:21:18\tSPEAKER_04\n But then, to go for instance to UMTS, pick out what is available within UMTS.\n\n1:21:24\tSPEAKER_04\n If I really have an IP application where I need this kind of quality of service and having a mindset, certain kind of who has will be available in the rest of the internet.\n\n1:21:35\tSPEAKER_04\n So how can I map these things to the UMTS stuff?\n\n1:21:39\tSPEAKER_04\n And what is the trend towards UMTS to the first generation and how it is possible to map this one to this technology?\n\n1:21:46\tSPEAKER_04\n And if you have the building blocks identified, what is really necessary for who has in advance for mobile systems, then you have the principle, the ideas for the following generation, what you could improve.\n\n1:22:01\tSPEAKER_04\n Because then you are maybe no more related to these kind of things.\n\n1:22:05\tSPEAKER_04\n I believe the same applies for multi-cars and I believe the same applies for routing.\n\n1:22:11\tSPEAKER_04\n So in principle, in the beginning there would be a certain kind of paper word, anyway some theoretical examination of these problems.\n\n1:22:21\tSPEAKER_04\n And then some prototypes must be derived from that.\n\n1:22:26\tSPEAKER_04\n And then maybe we will start here with this certain kind of test-part equipment we still have here.\n\n1:22:31\tSPEAKER_04\n We have for PC's available, maybe we have to extend it and figure out some real scenarios.\n\n1:22:38\tSPEAKER_04\n And maybe then because hopefully then we have with the money also not only for the group, but it would be great, but there are also some sponsors and then we have a certain kind of field try.\n\n1:22:51\tSPEAKER_04\n But I think that's it's a long way, that's it.\n\n1:22:56\tSPEAKER_04\n In the beginning we must have a certain kind of theoretical framework with relevant technology, real technology.\n\n1:23:06\tSPEAKER_04\n Maybe you can start with GPS or UMTS or whatever, because these technology would definitely be available in Europe.\n\n1:23:13\tSPEAKER_04\n There's so many, spend on it so that it will be in a certain kind of flavor.\n\n1:23:19\tSPEAKER_04\n And you would be also available in the USA because there is a big harmonization effort, despite the fact that they are not aligned to each other anyway, but they will have also certain kind of search generation of positive elements.\n\n1:23:36\tSPEAKER_04\n So and after this theoretical framework, if this one is aligned with KU, you have some specification and you set up some line also for EBSD or whatever kind of product.\n\n1:23:45\tSPEAKER_04\n So that is what I have in mind with that. And then, okay, then you will see.\n\n1:23:54\tSPEAKER_04\n The problem is which I see is that it could be fruitful to standardization, that it could be fruitful to some extent to telecommunication providers.\n\n1:24:09\tSPEAKER_04\n But there is not a real product, like you say. There's not the selling idea.\n\n1:24:16\tSPEAKER_04\n If you go with something, we will mention, okay, let's have this one here.\n\n1:24:21\tSPEAKER_04\n We have a new PC and a CAA card and then extents some saying in the end system, or what you mentioned here was, you see this for technologies and the working in the end.\n\n1:24:31\tSPEAKER_04\n So you have a device, which you could set.\n\n1:24:34\tSPEAKER_04\n If you go for networking, improvements are principle and understanding the extentization building blocks, there's no product.\n\n1:24:49\tSPEAKER_04\n But it is a long term, it's a long term, I say, work you can do.\n\n1:24:56\tSPEAKER_04\n And it's more related, I believe, to the skills.\n\n1:24:59\tSPEAKER_04\n To more than available, and as I see, it will be available within the end.\n\n1:25:06\tSPEAKER_04\n And the point is, if we focus on these networking, more networking stuff, and some application guys came into the boat and they focused on their applications stuff, whatever this means. We have here the interactive classroom, but it could be another one.\n\n1:25:27\tSPEAKER_04\n It is not representative.\n\n1:25:30\tSPEAKER_01\n But there's something needed to sell it, and I think.\n\n1:25:33\tSPEAKER_04\n Yeah, it is something available.\n\n1:25:36\tSPEAKER_04\n But I don't know, I'm not an application expert.\n\n1:25:39\tSPEAKER_04\n I want to be able to discuss it on the next Tuesday, as I mentioned, anyway.\n\n1:25:45\tSPEAKER_04\n That is my answer to this question, somebody is available.\n\n1:25:50\tSPEAKER_04\n Good thing is that the money is available because everybody is paid here.\n\n1:25:54\tSPEAKER_04\n So that is the money, that's the smallest portion of money, which is available.\n\n1:25:59\tSPEAKER_04\n But first of all, we'll need more, definitely, because maybe the KPN is no more interesting to go.\n\n1:26:07\tSPEAKER_04\n Or we can convince these kinds of things, which we have in mind, companies like KPN.\n\n1:26:17\tSPEAKER_04\n And if we have other such issues, and have this as a long term, and as a core group activity, and this theoretical framework whether it is finished in half a year or a one year, it doesn't matter, of course, because the roadmap for the next generation network is for many years.\n\n1:26:39\tSPEAKER_04\n And before UMTS will be deployed very well, I believe it will become in 2004, something like that.\n\n1:26:50\tSPEAKER_04\n And have an intermediate project, which is related in this direction, something like this, see this handover for two technologies or whatever.\n\n1:26:58\tSPEAKER_04\n This is a smaller portion in the generic framework I would like to see from this proposal.\n\n1:27:03\tSPEAKER_04\n Why not go on this one?\n\n1:27:05\tSPEAKER_04\n I don't know, but that's the point we are sitting here together.\n\n1:27:12\tSPEAKER_04\n But before, deep-myzing, we mentioned it to be very clear that he will go on with a portion of time with his USAA stuff.\n\n1:27:23\tSPEAKER_04\n That's right, that the bad sense.\n\n1:27:25\tSPEAKER_04\n And it's a medical sense, because that means for you, in a certain kind of a certain extent, you are decoupled from networking stuff.\n\n1:27:32\tSPEAKER_04\n And that's your focusing, our mathematical thing, and we're saying network or other things.\n\n1:27:36\tSPEAKER_05\n The network cost and performance evaluation, and especially communication networks, never deal with mobile communication so why not?\n\n1:27:49\tSPEAKER_04\n So there is still all my activity.\n\n1:27:52\tSPEAKER_04\n Maybe a portion of time at the University of Berlin.\n\n1:27:56\tSPEAKER_04\n And independently, I believe that I see a side in the middle of December, and I'm still focused on these Ques and advance schemes, also within Siemens.\n\n1:28:10\tSPEAKER_04\n And also with some projects there.\n\n1:28:12\tSPEAKER_04\n And I believe your outing stuff is also available and you will go back to Spain, right?\n\n1:28:21\tSPEAKER_04\n Yeah, sure.\n\n1:28:22\tSPEAKER_04\n And I'm fortunate. The skills will be always available.\n\n1:28:27\tSPEAKER_04\n If there's a certain kind of project.\n\n1:28:29\tSPEAKER_02\n And the home countries, and not only this, we can even use this platform to get some European projects in the future.\n\n1:28:41\tSPEAKER_02\n Because sometimes, I believe things are available.\n\n1:28:46\tSPEAKER_02\n But I think this will improve over time, I'm sure.\n\n1:28:54\tSPEAKER_02\n So probably this kind of joint work of different countries, the companies, universities.\n\n1:29:00\tSPEAKER_02\n This is usually the best place to put a project on.\n\n1:29:05\tSPEAKER_02\n Because it's involving different partners from different points of view.\n\n1:29:12\tSPEAKER_04\n I will not prevent anybody from getting some cake in here sitting here together.\n\n1:29:16\tSPEAKER_04\n It's very slow and positive.\n\n1:29:19\tSPEAKER_04\n And my last question is for Wilbert.\n\n1:29:21\tSPEAKER_04\n But I think you got the basic idea because it was mostly discussed with you here.\n\n1:29:29\tSPEAKER_04\n This current available, this is a project proposal.\n\n1:29:33\tSPEAKER_04\n Don't you think that KPN could be convinced to go on this way, what I mentioned before?\n\n1:29:38\tSPEAKER_04\n There's no way.\n\n1:29:40\tSPEAKER_04\n They need to definitely be responsible for some kind of service or device or product or whatever.\n\n1:29:47\tSPEAKER_08\n That's right, the status is.\n\n1:29:54\tSPEAKER_04\n Can we both have together?\n\n1:29:57\tSPEAKER_04\n I think it's a little bit more easier.\n\n1:29:59\tSPEAKER_04\n The discussion on Thursday.\n\n1:30:03\tSPEAKER_08\n I'm out for one week and a half.\n\n1:30:07\tSPEAKER_08\n So on Wednesday, Thursday, Friday, I have a workshop with Stanford.\n\n1:30:11\tSPEAKER_08\n The next week I have a week on holiday.\n\n1:30:14\tSPEAKER_04\n Maybe it's enough time for you to consider a little bit more.\n\n1:30:19\tSPEAKER_04\n Good reaction.\n\n1:30:22\tSPEAKER_04\n And we could have a discussion.\n\n1:30:25\tSPEAKER_04\n And maybe this one is an overall work, an important part of it with everybody who could hook in and get certain kind of small portions to solve it.\n\n1:30:36\tSPEAKER_08\n So the only solution for KPN would be that there is a project in this area.\n\n1:30:43\tSPEAKER_08\n So that makes sense to do in this area.\n\n1:30:46\tSPEAKER_08\n This, I mean, the Bay area with a group of few people for something.\n\n1:30:53\tSPEAKER_08\n And that connects to this project.\n\n1:30:55\tSPEAKER_08\n So one, somebody or two, somebody can be found or get money to join this project.\n\n1:31:03\tSPEAKER_08\n But the other four should build a service on top of it that has a clear business focus.\n\n1:31:09\tSPEAKER_08\n Means a UNTS service, basically.\n\n1:31:15\tSPEAKER_04\n Can you consider, as of the meantime, some potential UFTS services besides this one?\n\n1:31:27\tSPEAKER_08\n Yeah, but you see, they ask something pretty strange.\n\n1:31:33\tSPEAKER_08\n They want something pretty strange for me that I think of a service and network service.\n\n1:31:37\tSPEAKER_08\n There are 60 million billion people out there in the world that think of services all day.\n\n1:31:43\tSPEAKER_08\n And try to make a lot of money with it in the form of startups or whatever.\n\n1:31:48\tSPEAKER_08\n And just think of a service like that if I could do this.\n\n1:31:52\tSPEAKER_04\n Yeah, but maybe based on this one, and you see the networking stuff that is a little bit more evolved.\n\n1:31:59\tSPEAKER_04\n And the core network technology and the access network, I would like to say, is aligned as much as possible to the Internet.\n\n1:32:08\tSPEAKER_04\n That's a basic idea.\n\n1:32:10\tSPEAKER_04\n That you can have a certain kind of service which may use of these normal things.\n\n1:32:17\tSPEAKER_04\n Because normally, I believe the people are either on the application that means higher than layer four, or they are on layer one up to layer four.\n\n1:32:27\tSPEAKER_04\n And the service people are considering, okay, UFTS, you have some location information.\n\n1:32:31\tSPEAKER_04\n And maybe you have the infrastructure as a car.\n\n1:32:35\tSPEAKER_04\n So I provide a certain kind of service, independently what the network is awful.\n\n1:32:40\tSPEAKER_04\n Because they don't consider it very well.\n\n1:32:43\tSPEAKER_04\n And I know there is a certain kind of location information, you have GPS and some other location space.\n\n1:32:49\tSPEAKER_04\n And centralizing it as UFTS is based on base station.\n\n1:32:52\tSPEAKER_04\n There's also a console, and then the SU, okay, I can do that.\n\n1:32:56\tSPEAKER_04\n And the networking guy said, okay, it would be great to have multi-casts and all these kinds of things.\n\n1:33:01\tSPEAKER_04\n But do not consider really what is the benefit for applications.\n\n1:33:06\tSPEAKER_04\n All the applications may use of it and how can new applications realize which we have considered after all based on this new network function, and which network functionality.\n\n1:33:20\tSPEAKER_04\n So I think it's worth to consider something in that way.\n\n1:33:29\tSPEAKER_08\n Until now I've been trying to think about it.\n\n1:33:33\tSPEAKER_08\n To me, every time I encounter this all pretty close by, the industry is already behind this.\n\n1:33:42\tSPEAKER_08\n They want to make this available pretty soon.\n\n1:33:47\tSPEAKER_08\n So I'm just trying to think, you know, more ahead, like use the wireless device as only a signaling thing or something.\n\n1:33:57\tSPEAKER_08\n So whatever you come in with your GSM phone, and there is a PC available, like everything will be directed to the bigger device or something.\n\n1:34:05\tSPEAKER_08\n So more of services like that, I think they are working pretty hard to get IP available very good and efficiently for mobile devices or wireless devices.\n\n1:34:22\tSPEAKER_04\n I think our current use is a technology split. Of course you have IP in the mobile device.\n\n1:34:29\tSPEAKER_04\n I think you see this large product cost tax. There's IP or IP in the tunnel center.\n\n1:34:35\tSPEAKER_04\n So it's very strange to me because you have different numbering screens.\n\n1:34:39\tSPEAKER_04\n So we have a phone number, you have to map it to IP addresses and so on.\n\n1:34:43\tSPEAKER_04\n But for me, you have not the entire passport for IP function, and it will be a far away from there.\n\n1:34:50\tSPEAKER_04\n And if you take a really look at the GPS, protocol, tax, and I believe ours is there, but for you and Chess, but they are not there.\n\n1:34:57\tSPEAKER_04\n And the family I was at, and the next generation, the access number, will come soon.\n\n1:35:04\tSPEAKER_04\n You see, every three years or four years, they will have a few generations.\n\n1:35:09\tSPEAKER_08\n And there's a part of our group, I'd like to focus on the IP over Ether and no net or something.\n\n1:35:17\tSPEAKER_08\n Over Ether. No net. Over Ether.\n\n1:35:24\tSPEAKER_08\n There is no net. If you want to make, like also for wireless devices, and when to IP available, that could be efficient.\n\n1:35:36\tSPEAKER_08\n Can you repeat it? Well, so he says, well, IP to IP or N2NIP is far away.\n\n1:35:54\tSPEAKER_08\n So what you might want to do is get UMTS out of there. Just do IP play over radio. Like SDH, IP over fiber or WDM.\n\n1:36:11\tSPEAKER_08\n Get rid of the SDH. Start with the SDH, then get rid of SDH.\n\n1:36:18\tSPEAKER_04\n The problem is, you see that the providers have always a broken view for the management.\n\n1:36:27\tSPEAKER_04\n If you have different kinds of protocols, tax and network management system, and everything exists in there, all this kind of thing, which is besides the networking stuff, of course, is still needed, is not aligned.\n\n1:36:40\tSPEAKER_04\n For different islands. That's my final vision. If you have really the IP network, it's a certain generation, that you have really the physical media, and where necessary additional nuclear protocols, and then you have really always end to end.\n\n1:36:59\tSPEAKER_02\n It makes things much more simple, much more easier. But it's far, far away. Unless we speak about quality of service, which is not embedded on IP services.\n\n1:37:12\tSPEAKER_04\n Yeah, but you have the extension of the ability of service mechanism, which you have to back send to the underlying technology.\n\n1:37:19\tSPEAKER_04\n Yeah, but for example, nobody is really using RSVP. But maybe in the wind interface, it makes sense to use it.\n\n1:37:29\tSPEAKER_04\n You guys do that, this is much later on. But I think we should stop now, but please add, if I should go on with considerations of the potential.\n\n1:37:42\tSPEAKER_04\n It didn't make much progress today in the meeting. But anyway, this kind of activity lives from all, from the input of all.\n\n1:37:53\tSPEAKER_04\n And so I really, if somebody has an idea, send an email, and I would like to ask everybody not to, I'm doing everything I could not.\n\n1:38:03\tSPEAKER_04\n It didn't have the time in the past, and I will not have it in the future. Maybe I will stay here only for weeks or for weeks. So it would be really not the best thing if the activity is there, but I believe.\n\n1:38:16\tSPEAKER_04\n And if I stay longer, of course, we can go on, but nevertheless, I will lie heavenly, also from the contributions of everybody, and it's in their own interests.\n\n1:38:24\tSPEAKER_04\n Also from the institutions behind. So if there are certain kind of ideas or questions or whatever, we are only a small group of people.\n\n1:38:35\tSPEAKER_04\n We can easily join the white board and start a discussion. It's not only every Tuesday, you know, at a certain time.\n\n1:38:43\tSPEAKER_04\n And I try to motivate the people that is free, that is starting at the ramp, and we can go in different directions.\n\n1:38:50\tSPEAKER_04\n And if you have a real focus on a certain novel thing for a service, or you have to answer whatever, great.\n\n1:38:57\tSPEAKER_04\n If not, long term, and these things must be nevertheless, must be, be finding much more detail.\n\n1:39:03\tSPEAKER_04\n Okay, so thanks.\n\n1:39:06\tSPEAKER_04\n Okay.\n\n1:39:22\tSPEAKER_00\n Yeah, just leave them on for now. Sometimes if you turn golf, all of this is working, it's trash.\n\n", "summary": [{"summary_text": "SPEAKER, Alle, Speaker and Speaker's partner are having a conversation. Speaker is going to start by reading the digit strings and then go around the table. The transcript numbers are on the right hand side of the page. "}]}