{"filename": "./data/Bns002.txt", "transcript": "0:00:00\tSPEAKER_05\n Okay, so welcome to our next meeting. Today we will have a talk for Miguel Sanchez concerning his work related to attack networks.\n\n0:00:16\tSPEAKER_05\n Yeah, via guest, former ICSI member of the NSA group, Shoddy-Domingo Pascoa, he is Assistant Professor at UPC and maybe Jody you have a few words concerning your work, one or two sentences, because we will have to more talk from him in more detail concerning what's going on. You want me to show it to you?\n\n0:00:40\tSPEAKER_04\n Yeah, very short. Very short. When I'm working in the Brabancou.\n\n0:00:47\tSPEAKER_05\n I'm sorry, one interrupt. This is not related to hearing, it's only for fixing it. It's\n\n0:00:53\tSPEAKER_04\n not earphone. It's not a earphone.\n\n0:00:56\tSPEAKER_05\n It's only microphone.\n\n0:01:00\tSPEAKER_04\n It's a microphone. Thank you.\n\n0:01:06\tSPEAKER_04\n Working in the Brabancou communication group, what the recessed topic at this moment is the traffic monitoring and characterization and developing tools for quality of service for command analysis. And we have projects for Spanish and museum production going.\n\n0:01:35\tSPEAKER_05\n Thank you. And after the talk of Miguel, I will give you a few slides concerning the project for POSU, I will say something about which direction it will go. And maybe it was my fault that I assumed that it's a point of being well concerning the MTS of the importance.\n\n0:02:06\tSPEAKER_05\n Deploy to everybody, but it was only sent to me. So in the meantime, everybody got to believe it's a point of me. Maybe it's a homework, impossible for the next meeting to get a little bit familiar with this thing.\n\n0:02:21\tSPEAKER_05\n And so I believe we will not have today a very hard technical discussion, maybe more if you would topic an item's fee for focus in the next days until the next meeting.\n\n0:02:32\tSPEAKER_05\n And then we are already with our meeting.\n\n0:02:35\tSPEAKER_05\n And we think it's done. Then we have to wait this number and we go to the next meeting.\n\n0:02:42\tSPEAKER_05\n Okay.\n\n0:02:44\tSPEAKER_00\n Miguel, please start.\n\n0:02:45\tSPEAKER_00\n Thank you. Well, I have prepared a really short talk about some of the topics I have been doing some research work before coming here. And well mainly I will present here you have more or less the sketch of the presentation. I will present some ideas and some concepts about what ad hoc networks are, about the issues in media access control in wireless networks, also about routing in such kind of networks. And I will make some comments also about the current standards of wireless local area networks. And finally I will present the blueprint of my research project or my research proposal here.\n\n0:03:38\tSPEAKER_00\n So the first thing is what an ad hoc network is. You know an ad hoc network is made of wireless nodes. These nodes of course can be mobile nodes. And in this network there is no network infrastructure. So the only active thing we have is the mobile nodes.\n\n0:04:05\tSPEAKER_00\n And the end to end communication is sometimes done by direct communication from one node to the other because they can talk to each other. But sometimes it is not possible this direct communication because nodes and the source and the destination nodes are too far away.\n\n0:04:31\tSPEAKER_00\n And in this case it can be done, communication can be done by using multi-help routing.\n\n0:04:38\tSPEAKER_00\n So an intermediate or a set of intermediate nodes will route or will forward the packet from the center to the destination. So in a sense what we have in this kind of networks is that nodes are both act as both endpoints and also routers of other neighboring nodes.\n\n0:05:08\tSPEAKER_00\n And this makes a difference from other kind of network. And well regarding the purposes of what can this kind of network be used for, we can say that while cellular networks are infrastructure based networks in this kind of ad hoc networks we don't have anything with the exception of the network node. So these networks can be useful for occasions where node available infrastructure is present. Like for example, after some kind of catastrophe or catastrophic event or also when even when there is a network available we don't want for different reasons to use the available network. This later case can be for example the use in military systems where maybe we don't want to use the other, the enemy network infrastructure\n\n0:06:18\tSPEAKER_05\n for evident research. But you can also I believe to have an ad hoc network one node is then connecting to the outer world. For instance what I have in mind you have a car where you plug in different devices and they talk to each other for instance.\n\n0:06:34\tSPEAKER_05\n But one device decided to go to the GSM network or GPS network whatever kind of things.\n\n0:06:39\tSPEAKER_05\n That's a certain kind of task for one node within the ad hoc network to provide connectivity\n\n0:06:45\tSPEAKER_00\n to the outer world. That's okay. That's perfect. You know this in this case we will say that this node is acting as a external gateway from this network to connect to other networks.\n\n0:06:56\tSPEAKER_00\n And of course the underlying protocols can be of course IP based.\n\n0:07:03\tSPEAKER_00\n Okay here you have several proposed scenarios for use this network when no network is available.\n\n0:07:13\tSPEAKER_00\n Another application for example NASA is studying is the use of these networks, these ad hoc networks for sending multiple probes, missions.\n\n0:07:30\tSPEAKER_00\n So for example all of you are aware of this last successful Mars mission.\n\n0:07:38\tSPEAKER_00\n The sojourner vehicle was only one and was walking around or robbing around the base station which in this case was the gateway node of this network.\n\n0:07:53\tSPEAKER_00\n But it was only one mobile node of course. Nothing prevents except well maybe the cast to send not only one mobile robot but tons of them or at least several of them.\n\n0:08:08\tSPEAKER_00\n So higher area could be covered, could be explored.\n\n0:08:14\tSPEAKER_00\n And of course all the different nodes could also use some kind of ad hoc networking, ad hoc routing to extend the maximum distance then a single radio transmission will autolo.\n\n0:08:29\tSPEAKER_00\n And in the other case the other area of application is the so-called network of sensors.\n\n0:08:40\tSPEAKER_00\n We can deploy a set of sensors in maybe an inhabited area that say for example in the forest.\n\n0:08:48\tSPEAKER_00\n And we can take some information for example for fire fighting, we can just launch from a plane several small sensors.\n\n0:09:01\tSPEAKER_00\n And these sensors can be for example checking that there is no fire, they can have some kind of infrared technology sensor.\n\n0:09:11\tSPEAKER_00\n So we can cover a huge area with only a small set of sensors and without any other infrastructure.\n\n0:09:21\tSPEAKER_03\n Yes.\n\n0:09:22\tSPEAKER_03\n Is that really an ad hoc network because the sensors are not moving?\n\n0:09:26\tSPEAKER_03\n And I think it makes no sense with moving sensors because then you don't know where the sensors are.\n\n0:09:32\tSPEAKER_00\n So interesting question. The main thing about an ad hoc network is not that nodes move.\n\n0:09:42\tSPEAKER_00\n It is the way after apology changes can happen.\n\n0:09:46\tSPEAKER_00\n The idea that any change is possible at any given moment.\n\n0:09:52\tSPEAKER_00\n But you can of course ask, but if the nodes are not moving, what kind of apology changes can we expect?\n\n0:09:59\tSPEAKER_00\n Well, the thing is that usually in a network of sensors what we have or the idea is to have an important number of sensors.\n\n0:10:10\tSPEAKER_00\n And maybe with a high filer rate maybe the batteries are exhausted in some nodes because maybe they are not being able to take any sun to recharge itself.\n\n0:10:26\tSPEAKER_00\n Maybe some of them can be just out of order for other environmental conditions.\n\n0:10:35\tSPEAKER_00\n So the idea is that even when these nodes are not moving, they can start and stop working at a higher pace.\n\n0:10:45\tSPEAKER_00\n Then what will happen in a regular network, in a network where you don't have either mobility or this on-off rate, high rate.\n\n0:10:58\tSPEAKER_05\n Let me go back to your example.\n\n0:11:01\tSPEAKER_05\n I have a mind, some routers are burned here at ICSI, whatever kind of thing, what will happen even in the fixed network. So if some sensors are getting out of service and whatever kind of thing, so the topology has changed in it.\n\n0:11:16\tSPEAKER_05\n No node is moving. How to provide the connectivity and the intercommunication things for the present network.\n\n0:11:24\tSPEAKER_00\n Well, and finally another non-military application where maybe a network is available, for example, a room like this where we have in fact a wired infrastructure.\n\n0:11:39\tSPEAKER_00\n But this possible application of ad hoc networks could be any place, any meeting room where we arrive with our computers and we just can communicate seamlessly to each other without any kind of access point, any kind of external network.\n\n0:12:02\tSPEAKER_00\n Because the kind of work we want to do is just only a local base, it's only to chat to each other or to exchange files with the person which is in front of us.\n\n0:12:13\tSPEAKER_00\n But we don't want to provide access to the internet or something.\n\n0:12:20\tSPEAKER_00\n Of course, the same scenario could also happen in a place where there is no infrastructure available in a meeting room in the middle of the desert without any other network.\n\n0:12:38\tSPEAKER_00\n So the point or the question could be for some of us, the idea of saying, okay, that sounds okay, but why not to use a longer transmission range so we can reach any destination in just one hop?\n\n0:12:55\tSPEAKER_00\n It seems to make sense because, well, we are this way, avoiding all the routing problem that we will talk a little bit about routing later, but it seems that the problem is not an easy one because an out-moving route is changing.\n\n0:13:16\tSPEAKER_00\n One thing that routing in this scenario is a complex thing. But the problem is if we just try to put more power in each transmitter, so this transmitter can reach any destination in only one hop.\n\n0:13:32\tSPEAKER_00\n What we are doing is to rising the power needs at each node and also we are reducing the network throughput because we are only allowing one transmission at a time because we cannot allow several transmissions at the same time because one is interfering the other.\n\n0:13:58\tSPEAKER_00\n I think I am not telling it yet, but we are assuming that we are using a single common channel for all the nodes.\n\n0:14:07\tSPEAKER_00\n So that is why we cannot allow several transmissions in the same channel at the same time.\n\n0:14:15\tSPEAKER_00\n So the idea of having a longer transmission range is not a good one, or at least it has the drawbacks I was telling you.\n\n0:14:29\tSPEAKER_00\n I will speak a little bit about the media access issues in wireless networks. The easiest way to show how this works, or I think one of the easiest, is the drawing or the picture.\n\n0:14:47\tSPEAKER_00\n But what we have is a set of nodes, each one at a different location, at a given moment. This node, this dash node, is transmitting.\n\n0:15:00\tSPEAKER_00\n The arrows are representing this transmission and the receiving nodes, the three nodes are receiving the transmission. I am trying to show the area, the covered area of this transmission by means of this dashed line circle.\n\n0:15:22\tSPEAKER_00\n So any transmission has a maximum transmission range. In a simpler way, we can see this like a circle with the center in the transmitter and a certain radius.\n\n0:15:39\tSPEAKER_00\n The value of these values is, in principle, a fixed value and it depends on the power of the transmitter. Of course, this is simply a simplified model and of course this can be improved a lot.\n\n0:15:59\tSPEAKER_00\n In fact, the real behavior is not exactly this one, but for what I want to say it's okay enough.\n\n0:16:10\tSPEAKER_00\n So what are the differences in this wireless transmission regarding to the wired ones? What are the main differences? Well, the main differences come from the fact that in a wireless transmission we have a special domain we don't have when we are using a wire for transmitting a signal.\n\n0:16:39\tSPEAKER_00\n And the point I'm trying to show in this picture is that for example, this other node wants also to transmit while this one was transmitting.\n\n0:16:50\tSPEAKER_00\n If we are using some kind of carry detect scheme like for example, CSMA or something, the derivative from it.\n\n0:17:00\tSPEAKER_00\n The problem is that this node will hear the transmission media. It won't be able to hear anything. So he will conclude that no other transmission is going on and he will start transmitting.\n\n0:17:16\tSPEAKER_00\n And if it does, what will happen is that this node and this other node will also receive this transmission and this will produce at least at these two nodes, a collision or a bad reception.\n\n0:17:32\tSPEAKER_00\n So none of these two simultaneous transmissions will be properly received at this node nor at this other node.\n\n0:17:42\tSPEAKER_00\n Okay, this problem is what is called, sorry, I think this is the previous one. This is the German one.\n\n0:17:53\tSPEAKER_00\n Thank you. This is what is called a hidden terminal problem because this node is not able to hear this other node because of the distance between them.\n\n0:18:08\tSPEAKER_00\n But this problem, as you can see in the picture, is really producing at least some reception problem at these two nodes.\n\n0:18:18\tSPEAKER_00\n So it is a problem that we have to address and it is a new problem compared to where the media access control.\n\n0:18:28\tSPEAKER_00\n And well, some protocols have been developed to avoid this problem and to try to address this particular behavior of wireless transmissions.\n\n0:18:40\tSPEAKER_00\n And the main idea is to use some kind of a reservation mechanism so we are reserving a certain and a specific area of space so we can guarantee that nobody is trying to use the same space at the same time.\n\n0:19:01\tSPEAKER_00\n Okay, this is the basic idea.\n\n0:19:03\tSPEAKER_05\n Yeah, we can give some examples for such kind of protocol. Yeah, yeah, yeah, this one. This one next slide is.\n\n0:19:11\tSPEAKER_00\n Okay, in the main idea and the base of most of these protocols is what is the so-called RTS, CTS, a dialogue.\n\n0:19:21\tSPEAKER_00\n The idea is that of course this is only intended for unique-ass transmissions. I mean, only for when a node wants to transmit something to a neighbor node, okay.\n\n0:19:33\tSPEAKER_00\n But not to broadcast all the nodes. Okay, for this work, the transmitter has to send a reservation packet called RTS request to send before being able to send it.\n\n0:19:50\tSPEAKER_00\n And the receiver is expected to return back another packet called CTS, clear to send to allow the transmitter to send the data.\n\n0:20:03\tSPEAKER_00\n If the transmitter receives successfully the CTS packet from the destination, then it will be able to send the packet, the data packet.\n\n0:20:13\tSPEAKER_00\n If not, it will back off and it will retry sometime later. Okay, so the main idea.\n\n0:20:21\tSPEAKER_05\n Media is still occupied, doing that earlier?\n\n0:20:26\tSPEAKER_00\n Yes, yes. The idea is, if I want to send you something, I, first of all, I need you to answer me to be sure that you are my neighbor now, because maybe you are off and maybe you are too far away. And also because that way Miguel, for example, maybe is not being able to hearing me, will hear your CTS and will know that you are about to receive a data from me. Okay, so in fact, forcing the receiver to transmit for a short period of time is also used to signal all the receiver receivers neighbors that are reception, are reception is taking place. Okay, I didn't get it. What happened when I sent an RTS packet?\n\n0:21:19\tSPEAKER_05\n Is that the media still occupied for me or is anybody allowed also to send RTS packets?\n\n0:21:26\tSPEAKER_05\n Or everybody? Because if I go to an intermediate, maybe you are communicating to me and I am the intermediate, to the final destination, Michael. And Michael sent also some RTS packets in the time and, and, and, uh, uh, Jodi too and whatever.\n\n0:21:40\tSPEAKER_05\n Yeah, then you will never come to a really, then you are always exchanging RTS and non-engknowledgement packets for the RTS.\n\n0:21:47\tSPEAKER_00\n Two things. First of all, this, this mechanism is only a media access control mechanism, so it is not connected with routing anyhow. And second point.\n\n0:21:59\tSPEAKER_00\n Okay. So it's only related to the neighbor who is in the scope of the, yeah, RTS packets can collide to other RTS packets.\n\n0:22:09\tSPEAKER_00\n So this mechanism is not preventing collisions. It is preventing only data collisions. Okay. So the, and, and you can say, okay, but what is the, what the benefit is, the benefit is that RTS packets and CTS packets are short packets, really short packets, let's say, uh, uh, 30 bytes or less, while data packets can be much, much bigger, let's say, uh, 1k, 5k, okay.\n\n0:22:44\tSPEAKER_00\n So a collision in these short packets is only wasting a small amount of time. And, uh, if that way we can't guarantee that there is, there is no collision, uh, between data packets.\n\n0:23:02\tSPEAKER_00\n Well, this, this is, this means a huge increase in network throughput, because we, well, we only waste really a small time colliding.\n\n0:23:15\tSPEAKER_05\n Okay. But that means the principle that on the Mac layer, you have always RTS, CTS packet between the neighboring nodes.\n\n0:23:23\tSPEAKER_05\n Yeah. And you send afterwards the data, but the data will be maybe delayed in the intermediate node, because you have always be sure to be, uh, uh, RTS and CTS packets would change before you can forwarding the data, right?\n\n0:23:37\tSPEAKER_00\n Yeah. It is our reservation mechanism. So if reservation doesn't work, okay, if, if one reservation, don't succeed, then, uh, this transmission should have to wait until the reservation.\n\n0:23:52\tSPEAKER_05\n Okay, yeah, let me step up to, uh, the other time, uh, let me, let me.\n\n0:24:01\tSPEAKER_05\n So many of my ideas first. So this is what node one, this is node two. This is the source. This is node two.\n\n0:24:09\tSPEAKER_05\n No, forget about routing. Yeah, okay. But anyway, I would like to do that in the end of network. And this is maybe the scope.\n\n0:24:16\tSPEAKER_05\n This is within the scope of this, uh, special networks. That means here that this, uh, within the transmission.\n\n0:24:23\tSPEAKER_05\n Okay. Power. So he first sent an RTS and get back, uh, RTS.\n\n0:24:31\tSPEAKER_05\n And he is allowed to send data, right? That's okay.\n\n0:24:35\tSPEAKER_05\n So in the meantime, when he gets this one, he also had to send RTS and then CTS, because this is the next, next scope of the transmission area.\n\n0:24:45\tSPEAKER_05\n And then he can send the data, right? Okay. That's the case. That's it. That's it.\n\n0:24:51\tSPEAKER_05\n That's what I mean. In the meantime, he still can get some data here, that he tried to get certain connectivity on the mat layer.\n\n0:24:59\tSPEAKER_00\n Yeah, but, uh, our node is only, it's only involved in one transmission at a given time.\n\n0:25:06\tSPEAKER_00\n So if node 2 has, uh, answer with, with the city is, it will be waiting until the data that has to come.\n\n0:25:18\tSPEAKER_05\n Okay. And then he tried to forward this data. Yeah.\n\n0:25:21\tSPEAKER_00\n But not before. But not before.\n\n0:25:23\tSPEAKER_05\n So he has to collect all the data. Yeah. Yeah. You cannot be a little bit strange because if that is starting a side transfer with millions of bytes,\n\n0:25:31\tSPEAKER_00\n you have to collect all the bytes before you go to the next packet. No, no, no, but we are, we are talking only about a data packet at the backlight.\n\n0:25:38\tSPEAKER_05\n All data packets. Yeah. Okay. Okay. So but, in principle, when he receives the data packets, then he, the same applies for the next data.\n\n0:25:50\tSPEAKER_00\n Yeah. All the packets, all unique as a package.\n\n0:25:53\tSPEAKER_00\n So he has to forward the packet to the final destination. Yeah. That's true. That's true. But not in the meantime. After receiving, you know, in fact, probably the routing protocol will need to check the address, the, let's say, IP address, which is inside the data packet.\n\n0:26:13\tSPEAKER_00\n You cannot, usually you cannot read the data packet until the reception is over. Okay. Because usually your network hard work only provides you a copy of a packet after a successful reception.\n\n0:26:31\tSPEAKER_00\n And usually you know that our reception is successful if every bit have passed the CRC tech. Okay. You have to take that that this frame has received without errors.\n\n0:26:45\tSPEAKER_03\n Okay. So further questions. Yeah. That's okay. Am I right that this dialogue does not prevent any disturbance of other notes in the sending range of N1. Yeah. Let me, let me put some\n\n0:27:04\tSPEAKER_00\n special representation of what we are doing. Okay. This is the trust between node. This is the receiving node. And these two areas. Of course, this is something like this. The places of the total space where you can hear the here. This one is the RTS and this one is the CTS. So any note, for example, this node is a neighbor of the receiving node, but it is not a neighbor of the transmitting node.\n\n0:27:39\tSPEAKER_00\n Yeah. That's it. So when this node hears the CTS transmission that is performed by the receiver, this will be informed that our reception is taking place in its area. Okay. So in fact, this node will avoid any further transmission until this reception that will start in a moment is over.\n\n0:28:07\tSPEAKER_03\n And this node, his transmission is aborted. And so there's no advantage to if it's aborted by any data packets. So this node has to stop each transmission. Yeah. So even the at the moment ongoing transmission.\n\n0:28:27\tSPEAKER_00\n Is that right? Yeah. So his transmission is aborted. But this is not for my. No. Let me, let me, let me show you one thing. If this node was transmitting before.\n\n0:28:41\tSPEAKER_00\n It should, it should transmit an RTS packet in advance. Okay. So this node should hear it before. So this node is one resending the CDS packet to the transmitter. So this transmission won't take place.\n\n0:29:01\tSPEAKER_05\n Yeah. It's always true that only one node gets a video access for one frame. That's the point. You always said from data, but it's really one frame. Yeah.\n\n0:29:11\tSPEAKER_00\n And in fact, there is another detail. It is not on the on the slide. And it is that both the RTS and the CDS packet have filled a control field where the total length of the data packet is shown. So when you hear one CDS or one RTS packet, you know that the frame that they are trying to trust me or this one is trying to trust me. This one is about to receive. You know the length. You know the bit rate. So you know the amount of time you have to wait until you can try to get the control or try to send your own transmission.\n\n0:29:59\tSPEAKER_03\n Okay. But this scenario is also not only working if both or all nodes have the same range of transmission. So the same radius of the sending away.\n\n0:30:14\tSPEAKER_00\n So otherwise this one node maybe would hear his neighbor, but not vice versa. Well, we are assuming that all the all the transmissions are by the directional. I mean, you know, it depends.\n\n0:30:37\tSPEAKER_00\n Mainly on the antenna gain and the transmission power and the receiver threshold. But I'm thinking about this example. You guys. So what we are assuming is that all the nodes behave exactly the same regarding to transmission and receiving signals.\n\n0:30:57\tSPEAKER_00\n But maybe here's a word. Yeah, but but in this case, you know, this this idea, this geometric idea can be can be if you want the formed because of some obstacles.\n\n0:31:18\tSPEAKER_00\n Okay, but this wall is working both ways. It is not only making this node not to hear this one. It's also making this one not to hear this not one of the. So if they because of this wall, if they are not neighbors, well, we can represent this putting this node like here.\n\n0:31:39\tSPEAKER_00\n But one of the senders could be much stronger than the other one. Now, but this is not the scenario. We are assuming all the nodes are exactly the same. So they trust me the same power and they have the same sensitivity.\n\n0:31:58\tSPEAKER_03\n So they can hear if I can hear you, you can hear me and the opposite works also. If you cannot hear me, I cannot hear it. It's a assumption. It's clear. But on the other hand, in real world, it isn't all in real scenario.\n\n0:32:16\tSPEAKER_00\n It is not really, but also depends on, you know, for example, power relationships and antenna relationships. Yeah, you know, because for example, one can think, okay, if I use a directional antenna, this is making that in one direction, I'm getting more, let's say, more gain than in other and that's true.\n\n0:32:42\tSPEAKER_00\n That what is also true is that one directional antenna works both ways. It provides you more gain when you are transmitting, but also when you are receiving. So in general, in general, even if there are different antenna gains, you are getting mainly by directional channels.\n\n0:33:04\tSPEAKER_00\n Only when you have an important power difference is when the communication can only work one way. For example, you have one big station with a lot of transmission power.\n\n0:33:21\tSPEAKER_00\n And then you have a really small mobile thing that can hear perfectly the signal from this big station, but it has not enough power to transmit something that can be here here.\n\n0:33:36\tSPEAKER_00\n But this is not our scenario. In our scenario, all the nodes are exactly the same. They have the same signal behavior. So this is not a problem for us.\n\n0:33:53\tSPEAKER_00\n At this point, maybe later we'll see some differences. So, you know, the idea is that this mechanism is a reservation mechanism. And what we are doing here is trying to reserve the area of space we are covering.\n\n0:34:11\tSPEAKER_00\n And here is where some of our work is done. The main idea for our work is, well, if we are using this reservation mechanism, we are reserving an area of space for a single transmission.\n\n0:34:31\tSPEAKER_00\n If this area is bigger than what is really needed, we are somehow wasting a little bit of space. So, our first work in this area was to study different mechanisms to try to adjust this transmission radius.\n\n0:34:50\tSPEAKER_00\n This is the area, the covered area for a single transmission, trying to get a minimum value. So, we can reduce the not-use space for other simultaneous transmissions.\n\n0:35:09\tSPEAKER_00\n And this will lead us to a better network throughput, to higher number of simultaneous transmissions. And we have work about this problem in two different ways.\n\n0:35:30\tSPEAKER_00\n One of these ways has been try to find a mechanism to calculate an optimal value for the transmission range and to get an equal value for all the transmissions.\n\n0:35:48\tSPEAKER_00\n So, the idea in this first work was to obtain a fixed value for the transmission range. And the second work, it is about an algorithm to adapt the transmission power for every single transmission.\n\n0:36:15\tSPEAKER_00\n So, in this second part of our work, we are using a different value for every single transmission.\n\n0:36:25\tSPEAKER_00\n So, first point, what we have proposed is a way to obtain the transmission range for a scenario where we know the number of nodes and the area of deployment.\n\n0:36:45\tSPEAKER_00\n We have a fixed area where we deploy all the nodes, we have a fixed number of nodes, and we assume that these nodes are moving freely around this area.\n\n0:36:59\tSPEAKER_00\n And what we have presented is a mechanism to calculate, to obtain the transmission radius that provides at the same time that provides us the better throughput possible.\n\n0:37:21\tSPEAKER_00\n But, without our network getting partition, which is a problem that we are trying to avoid.\n\n0:37:31\tSPEAKER_00\n You know, if we have because of node motion, we have something like this. This is the deployment area of our nodes.\n\n0:37:41\tSPEAKER_00\n And if we have some nodes here, some nodes here, well, maybe these nodes in this area cannot reach the nodes on this other area.\n\n0:37:53\tSPEAKER_00\n So, what can we do to avoid this? Of course, we can choose a transmission radius longer enough to reach from this area, we will be able to reach the nodes on this other area.\n\n0:38:09\tSPEAKER_00\n But, again, we can assume that if nodes are moving more or less in a random fashion, this configuration is not very likely to happen.\n\n0:38:27\tSPEAKER_00\n So, the point we have done is to present a mechanism which provides one value for a given probability.\n\n0:38:43\tSPEAKER_00\n So, we can say that a given value of sub-0 for the transmission range will be okay for a given number of nodes if we, sorry, for a certain probability.\n\n0:39:02\tSPEAKER_00\n So, the point is, we cannot say that this is not going to happen. What we can say is that this is not very likely to happen if nodes move random.\n\n0:39:16\tSPEAKER_05\n So, the previous slide you mentioned that you are working also on adaptive power control. If I send something and I could not find any neighbor because one of the cluster below is not possible to extend the power until the maximum and if I do not have any connectivity with the maximum of I, okay, then I am lost anyway.\n\n0:39:36\tSPEAKER_00\n Yeah, this is a way that it is being explored by other researchers but not by me. But there is one person who is doing what they call topology control.\n\n0:39:52\tSPEAKER_00\n And this is related to the control of the transmission power to get certain properties from your network. Like, for example, what they are doing is people working for BVN, Ram Ramana Tan, is the researcher and the article is, I think, from this year.\n\n0:40:15\tSPEAKER_00\n And these guys are doing what they call Bconnected Networks. They are trying all the node or nodes to have at least two neighbors, okay.\n\n0:40:27\tSPEAKER_00\n And they are controlling the power to at least get this number of neighbors. But this is not what I am doing. And the kind of power control I am doing is more or less presented here.\n\n0:40:44\tSPEAKER_00\n And what we are doing is to transmit with the minimum power needed depending on the distance to the destination. Okay, every transmission is supposed to be done to a certain neighbor node.\n\n0:41:00\tSPEAKER_00\n We call neighbors to these nodes which are closer than a given distance. Okay, and because we wanted to compare our algorithm with something, we needed to compare it with the no power control, which is the usual mechanism at this media access control level.\n\n0:41:22\tSPEAKER_00\n So what we are doing here is to compare our mechanism against the no power control. But again, we have to fix in order to be able to compare.\n\n0:41:32\tSPEAKER_00\n We have to fix the given whatever, but a given maximum transmission range to compare. And what we are doing is we are taking the advantage that we are, we have these RDS, CTS, dialogue.\n\n0:41:51\tSPEAKER_00\n In advance before sending the data to agree with the receiver, the power level he is willing to get from us.\n\n0:42:04\tSPEAKER_00\n Okay, so every single transmission in every single transmission we are checking with the receiver, the power level we have to use for the data transmission. That's the main thing.\n\n0:42:18\tSPEAKER_05\n And how do you check if the nodes are moving randomly?\n\n0:42:23\tSPEAKER_00\n Well, we are assuming that for at least for a car and walking or people riding a motorcycle, the frame length is so small that only very small space can be traveled while the transmission is taking place.\n\n0:42:52\tSPEAKER_05\n So, in one millisecond.\n\n0:42:55\tSPEAKER_05\n Yeah, well, you just take the robot.\n\n0:43:04\tSPEAKER_00\n Yeah, but let's say you have one kilobyte. One kilobyte is a bit. And if you are transmitting, let's say, at one megabit per second, this means one microsecond, repeat.\n\n0:43:27\tSPEAKER_00\n Okay, so this only is taking eight milliseconds, which is not a lot of time. If you are traveling, let's say, at one hundred kilometers per second.\n\n0:43:40\tSPEAKER_01\n No, sorry.\n\n0:43:42\tSPEAKER_05\n Yeah, that's right. But first of all, it took place at the RDS, CTS. And there could be a mention that if it's still occupied by another one, it will be delayed anyway.\n\n0:43:52\tSPEAKER_00\n It will be delayed, but you will start from scratch again. I mean, it will be a start with another RTS, CTS.\n\n0:44:02\tSPEAKER_01\n But anyway, depending on the network, this will have to translate this.\n\n0:44:13\tSPEAKER_01\n So, this should be something like 30 meters per second.\n\n0:44:36\tSPEAKER_00\n So, in eight milliseconds, well, the amount of space you are traveling is not too much. For most of the wireless technologies, maybe not for all of them.\n\n0:44:48\tSPEAKER_00\n But of course, I'm also using a conservative value for the transmission speed. Now, you can get much more speed than speedier interfaces than this one. But the thing is that we are assuming that for a given transmission, we can consider the network as if it were built of a set of static nodes.\n\n0:45:17\tSPEAKER_00\n The motion will be important for routing, but for the media access control level, we are considering that motion is not important.\n\n0:45:30\tSPEAKER_05\n What I think, maybe some cases, I go this way with my note, and suddenly I go out of the scope of the transmission area, because it's really a random movement, then I still hear and disadvantages the data transmission.\n\n0:45:47\tSPEAKER_00\n But again, what we are adding with these behaviors is a little bit more, probably some small part to the bit of rate.\n\n0:46:00\tSPEAKER_00\n Maybe this frame won't be received properly and should have to be dropped. But anyway, even if nodes are completely static, some problems will happen in the wireless transmission, so we won't have a 100% perfect channel anyway.\n\n0:46:20\tSPEAKER_00\n So if this problem, as you show it, probably it's, you can see that it is not very likely to happen, because you have to consider the probability of happening this.\n\n0:46:38\tSPEAKER_05\n That's really right, but what I would like to say is that besides the CTS behavior, you need some kind of additional mag layer functionality to be able to take, for example, retransmission or whatever.\n\n0:46:50\tSPEAKER_05\n Yeah, sure.\n\n0:46:51\tSPEAKER_00\n For control or whatever kind of thing.\n\n0:46:53\tSPEAKER_00\n In fact, maybe I had to prepare a more detailed view. I just was trying to do something soft, not to bore the public, but of course there are a lot of other smart things that are built in these protocols.\n\n0:47:12\tSPEAKER_00\n Like for example, and automatic acknowledgement, some protocols use in the same way as these RTS and CTS packets, some of them use and acknowledge from the receiver, which is also a shared packet.\n\n0:47:29\tSPEAKER_00\n So you are getting some kind of link layer acknowledgement scheme, which can save a lot of data transmissions, because usually when you send a frame, you will want to some kind of acknowledgement back.\n\n0:47:45\tSPEAKER_00\n So if this acknowledgement has to go through the process of a new RTS and new CTS, this takes longer than just a link layer extra packet.\n\n0:48:00\tSPEAKER_00\n This is also contemplated in this packet length, or included in the RTS and CTS packets. So everybody can wait until this acknowledgement is also transmitted might be receiver.\n\n0:48:16\tSPEAKER_00\n So in fact, some people proposing this mechanism is showing a big improvement. And there are a lot of other mechanisms also regarding the timeout mechanism or the timeout algorithm for this retries when you try to send something and you don't succeed.\n\n0:48:39\tSPEAKER_00\n So the amount of time you have to wait until you retry again, some people are also proposing different algorithms with different results.\n\n0:48:53\tSPEAKER_00\n In fact, there are a lot of, I just was trying to present the main ideas. So you feel free to ask whatever you want, but I want to insist that it was just a simplified version, a light version.\n\n0:49:17\tSPEAKER_00\n Well, finally, this algorithm, as I was telling, what is doing is to check with the receiver the power level to be used.\n\n0:49:28\tSPEAKER_00\n And it is very simple to see that some advantages can be obtained because the difference is if you don't have power control, you are using all the time the maximum power.\n\n0:49:41\tSPEAKER_00\n So if you have power control, sometimes you will use less than the maximum power.\n\n0:49:48\tSPEAKER_00\n How often do you use less power than the maximum? Well, this will be connected to the motion pattern.\n\n0:49:57\tSPEAKER_00\n Depending how nodes are moving, well, maybe all the time all your neighbors are at the maximum distance, but this probably doesn't look like something very, very likely.\n\n0:50:13\tSPEAKER_00\n Because, well, probably what you will have will be some neighbors that are really close, others that are a little bit far away. And finally, these neighbors that are in the frontier of your coverage area.\n\n0:50:29\tSPEAKER_05\n Okay, this question not directly related to these things, but maybe it's not really the only short answer. Do you assume that power control will be the issue also in the next years?\n\n0:50:43\tSPEAKER_05\n In other words, the success of having more power within the devices in maybe three years, four years, five years for batteries and so on will be succeeded that you have so much power available that these difficult mechanisms within the wireless network will be out of scope.\n\n0:51:09\tSPEAKER_05\n Because if I have a device which cannot use maybe for 24 hours, I do not have a pointer, but really is a constraint to deal with this.\n\n0:51:20\tSPEAKER_00\n Yeah, let me answer you with a question.\n\n0:51:25\tSPEAKER_00\n For example, your car, you have an endless source of gas. Do you think it will be a problem, the amount of gas your car is using?\n\n0:51:40\tSPEAKER_00\n Okay, it won't be a problem for your pocket, for your wallet, but maybe it will be a problem for the environment.\n\n0:51:49\tSPEAKER_00\n So I think that the answer to your question is in this line that if you have an endless source of power, well maybe it's not a problem for the battery lasting, but it is a problem because you are using more area than you should.\n\n0:52:06\tSPEAKER_00\n And therefore you are preventing other transmissions to take place at the same time. And therefore the problem is not only connected to the power, it is also connected to the global network throughput.\n\n0:52:25\tSPEAKER_00\n So, but again, if you ask me, what do you think what will happen in the industry? What I think that will happen is that they will try to get better hardware than we have now.\n\n0:52:44\tSPEAKER_00\n So, the problem with transceiver is that a lot of power is consumed at the logic of the transceiver and not transmitted to the air. It is not power transferred to the air.\n\n0:52:58\tSPEAKER_00\n So, the problem now is that most of the power wireless network card is consuming is drawn by the logic control of the card, all the calculations, all the hardware.\n\n0:53:15\tSPEAKER_00\n I am sure that manufacturers will try to squeeze until the last million of these wasted power. Because what you cannot avoid is the part of the radio frequency power you have to transmit.\n\n0:53:36\tSPEAKER_00\n I mean, this cannot be avoided. But what you cannot avoid or you cannot reduce and probably because now the main factor, the main consumption factor is the logic inside.\n\n0:53:48\tSPEAKER_00\n In the same way as it happened with processor, for example. Now, processors are much more power efficient than before.\n\n0:53:58\tSPEAKER_05\n But anyway, that was a reason for my question. If I save with a lot of difficult mechanisms within the air interface and the base station access point and the mobile node, 1% of the power, where 99% is consumed by packet processing and CPU, whatever, is it worth to have it?\n\n0:54:18\tSPEAKER_05\n If I really, with a normal device, with a battery lifetime of maybe 24 hours, 36 hours, whatever kind of thing, and I think it will be increased as a more mobile node, that the battery will be.\n\n0:54:32\tSPEAKER_05\n So, that's one reason for my question.\n\n0:54:35\tSPEAKER_00\n Yeah, but even if you don't have to worry about your power source, you have to worry about your environment, about not using more resources that you don't own, that are shared among the community.\n\n0:54:55\tSPEAKER_04\n If I wanted to do the mechanism, you should look for the minimum current range, to maximize the throughput of the network.\n\n0:55:08\tSPEAKER_04\n The power control algorithm should work in order to use at each instant to find the minimum power to reach the destination.\n\n0:55:26\tSPEAKER_00\n And to get the maximum network throughput. However, it is always, however, by applying this greedy mechanism, or more than greedy, in this case, you could be saying this stinging mechanism, trying to avoid to use any extra space, is also leading to a higher level of interference at the receivers.\n\n0:56:07\tSPEAKER_00\n So, at the end of the road, we have to look for some trade-offs to avoid too much interference at the receivers. So, at the end, we are using a little bit more power than these mathematically minimum values, because if not the frame error rate or the bit error rate skyrocket.\n\n0:56:36\tSPEAKER_00\n Because of the high interference levels, a lot of simultaneous transmissions also mean for each receiver point of view, a lot of neighbors or nodes transmitting at the same time.\n\n0:56:52\tSPEAKER_00\n And all the transmitters with the assumption of my transmitter are my interferers, and all of them are producing less quality reception.\n\n0:57:05\tSPEAKER_00\n So, if they are a lot of them, reception can be disturbed. And this is taking longer than I expected. Let's take a really light view at the routing in this network, which is another important area of research.\n\n0:57:32\tSPEAKER_00\n In fact, there is a group at the ITF called Manit. This working group is devoted to try to present or to agree a common protocol for routing IP traffic on this kind of network, on this at-hawk networks.\n\n0:57:55\tSPEAKER_00\n And at this moment, I would say a lot of proposals of different protocols for end-to-end traffic and also for multi-cast traffic on these networks.\n\n0:58:13\tSPEAKER_00\n And, well, some day in the future, a protocol should be chosen, but for the moment, we have several of them on the table and any protocol has some advantages and disadvantages.\n\n0:58:35\tSPEAKER_00\n The basic problem we have to solve in these routing protocols is the fast pace at what topology changes can happen.\n\n0:58:50\tSPEAKER_00\n So, the problem here is that now one now is my neighbor and next second it is not. So, any route that was going through this neighbor now is not possible and should change.\n\n0:59:07\tSPEAKER_00\n And the problem is that, well, if you let me a personal comment, I think that one error on the group is not to agree a set of mobility patterns to do the tests.\n\n0:59:23\tSPEAKER_00\n Because here, mobility is making this neighborhood relationships to appear or to disappear. So, it should be interesting if we agree a common set of motion patterns to perform the tests, because if not, it's difficult to perform comparisons between one protocol and another, a different one.\n\n0:59:52\tSPEAKER_00\n But anyway, now what we have is two basic approaches to this problem. Mainly, are they go the proactive protocols, which are extensions of vector and link state routing protocols, distance vectors and link state protocols, which are usually table driven.\n\n1:00:18\tSPEAKER_00\n You have a process trying to maintain up to date a set of routing tables at the nodes and every routing decision is just looking up the table and sending to the proper neighbor node.\n\n1:00:36\tSPEAKER_00\n And the other set of protocols are using a reactive approach and these protocols are trying to work on demand. So, they are trying to solve only these routers that are needed.\n\n1:00:52\tSPEAKER_00\n So, when I want to send a packet to a given destination, first of all, I have to figure out the proper route for this packet. And then I'm using solve routing, I'm including on the heater of this packet, the set of nodes that should be forwarding this node to the destination.\n\n1:01:16\tSPEAKER_00\n Of course, these two approaches can be somehow mixed and some hybrid proposals are also on the paper.\n\n1:01:27\tSPEAKER_00\n And these proposals are trying to get the advantages of both mechanisms, sometimes making a combination of them. Let's say, for example, using a proactive approach for the closer set of nodes, let's say for the neighbors and maybe the next level and using a reactive approach.\n\n1:01:56\tSPEAKER_00\n I mean, as a routing approach for nodes that are closer than this proactive area.\n\n1:02:05\tSPEAKER_00\n And well, some multicast protocols have been proposed for this scenario too. And well, they have to deal with the same problems that they're into and routing protocols.\n\n1:02:20\tSPEAKER_00\n So, what do you mean by multicast protocols? Yeah, routing protocols intended for multicast. So, for sending one to any.\n\n1:02:32\tSPEAKER_00\n Well, the main problems that some of the solutions are exhibiting is the lack of scalability. Mainly, the source routing protocols have a problem when you scale from or scale badly from tens of nodes to 2,000 of nodes.\n\n1:02:55\tSPEAKER_00\n Because, well, you kind of have, let's say, an endless hider length. You have a limited hider length.\n\n1:03:06\tSPEAKER_05\n Maybe you have to explain a little bit for those who are not family of the source routing. You can have the destinations.\n\n1:03:13\tSPEAKER_05\n You would like the IP addresses of intermediate nodes. You still know, even if it's not the direct neighbor, but one of where you really want the packet to put it in the IP header.\n\n1:03:25\tSPEAKER_05\n So, and this one is going then to the sky and so on and so on until finally it reaches destination.\n\n1:03:32\tSPEAKER_05\n So, if you cannot put if you have 1,000 intermediate nodes for that, but to put 1,000 IP addresses in the header, so that the packet is for one of the smaller nodes.\n\n1:03:41\tSPEAKER_03\n Small than 1 IP address in the header. Okay, let's see.\n\n1:03:48\tSPEAKER_00\n Something like this. Do they have to be in order?\n\n1:03:56\tSPEAKER_03\n Yeah. You are looking first for node 2 and then for node 2.\n\n1:04:00\tSPEAKER_05\n So, node 2 remove from the header and point of the word and so on until it reaches destination.\n\n1:04:11\tSPEAKER_00\n So, this hider will, of course, there are also some solutions like employing some kind of hierarchical source route routing.\n\n1:04:21\tSPEAKER_00\n So, you don't have to put all the route.\n\n1:04:26\tSPEAKER_05\n This one, for instance, that made, said the different paths could be 1 to number 4, maybe 2b or 3b, but nevertheless this guy is in gateway in the route of 4p.\n\n1:04:40\tSPEAKER_05\n So, this packet, you know, and remove itself from the header.\n\n1:04:43\tSPEAKER_00\n Okay. Another of the whole class, you know.\n\n1:04:46\tSPEAKER_00\n Another problem is trying to provide some quality of service in this network, because, well, changes is the only thing you know for sure here.\n\n1:04:59\tSPEAKER_00\n So, providing quality of service is also quite a challenge in this network.\n\n1:05:06\tSPEAKER_00\n But again, there are some proposals.\n\n1:05:09\tSPEAKER_00\n Are your terrarium, which is kind of proposing? Not really. Not really because I don't trust, you know, I'm sure that the proposals are okay.\n\n1:05:20\tSPEAKER_00\n But I don't think that you cannot work. I don't think you can't warrant too much in these networks.\n\n1:05:28\tSPEAKER_00\n So, I see this like a topic I'm not convinced about.\n\n1:05:36\tSPEAKER_00\n I don't trust you can really provide quality of service, but of course...\n\n1:05:41\tSPEAKER_05\n It depends on the service that we want. Definitely not after a guarantee level.\n\n1:05:45\tSPEAKER_05\n But there is something like a control level or something like that, to see if there is a problem.\n\n1:05:50\tSPEAKER_00\n You know, if you are curious, I can provide you some of the proposals, which include...\n\n1:05:59\tSPEAKER_00\n Yeah. And finally, the other thing, which is also under research or under study, is to have some kind of power or a word routing.\n\n1:06:13\tSPEAKER_00\n There are some proposals too. So, that way, you could...\n\n1:06:18\tSPEAKER_00\n Routing function could be connected with global or local power consumption. So, for example, you could ask the network to transmit your packet with the lowest global consumption or with your lowest local consumption, for example.\n\n1:06:42\tSPEAKER_00\n I mean, the option for me to use less power when sending a packet is to send it to the closest neighbor.\n\n1:06:53\tSPEAKER_00\n Okay, assuming that I'm also using having some kind of power control thing, so that way, transmitting to the closer to my closer node is something that requires less effort than sending to a more distant node.\n\n1:07:12\tSPEAKER_00\n Maybe the closer node is not a good... it is not in the good direction to reach the destination, but it is for sure the less expensive thing for me.\n\n1:07:27\tSPEAKER_00\n But probably this is not something really useful, and that can...\n\n1:07:33\tSPEAKER_00\n What can be really useful is to reduce the global power consumption in the routing function.\n\n1:07:40\tSPEAKER_00\n So, because in this way, well, maybe one node is being forced to use more power, but if we take a look at the whole thing, we can ask for a low consumption route.\n\n1:07:53\tSPEAKER_00\n Well, the same way, as we are asking, for example, when we want some packet to be shipped in the real life, we can go and say, well, we are happy with this UPS ground system, or we want these two-day delivery service, or 24 hours service, and we are willing to pay more or less...\n\n1:08:13\tSPEAKER_05\n All this... it really happens also in the wild case, you know, if I get a one-hour, with the CMP, you are like, just as important as the same.\n\n1:08:23\tSPEAKER_00\n So, these are more or less some open problems, and well, just a quick comment about probably all of us are now aware of the availability of this standard, the IEEE 800 and 2.11. In fact, it is powering, you know, the evolution of the networking industry in the wilder's area.\n\n1:08:53\tSPEAKER_00\n And in the beginning, the first adaptors were only one and two megabytes per second, but now you can buy for the same price, for even the same price.\n\n1:09:08\tSPEAKER_00\n The new 11 megabits per second version, I have been using it for a while, and it can tell you it works pretty well.\n\n1:09:18\tSPEAKER_00\n And the thing is that these devices have two different modes of operation. One of them, and probably the most popular, is what we call the infrastructure mode, where you have a set of mobile nodes, and then you have one or more access points. These access points are, in fact, providing the required connectivity from the mobile to the wide network, and from there to the internet usually.\n\n1:09:56\tSPEAKER_00\n Yeah, we can call it the base station, and the other mode of operation, which should be appropriate, for example, for this meeting room example, doesn't require any access point, and in this second case communication happens from one computer to the other at the link layer.\n\n1:10:21\tSPEAKER_00\n So if I want to connect to, let's say, Miguel's, Michael's, I will send him a packet, and he will receive it, and that's it.\n\n1:10:34\tSPEAKER_00\n We can build on top of this some routing algorithms, some at-hoc routing algorithms, but this is out of the escarp of the standard.\n\n1:10:45\tSPEAKER_05\n And, and then version one and two, we have different technologies, you know, with the two modes and also in four ways.\n\n1:10:56\tSPEAKER_00\n But it's still a play for the, no, 11b is only for radio, and it's only for direct sequences for the spectrum.\n\n1:11:07\tSPEAKER_00\n But in fact, there is an ongoing new version, I think it's version A, but it is not commercially available, which we will use, or token-al-frequency-db-symultiplexing, and we'll get probably 25 megabits per second.\n\n1:11:25\tSPEAKER_00\n But again, they will move to 5 gigahertz, 5.5 gigahertz, hertz, area of the spectrum, but now current devices are split, you know, the all wavelength are 900 megahhertz version, and the new ones, the 11 megabits are 2.4, ISM band.\n\n1:11:52\tSPEAKER_00\n However, some all wavelengths are also, but not the older ones, the oldest ones are also 2.4 gigahertz.\n\n1:12:06\tSPEAKER_00\n And the good thing is that now, especially with the new version, you start to see compatible products in the market.\n\n1:12:16\tSPEAKER_00\n Because, maybe because it's the second version, but also because I think it's the only way for this industry to take off.\n\n1:12:27\tSPEAKER_00\n Because previous versions, if you buy, let's say, wavelength, you are tied to wavelength the rest of your life.\n\n1:12:35\tSPEAKER_00\n But now, you can have interoperable products from several vendors, which is, I think, what in the past will power the Ethernet revolution.\n\n1:12:48\tSPEAKER_00\n You can buy any compatible product, and you know it will work with the other brand.\n\n1:12:55\tSPEAKER_05\n And one additional question from I.T. about maybe also show up at the first time, is only 5.\n\n1:13:06\tSPEAKER_00\n I have heard that wireless LAN and Bluetooth will have some problems that...\n\n1:13:13\tSPEAKER_00\n In France?\n\n1:13:14\tSPEAKER_00\n Beginning, I think that to put things in perspective, what we need to know is what Bluetooth is and what Bluetooth is for.\n\n1:13:26\tSPEAKER_00\n And Bluetooth is mainly for carrying this cable.\n\n1:13:30\tSPEAKER_00\n You know, the other day, I was joking about that wireless microphones were not in fact wireless, because it had this wire.\n\n1:13:39\tSPEAKER_00\n So the point is that Bluetooth is mainly a technology for carrying this kind of cables.\n\n1:13:47\tSPEAKER_00\n Short distance cables, carrying usually wireless slow signals or, let's say, boys and something like this.\n\n1:13:59\tSPEAKER_05\n But now let's get to the range of 10 meters or 100 meters.\n\n1:14:03\tSPEAKER_00\n Yeah, but you know, in fact, the initial version had only the range of 10 meters.\n\n1:14:10\tSPEAKER_00\n And I guess that somebody at a certain meeting said, okay, why don't we have an extended range version, so we could reuse the same technology for other purposes different than the original ones.\n\n1:14:24\tSPEAKER_00\n So I have the feeling that this is what is introducing some kind of confession in the Bluetooth or in the way people is looking at Bluetooth because they can say, okay, 100 meters is an acceptable distance.\n\n1:14:44\tSPEAKER_00\n Let's say for communicating inside, building inside a small office. So some people I think it's being tempted to think that Bluetooth could provide them some kind of local connectivity, but for data, for computing uses.\n\n1:15:01\tSPEAKER_00\n However, I think that when you have tried current standard working devices, working at 11 megabits per second, you cannot switch to another thing, to another slower thing.\n\n1:15:18\tSPEAKER_00\n But even when they are using the same area of spectrum because Bluetooth is also intended to work in 2.4 gigabits, the technologies are different.\n\n1:15:32\tSPEAKER_00\n You know, Bluetooth is using frequency helping system and both die in sequence and frequency helping spread spectrum techniques are also intended to provide interference less data transmission.\n\n1:15:53\tSPEAKER_00\n So the idea is that these two techniques are intended not to interfere with any other thing. So even when I haven't tried and I cannot tell you for sure, I think that the only problem one network will encounter in the presence of the other is a little bit of more noise.\n\n1:16:17\tSPEAKER_00\n And this will produce a little bit less throughput, but nothing more. I don't expect any more problem. Even the own Bluetooth specification is also assuming that another Bluetooth or several Bluetooth networks could be in the same area of space.\n\n1:16:40\tSPEAKER_00\n And they are using the same frequency helping technology. But again, this technology is trying to avoid the other networks by choosing different helping patterns.\n\n1:16:53\tSPEAKER_00\n So if several Bluetooth networks can coexist without a problem, I don't see any problem will happen if we want to make coexist when a Bluetooth with another wireless and local area network technology.\n\n1:17:12\tSPEAKER_05\n But anyway, based on your initial scenario, either because Bluetooth is on one chip, like you have now your USB bus or whatever connectivity will have your Bluetooth connectivity.\n\n1:17:27\tSPEAKER_05\n And then what ever kind of a thing is connected to your laptop or your microphone or whatever you will have is Bluetooth based or will be.\n\n1:17:42\tSPEAKER_00\n And why is that? So despite the fact that they are considered for different scenarios, they are still in fact, Bluetooth is also designed to be compatible with existing digital European callless telephones.\n\n1:17:57\tSPEAKER_00\n So, hopefully, we will be able to use some of our all devices or maybe our callless phone base station at home with the computers.\n\n1:18:07\tSPEAKER_00\n So I think some really nice application will appear.\n\n1:18:12\tSPEAKER_05\n I will have some problems in the future with my wireless and Bluetooth connectivity. I will continue with some of it.\n\n1:18:20\tSPEAKER_00\n I'll try to.\n\n1:18:22\tSPEAKER_00\n Let me just finish. Well, this is something more or less I told you. And you know, the point or what did the spark of my work here or what I was proposing to work here is the fact that these two modes of operation I was telling you here, that you have to choose at the tribal level if your network adapter is working in an access point based environment or in an ad hoc environment.\n\n1:19:02\tSPEAKER_00\n I see this as a limitation because I think that when you have to choose among two options, well, maybe you are saying no to some of the benefits, the other option, different than the one you are choosing.\n\n1:19:19\tSPEAKER_00\n Good provide you and I envision an an an an scenario where.\n\n1:19:26\tSPEAKER_00\n Yeah, let's go where we can have a kind of dual mode wireless network adapter.\n\n1:19:37\tSPEAKER_00\n So if we are not able to reach any access point, but we are able to reach another network node, well, maybe this network node could do me the favor to reach or to forward my package to the access point.\n\n1:19:55\tSPEAKER_00\n So the main idea, the driving force here is to try to obtain, let's say hybrid mode, which allows an adapter to work either in the access point or in the ad hoc mode in a seamless way.\n\n1:20:19\tSPEAKER_00\n So to include in every single node driver, this forwarding or helper forwarding mechanism that will allow to extend the wireless coverage without the need of buying a lot of access points and putting even an access point inside the rest room.\n\n1:20:43\tSPEAKER_00\n This idea can sound a little bit not very appealing for the manufacturers, at least for the manufacturers of access points because they probably are very happy of telling a lot of them.\n\n1:21:07\tSPEAKER_00\n So this is the, I think this is near the end, this is the last.\n\n1:21:14\tSPEAKER_00\n So one possible extension of the same idea and something I've been thinking for a while is the idea that well, why can't we extend this same concept to cellular systems?\n\n1:21:28\tSPEAKER_00\n Why can't we, for example, think about some new mechanisms that users could get connectivity by means of other users and know directly to the base station?\n\n1:21:48\tSPEAKER_00\n Or when we have several technologies in overlap in a certain area, why can't we use the closest and the cheapest maybe technology or maybe the less power consumption technology without the user to worry about if he is now using these or the other technology?\n\n1:22:14\tSPEAKER_00\n And on the other hand, what are the billing implications of these behaviors?\n\n1:22:21\tSPEAKER_00\n Because it is clear that well, when I'm only talking to the base station of my provider, well, billing is more or less straightforward.\n\n1:22:32\tSPEAKER_00\n But what happens if I'm working, let's say, across a mall and at a given moment, I'm using the small base station of a countless phone that is inside the shop at the window of all in this case, I'm using a resource which is not owned by my provider.\n\n1:22:54\tSPEAKER_00\n I'm using a private property, maybe I have to pay to this private property or maybe my career will have to pay to refund some money to this guy.\n\n1:23:07\tSPEAKER_00\n You know, this is something I'm putting on the table, I'm not sure about if this can be really of interest or not, but it's an idea, I'll be happy to discuss it with you.\n\n1:23:24\tSPEAKER_00\n And I think my presentation is over.\n\n1:23:27\tSPEAKER_05\n Okay, thank you very much. Welcome.\n\n1:23:38\tSPEAKER_05\n And you won last question from my side because I'm going in our, I've come down as a proposal, some kind of active quality back at this station.\n\n1:23:58\tSPEAKER_00\n Do we have certain kind of experience as we know certain activities in that area? No, to both questions, I don't have previous experience, I don't know if it would fix.\n\n1:24:17\tSPEAKER_00\n However, you know, I'm just doing this presentation, some how I review of my previous work. So this doesn't mean that I'm probably getting involved a little bit more in this active routing thing.\n\n1:24:38\tSPEAKER_00\n So maybe I will be able to, hopefully I will be able to give you a better answer in the future.\n\n1:24:51\tSPEAKER_00\n Oh, thanks, thanks Michael for your computer. No problem.\n\n1:24:56\tSPEAKER_02\n I will be flour a little bit information here. Should I power off it? Just lock out. Okay, lock out.\n\n1:25:09\tSPEAKER_05\n Okay, sorry. Which is the proper one? Michael, which is the proper answer?\n\n1:25:28\tSPEAKER_05\n Let's be proper. Yeah, kill the computer. So I started for advertising, for the proposal here to provide a few slides.\n\n1:25:43\tSPEAKER_05\n I think, first of all, but there's not here. Second link here for the enabling UTS services and application. I assume I was not read yesterday night.\n\n1:26:01\tSPEAKER_05\n So I suggest we go roughly to this slide here. And the problem is that, once we have different scopes and motivation of the project report for my point of view is that we will have the wireless access net for the next generation will be more flexible.\n\n1:26:25\tSPEAKER_05\n There's a role for a current for a fast changes within this network. And that means if you go to slide number three, that we have the possibility to have a normal features in the mobile access network.\n\n1:26:46\tSPEAKER_05\n And also based on the belongs normally to one, the single provider domain that is possible to use novel things and new protocols and new technologies within this network.\n\n1:27:03\tSPEAKER_05\n And the internet backbone, we, it is impossible. And you see several examples like the MPL and the quality of service support and my decadent, all this kind of thing that based on success of the internet backbone, it's become very unflixable for the provision of new things.\n\n1:27:25\tSPEAKER_05\n So if we are going to our for building blocks and provide knowledge solutions for the next generation or wireless access networks, taking into account without modifying the end to end scope, then I think it's a really benefit for also for the use of interactive multimedia application.\n\n1:27:44\tSPEAKER_05\n So as it is described in the project proposal, the point is that to start with a bigger cluster of potential partners to do this really, really, really big work seems to not to be able to feel the next time.\n\n1:28:09\tSPEAKER_05\n Because if you have certainly ever seen a discussed everything and then without any money in the background, there are a lot of money in the background that is not for my point of view.\n\n1:28:21\tSPEAKER_05\n Nevertheless, I discussed a lot of part of these things.\n\n1:28:25\tSPEAKER_05\n And today, my thing, I'm using the E to discuss those guys who is, Professor who is all of the interested in the application staff that are going in that direction. They have a small project from the end of the day.\n\n1:28:40\tSPEAKER_05\n And I think that the process of the process is a little bit exaggerated. If I was going in that direction, there are a lot of interest. But with our really hard money in the background, it is very hard to come to the initial steps.\n\n1:28:55\tSPEAKER_05\n And one pair, one of the members in this A group has identified a certain kind of start money, I would like to say. So maybe you started a small cluster of the constraints of this funding.\n\n1:29:11\tSPEAKER_05\n That means six universities and institutions, Sweden, USA, Sweden, Europe. And of course, including the NSA group. Maybe it seems to be very reasonable for me.\n\n1:29:26\tSPEAKER_05\n But then we have to align the project proposal in that sense, because then we cannot do anything as it is required in the big scope.\n\n1:29:34\tSPEAKER_05\n So the point is to reduce the overall picture, which I described in a few words, to the fact that we have really some work packages that we can focus on it.\n\n1:29:47\tSPEAKER_05\n Still fitting into the big picture. And so that will be the task of the next week.\n\n1:29:53\tSPEAKER_05\n And I hope that everybody is doing its homework concerning three, for instance, alternative to the intelligent class rule. Maybe that we can start here only with the NSA group within this big picture with some work that we put the pieces together, because I believe many are very flexible here.\n\n1:30:16\tSPEAKER_05\n And currently also the future coming, joining people, also, is able to do some work here. And if we are starting with a very, very small cluster with a common activity, maybe some starting funding for, eager radio source of the project proposal with the minds that maybe as a final stage, we've become a European proposal with this whole funding.\n\n1:30:44\tSPEAKER_05\n That's my point, and my picture I have in mind. And I would go there and let me back to Germany at 10th of December that is fixed now.\n\n1:30:55\tSPEAKER_05\n And I hope we can use this remaining weeks to have really progress for the proposal in the central dimension before, because then I will make the asset starting that is still worth to stay here.\n\n1:31:07\tSPEAKER_05\n And I hope that the students would say, okay, for me to stay longer here, and then I will come back maybe in the middle of end of January.\n\n1:31:14\tSPEAKER_05\n So that's a comment to the proposal.\n\n1:31:21\tSPEAKER_05\n So I think everybody should consider carefully based on this statement, and make steps. And of course, everybody has a little bit other work to do, but it should be always an ongoing process.\n\n1:31:39\tSPEAKER_03\n You mentioned six partners of this work, so you know already what partners I included. Okay, I didn't look at the slides.\n\n1:31:52\tSPEAKER_05\n I did this to do other things electronically.\n\n1:31:55\tSPEAKER_05\n Okay, so I'll take a look to slide off number two. I'm just curious.\n\n1:32:00\tSPEAKER_05\n I see University of Mannheim University, that's the official one. You see that in the ICSI, I believe that home companies and universities are still contributing.\n\n1:32:17\tSPEAKER_05\n But these are the official ones, and I would like to know.\n\n1:32:19\tSPEAKER_05\n And all of them had a critique, or they say they are very interested. If you were at the University of Mannheim, is that location where your group is working on it, and I got the statement, they are very interested in that.\n\n1:32:34\tSPEAKER_05\n They did a lot in the area of intelligent class, but nevertheless they did a lot of networking stuff.\n\n1:32:40\tSPEAKER_05\n And University of Uppsala is a wide-distance, truly, professor who did 10 years work in active routing.\n\n1:32:50\tSPEAKER_05\n And okay, University doesn't acknowledge the every kick Spanish.\n\n1:32:56\tSPEAKER_05\n Maybe we have better experts here.\n\n1:33:00\tSPEAKER_05\n In Spain, University of Uppsala is also the one who recognized Hoan PÃ©re.\n\n1:33:12\tSPEAKER_05\n PÃ©re. P-E-I-I-E.\n\n1:33:16\tSPEAKER_05\n Pais. Pais.\n\n1:33:18\tSPEAKER_05\n No, they're not not Pais. P-E-I-A-E.\n\n1:33:24\tSPEAKER_05\n You can name it later on. Then of course the whole NSA group, and also the coordinator for the things.\n\n1:33:34\tSPEAKER_05\n The Georgia Tech had a good relationship to the long-lasting corporation with Georgia Tech.\n\n1:33:41\tSPEAKER_05\n And they did a lot in this area, also related to networking stuff as well as to the intelligent class of stuff.\n\n1:33:46\tSPEAKER_05\n And the UCB is still focusing on maybe we can have more professors involved, which are working also on the networking stuff as well.\n\n1:33:57\tSPEAKER_05\n And the application stuff says that the UCB is classed as one partner, but nevertheless it's different departments.\n\n1:34:06\tSPEAKER_05\n So, but take a look to the slides I will deploy it.\n\n1:34:11\tSPEAKER_00\n Where the slides are available?\n\n1:34:16\tSPEAKER_00\n I will send an electronic.\n\n1:34:18\tSPEAKER_05\n What?\n\n1:34:19\tSPEAKER_00\n After the meeting.\n\n1:34:21\tSPEAKER_00\n You will turn it over.\n\n1:34:23\tSPEAKER_05\n Sorry, sorry.\n\n1:34:25\tSPEAKER_05\n And maybe you'll take a look to the last two slides.\n\n1:34:31\tSPEAKER_05\n Maybe the GPS pictures are still available.\n\n1:34:34\tSPEAKER_05\n So, you have a principle here now is mapping of the different areas.\n\n1:34:41\tSPEAKER_05\n Was in GPS and a principle is the same applies for UMTS.\n\n1:34:44\tSPEAKER_05\n There's no so much different.\n\n1:34:47\tSPEAKER_05\n You always have a SGSN or UMTSA called 3G, SGSN.\n\n1:34:52\tSPEAKER_05\n And you have the protocol stack on the slide number five to see what is going on.\n\n1:35:01\tSPEAKER_05\n And you see the different amazing thing is that you have IP over IP.\n\n1:35:06\tSPEAKER_05\n You take a look to the GTS and you have two IP layer functionality and other things.\n\n1:35:12\tSPEAKER_05\n And you have the GPS ton of protocol GTP between the G and the S and GTSM.\n\n1:35:19\tSPEAKER_05\n And so, I believe they are very, very difficult protocols stack between the involved nodes.\n\n1:35:28\tSPEAKER_05\n And making it necessary and possible to deal with our focusing blocks.\n\n1:35:35\tSPEAKER_05\n And I believe in a difficult way if we have my inequality of the routing and mobility aspects and all these kind of things for IP layer functionality.\n\n1:35:49\tSPEAKER_05\n So, that's the point of the overview of the protocol stack and the involved nodes.\n\n1:35:54\tSPEAKER_05\n And I will provide more information but I will also figure out I will say from scratch.\n\n1:36:01\tSPEAKER_05\n I'm not totally expert for the future wireless networks.\n\n1:36:07\tSPEAKER_05\n Okay.\n\n1:36:09\tSPEAKER_05\n Does anybody like to say everybody?\n\n1:36:12\tSPEAKER_05\n And if there's no additional question command or other remarks.\n\n1:36:19\tSPEAKER_05\n Okay. We don't like to start with the reading these numbers.\n\n1:36:26\tSPEAKER_05\n So, this twence code number is 2371.\n\n1:36:31\tSPEAKER_05\n 2390345080220.\n\n1:36:40\tSPEAKER_05\n 7288699530080808.\n\n1:36:48\tSPEAKER_05\n 18312494115208.\n\n1:36:55\tSPEAKER_05\n 53687303779989096009.\n\n1:37:06\tSPEAKER_05\n 0120825915355.\n\n1:37:13\tSPEAKER_05\n Okay. Please the next one.\n\n1:37:15\tSPEAKER_03\n Transcript number 2451-24707281897064309309302.\n\n1:37:30\tSPEAKER_03\n 23201-209314677890007660117279573932364 8454156.\n\n1:38:01\tSPEAKER_00\n Next one please.\n\n1:38:05\tSPEAKER_00\n Transcript 2431-24506570730742387999003300226077038449674 5593.\n\n1:38:26\tSPEAKER_00\n 6, 7, 9, 4, 5, 1, 0, 1, 2, 1, 0, 5, 1, 7, 5, 9, 2, 9, 3, 4, 5, 0, 3.\n\n1:38:50\tSPEAKER_04\n 5, 0, 4, 5, 2, 8, 5, 6, 6, 6, 7, 2, 7, 8, 9, 0, 2, 3, 0, 1, 1, 2, 1, 9, 9, 2, 3, 4, 5, 6, 5, 4, 5, 4, 5, 2, 9, 6, 4, 1, 8, 4, 6, 4, 8, 6, 4, 2, 0, 8, 5, 9, 1, 0, 7, 1.\n\n1:39:24\tSPEAKER_02\n Transcript this 23912410, 47021561762709893528040682181794529094948030126331406084063084094063810 00621207407086013639840666001078832709469\n\n1:40:13\tSPEAKER_05\n 04022161541760186506511 Norby\n\n1:40:16\tSPEAKER_04\n 991.0% I don't know how to do that.\n\n1:40:41\tSPEAKER_03\n There are people from all cultures here from IBM.\n\n1:40:46\tSPEAKER_03\n Why do you think all the text are...\n\n1:40:48\tSPEAKER_04\n Do they type again or do they type in automatic?\n\n1:40:52\tSPEAKER_02\n I don't do it with my hand.\n\n1:40:54\tSPEAKER_02\n I don't have to try it with that.\n\n1:40:56\tSPEAKER_00\n Human waste.\n\n1:40:57\tSPEAKER_00\n What? I thought it was a...\n\n1:40:59\tSPEAKER_04\n This is the same.\n\n1:41:02\tSPEAKER_04\n That's the kind of voice recognition.\n\n1:41:05\tSPEAKER_05\n Can you send me the slides?\n\n1:41:08\tSPEAKER_05\n Because I have some ideas.\n\n1:41:11\tSPEAKER_05\n I have some ideas concerning...\n\n1:41:13\tSPEAKER_05\n I would like to discuss with you.\n\n1:41:15\tSPEAKER_05\n Here you have the graphic.\n\n1:41:18\tSPEAKER_05\n But anyway, if you would like...\n\n1:41:22\tSPEAKER_05\n No, you can't discuss it.\n\n1:41:24\tSPEAKER_00\n I mean, I can't...\n\n1:41:26\tSPEAKER_00\n I can't send you anywhere there.\n\n1:41:28\tSPEAKER_05\n Yeah, that's important because I collect all the things which happen to get wrong with it.\n\n1:41:32\tSPEAKER_05\n I think it's important to have people because, based on the new web pages, design, maybe it's necessary or maybe it's a reach to publish certain things.\n\n1:41:40\tSPEAKER_05\n But it's a certain kind of...\n\n1:41:43\tSPEAKER_05\n But nevertheless, there's some technical things that I would like to discuss with you.\n\n1:41:47\tSPEAKER_05\n So, I suggest that we will have in a few minutes we will have coffee, cake, whatever it will be offered.\n\n1:41:56\tSPEAKER_05\n And then we will have a...\n\n1:41:58\tSPEAKER_05\n We can have a discussion.\n\n1:41:59\tSPEAKER_05\n Okay.\n\n1:42:00\tSPEAKER_05\n Okay.\n\n1:42:02\tNone\n Here?\n\n1:42:03\tNone\n Where did it get?\n\n1:42:04\tSPEAKER_05\n Next again.\n\n1:42:05\tSPEAKER_05\n Okay.\n\n1:42:06\tSPEAKER_01\n Where did it get?\n\n1:42:08\tSPEAKER_01\n I can put that in.\n\n1:42:09\tSPEAKER_02\n Oh, you were a professor.\n\n1:42:11\tSPEAKER_02\n Okay.\n\n1:42:12\tSPEAKER_02\n Okay.\n\n1:42:13\tNone\n Okay.\n\n1:42:14\tNone\n Thank you.\n\n1:42:15\tNone\n Thank you.\n\n1:42:16\tNone\n Yeah.\n\n1:42:17\tNone\n Thank you.\n\n1:42:18\tNone\n Well...\n\n1:42:20\tNone\n Okay.\n\n1:42:21\tNone\n Okay.\n\n", "summary": [{"summary_text": "Miguel Sanchez will give a talk about his work related to attack networks. Shoddy-Domingo Pascoa is Assistant Professor at UPC. Speaker is working in the Brabancou communication group. His topic is traffic monitoring and characterization and developing tools for quality of service for command analysis. He will present the blueprint of his research project or research proposal for POSU."}]}