{"filename": "./data/Bns003.txt", "transcript": "0:00:00\tSPEAKER_00\n Is this a virtual meeting?\n\n0:00:10\tSPEAKER_02\n Oh, there.\n\n0:00:11\tSPEAKER_02\n Or is it?\n\n0:00:12\tSPEAKER_02\n Okay.\n\n0:00:13\tSPEAKER_02\n Okay.\n\n0:00:14\tNone\n Thanks.\n\n0:00:15\tNone\n Okay.\n\n0:00:16\tNone\n Because that's it.\n\n0:00:18\tNone\n Okay.\n\n0:00:19\tNone\n That's it.\n\n0:00:20\tNone\n That's it.\n\n0:00:21\tNone\n Okay.\n\n0:00:22\tNone\n That's it.\n\n0:00:23\tNone\n Okay.\n\n0:00:24\tNone\n Okay.\n\n0:00:25\tNone\n That's it.\n\n0:00:26\tSPEAKER_04\n That's it.\n\n0:00:27\tSPEAKER_04\n Okay.\n\n0:00:28\tSPEAKER_04\n Okay.\n\n0:00:29\tSPEAKER_04\n Okay.\n\n0:00:30\tSPEAKER_04\n Okay.\n\n0:00:31\tSPEAKER_04\n Okay.\n\n0:00:32\tSPEAKER_04\n Okay.\n\n0:00:33\tSPEAKER_04\n Okay.\n\n0:00:34\tSPEAKER_04\n Welcome to our next meeting.\n\n0:00:35\tSPEAKER_04\n I have a couple of points we should discuss.\n\n0:00:38\tSPEAKER_04\n The proposal.\n\n0:00:39\tSPEAKER_04\n I'll go through the proposal.\n\n0:00:40\tNone\n I'll go through the proposal.\n\n0:00:41\tSPEAKER_04\n Yep.\n\n0:00:42\tSPEAKER_04\n And furthermore, as most of you know, I believe in 10th of December.\n\n0:00:49\tSPEAKER_04\n I think we should discuss how we proceed in the meantime.\n\n0:00:52\tSPEAKER_04\n Because I'd like to say different signals, on statements, I believe as I keep having the higher probabilities that will return a case for the procedure, together, Jacob Anvis, and IEP66, it will be.\n\n0:01:08\tSPEAKER_04\n I would like to say, our year stage will be end of January.\n\n0:01:11\tSPEAKER_04\n So that means you have to get over six weeks and then furthermore, I would like to know the status of everybody.\n\n0:01:19\tSPEAKER_04\n No, for sure.\n\n0:01:20\tSPEAKER_04\n Okay.\n\n0:01:21\tSPEAKER_04\n Um, guys, you will have your plans and then we'll have your plans, what is ongoing process concerning your work, okay from you is definitely clear, what are your current plans and need my maybe use and also what we have discussed before and so I think the ongoing process is you use AIA and also this new current work.\n\n0:01:45\tSPEAKER_04\n And for my point it seems to be clear that I will go back definitely a tenth of December and I mentioned before probably will be more than 50% of what I would like to say that I will be come back to get the freedom to relance here the project in the sense or ever kind of form and get the principle paid by another project within Zeeman's.\n\n0:02:11\tSPEAKER_04\n So the point is how long I will stay, I will be a couple of months definitely and based on the success I think that's always an ongoing process to go back to Germany for a couple of weeks and then come here and go on with this work.\n\n0:02:25\tSPEAKER_04\n So that is my current opinion concerning how you was dealing with this work ongoing effort.\n\n0:02:31\tSPEAKER_04\n And first of all I would like to first of all thanks to Gidman because he started to use the test pad.\n\n0:02:41\tSPEAKER_04\n He was with his dad. Yeah. So the first box is warning.\n\n0:02:49\tSPEAKER_04\n I will set up definitely my spare time and leave it in the weekends, the second box.\n\n0:02:55\tSPEAKER_04\n And I'm looking for two other volunteers who are setting the set in the first box.\n\n0:02:59\tSPEAKER_06\n But what are the boxes?\n\n0:03:01\tSPEAKER_06\n Boxes, PCs.\n\n0:03:03\tSPEAKER_04\n But what?\n\n0:03:05\tSPEAKER_04\n Equipers, we should equip it with linux or maybe three feet.\n\n0:03:09\tSPEAKER_01\n First stop the first thing the most complicated is to fit them with the removal, removal hard disk.\n\n0:03:19\tSPEAKER_01\n But it's yeah.\n\n0:03:21\tSPEAKER_01\n So the first computer had to, what's the right word, I had to put everything out to put the removal hard disk in the box.\n\n0:03:35\tSPEAKER_01\n Yeah, it's ID, but it's not very difficult or something like that.\n\n0:03:43\tSPEAKER_01\n So you just have to...\n\n0:03:45\tSPEAKER_04\n Why were laughing?\n\n0:03:47\tSPEAKER_04\n I don't know. I didn't see him.\n\n0:03:51\tSPEAKER_04\n I don't know what he did.\n\n0:03:53\tSPEAKER_04\n I was running it. I was definitely...\n\n0:03:55\tSPEAKER_01\n So will that set up the second computer?\n\n0:03:57\tSPEAKER_04\n Yeah, maybe.\n\n0:03:59\tSPEAKER_04\n I don't know about your time cost.\n\n0:04:01\tSPEAKER_06\n I can build any computer installing whatever it needed.\n\n0:04:07\tSPEAKER_06\n I mean, I really enjoy doing it.\n\n0:04:11\tSPEAKER_06\n That's okay for me.\n\n0:04:13\tSPEAKER_04\n Maybe also to support your own...\n\n0:04:15\tSPEAKER_04\n No promises.\n\n0:04:17\tSPEAKER_04\n And even maybe to support your IGMP stuff on it.\n\n0:04:21\tSPEAKER_02\n No promises.\n\n0:04:25\tSPEAKER_04\n No promises.\n\n0:04:27\tSPEAKER_01\n So it's about one hour to put this hard disk in and a further hour to...\n\n0:04:35\tSPEAKER_01\n Well, two hours, three hours to install your operating system.\n\n0:04:39\tSPEAKER_04\n We've been waiting until the network is one and because it's not the most...\n\n0:04:43\tSPEAKER_04\n Yeah, the most...\n\n0:04:45\tSPEAKER_04\n Based on certain firewall constraints, I believe David is currently working on that to set up the firewall and he's not an expert for that.\n\n0:04:53\tSPEAKER_04\n And when I get the signal, I would ask one more time.\n\n0:04:57\tSPEAKER_04\n But that's thanks to...\n\n0:04:59\tSPEAKER_04\n Do you network such internet connectivity?\n\n0:05:01\tSPEAKER_04\n Yes, we have for secure socket and for web access, the firewall is over there.\n\n0:05:07\tSPEAKER_04\n But Kali is not working, right?\n\n0:05:11\tSPEAKER_01\n Right. On Friday when I installed Linux the first time, I got access to the local network here.\n\n0:05:19\tSPEAKER_01\n But not to any machines outside of ICSI.\n\n0:05:25\tSPEAKER_01\n And till Monday there's no access at all to any machines, also not to insulate machines.\n\n0:05:31\tSPEAKER_01\n So I think it's related to the work they've done on Sunday here and I...\n\n0:05:37\tSPEAKER_02\n Is it only you should have access to all the instruments?\n\n0:05:41\tSPEAKER_02\n Yes, it's time.\n\n0:05:43\tSPEAKER_04\n It's not the Internet, outside access, but not the Internet and not the Air again or whatever time.\n\n0:05:49\tSPEAKER_02\n No, no.\n\n0:05:51\tSPEAKER_02\n No, no USB.\n\n0:05:53\tNone\n The FDP is...\n\n0:05:55\tNone\n Or not, I don't know.\n\n0:05:57\tSPEAKER_04\n Because the point is that we will use it as it describes several times, that we will use it as a local network.\n\n0:06:03\tSPEAKER_04\n But it doesn't make sense to use certain kinds of media, transportation, to put some stuff you need from your PC or your... to this...\n\n0:06:13\tSPEAKER_04\n To this testpad, you know.\n\n0:06:15\tSPEAKER_04\n So you download it, it must be possible from the network normative.\n\n0:06:19\tSPEAKER_04\n It should be used as...\n\n0:06:22\tSPEAKER_04\n For demonstration, or to figure out if you have a scenario where you have to use more than one box, which you have on your desktop.\n\n0:06:30\tSPEAKER_04\n So that is the primary reason for this testpad.\n\n0:06:35\tSPEAKER_04\n So there, they will have to have WebExcess, which will download the necessary files.\n\n0:06:44\tSPEAKER_04\n So on the third or more, one more thanks to Claudia.\n\n0:06:48\tSPEAKER_04\n She did a lot of work and I could only...\n\n0:06:52\tSPEAKER_00\n Other testpad.\n\n0:06:53\tSPEAKER_04\n...and some devices and some discusses with her concerning the web pages.\n\n0:06:56\tSPEAKER_04\n And now, yeah, I'm in the position of the state we have to do with the project.\n\n0:07:01\tSPEAKER_04\n There are also some contributions from yoga I requested.\n\n0:07:06\tSPEAKER_04\n And a lonely page in front of where we have to...\n\n0:07:10\tSPEAKER_04\n It's primarily my job, I just set up.\n\n0:07:13\tSPEAKER_04\n It's adjusted to the people who are worse to be...\n\n0:07:17\tSPEAKER_04\n...alone's...\n\n0:07:19\tSPEAKER_04\n...alone's...\n\n0:07:20\tSPEAKER_04\n...alone's.\n\n0:07:21\tSPEAKER_04\n...alone's.\n\n0:07:22\tSPEAKER_04\n I'm not sure how to do it.\n\n0:07:23\tSPEAKER_05\n No, it is good to get in that.\n\n0:07:25\tSPEAKER_04\n This good getting in that.\n\n0:07:27\tSPEAKER_04\n But I think everybody should take a look to the web pages.\n\n0:07:36\tSPEAKER_04\n And in front of Claudia, if something has to be approved or there are some comments...\n\n0:07:44\tSPEAKER_04\n He's lucky, I was a type one.\n\n0:07:48\tSPEAKER_04\n And because it's very important, maybe not for us, maybe for our successors and maybe somebody will come back once a day or send some comments.\n\n0:07:56\tSPEAKER_04\n Or some colleagues or whatever.\n\n0:07:59\tSPEAKER_04\n So my point of view, I will document an average thing when I believe here in the sense that potential successors and group leaders can group in with these things.\n\n0:08:11\tSPEAKER_04\n And that these web pages will be updated every time when it is necessary.\n\n0:08:17\tSPEAKER_04\n We try to do it, that it must be at least updated only when really major changes happen.\n\n0:08:22\tSPEAKER_04\n That means somebody is leaving the group, somebody is joining the group, the new project is started.\n\n0:08:28\tSPEAKER_04\n But the effort should be minimized as possible.\n\n0:08:31\tSPEAKER_04\n And so please take a look to the web pages.\n\n0:08:35\tSPEAKER_04\n And I have announced in the project area the major headlines.\n\n0:08:43\tSPEAKER_04\n And especially a little bit maybe you can write something about yours. I call it multi-carcens and develop my deployment for a specific multi-carc.\n\n0:08:55\tSPEAKER_04\n Maybe a few lines, maybe a picture.\n\n0:08:58\tSPEAKER_04\n And something like that should be added with the AIA or case that's my stuff.\n\n0:09:02\tSPEAKER_04\n And then the next point is that this active routing stuff.\n\n0:09:12\tSPEAKER_04\n I would like to discuss it before, but you were busy.\n\n0:09:17\tSPEAKER_04\n And so I believe it must be adjusted to the current activities a little bit more.\n\n0:09:26\tSPEAKER_04\n And I think it is not worth to discuss it now because nobody has it.\n\n0:09:33\tSPEAKER_04\n And so let us have a bilateral discussion afterwards.\n\n0:09:42\tSPEAKER_04\n Your contribution is related to certain kind of things that haven't here.\n\n0:09:46\tSPEAKER_04\n That means with the project proposal itself.\n\n0:09:50\tSPEAKER_04\n And also maybe to the USIA AIA architecture.\n\n0:09:54\tSPEAKER_04\n That sends certain stages because it's a general architecture.\n\n0:09:57\tSPEAKER_04\n And so that certain stages maybe to future mobile core networks that it is related to these kind of things.\n\n0:10:06\tSPEAKER_04\n And what I have in mind is that things should not be started from the end system.\n\n0:10:12\tSPEAKER_04\n Just my principle of concern because set will now be happy for my point of view.\n\n0:10:18\tSPEAKER_04\n It should be started as the actual device.\n\n0:10:21\tSPEAKER_04\n So that the certain kind of mechanism of whatever is enabled between the increased edge device and the output edge device.\n\n0:10:29\tSPEAKER_04\n Because it will be at a certain stage IP based as a future generation to the communication networks.\n\n0:10:34\tSPEAKER_04\n Before it's going through the overall internet.\n\n0:10:38\tSPEAKER_04\n Between these both boxes, I can assume because the mobility happens there as a normal network sink.\n\n0:10:47\tSPEAKER_04\n And so forwardly processing or outing process should be no more separated from my point of view.\n\n0:10:52\tSPEAKER_04\n And to have their certain kind of intelligent mechanism that packets can be used to set up so house because they have also information.\n\n0:11:00\tSPEAKER_04\n They know where they have to go because I feel as if they're there within the packet.\n\n0:11:05\tSPEAKER_04\n And how can these use within these areas?\n\n0:11:08\tSPEAKER_04\n And how is this area is an aligned to the more traditional routing within the internet backbone itself?\n\n0:11:15\tSPEAKER_04\n That's my question.\n\n0:11:17\tSPEAKER_04\n I think that's a good research area.\n\n0:11:19\tSPEAKER_04\n And I think there's a lot of expert.\n\n0:11:21\tSPEAKER_04\n Oh, for this.\n\n0:11:22\tSPEAKER_04\n I believe there's a lot of potential.\n\n0:11:25\tSPEAKER_04\n And we should discuss it maybe in that other afterwards.\n\n0:11:30\tSPEAKER_04\n So one more time, everybody should take a look through the web pages.\n\n0:11:36\tSPEAKER_04\n And from Claudia is there a general in Marx.\n\n0:11:38\tSPEAKER_04\n And should write based on the headlight of the project proposal.\n\n0:11:44\tSPEAKER_04\n So things what still happened, the things what they have still in mind.\n\n0:11:52\tSPEAKER_04\n So that we can update these last, you know, the last major part of the web pages.\n\n0:11:59\tSPEAKER_01\n The pages are already on the web.\n\n0:12:01\tSPEAKER_01\n Yes, it is.\n\n0:12:02\tSPEAKER_04\n The panel excesses normally was maybe.\n\n0:12:04\tSPEAKER_04\n So there are some gaps.\n\n0:12:05\tSPEAKER_00\n So there are some gaps.\n\n0:12:06\tSPEAKER_04\n So I've got the E1.\n\n0:12:07\tSPEAKER_04\n And so.\n\n0:12:09\tSPEAKER_07\n Okay.\n\n0:12:10\tSPEAKER_07\n So there are some gaps left.\n\n0:12:14\tSPEAKER_07\n Maybe you can also read through the other text which is on the web pages.\n\n0:12:17\tSPEAKER_07\n Because I like to change the text a bit.\n\n0:12:19\tSPEAKER_07\n Because sometimes it's too long, sometimes it's too short.\n\n0:12:22\tSPEAKER_07\n Maybe the English is not that good.\n\n0:12:24\tSPEAKER_07\n But anyways, so I tried to do this today.\n\n0:12:28\tSPEAKER_07\n And if you could do it afterwards, it would be really nice.\n\n0:12:31\tSPEAKER_07\n Because I'm quite sure that I can find every like graphic.\n\n0:12:35\tSPEAKER_06\n There are a couple of comments I have about the web pages.\n\n0:12:39\tSPEAKER_06\n I think it's Joe's graphic.\n\n0:12:41\tSPEAKER_06\n I think it should be.\n\n0:12:42\tSPEAKER_06\n Yeah, the graphics are too bad.\n\n0:12:43\tSPEAKER_04\n Maybe you are wanting at it.\n\n0:12:44\tSPEAKER_04\n It was a good save.\n\n0:12:46\tSPEAKER_06\n And then maybe the ICSI logo could be.\n\n0:12:50\tSPEAKER_06\n I can't change something with logo.\n\n0:12:53\tSPEAKER_06\n No, it is just maybe we can translate the white color into transparent color.\n\n0:13:01\tSPEAKER_06\n So it will get more natural.\n\n0:13:04\tSPEAKER_06\n Good.\n\n0:13:05\tSPEAKER_07\n Another thing is I want to get a link on the logo so that you can come from the logo to the ICSI web page.\n\n0:13:12\tSPEAKER_07\n That's some things I have to do.\n\n0:13:17\tSPEAKER_07\n If you have something which I should put on the web page for you.\n\n0:13:20\tSPEAKER_07\n So some pages will be nice if you sent it.\n\n0:13:23\tSPEAKER_07\n It will be nice.\n\n0:13:24\tSPEAKER_07\n And the page will be nice if you send it.\n\n0:13:26\tSPEAKER_07\n And then the page will be about some information for people who are newcomers.\n\n0:13:33\tSPEAKER_07\n Or I don't know, good word for it.\n\n0:13:35\tSPEAKER_07\n Should we use new cameras or somebody with new arriving here or wants to send an application?\n\n0:13:45\tSPEAKER_07\n Newbies.\n\n0:13:46\tSPEAKER_02\n Huh?\n\n0:13:47\tSPEAKER_07\n Newbies.\n\n0:13:48\tSPEAKER_07\n Newbies?\n\n0:13:49\tSPEAKER_07\n Okay.\n\n0:13:51\tSPEAKER_07\n So they have to add some information.\n\n0:13:54\tSPEAKER_07\n I don't know.\n\n0:13:55\tSPEAKER_07\n I tried to set up everything by today for this page because I have started with this.\n\n0:14:00\tSPEAKER_07\n I have any kind of ideas what was important for you.\n\n0:14:04\tSPEAKER_07\n Because I have some points like Pacific Bell, long distance carriers, cars and car insurances, health insurances.\n\n0:14:18\tSPEAKER_07\n So health insurances is something I can only say for German people.\n\n0:14:21\tSPEAKER_07\n So maybe I don't know if this is different in Spain that will be fine to have some information or in Holland.\n\n0:14:29\tSPEAKER_06\n So maybe you will take a look and I will tell you some of the things.\n\n0:14:31\tSPEAKER_07\n Yeah.\n\n0:14:32\tSPEAKER_07\n So maybe how you did it or whatsoever.\n\n0:14:34\tSPEAKER_07\n So maybe I will tell you some of the things because I have something.\n\n0:14:36\tSPEAKER_07\n Yeah.\n\n0:14:37\tSPEAKER_07\n Then what else did I have?\n\n0:14:39\tSPEAKER_07\n And other points like what about bank?\n\n0:14:42\tSPEAKER_07\n So transferring your money from Europe over here, what is the cheapest way or what could you recommend or something?\n\n0:14:50\tSPEAKER_07\n Another point.\n\n0:14:52\tSPEAKER_07\n Yeah.\n\n0:14:53\tSPEAKER_07\n There is another point like going out in Berkeley or what to do in Berkeley and the neighbourhood.\n\n0:14:59\tSPEAKER_02\n So this stuff is not that's written in the group energy.\n\n0:15:02\tSPEAKER_07\n No, I know.\n\n0:15:03\tSPEAKER_04\n Yeah but no matter who is that.\n\n0:15:05\tSPEAKER_07\n But there is nothing like this on the XC page as far as I know.\n\n0:15:10\tSPEAKER_04\n So, and the point we discussed it still a couple of months ago.\n\n0:15:14\tSPEAKER_04\n The point is normally it is, I see it's item anyway.\n\n0:15:19\tSPEAKER_02\n Yes, it's at least it should be what I think are the issues.\n\n0:15:24\tSPEAKER_06\n Well, they have a white booklet probably.\n\n0:15:28\tSPEAKER_04\n Yeah, but it's not on the web.\n\n0:15:31\tSPEAKER_04\n No, no, no.\n\n0:15:33\tSPEAKER_04\n Normally that was my...\n\n0:15:37\tSPEAKER_06\n In fact, the Pacific Alphon was not working for example.\n\n0:15:40\tSPEAKER_06\n When I tried the phone on this booklet, it was not working.\n\n0:15:44\tSPEAKER_06\n But the thing is that maybe this could be an starting point or...\n\n0:15:50\tSPEAKER_07\n I don't know, maybe I talked with Jane about this.\n\n0:15:53\tSPEAKER_07\n If we can use this information, I don't know, somewhere on the XC home page.\n\n0:15:58\tSPEAKER_02\n Maybe every group has somewhere hidden...\n\n0:16:05\tSPEAKER_02\n The point is that nobody feels responsible for that.\n\n0:16:10\tSPEAKER_02\n But my point is that it should not be under the internet group.\n\n0:16:14\tSPEAKER_04\n It's a common.\n\n0:16:16\tSPEAKER_04\n Yes, but it sees at your point.\n\n0:16:19\tSPEAKER_04\n But if it is under the nightclub, the group leaders responsible to get up to date information.\n\n0:16:23\tSPEAKER_04\n I believe there's a group where the people are changing much more fast that we join the group and to use the group as other groups.\n\n0:16:32\tSPEAKER_04\n So, the most problem, is that there's a people here in this group with this information, much more often as other groups.\n\n0:16:44\tSPEAKER_02\n That could still be applicable if you put it under the XC side if you take responsibility for it.\n\n0:16:52\tSPEAKER_02\n I talked to Jane about this.\n\n0:16:54\tSPEAKER_02\n I think both arguments are not...\n\n0:16:56\tSPEAKER_02\n arguments against having this under the normal IC side page or under the network page.\n\n0:17:04\tSPEAKER_05\n But your problem is, are you allowed to change anything on the general XC server?\n\n0:17:09\tSPEAKER_07\n No, this is why I have to talk to Jane.\n\n0:17:11\tSPEAKER_05\n So, maybe in just a link from the main image to the web of this structure.\n\n0:17:15\tSPEAKER_04\n So, real unique street in compliance and in accordance with what you...\n\n0:17:21\tSPEAKER_04\n this structure of web pages.\n\n0:17:26\tSPEAKER_04\n And that means the group leader normally do not have access to the general web pages.\n\n0:17:32\tSPEAKER_04\n It has access to the end of the page.\n\n0:17:36\tSPEAKER_04\n But I think there's an administration problem in the library.\n\n0:17:39\tSPEAKER_04\n There are the agrees as the information page must be on the general, on the highest level.\n\n0:17:45\tSPEAKER_04\n Okay, there's no problem with that.\n\n0:17:48\tSPEAKER_01\n I think you're argument is...\n\n0:17:51\tSPEAKER_01\n I think we have to have to write to change it.\n\n0:17:55\tSPEAKER_01\n So, if there's anything changing in insurances or something like that, that we have access to this page further on to make any changes.\n\n0:18:05\tSPEAKER_07\n Yeah, this is not a problem at all.\n\n0:18:07\tSPEAKER_07\n I mean, if you are coming from Germany and you know that they have something changed with the health insurance, then you send Jane an email like, could you please change this?\n\n0:18:14\tSPEAKER_05\n Yeah, but that's more complicated.\n\n0:18:16\tSPEAKER_05\n That's the whole problem that nobody wants to do it.\n\n0:18:19\tSPEAKER_05\n Yeah, okay.\n\n0:18:20\tSPEAKER_04\n You know how close as you was at the end of the page.\n\n0:18:23\tSPEAKER_04\n Yes.\n\n0:18:24\tSPEAKER_04\n And that was a reason.\n\n0:18:26\tSPEAKER_04\n We finally decided that we put it to the information on the end of the page.\n\n0:18:31\tSPEAKER_04\n We have to start with this.\n\n0:18:33\tSPEAKER_01\n I think the best solution is really to put a link on the ICSI page to this stuff.\n\n0:18:40\tSPEAKER_01\n And the stuff itself is located at our server.\n\n0:18:46\tSPEAKER_04\n In our directory.\n\n0:18:48\tSPEAKER_04\n Yeah, in our directory.\n\n0:18:50\tSPEAKER_04\n Yeah, so it's a link.\n\n0:18:52\tSPEAKER_07\n And then we have to ask this.\n\n0:18:54\tSPEAKER_07\n Another point is I would like to add another button, something which is called like events or, I don't know, yeah, I guess like all the events where we could announce talks which are, you know, future talks for the future.\n\n0:19:10\tSPEAKER_07\n And we could also have a link on, for instance, the two workshops which are going on last summer.\n\n0:19:18\tSPEAKER_07\n So, Hanna's workshop and then the workshop from Oliver.\n\n0:19:21\tSPEAKER_07\n That there might be a link behind this workshops and or format talks we have.\n\n0:19:25\tSPEAKER_07\n So, like, from people who have been here before.\n\n0:19:28\tSPEAKER_07\n And you went to publish their slides or an article or whatsoever behind there.\n\n0:19:33\tSPEAKER_07\n So that we have like a button for events which are where workshops can be announced or old workshops could be shown or whatever.\n\n0:19:43\tSPEAKER_04\n Because that is a living thing.\n\n0:19:45\tSPEAKER_04\n I think it's a good idea.\n\n0:19:46\tSPEAKER_04\n Not only that the workshop was a talk and on because they are still announced that it was a broader sense.\n\n0:19:51\tSPEAKER_04\n But I think that the different cloud is very good that the slides on the talks here.\n\n0:19:57\tSPEAKER_04\n If it's worse to have it on the web anyway.\n\n0:20:00\tSPEAKER_04\n It should be published in that way that the people can access it.\n\n0:20:04\tSPEAKER_04\n I have my website, I have a slides maybe.\n\n0:20:07\tSPEAKER_04\n Yeah, with some things.\n\n0:20:09\tSPEAKER_04\n And it's going on maybe you have some multi-card slides concerning your own about your NPN.\n\n0:20:17\tSPEAKER_04\n And if you have some talks from X term and we have some in the past, you can also put the slides on.\n\n0:20:26\tSPEAKER_04\n Because there's still a growing context of opportunity for the people you know.\n\n0:20:31\tSPEAKER_04\n Oh, is this guided?\n\n0:20:32\tSPEAKER_04\n Something that maybe I can contact him and ask him what he likes to do with something, contribute, whatever.\n\n0:20:39\tSPEAKER_04\n So that's interesting.\n\n0:20:41\tSPEAKER_04\n It's a great idea from Canada to perhaps this event page because it's not a big deal.\n\n0:20:46\tSPEAKER_07\n No, it's easy to edit.\n\n0:20:48\tSPEAKER_04\n Yeah, then it's not okay.\n\n0:20:49\tSPEAKER_04\n There are no events and there are no events.\n\n0:20:51\tSPEAKER_04\n But we still have a few which happened in the last year.\n\n0:20:54\tSPEAKER_04\n And it's okay, then it is a going thing.\n\n0:20:57\tSPEAKER_04\n It's done automatically.\n\n0:20:59\tSPEAKER_04\n That's a goal.\n\n0:21:00\tSPEAKER_04\n Or the goal put some things on the web.\n\n0:21:04\tSPEAKER_04\n Something into the center page.\n\n0:21:08\tSPEAKER_04\n Everybody agree?\n\n0:21:11\tSPEAKER_01\n I don't know.\n\n0:21:12\tSPEAKER_01\n Maybe it could be a good thing if we have such an event button that somewhere beneath this button or wherever.\n\n0:21:21\tSPEAKER_01\n That there's a date when the last update was.\n\n0:21:25\tSPEAKER_01\n So that you know it's worse to click this button to see there's a new announcement or not.\n\n0:21:33\tSPEAKER_01\n Otherwise you are often clicking this button and you get your old information or even an empty page.\n\n0:21:41\tSPEAKER_07\n Yeah, but this will be done down on the button on the page anyways.\n\n0:21:44\tSPEAKER_04\n Maybe we can have updated or you know the button.\n\n0:21:47\tSPEAKER_04\n Yeah, something like that.\n\n0:21:48\tSPEAKER_04\n Then update it.\n\n0:21:51\tSPEAKER_04\n Last update.\n\n0:21:52\tSPEAKER_04\n Maybe something happened.\n\n0:21:53\tSPEAKER_04\n I don't know how we do with that.\n\n0:21:55\tSPEAKER_04\n So it's just a suggestion.\n\n0:21:58\tSPEAKER_01\n I don't know how easy this to implement something like that.\n\n0:22:02\tSPEAKER_07\n Yeah, okay.\n\n0:22:04\tSPEAKER_04\n Okay.\n\n0:22:06\tSPEAKER_04\n Let's consider.\n\n0:22:10\tSPEAKER_00\n Okay.\n\n0:22:13\tNone\n Okay.\n\n0:22:16\tSPEAKER_04\n So that's the next point.\n\n0:22:19\tSPEAKER_04\n And I believe.\n\n0:22:22\tSPEAKER_04\n Yeah.\n\n0:22:25\tSPEAKER_04\n That's the last one.\n\n0:22:29\tSPEAKER_04\n This one that I would like to know the status as far as possible from everybody concerning his future intention here.\n\n0:22:38\tSPEAKER_04\n And I see that I know that even the country where he considered currency, the country viewed here to as a proposal.\n\n0:22:47\tSPEAKER_04\n Because you know I'm facing the problem if I go back to Siemens and say okay, there's a potential.\n\n0:22:53\tSPEAKER_04\n There's a potential context.\n\n0:22:55\tSPEAKER_04\n Probably maybe no money.\n\n0:22:57\tSPEAKER_04\n If you go in one direction, it is worse to know that people can still go on in that area of some kind of work and they are back in the university of that company.\n\n0:23:07\tSPEAKER_04\n And even there's another one should have part time jobs and if it's come to a real proposal that maybe the people can move in one more time because that needs this information definitely to inform.\n\n0:23:25\tSPEAKER_04\n So Siemens management that is worse to simply back here.\n\n0:23:29\tSPEAKER_04\n So maybe it would work you can start to believe and of generally definitely.\n\n0:23:34\tSPEAKER_04\n And currently you see no chance as far as I know to stay longer here.\n\n0:23:40\tSPEAKER_04\n And either you will go back to KPN or you will stay here and find a job opportunity in another company.\n\n0:23:48\tSPEAKER_04\n Is that why can you give us more detailed concern as status?\n\n0:23:54\tSPEAKER_02\n No.\n\n0:23:57\tSPEAKER_07\n I think it's happening.\n\n0:24:04\tSPEAKER_07\n For me everything has completely changed.\n\n0:24:06\tSPEAKER_07\n So now I go back and I don't know anything what to do.\n\n0:24:09\tSPEAKER_07\n So I have to sort everything out when I'm back in Germany.\n\n0:24:12\tSPEAKER_07\n But I won't go back to the university.\n\n0:24:15\tSPEAKER_04\n So you are looking for a job.\n\n0:24:17\tSPEAKER_04\n Probably then okay.\n\n0:24:18\tSPEAKER_04\n Because we are not going to say you were lost for that.\n\n0:24:21\tSPEAKER_04\n I don't know.\n\n0:24:27\tSPEAKER_02\n I think so.\n\n0:24:31\tSPEAKER_02\n Lost this maybe did.\n\n0:24:33\tSPEAKER_02\n Yeah.\n\n0:24:34\tSPEAKER_02\n I can't say you were missing that.\n\n0:24:36\tSPEAKER_02\n But I think you were also a KPN.\n\n0:24:39\tSPEAKER_02\n It's lost for the ICO.\n\n0:24:43\tSPEAKER_02\n So we are not going to have a budget cut.\n\n0:24:46\tSPEAKER_02\n Nothing is possible in the motion.\n\n0:24:49\tSPEAKER_04\n So from your side, the statement is that independent of your person, KPN is not willing to send us another cut.\n\n0:25:02\tSPEAKER_04\n Any way.\n\n0:25:04\tSPEAKER_04\n And if they are interested in a certain kind of project, then it must be related to the certain kind of service or certain kind of end-sister or your product or whatever kind of thing.\n\n0:25:17\tSPEAKER_02\n It's going to be different.\n\n0:25:20\tSPEAKER_02\n It will be a start-up.\n\n0:25:23\tSPEAKER_02\n And then they are working on a few of them in this area.\n\n0:25:27\tSPEAKER_02\n But it's outside of ICO.\n\n0:25:31\tSPEAKER_04\n So KPN and I say, I believe.\n\n0:25:37\tSPEAKER_04\n And I'm totally intent to do it the last two months.\n\n0:25:42\tSPEAKER_02\n Holiday.\n\n0:25:48\tSPEAKER_02\n I am working on something an open source.\n\n0:25:52\tSPEAKER_02\n Because I can't come back.\n\n0:25:55\tSPEAKER_02\n Well, it's a little bit out of Mark.\n\n0:25:58\tSPEAKER_02\n Right now I'm interested and I'm looking into it and working.\n\n0:26:01\tSPEAKER_02\n I started yesterday actually working on it to do an implementation of the protocol that was designed by Mark on an open source as it's different from the one that's of Mark's project.\n\n0:26:14\tSPEAKER_04\n Do you finish that?\n\n0:26:17\tSPEAKER_04\n I do.\n\n0:26:18\tSPEAKER_04\n I finish that until the end of the challenge.\n\n0:26:20\tSPEAKER_02\n I wanted to be a little bit hard-talked.\n\n0:26:24\tSPEAKER_02\n I was like, it's right.\n\n0:26:27\tSPEAKER_04\n I'm working with it.\n\n0:26:32\tSPEAKER_06\n Oh, I'll be here until the end of your life.\n\n0:26:38\tSPEAKER_06\n And well, even later, if there is some interesting work going on, well, I will be able to do some work from Spain to...\n\n0:26:51\tSPEAKER_06\n So that's my future forecast.\n\n0:26:57\tSPEAKER_04\n Do we have some students who could be joined...\n\n0:27:03\tSPEAKER_04\n I assume there isn't some activity made.\n\n0:27:06\tSPEAKER_06\n Well, you know, the problem...\n\n0:27:08\tSPEAKER_06\n I think that we have a problem or a difference in Spain at least compared with the Americans.\n\n0:27:13\tSPEAKER_06\n And is that our students are not getting involved in research until they have finished their studies?\n\n0:27:24\tSPEAKER_06\n So it's something a little bit strange, but this is the...\n\n0:27:28\tSPEAKER_04\n I'm not sorry.\n\n0:27:29\tSPEAKER_05\n They are not in work and they're in service.\n\n0:27:31\tSPEAKER_05\n Yeah.\n\n0:27:32\tSPEAKER_05\n You know...\n\n0:27:34\tSPEAKER_02\n Lectures.\n\n0:27:35\tSPEAKER_06\n You know, they...\n\n0:27:37\tSPEAKER_06\n No, no, no.\n\n0:27:38\tSPEAKER_06\n You have to pass the different tests and you have to study the different subjects until you have finished with this.\n\n0:27:45\tSPEAKER_06\n Well, okay, you can do it by your own, but the thing is that you're not supposed to do it.\n\n0:27:50\tSPEAKER_06\n And usually students are pretty busy for not doing other things.\n\n0:27:55\tSPEAKER_01\n And there's no final master thesis or something like that for the whole platform.\n\n0:28:00\tSPEAKER_06\n Not really.\n\n0:28:01\tSPEAKER_06\n You know, there is, there is, but it is not a research work.\n\n0:28:06\tSPEAKER_06\n Usually it's an application work.\n\n0:28:08\tSPEAKER_06\n So you build a website, you own a commerce site, whatever, or a program, or...\n\n0:28:15\tSPEAKER_04\n I didn't study anything.\n\n0:28:18\tSPEAKER_06\n But it is not something your teacher provides you some research papers in your...\n\n0:28:24\tSPEAKER_06\n Let's say, build a simulator, try to...\n\n0:28:27\tSPEAKER_06\n No, that's a good question.\n\n0:28:29\tSPEAKER_06\n So we have other students, which are people that has a grant, and they are starting as researchers.\n\n0:28:39\tSPEAKER_06\n But this is only connected to your own funding.\n\n0:28:43\tSPEAKER_06\n So if you have projects, you can have people working with you if you don't have a research project.\n\n0:28:50\tSPEAKER_06\n Well, you cannot pay them, so you usually you don't have anybody.\n\n0:28:55\tSPEAKER_06\n So it's kind of dependent on the funding we have in some projects.\n\n0:29:02\tSPEAKER_06\n So it's not sure.\n\n0:29:04\tSPEAKER_06\n Not really sure.\n\n0:29:05\tSPEAKER_04\n Talking about Census students here at the time, I'm talking about...\n\n0:29:10\tSPEAKER_04\n There is an activity at least with an A group that certain kind of activities, or the universities could apply for semester works.\n\n0:29:20\tSPEAKER_04\n Yeah.\n\n0:29:21\tSPEAKER_04\n We have a kind of thing.\n\n0:29:23\tSPEAKER_06\n I think we could find some workforce.\n\n0:29:28\tSPEAKER_06\n Because you can redirect the work as a subject, the work, or something that you can try to...\n\n0:29:39\tSPEAKER_06\n In some subjects, in fact, the topics are more open, so you can introduce some research topics too.\n\n0:29:48\tSPEAKER_06\n But the main thing is that there is a big difference, because students are not supposed to do research work until they have finished.\n\n0:29:58\tSPEAKER_06\n They're great.\n\n0:29:59\tSPEAKER_06\n You can change that.\n\n0:30:01\tSPEAKER_06\n Yeah, sure.\n\n0:30:02\tSPEAKER_02\n Maybe it's pretty healthy for a student to have a project where you have to write some research.\n\n0:30:11\tSPEAKER_06\n Yeah, I think so too.\n\n0:30:13\tSPEAKER_06\n But it also depends on the subjects, because sometimes subjects are fixed, so you cannot give any stuff you want.\n\n0:30:23\tSPEAKER_06\n You have to provide a certain problem for the subject too.\n\n0:30:28\tSPEAKER_06\n But sometimes, especially in the latest courses, things are probably more open, and there's something that can be changed.\n\n0:30:39\tSPEAKER_04\n I'll just mention that you also think.\n\n0:30:44\tSPEAKER_04\n For me, and I said before, I will be funded by the Ministry of German Government, and probably search for projects, or what the idea is. That seems to be sure.\n\n0:30:58\tSPEAKER_04\n And they got absolutely free then to do what I would like to do.\n\n0:31:01\tSPEAKER_04\n I would like to go on as a coup as an Islamic investment, and in the late 19th century, I also have activities as a Georgia Tech.\n\n0:31:11\tSPEAKER_04\n They have now, or PhDs, as a settled, and my next generation of contract, are also going in that sense. So the topic is going on going on.\n\n0:31:23\tSPEAKER_04\n And then I will come back here, and I would like to use these things to maybe come to a closer, bigger project, outside of this goal, with contributions here, further forward from the NSA group, and then from other partners.\n\n0:31:39\tSPEAKER_04\n But this I have definitely discussed with my management, and this will happen in December, in the beginning of January.\n\n0:31:50\tSPEAKER_04\n And I will keep informed to the management, by the way.\n\n0:31:54\tSPEAKER_04\n But also, I assume that my suggestions, if you have a BDFORM conference, email exchange, you wait that time, so that we can inform each other, concerning what I was explaining, what I was talking about, what I was saying.\n\n0:32:11\tSPEAKER_04\n I think we have details, these things, that are one of the other things.\n\n0:32:20\tSPEAKER_04\n Oh, how was your idea and your plans?\n\n0:32:24\tSPEAKER_04\n Well, you're a giant.\n\n0:32:26\tSPEAKER_04\n I will...\n\n0:32:27\tSPEAKER_04\n I think it's a test, but you won't be allowed to do it.\n\n0:32:29\tSPEAKER_01\n No, no, no, no.\n\n0:32:32\tSPEAKER_01\n So I will stay here, did the end of February.\n\n0:32:36\tSPEAKER_01\n And afterwards, at Berlin, I'm... yeah, founded by an institution of the German government, so they are paying me, and I have to do research for them, of course.\n\n0:32:48\tSPEAKER_01\n I have to reach some goals and so on.\n\n0:32:55\tSPEAKER_01\n But on the other hand, there will be some time left, I think, to do some work on this area I started here.\n\n0:33:05\tSPEAKER_01\n And for me, myself, I'm also very interested in, in continuities work.\n\n0:33:11\tSPEAKER_01\n And so that will be manageable.\n\n0:33:15\tSPEAKER_01\n And on the other hand, there are also some students, or...\n\n0:33:20\tSPEAKER_01\n Well, at the moment, it's quite difficult to find students who are doing their master's thesis and so on, because there are not a lot of students, which are in this state and Germany now.\n\n0:33:32\tSPEAKER_01\n But about two years ago, the numbers of students were studying computer science, started to increase again.\n\n0:33:45\tSPEAKER_01\n And so in one or two years, we will have many students, which are performing their master's thesis.\n\n0:33:52\tSPEAKER_01\n And so I think there will also be many students, which are joining in this work.\n\n0:33:58\tSPEAKER_01\n So hopefully, I will find some students, which are joining in.\n\n0:34:07\tSPEAKER_01\n So hopefully, this work will be going on.\n\n0:34:10\tSPEAKER_05\n Okay, it's a little bit for me, and my...\n\n0:34:13\tSPEAKER_05\n So I won't change the topics, I'm here until end of May.\n\n0:34:19\tSPEAKER_05\n And after that, I personally go into a Siemens project with some department of treatment, but related to that topic, but I've done here, so, with some of pre-stage, so that might be more related or loosely related, so at least it's in the same topic.\n\n0:34:39\tSPEAKER_05\n And progress is going on, but it's not that fast going on as I would have liked it.\n\n0:34:47\tSPEAKER_05\n I would like to have it, sorry.\n\n0:34:51\tSPEAKER_04\n So, what is the current status anyway?\n\n0:34:56\tSPEAKER_05\n Currently, I'm looking into quality of self-shooting, and I had discussions with the post-op from the UCB, where we started to collect information to write a paper about quality of serving, rooting for MPLS and an MPLS domain.\n\n0:35:15\tSPEAKER_05\n So you have distributed rooting at the edges.\n\n0:35:20\tSPEAKER_05\n And one aspect is that the information is outdated, but you're not always at the exact information of your link status and so on.\n\n0:35:31\tSPEAKER_05\n So what we have plans of that, and trying to look at some rooting policies or rooting items.\n\n0:35:41\tSPEAKER_03\n Now, as I see in principle, the early RPU MPLS of a certain kind of successor of active rology, because principle of the forwarding part is a little bit de-couple of the logic parts,\n\n0:35:56\tSPEAKER_04\n and this was in principle. Okay, it's much really the subject, but in the broader sense, in that sense, I think there are a certain degree of alignment for the enterprise.\n\n0:36:10\tSPEAKER_05\n So at least from the definition of Christian truly MPLS is a subset of active rooting.\n\n0:36:20\tSPEAKER_05\n So it's very aesthetic, it's no active, but it's sort of active because they have these program statements.\n\n0:36:28\tSPEAKER_04\n There is a separation of ones that I do not use in normal tradition, and data forwarding parts and updated points with only the vialing information.\n\n0:36:38\tSPEAKER_06\n But they are using the same idea of leveling packets with a content descriptor or something.\n\n0:36:48\tSPEAKER_04\n So what I mean is at a certain degree, we have a second point.\n\n0:36:58\tSPEAKER_04\n So my last point, I'm responsible for the proposal itself.\n\n0:37:04\tSPEAKER_04\n I know it's a possibility of us, if I'm not writing something, nothing but heaven.\n\n0:37:10\tSPEAKER_04\n So I believe what you are going out of these activity, you have to use your time to finish your work as your head and mind until the end of February or that life.\n\n0:37:25\tSPEAKER_04\n And of general, sorry, so you will not find any time to contribute any watches as an activity.\n\n0:37:35\tSPEAKER_04\n Then from me, as science, I expect more detailed vision.\n\n0:37:41\tSPEAKER_04\n We can do it as I mentioned before.\n\n0:37:43\tSPEAKER_04\n A little bit afterwards, concerning your work and how you think it could be a significant contribution to the activity, maybe based on the generic USID architecture.\n\n0:37:56\tSPEAKER_04\n I will write as long as I have time here on the proposal itself.\n\n0:38:03\tSPEAKER_04\n And in the Vietrung future, I've a distributed list of small cluster of people.\n\n0:38:14\tSPEAKER_04\n I tried to access one pair several times. He didn't answer because he still had mentions that there's minor funding.\n\n0:38:25\tSPEAKER_04\n I think would help, for instance, to have an English meeting, either here or here or wherever.\n\n0:38:32\tSPEAKER_04\n I have a contact one more time, Professor. What is the name? Well, I'm not even mentioned.\n\n0:38:44\tSPEAKER_04\n Because you are a professor in a responsible for the infrastructure and the USID and the USID as a project, which are related to these activities and the name of intelligent class.\n\n0:38:59\tSPEAKER_04\n I don't know whether I can succeed to get an appointment.\n\n0:39:03\tSPEAKER_04\n But I would distribute a list, contact list, and the interest of each partner, so that everybody can see.\n\n0:39:11\tSPEAKER_04\n Everybody knows that I have a mind. Maybe it's a small NSA-COO activity.\n\n0:39:15\tSPEAKER_04\n Let's have this knowledge linkage to the outer world.\n\n0:39:19\tSPEAKER_04\n Maybe it's an NSA-COO activity with a linkage to the outer world based on the universities at home, there's some linkage. The sub stages, there's an annual activity in this area with supportive home entities and with certain kind of linkage here for the companies that are in the university.\n\n0:39:43\tSPEAKER_04\n The last one, I think is the best one.\n\n0:39:47\tSPEAKER_04\n You see the question, as always, where's the money?\n\n0:39:51\tNone\n I said, oh, poor. I don't know. The second person is how long I stay here.\n\n0:39:56\tSPEAKER_04\n I don't know. So everybody's waiting.\n\n0:39:59\tSPEAKER_04\n And the only activity could come from the NSA-COO.\n\n0:40:04\tSPEAKER_04\n I think it's a evolving process and it takes some time and everything must be a little bit more.\n\n0:40:11\tSPEAKER_04\n But anyway, I would like to get contributions from the people here of the NSA-COO.\n\n0:40:17\tSPEAKER_04\n So the little living thing and the pity that multi-card is a principle removed and we do not have any experts for multi-card anymore.\n\n0:40:28\tSPEAKER_04\n And that makes very hard, I believe, because that is a major.\n\n0:40:33\tSPEAKER_04\n On the least 25% of the world never start.\n\n0:40:41\tSPEAKER_04\n But nevertheless, we have to live as a situation.\n\n0:40:46\tSPEAKER_04\n Right? Right. Again.\n\n0:40:49\tSPEAKER_04\n So maybe we have to rewrite something.\n\n0:40:52\tSPEAKER_04\n Have new ideas going focus more in certain kind of really telecommunication, effort, and the hard thing and cool stuff.\n\n0:41:00\tSPEAKER_04\n And to move upon the version magic hard stuff, it's not a better pity because that's interesting.\n\n0:41:05\tSPEAKER_04\n It's a really, really good source of research work for the future telecommunication core networks because they are still not able to do with multi-card.\n\n0:41:16\tSPEAKER_04\n They still have the talent generation and all these kind of things.\n\n0:41:21\tSPEAKER_04\n And I believe that would be very beneficial if we use it for the mobile scenarios in their network.\n\n0:41:28\tSPEAKER_04\n So by NLA, we have to live as a real situation and then we have to drop multi-card from the proposal.\n\n0:41:38\tSPEAKER_06\n Any comments? All not really.\n\n0:41:43\tSPEAKER_06\n I think that all in the future somebody will come to the NSA group.\n\n0:41:50\tSPEAKER_04\n And we can't extend it all the more time.\n\n0:41:53\tSPEAKER_06\n So no, I mean, that's okay.\n\n0:41:56\tSPEAKER_06\n I think that it cannot be considered the first time tasked to do because nobody is knowledgeable about multi-card thing.\n\n0:42:04\tSPEAKER_06\n But I think that any of us could address this in the future or maybe a new person could address this in the future.\n\n0:42:13\tSPEAKER_06\n So I mean, what I think is that it makes no sense to me to reduce something which is more or less complete because we don't have the person.\n\n0:42:27\tSPEAKER_06\n I think that the way to go is probably the opposite to try to find something which has a meaning by itself and then try to get the resources to do this.\n\n0:42:40\tSPEAKER_04\n Maybe you understand it in a wrong way.\n\n0:42:43\tSPEAKER_04\n I do not mean to drop it to remove the text from the proposal.\n\n0:42:47\tSPEAKER_04\n Okay. I mean activities.\n\n0:42:49\tSPEAKER_04\n Planning activities.\n\n0:42:50\tSPEAKER_04\n That's okay. Sorry, sorry.\n\n0:42:52\tSPEAKER_04\n No, no, because that's why I mentioned that it is an important thing.\n\n0:42:57\tSPEAKER_04\n Currently there's only one new group member, St. Buholz, who will figure out the thing, how to say.\n\n0:43:10\tSPEAKER_04\n Taking into account the end system was a limited end system.\n\n0:43:14\tSPEAKER_04\n Capabilities was respect to mobility and the network itself.\n\n0:43:19\tSPEAKER_04\n Where it should be adapted. Where it should be the adoption process performed to deal with different devices for your weakest access to the network.\n\n0:43:29\tSPEAKER_04\n Should it be in the end system itself, should be in the edge device, should be in the course, should be in the server.\n\n0:43:34\tSPEAKER_04\n These are the questions you would like to figure out and to have a principle and cons of all these different approaches.\n\n0:43:44\tSPEAKER_04\n So that's the only new member who's spent two hours.\n\n0:43:50\tSPEAKER_04\n Because here I invited him and discussed the same.\n\n0:43:53\tSPEAKER_04\n There's what tends to work. I was a fan.\n\n0:43:56\tSPEAKER_02\n Oh, you just want to take it?\n\n0:43:58\tSPEAKER_04\n Yeah.\n\n0:43:59\tSPEAKER_04\n Yeah.\n\n0:44:00\tSPEAKER_04\n He's already an ex-exec.\n\n0:44:01\tSPEAKER_04\n Only for administration stuff.\n\n0:44:02\tSPEAKER_04\n But for the technical discussion he was here one day.\n\n0:44:05\tSPEAKER_04\n There must be three weeks ago.\n\n0:44:08\tSPEAKER_02\n I just met him when I arrived.\n\n0:44:14\tSPEAKER_02\n He was going to...\n\n0:44:20\tSPEAKER_04\n He will come mid-or general.\n\n0:44:26\tSPEAKER_04\n But there's the only guy.\n\n0:44:28\tSPEAKER_04\n He's not reflected in the sense that he removes the text.\n\n0:44:32\tSPEAKER_04\n What I mean is that what's kind of activity we are going with detail is quite an effort.\n\n0:44:39\tSPEAKER_04\n And detail is what detail is.\n\n0:44:45\tSPEAKER_04\n So any other person?\n\n0:44:48\tSPEAKER_04\n Any other command?\n\n0:44:56\tSPEAKER_04\n That we push it start with reading the numbers.\n\n0:45:03\tSPEAKER_04\n Yes, we have to do it.\n\n0:45:05\tSPEAKER_04\n So that means we have to read the transcript number and send the numbers.\n\n0:45:09\tSPEAKER_04\n And if there's a new line short break.\n\n0:45:13\tSPEAKER_04\n And afterwards we have two devices switched on.\n\n0:45:18\tSPEAKER_04\n So please do not switch off the devices.\n\n0:45:21\tSPEAKER_04\n I'll recall again in advance.\n\n0:45:25\tSPEAKER_04\n So I will start.\n\n0:45:29\tSPEAKER_04\n Okay.\n\n0:45:58\tSPEAKER_04\n 0 5 8 0 1 1 4 5 1 0 3 0 4 2 6 4 1 Okay, the next one please\n\n0:46:06\tSPEAKER_07\n Tonight, okay? Transcript is 2 3 1 1 dash 2 3 3 0 1 1 2 6 9 3 3 4 9 5 6 7 0 1 7 6 9 1 0 6 0 2 9 0 4 3 1 9 0 3 7 2 8 8 3 5 1 6 2 0 6 5 2 7 0 0 8 7 6 4 6 7 8 9 5 9 9 0 0\n\n0:46:41\tSPEAKER_06\n Transcript 2 2 9 1 dash 2 3 1 0 0 6 8 8 0 1 7 0 0 2 0 0 2 9 5 3 4 5 0 2 5 9 7 5 3 1 3 0 2 8 3 5 6 0 4 7 9 6 9 9, 9 9 0 9 7 5 5 3 0 1 2 all 5 4 3 9 3 8 5 5 6 8 1 2 2 0 7 7 9 6 8 9 0 0 3\n\n0:47:25\tSPEAKER_02\n Transfer fifth 2271-2290 07 065 1843075 2 3 004 520940 6202 717451 8809 0 0 0 5 4 218 3 6 0 4 0 4 8 6 0 5 6 2 9 9 6 9 6 9 6 7 8\n\n0:48:04\tNone\n 8 8 8 6 4\n\n0:48:07\tSPEAKER_00\n Oh, oh, will it? Did you get up?\n\n0:48:15\tSPEAKER_07\n Oh, I'm so sorry, that was mean, okay?\n\n0:48:19\tSPEAKER_02\n I'm so already standing here when I was here, so then I started laughing Oh, oh, oh\n\n0:48:31\tSPEAKER_05\n Okay, I'll do this Transcript this 2131-250 470-5567-80274 028707-1329-39720 4 5 7 4 1 8 4 6 0 9 5 3 6 9 8 0 0 9 5 5 4 0 1 20465 4 152\n\n0:49:07\tSPEAKER_01\n Okay, transcript number is 2111-213-4509-600066 8375033 970507060 1 2 3 5 3 6 3 6 7 6 7 6 4 108 9 8 9 0 0 7 7 7 2 1 0 1 7 3 4 4 9 7 That's it\n\n", "summary": [{"summary_text": "Next meeting is on 10th of December. Speaker will go back to Germany for a couple of weeks and then come back here. He will be more than 50% of the way through the project and get the freedom to relance it within Zeeman's principle. The year stage will be at the end of January. The proposal will be discussed."}]}