{"filename": "./data/Bro021.txt", "transcript": "0:00:00\tSPEAKER_02\n Okay.\n\n0:00:20\tSPEAKER_05\n Somebody else should run this.\n\n0:00:23\tSPEAKER_05\n I'm sick of being the one sort of go through and say, well what do you think about this?\n\n0:00:28\tSPEAKER_07\n Do you want me to run it today?\n\n0:00:30\tSPEAKER_07\n Why should I?\n\n0:00:31\tSPEAKER_07\n Okay.\n\n0:00:32\tSPEAKER_07\n Let's see maybe we should just get a list of items, things that we should talk about.\n\n0:00:40\tSPEAKER_07\n I guess there's the usual updates everybody going around saying, you know, what they're working on, things that happen the last week, but aside from that, is there anything in particular that anybody wants to bring up?\n\n0:00:53\tSPEAKER_07\n No. Okay. So why don't we just go around it?\n\n0:01:00\tSPEAKER_03\n You want to start?\n\n0:01:02\tSPEAKER_03\n All right. We had the first thing maybe that the Euros pitch paper is accepted.\n\n0:01:11\tSPEAKER_07\n This is what's in the paper there?\n\n0:01:14\tSPEAKER_03\n So it's the paper that described basically the system that we're proposed for the one that\n\n0:01:20\tSPEAKER_07\n we submitted the last round.\n\n0:01:25\tSPEAKER_03\n Right. Two under commands seems from the reviewer.\n\n0:01:30\tSPEAKER_03\n Good.\n\n0:01:34\tSPEAKER_03\n Where is it going to be this year?\n\n0:01:37\tSPEAKER_03\n It's Alborg in Denmark.\n\n0:01:41\tSPEAKER_03\n September.\n\n0:01:46\tSPEAKER_03\n Yeah. Well, I've been working mainly on line normalization this week, trying different, slightly different approaches.\n\n0:02:04\tSPEAKER_03\n The first thing is trying to play a little bit again with the time constant.\n\n0:02:12\tSPEAKER_03\n One thing is trying on line normalization with two different means, one mean for the silence and one for the speech.\n\n0:02:23\tSPEAKER_03\n And so I have two recursions which are controlled by the probability of the voice activity detector.\n\n0:02:33\tSPEAKER_03\n This actually doesn't seem to help.\n\n0:02:37\tSPEAKER_03\n So, but well both online normalization approach seems equivalent.\n\n0:02:44\tSPEAKER_07\n Are the means pretty different?\n\n0:02:47\tSPEAKER_03\n Yes. They can be very different.\n\n0:02:51\tSPEAKER_05\n Do you maybe make errors in different places?\n\n0:02:55\tSPEAKER_03\n I didn't look more closely.\n\n0:03:00\tSPEAKER_03\n It might be here.\n\n0:03:06\tSPEAKER_03\n There is one thing that we can observe is that the mean are more different for C0 and C1 than for the other coefficients.\n\n0:03:20\tSPEAKER_03\n Yeah. C1 is...\n\n0:03:23\tSPEAKER_03\n There is strange thing happening with C1 is that when you have different kind of noises, the mean for the silence portion can be different.\n\n0:03:35\tSPEAKER_03\n So, when you look at the trajectory of C1, it's a strange shape.\n\n0:03:41\tSPEAKER_03\n I was expecting that this two mean helps, especially because of the strange C1 shape, which can...\n\n0:03:53\tSPEAKER_03\n You can have a trajectory for the speech and then when you are in the silence, it goes somewhere.\n\n0:04:01\tSPEAKER_03\n But if the noise is different, it goes somewhere else.\n\n0:04:06\tSPEAKER_03\n So, which would mean that if we estimate the mean based on all the signal, even though we have frame dropping, but we don't frame drop everything, this can hurt the estimation of the mean for speech.\n\n0:04:19\tSPEAKER_03\n But I still have to investigate further, I think.\n\n0:04:24\tSPEAKER_03\n The third thing is that instead of having a fixed time constant, I try to have a time constant that's smaller at the beginning of the utterances to adapt more quickly to the...\n\n0:04:37\tSPEAKER_03\n Something that's closer to the right mean.\n\n0:04:43\tSPEAKER_03\n And then this time constant increases and I have a threshold that...\n\n0:04:49\tSPEAKER_03\n If it's higher than a certain threshold, I keep it to this threshold to still adapt the mean.\n\n0:04:58\tSPEAKER_03\n When...\n\n0:05:00\tSPEAKER_03\n If the utterances long enough to continue to adapt after like one second.\n\n0:05:09\tSPEAKER_03\n Well, this doesn't help neither, but this doesn't hurt.\n\n0:05:16\tSPEAKER_07\n Wasn't there some experiment you were going to try where you did something differently for each?\n\n0:05:23\tSPEAKER_07\n I don't know whether it was each male band or each FFT band or something.\n\n0:05:29\tSPEAKER_07\n There's something you were going to...\n\n0:05:31\tSPEAKER_07\n Some parameter you were going to vary depending on the frequency.\n\n0:05:35\tSPEAKER_07\n I don't know if that was...\n\n0:05:37\tSPEAKER_03\n I guess it was...\n\n0:05:39\tSPEAKER_03\n I don't know, maybe it's this idea of having different online normalization for each...\n\n0:05:47\tSPEAKER_03\n Tuning for the different MFCCs.\n\n0:05:54\tSPEAKER_07\n Yeah, I thought Morgan knew brought it up a couple of meetings ago and then it was something about...\n\n0:05:59\tSPEAKER_07\n Then somebody said, yeah, it does seem like C0 is the one that's the major one.\n\n0:06:06\tSPEAKER_07\n I can't remember exactly what it was now.\n\n0:06:10\tSPEAKER_03\n Actually, yeah, it's very important to normalize C0 and much less to normalize the other coefficients.\n\n0:06:21\tSPEAKER_03\n Well, at least with the current online normalization scheme.\n\n0:06:27\tSPEAKER_03\n I think we kind of know that normalizing C1 doesn't help with the current scheme.\n\n0:06:36\tSPEAKER_03\n In my idea, I was thinking that the reason is maybe because of this funny things that happen between speech and silence, which have different means.\n\n0:06:50\tSPEAKER_03\n But maybe it's not so easy to...\n\n0:06:54\tSPEAKER_05\n I really would like to suggest looking a little bit at the kinds of errors.\n\n0:07:01\tSPEAKER_05\n I know you can get lost in that and go forever and not see too much, but sometimes.\n\n0:07:07\tSPEAKER_05\n Just seeing that each of these things didn't make things better may not be enough.\n\n0:07:12\tSPEAKER_05\n Maybe that they're making them better in some ways and worse than others or increasing insurgents and increasing delusions or...\n\n0:07:21\tSPEAKER_05\n helping with noisy case, but hurting in quiet case. If you saw that, then maybe something would occur to you. How to deal with that.\n\n0:07:32\tSPEAKER_03\n All right.\n\n0:07:38\tSPEAKER_03\n Yeah.\n\n0:07:41\tSPEAKER_03\n So that's it, I think, for the online normalization.\n\n0:07:47\tSPEAKER_03\n I've been playing a little bit with some kind of thresholding.\n\n0:07:54\tSPEAKER_03\n As a first experiment, I think what I did is to take to measure the average, no, the maximum energy of each utterance and then put a threshold.\n\n0:08:16\tSPEAKER_03\n Well, this for each band. Then put a threshold. That's 15 dB below. Well, a couple of dB below this maximum.\n\n0:08:27\tSPEAKER_03\n Actually, it was another threshold. It was just adding noise.\n\n0:08:32\tSPEAKER_03\n I was adding a white noise, energy. That's 15 dB below, the maximum energy of the utterance.\n\n0:08:42\tSPEAKER_03\n Yeah. When we look at the MFCC that results from this, there are a lot more smoother.\n\n0:08:49\tSPEAKER_03\n When we compare like a channel zero and channel one utterance, so a clean and the same noisy utterance.\n\n0:09:00\tSPEAKER_03\n Well, there is almost no difference between the capture coefficient of the two.\n\n0:09:07\tSPEAKER_03\n And the result that we have in terms of speed recognition, actually, it's not worse. It's not better neither.\n\n0:09:15\tSPEAKER_03\n But it's kind of surprising that it's not worse because basically you had noise at 15 dB, just 15 dB below, the maximum energy.\n\n0:09:25\tSPEAKER_07\n So why does that smooth things out? I don't understand.\n\n0:09:29\tSPEAKER_03\n Oh, there's less difference. It's whitening.\n\n0:09:32\tSPEAKER_03\n The portion that are more silent, as you add to a white noise that is very high energy, it whitens everything.\n\n0:09:42\tSPEAKER_03\n And the high energy portion of the speech don't get much affected anyway.\n\n0:09:48\tSPEAKER_03\n The other noise, as the noise you add is the same, the shape is also the same.\n\n0:09:55\tSPEAKER_03\n So the trajectory are very, very similar.\n\n0:09:58\tSPEAKER_05\n I mean, again, if you trained in one kind of noise and tested in the same kind of noise, you know, given enough training data, you don't do badly.\n\n0:10:05\tSPEAKER_05\n The reason we have the problems we have is because it's different in training and test.\n\n0:10:10\tSPEAKER_05\n Even if the general kind is the same, the exact instances are different.\n\n0:10:16\tSPEAKER_05\n So when you whiten it, then it's like the only noise to first order the only noise that you have is white noise, and you've added the same thing for training and test.\n\n0:10:27\tSPEAKER_07\n So would that be similar to doing the smoothing then over time?\n\n0:10:34\tSPEAKER_03\n I think it's different.\n\n0:10:38\tSPEAKER_03\n It's something that affects more of the silent portions because, well, anyway, the portion of speech that have high energy are not a lot affected by the noises in the order of database.\n\n0:10:54\tSPEAKER_03\n If you compare the two channels of speech that are during speech portion, the MFCC are not very different.\n\n0:11:04\tSPEAKER_03\n They are very different when energy is lower, like during fricatives or during speech poses.\n\n0:11:13\tSPEAKER_05\n But you're still getting more recognition errors, which means that the differences, even though they look like they're not so big, are hurting your recognition.\n\n0:11:23\tSPEAKER_03\n So it destroys the speech, right?\n\n0:11:26\tSPEAKER_03\n So performance went down?\n\n0:11:28\tSPEAKER_03\n No, it didn't.\n\n0:11:31\tSPEAKER_03\n So in this case, I really expect that maybe the two stream of features are very different.\n\n0:11:41\tSPEAKER_03\n Maybe we could gain something by combining them.\n\n0:11:45\tSPEAKER_05\n Well, the other thing is that you just picked one particular way of doing it. First place is 15 dB down across the utterance.\n\n0:11:53\tSPEAKER_05\n Maybe you'd want to have something that was a little more daft.\n\n0:11:56\tSPEAKER_05\n Secondly, you happened to pick 15 dB and maybe 20 dB better, or 12.\n\n0:12:01\tSPEAKER_07\n What was the threshold part of it?\n\n0:12:03\tSPEAKER_07\n Was the threshold far down?\n\n0:12:05\tSPEAKER_07\n Yeah.\n\n0:12:06\tSPEAKER_05\n Well, he had to figure out how much to add.\n\n0:12:08\tSPEAKER_05\n So he was looking at the peak value.\n\n0:12:14\tSPEAKER_07\n And so what's, I don't understand, how does it go?\n\n0:12:17\tSPEAKER_07\n If the peak value is above some threshold, then you add the noise, or it's below some.\n\n0:12:22\tSPEAKER_03\n I systematically particularly add the noise, but the noise level is just some kind of threshold below the peak.\n\n0:12:31\tSPEAKER_03\n Oh, I see.\n\n0:12:33\tSPEAKER_03\n Yeah, which is not really, no, it actually is just adding a constant to each of the male energy.\n\n0:12:43\tSPEAKER_03\n To each of the male energy.\n\n0:12:46\tSPEAKER_03\n To each of the male energy.\n\n0:12:49\tSPEAKER_03\n So yeah, it's really white noise.\n\n0:12:52\tSPEAKER_02\n Yeah.\n\n0:12:54\tSPEAKER_05\n So then afterwards the log is taken, and that's sort of why the little variation tends to go away.\n\n0:13:05\tSPEAKER_03\n Yeah, so maybe, well, this threshold is still a factor that we have to look at.\n\n0:13:10\tSPEAKER_03\n I don't know, maybe a constant noise addition would be final.\n\n0:13:19\tSPEAKER_05\n Or not constant, but varying over time.\n\n0:13:24\tSPEAKER_05\n In fact, it's another way to go.\n\n0:13:28\tSPEAKER_03\n Yeah.\n\n0:13:34\tSPEAKER_05\n Were you using the normalization in addition to this? I mean, what was the rest of the system?\n\n0:13:43\tSPEAKER_03\n Yeah, it was the same system.\n\n0:13:49\tSPEAKER_03\n It was the same system.\n\n0:14:01\tSPEAKER_03\n Yeah.\n\n0:14:04\tSPEAKER_03\n The third thing is that I play a little bit with finding what was different between...\n\n0:14:15\tSPEAKER_03\n And there were a couple of differences, like the LDF filters were not the same.\n\n0:14:31\tSPEAKER_03\n He had the French-elect complied localization in the system.\n\n0:14:38\tSPEAKER_03\n The nerve of MFCC was different, you used 13 and we used 15.\n\n0:14:45\tSPEAKER_03\n Well, a bunch of differences.\n\n0:14:48\tSPEAKER_03\n And actually, the result that you got were much better on the IDGET, especially.\n\n0:14:55\tSPEAKER_03\n So I kind of investigated to see what was the main factor of this difference.\n\n0:15:01\tSPEAKER_03\n And it seems that the LDF filter is less hurting.\n\n0:15:08\tSPEAKER_03\n So when we put some noise compensation, the LDF filter that's derived from noisy speeches, not more, any more optimal.\n\n0:15:19\tSPEAKER_03\n And it makes a big difference on the IDGETs, trained on clean.\n\n0:15:27\tSPEAKER_03\n If we use the old LDF filter, I mean the LDF filter that was in the proposal, we have like 82.7% recognition rate on noisy speech when the system is trained on clean speech.\n\n0:15:42\tSPEAKER_03\n But when we use the filter that's derived from clean speech, we jumped from 82.7 to 85.1, which is a huge leap.\n\n0:15:53\tSPEAKER_03\n So now the results are more similar.\n\n0:16:00\tSPEAKER_03\n I will not investigate on the other differences, which is like the number of MFCC that we keep and other small things that we can optimize later on.\n\n0:16:12\tSPEAKER_05\n Sure.\n\n0:16:13\tSPEAKER_05\n But on the other hand, if everybody is trying different kinds of noise suppression things and so forth, it might be good to standardize on the piece that we're not changing.\n\n0:16:20\tSPEAKER_05\n So if there's any particular reason to have pick one or the other, which one is closer to what the proposal was that was submitted to Aurora, are they both?\n\n0:16:34\tSPEAKER_03\n I think the new system that I tested, I guess, is closer because it doesn't have less of a front telecom stuff.\n\n0:16:45\tSPEAKER_01\n But the water you tested with at least, you're like, yeah.\n\n0:16:51\tSPEAKER_05\n Yeah, you're trying to add in front telecom, in front of the rest of it, like you said, the number of filters may be different or something.\n\n0:16:57\tSPEAKER_05\n The number of capsule coefficients.\n\n0:17:00\tSPEAKER_05\n Yeah, so I mean, I think we want to standardize there with me.\n\n0:17:04\tSPEAKER_05\n So I should pick something.\n\n0:17:08\tSPEAKER_03\n I think we were going to work with this new system.\n\n0:17:12\tSPEAKER_01\n So the right now, the system that is there in the, what we have in the repository is, it uses 15.\n\n0:17:19\tSPEAKER_02\n Right.\n\n0:17:21\tSPEAKER_02\n Yeah, so.\n\n0:17:22\tSPEAKER_03\n But we will use the LDA filters derived from clean speech.\n\n0:17:26\tSPEAKER_03\n Yeah, yeah.\n\n0:17:27\tSPEAKER_03\n And so actually it's not the LDA filter.\n\n0:17:29\tSPEAKER_03\n It's something that's also short enough in latency.\n\n0:17:34\tSPEAKER_01\n So we have been always using 15 coefficients, not 30.\n\n0:17:39\tSPEAKER_02\n Yeah.\n\n0:17:42\tSPEAKER_02\n Well, that's something.\n\n0:17:46\tSPEAKER_02\n Yeah.\n\n0:17:49\tSPEAKER_05\n I think as long as you guys agree, it doesn't matter.\n\n0:17:51\tSPEAKER_05\n I think we have a maximum of 60 features that we're allowed to sell.\n\n0:18:00\tSPEAKER_01\n Maybe we can at least run some experiments to see whether, once I have this, noise compensation to see whether 13 and 15 really matters or not.\n\n0:18:12\tSPEAKER_01\n Never tested it with the compensation, but without compensation, it was like 15 was slightly better than 13.\n\n0:18:19\tSPEAKER_01\n So that's why we stuck to 13.\n\n0:18:21\tSPEAKER_03\n And there is so this like energy versus zero.\n\n0:18:26\tSPEAKER_01\n Yeah, the larger the devices is zero.\n\n0:18:28\tSPEAKER_01\n But if that's the other thing, I mean, without noise compensation, certainly zero is better than log energy.\n\n0:18:33\tSPEAKER_01\n I mean, because there are more mismatched conditions than the matching conditions for testing.\n\n0:18:39\tSPEAKER_01\n You know, always for the matched condition, you always get a slightly better performance for log energy than C0.\n\n0:18:45\tSPEAKER_01\n But not for, I mean, for matched and the clean condition, both you get log energy.\n\n0:18:52\tSPEAKER_01\n You get a better performance with log energy.\n\n0:18:55\tSPEAKER_01\n Well, maybe once we have this noise compensation, I know we have to try that also, so that we want to go for C0 log energy.\n\n0:19:05\tSPEAKER_02\n You can see that.\n\n0:19:08\tSPEAKER_07\n So do you have more?\n\n0:19:19\tSPEAKER_07\n That's it, I think.\n\n0:19:21\tSPEAKER_05\n You have anything more than this?\n\n0:19:23\tSPEAKER_05\n No, I'm just, you know, being a manager this week.\n\n0:19:26\tSPEAKER_04\n I'll actually get.\n\n0:19:31\tSPEAKER_04\n Still working on my equals preparation stuff.\n\n0:19:34\tSPEAKER_04\n So I'm thinking about starting some cheating experiments to determine the relative effectiveness of some intermediate categories that I want to classify.\n\n0:19:49\tSPEAKER_04\n So for example, I know where voicing occurs and everything.\n\n0:19:55\tSPEAKER_04\n I do a phone recognition experiment, somehow putting in the perfect knowledge that I have about voicing.\n\n0:20:06\tSPEAKER_04\n So in particular, I was thinking in the hybrid framework, just taking those L&A files and setting to 0 those probabilities that these phones are not voicing.\n\n0:20:22\tSPEAKER_04\n So say like I know this particular segment is voicing.\n\n0:20:26\tSPEAKER_04\n I would say go into the corresponding L&A file and solve out the post-series for those phonemes that are not voiced and then see what kinds of improvements I get.\n\n0:20:40\tSPEAKER_04\n And so this would be a useful thing to know in terms of which of these categories are good for speech recognition.\n\n0:20:54\tSPEAKER_04\n So I hope to get those experiments done by a time queues come around in July.\n\n0:21:01\tSPEAKER_07\n So do you just take the probabilities of the other ones and spread them out evenly among them?\n\n0:21:06\tSPEAKER_04\n Yeah, I was thinking, okay, so just set to some really low number of the non-voiced phones and then re-normalize.\n\n0:21:21\tSPEAKER_07\n That would be really interesting to see.\n\n0:21:24\tSPEAKER_07\n So then you're going to feed those into some standard recognized art.\n\n0:21:29\tSPEAKER_04\n Are you going to do a dig answer?\n\n0:21:31\tSPEAKER_04\n Well, I'm going to work with Timit.\n\n0:21:36\tSPEAKER_07\n And then you'll feed those.\n\n0:21:40\tSPEAKER_07\n Sorry, so where are the outputs of the net going to if you're doing follow.\n\n0:21:43\tSPEAKER_04\n Oh, the outputs of the net go into the standard XE hybrid recognized it.\n\n0:21:49\tSPEAKER_04\n So maybe.\n\n0:21:51\tSPEAKER_07\n And you're going to do phone recognition with the net.\n\n0:21:55\tSPEAKER_04\n Right.\n\n0:22:01\tSPEAKER_04\n Another thing would be to extend this to digits or something where I can look at whole words.\n\n0:22:07\tSPEAKER_04\n And I would be able to see not just like phony events, but interphony events.\n\n0:22:15\tSPEAKER_04\n From stop to a vocalic.\n\n0:22:19\tSPEAKER_04\n Something that's transitional.\n\n0:22:24\tSPEAKER_07\n Yeah.\n\n0:22:27\tSPEAKER_04\n Okay.\n\n0:22:29\tSPEAKER_04\n That's it.\n\n0:22:31\tSPEAKER_07\n Okay.\n\n0:22:32\tSPEAKER_07\n So I haven't done a whole lot on anything related to this.\n\n0:22:36\tSPEAKER_07\n It's weak. I've been focusing mainly on meeting recorders done.\n\n0:22:39\tSPEAKER_07\n So, so just that's it on the day.\n\n0:22:43\tSPEAKER_06\n Well, in my last talk last week, I said I tried phase normalization and gotten garbage results.\n\n0:22:49\tSPEAKER_06\n I didn't have long term means of traction approach. Turned out there was a bug in my mat.\n\n0:22:54\tSPEAKER_06\n I tried it again.\n\n0:22:58\tSPEAKER_06\n And the results were better.\n\n0:23:02\tSPEAKER_06\n I got intelligible speech back, but they're still wearing as good as just the fact that they magnitude.\n\n0:23:08\tSPEAKER_06\n The long magnitude means.\n\n0:23:11\tSPEAKER_06\n And also, I'll be talking to.\n\n0:23:14\tSPEAKER_06\n I'm doing some QL about the smart online which model and about coming up with a good model for.\n\n0:23:21\tSPEAKER_06\n Far might use the smart com system.\n\n0:23:24\tSPEAKER_06\n So I'm going to be working on implementing this means of fashion approach from the.\n\n0:23:30\tSPEAKER_06\n Far make system for the smart com system.\n\n0:23:33\tSPEAKER_06\n And one of the experiments we're going to do is.\n\n0:23:37\tSPEAKER_06\n We're going to train the broadcast news net, which is because that's what we've been using so far.\n\n0:23:43\tSPEAKER_06\n And adapted on some other data.\n\n0:23:47\tSPEAKER_06\n And I just want to use data that resembles red speech.\n\n0:23:52\tSPEAKER_06\n Like these picture readings because he feels that the smart com system interaction is not going to be exactly conversational.\n\n0:24:02\tSPEAKER_06\n So actually, I was wondering how long does it take to train that broadcast news net?\n\n0:24:07\tSPEAKER_05\n The big one takes a while.\n\n0:24:09\tSPEAKER_05\n Yeah, it takes two, three weeks.\n\n0:24:11\tSPEAKER_05\n So, but you know, you can get.\n\n0:24:14\tSPEAKER_05\n I don't know if you want to run the big one in the final system because it takes a little while to run it.\n\n0:24:21\tSPEAKER_05\n So you can scale it down by.\n\n0:24:24\tSPEAKER_05\n I'm sorry, it was two, three weeks for training up for the large broadcast news test set training set.\n\n0:24:29\tSPEAKER_05\n I don't know how much you'd be training on.\n\n0:24:31\tSPEAKER_05\n Full.\n\n0:24:32\tSPEAKER_05\n So if you trained on half as much and made the net half as big, then it would be one fourth.\n\n0:24:37\tSPEAKER_05\n A lot of time and it'd be nearly as good.\n\n0:24:43\tSPEAKER_05\n Also, I guess we had, we've had these little discussions, I guess you have an chance to work with it too much.\n\n0:24:48\tSPEAKER_05\n We've had about other ways of taking care of the phase.\n\n0:24:52\tSPEAKER_05\n So, I mean, I guess I was something I could say would be that we've talked a little bit about just doing it all with complex arithmetic.\n\n0:24:59\tSPEAKER_05\n And not doing the polar representation with magnitude and phase, but it looks like there's ways that one could potentially just work with the complex numbers.\n\n0:25:10\tSPEAKER_05\n And in principle, get rid of the effects of the average complex spectrum.\n\n0:25:17\tSPEAKER_06\n And actually regarding the phase normalization.\n\n0:25:21\tSPEAKER_06\n So I did two experiments and one is, so phases get added modulo 2 pi.\n\n0:25:29\tSPEAKER_06\n Because you only know the phase of the complex number of the two, about you modulo 2 pi.\n\n0:25:33\tSPEAKER_06\n And so I thought it first, that what I should do is unwrap the phase, because that will undo that.\n\n0:25:40\tSPEAKER_06\n But I actually got worse results doing that unwrapping using the simple phase unwrapping.\n\n0:25:45\tSPEAKER_06\n I did not unwrapping at all.\n\n0:25:52\tSPEAKER_05\n Yeah. So.\n\n0:25:56\tSPEAKER_06\n And that's all happening.\n\n0:25:59\tSPEAKER_05\n So I'm still hopeful that, I mean, we don't even know if the phase is something, the average phase is something that we do want to remove.\n\n0:26:05\tSPEAKER_05\n I mean, maybe there's some deeper reason why it isn't the right thing to do.\n\n0:26:09\tSPEAKER_05\n At least in principle, it looks like there's a couple potential ways to do one being to just work with the complex numbers.\n\n0:26:19\tSPEAKER_05\n And in rectangular coordinates.\n\n0:26:23\tSPEAKER_05\n And the other is to do a Taylor series.\n\n0:26:28\tSPEAKER_05\n Well, so they work with the complex numbers.\n\n0:26:31\tSPEAKER_05\n And then when you get the spectrum, the average complex spectrum actually divided out as opposed to taking the log and subtracting.\n\n0:26:41\tSPEAKER_05\n So then there might be some numerical issues.\n\n0:26:47\tSPEAKER_05\n I mean, we don't really know that.\n\n0:26:49\tSPEAKER_05\n The other thing we talked a little bit about was Taylor series expansion.\n\n0:26:53\tSPEAKER_05\n And actually I was talking to Dick Carp about a little bit.\n\n0:26:57\tSPEAKER_05\n And since I got thinking about it.\n\n0:27:01\tSPEAKER_05\n The other thing is that you have to do, I think we have to do this on a white board.\n\n0:27:08\tSPEAKER_05\n But I think you have to be a little careful about scaling the numbers that you're taking the complex numbers that you're taking the log off.\n\n0:27:13\tSPEAKER_05\n Because the Taylor expansion for it has square on a cube and so forth.\n\n0:27:19\tSPEAKER_05\n And so if you have a number that is modulus, you know, very different from one, should be right around one.\n\n0:27:27\tSPEAKER_05\n Because it's an expansion of log 1 minus epsilon.\n\n0:27:32\tSPEAKER_05\n One plus epsilon.\n\n0:27:34\tSPEAKER_05\n Well, it's an epsilon squared over 2 and an epsilon cubed over 3 and so forth.\n\n0:27:39\tSPEAKER_05\n So if epsilon is bigger than 1, then it diverges.\n\n0:27:42\tSPEAKER_05\n So you have to do some scaling.\n\n0:27:44\tSPEAKER_05\n But that's not a big deal.\n\n0:27:45\tSPEAKER_05\n Because it's the log of k times the complex number.\n\n0:27:49\tSPEAKER_05\n And you can just the same as log of k plus log of the complex number.\n\n0:27:54\tSPEAKER_05\n So there's converges.\n\n0:27:59\tSPEAKER_01\n Okay.\n\n0:28:00\tSPEAKER_01\n How about you, Sena?\n\n0:28:01\tSPEAKER_01\n So I've been implementing this, we're filtering for this robot task.\n\n0:28:08\tSPEAKER_01\n And I actually thought it was doing fine when I tested it once.\n\n0:28:14\tSPEAKER_01\n It's like using a small section of the code and then I ran the whole recognition experiment with Italian.\n\n0:28:19\tSPEAKER_01\n And I got like, was results then not using it.\n\n0:28:22\tSPEAKER_01\n So I've been trying to find where the problem came from and then it looks like I have some problem in the way.\n\n0:28:28\tSPEAKER_01\n There's some very silly bugs somewhere.\n\n0:28:31\tSPEAKER_01\n I mean, it actually made the whole thing worse.\n\n0:28:35\tSPEAKER_01\n I was looking at the spectrograms that I got.\n\n0:28:37\tSPEAKER_01\n And it's like, it's very horrible.\n\n0:28:40\tSPEAKER_05\n I miss the, I'm sorry, I missed the very first sense.\n\n0:28:43\tSPEAKER_05\n Oh, Ben was on the rest.\n\n0:28:45\tSPEAKER_05\n But what?\n\n0:28:46\tSPEAKER_01\n Oh, yeah, I actually implemented the filter as a module and then I stood it out separately.\n\n0:28:51\tSPEAKER_01\n And it gave like, I just got the signal out and it was okay.\n\n0:28:55\tSPEAKER_01\n So I plugged it in somewhere and then, I mean, it's like I had to remove some part and then plugging it in somewhere.\n\n0:29:00\tSPEAKER_01\n And then in that process, I messed it up somewhere.\n\n0:29:03\tSPEAKER_01\n So, I mean, I thought it was all fine and then I ran it and I got something worse than not using it.\n\n0:29:08\tSPEAKER_01\n So I was like, I'm trying to find what problem came in.\n\n0:29:12\tSPEAKER_01\n It seems to be like somewhere, some silly stuff.\n\n0:29:15\tSPEAKER_01\n And the other thing was, he showed up one day and then I was talking.\n\n0:29:24\tSPEAKER_01\n Yeah, as he's wanted to do.\n\n0:29:27\tSPEAKER_01\n Yeah, so I was actually that I was thinking about doing something about the minute filtering and then Carlos method of stuff.\n\n0:29:34\tSPEAKER_01\n And then he showed up and then I told him and then he gave me a whole bunch of filters what Carlos used for his thesis.\n\n0:29:40\tSPEAKER_01\n That was something which came up and then, so I'm actually thinking of using that also in this, a winner filtering because that is a modified winner filtering approach where instead of using the current frame, he uses adjacent frames also in designing the winner filter.\n\n0:29:55\tSPEAKER_01\n So instead of designing our own new winner filters, I may just use one of those Carlos filters in this implementation and see whether it actually gives me something better than using just the current current frame.\n\n0:30:06\tSPEAKER_01\n Which is in a way, something like the smoothing the winner filter.\n\n0:30:11\tSPEAKER_01\n So I'm like, that's so that is the next thing once this, once I saw this problem out, maybe I'll just go into that also.\n\n0:30:20\tSPEAKER_01\n And the other thing was about the subspace approach.\n\n0:30:25\tSPEAKER_01\n So I like plugged some routines for computing this eigen values and eigen vectors.\n\n0:30:35\tSPEAKER_01\n So just trying to assemble some small block of things which I need to put together for the subspace approach.\n\n0:30:42\tSPEAKER_01\n And I'm in the process of like building up that stuff.\n\n0:30:45\tSPEAKER_02\n And I guess, yeah, because that's it and that's where I am right now.\n\n0:31:00\tSPEAKER_00\n I'm working with VTS.\n\n0:31:07\tSPEAKER_00\n I do several experiments with the Spanish database first, only with VTS and nothing more, not VAD, no LDA, nothing more.\n\n0:31:16\tSPEAKER_07\n What is VTS again?\n\n0:31:18\tSPEAKER_00\n Vectorial, Tyler said to remove the noise.\n\n0:31:22\tSPEAKER_07\n I think I ask you that every single minute.\n\n0:31:24\tSPEAKER_07\n What?\n\n0:31:25\tSPEAKER_07\n I ask you that question every meeting.\n\n0:31:27\tSPEAKER_05\n It's not big of a analysis. It's good to have some cases of the same address.\n\n0:31:31\tSPEAKER_05\n Yeah.\n\n0:31:32\tSPEAKER_07\n What is VTS?\n\n0:31:34\tSPEAKER_00\n VTS.\n\n0:31:37\tSPEAKER_00\n Well, and the question is that, what?\n\n0:31:40\tSPEAKER_00\n Remove some noise, but not too much.\n\n0:31:44\tSPEAKER_00\n And when we put the VAD, the result is better.\n\n0:31:52\tSPEAKER_00\n And we put everything, the result is better, but it's not better than the result that we have with the VTS.\n\n0:31:59\tSPEAKER_00\n You know.\n\n0:32:02\tSPEAKER_05\n I see.\n\n0:32:03\tSPEAKER_05\n So that given that you're using the VAD, also the effect of the VTS is not similar.\n\n0:32:10\tSPEAKER_05\n How much of that do you think is due to just the particular implementation, how much are you adjusting it, or how much do you think is intrinsic?\n\n0:32:16\tSPEAKER_00\n I don't know, because...\n\n0:32:18\tSPEAKER_03\n Are you still using only the 10th-first frame for noise estimation?\n\n0:32:24\tSPEAKER_00\n I do the experiment using only the...\n\n0:32:28\tSPEAKER_00\n Yeah.\n\n0:32:29\tSPEAKER_00\n...doing only one first estimation of the noise.\n\n0:32:33\tSPEAKER_00\n And also I did some experiment doing a line estimation of the noise.\n\n0:32:42\tSPEAKER_00\n Well, it's a little bit better, but not...\n\n0:32:47\tSPEAKER_03\n Maybe you have to standardize this thing also, noise estimation, because all the things that you are testing use different...\n\n0:32:55\tSPEAKER_03\n They all need some...\n\n0:32:57\tSPEAKER_03\n No, it's not a bad idea.\n\n0:32:59\tSPEAKER_03\n They all use a different one.\n\n0:33:02\tSPEAKER_05\n I have an idea.\n\n0:33:04\tSPEAKER_05\n If you're right, I mean, each of these require this.\n\n0:33:07\tSPEAKER_05\n Given that we're going to have, for this test, at least, boundaries, what if initially we start off by using known sections of non-speech for the estimation?\n\n0:33:22\tSPEAKER_05\n Right?\n\n0:33:23\tSPEAKER_05\n Yes.\n\n0:33:24\tSPEAKER_05\n So first place, I mean, even if ultimately we wouldn't be given the boundaries, this would be a good initial experiment to separate out the effects of things.\n\n0:33:33\tSPEAKER_05\n I mean, how much is the poor, you know, relatively unhelpful result that you're getting in this or this or this, is due to some inherent limitation to the method for these tests and how much of it is just due to the fact that you're not accurately finding enough regions that are really noise.\n\n0:33:52\tSPEAKER_05\n So maybe if you tested it using that, you'd have more reliable stretches of non-speech to the estimation from and see if that helps.\n\n0:34:02\tSPEAKER_00\n Another thing is the code book, the initial code book, that maybe, well, it's too clean.\n\n0:34:10\tSPEAKER_00\n Because it's, I don't know, the methods.\n\n0:34:14\tSPEAKER_00\n If you want, I can say something about the method.\n\n0:34:18\tSPEAKER_00\n Yeah, indeed.\n\n0:34:24\tSPEAKER_00\n Because it's a little bit different after the method.\n\n0:34:28\tSPEAKER_00\n But we have, if this is the noise signal, in the log domain, we have something like this.\n\n0:35:01\tSPEAKER_00\n And the idea of this method is to, given, how do you say, I will read because it's other in my English.\n\n0:35:15\tSPEAKER_00\n It's the estimate of the PDF of the noise signal when we have a statistic of the Glinger's speech and a statistic of the noise's speech.\n\n0:35:31\tSPEAKER_00\n And the Glinger's speech, the statistic of the Glinger's speech is from a code book.\n\n0:35:39\tSPEAKER_00\n This is the idea. Well, like this relation is not linear, the methods propose to develop this in the Dr. Taylor series.\n\n0:35:48\tSPEAKER_00\n Approximately.\n\n0:35:50\tSPEAKER_05\n I'm actually just confused about the equations you have up there.\n\n0:35:53\tSPEAKER_05\n So the topic equation is, this is the log domain.\n\n0:35:59\tSPEAKER_00\n Which is the log domain?\n\n0:36:01\tSPEAKER_00\n It's the T, it's equal to log of.\n\n0:36:11\tSPEAKER_05\n But why is what? Why of the spectrum?\n\n0:36:15\tSPEAKER_00\n This is this and this is this.\n\n0:36:17\tSPEAKER_05\n No, no. The top Y is what?\n\n0:36:20\tSPEAKER_05\n Is that the power spectrum?\n\n0:36:22\tSPEAKER_05\n No, is that power spectrum?\n\n0:36:24\tSPEAKER_05\n Yeah, this is the power spectrum.\n\n0:36:26\tSPEAKER_00\n Yeah, it's the power spectrum.\n\n0:36:28\tSPEAKER_00\n So this is the netted, yes.\n\n0:36:31\tSPEAKER_00\n I'll evaluate you.\n\n0:36:32\tSPEAKER_05\n Yeah, okay, so this is the magnitude, the error or something.\n\n0:36:35\tSPEAKER_05\n Yeah.\n\n0:36:36\tSPEAKER_05\n Okay, so you have power spectrum added there.\n\n0:36:38\tSPEAKER_05\n And down here you have, you put the depends on T.\n\n0:36:42\tSPEAKER_05\n But, Billy, this is just, you just mean the log of the one up above.\n\n0:36:48\tSPEAKER_05\n And so that is X times...\n\n0:36:55\tSPEAKER_00\n Yeah, maybe...\n\n0:36:58\tSPEAKER_00\n Well, we can put this...\n\n0:37:00\tSPEAKER_05\n X times one plus...\n\n0:37:04\tSPEAKER_05\n And in minus X.\n\n0:37:08\tSPEAKER_05\n Yeah.\n\n0:37:09\tSPEAKER_05\n And then...\n\n0:37:10\tSPEAKER_05\n And then I see...\n\n0:37:11\tSPEAKER_05\n That's log of X plus log of one plus...\n\n0:37:15\tSPEAKER_05\n Well...\n\n0:37:17\tSPEAKER_05\n Is that right?\n\n0:37:18\tSPEAKER_05\n I'll go and see.\n\n0:37:19\tSPEAKER_00\n Well...\n\n0:37:20\tSPEAKER_05\n I actually don't see how you get that.\n\n0:37:23\tSPEAKER_00\n Well, if we apply the log, we have...\n\n0:37:26\tSPEAKER_00\n It's...\n\n0:37:27\tSPEAKER_00\n Log...\n\n0:37:30\tSPEAKER_00\n It's equal to log of X plus N.\n\n0:37:36\tSPEAKER_00\n Yeah.\n\n0:37:37\tSPEAKER_00\n And well...\n\n0:37:41\tSPEAKER_00\n We can say that...\n\n0:37:43\tSPEAKER_00\n E...\n\n0:37:48\tSPEAKER_00\n Is equal to log of...\n\n0:37:53\tSPEAKER_00\n Exponential of X plus exponential of N.\n\n0:37:58\tSPEAKER_05\n No.\n\n0:38:05\tSPEAKER_05\n No.\n\n0:38:06\tSPEAKER_02\n That doesn't follow.\n\n0:38:09\tSPEAKER_02\n Blow of E every week.\n\n0:38:11\tSPEAKER_02\n Well, this is...\n\n0:38:13\tSPEAKER_00\n This is the time...\n\n0:38:14\tSPEAKER_00\n The time the mind.\n\n0:38:15\tSPEAKER_00\n Well, we have that...\n\n0:38:18\tSPEAKER_00\n We have first that, for example, X...\n\n0:38:21\tSPEAKER_00\n Is equal...\n\n0:38:23\tSPEAKER_00\n Well...\n\n0:38:25\tSPEAKER_00\n This is the frequency domain.\n\n0:38:27\tSPEAKER_00\n And we can put that...\n\n0:38:29\tSPEAKER_00\n The log domain...\n\n0:38:31\tSPEAKER_00\n Log of X...\n\n0:38:33\tSPEAKER_00\n Oh my god, but...\n\n0:38:34\tSPEAKER_00\n Well, in the time the mind, we have an exponential.\n\n0:38:38\tSPEAKER_00\n No?\n\n0:38:40\tSPEAKER_00\n No?\n\n0:38:41\tSPEAKER_00\n Oh, maybe...\n\n0:38:43\tSPEAKER_05\n Yeah, I mean, just never mind what they are.\n\n0:38:46\tSPEAKER_05\n It's just if X and N are variables.\n\n0:38:49\tSPEAKER_05\n Right?\n\n0:38:50\tSPEAKER_05\n The log of X plus N is not the same as the log of E the X plus E the N.\n\n0:38:56\tSPEAKER_00\n Yeah, but this is...\n\n0:38:58\tSPEAKER_00\n I don't...\n\n0:39:00\tSPEAKER_00\n Maybe I can take it offline, but...\n\n0:39:02\tSPEAKER_00\n I can do this incorrectly.\n\n0:39:05\tSPEAKER_00\n The expression that they're bearing in the paper is...\n\n0:39:10\tSPEAKER_00\n Very long.\n\n0:39:11\tSPEAKER_01\n The Taylor series expansion for log 1 plus N by X is...\n\n0:39:15\tSPEAKER_01\n It's X.\n\n0:39:16\tSPEAKER_01\n Yes, the first one.\n\n0:39:17\tSPEAKER_01\n Yeah, I guess.\n\n0:39:18\tSPEAKER_05\n Yeah, because it doesn't just follow as there has to be some...\n\n0:39:21\tSPEAKER_01\n If you take log X into log 1 plus N by X and then expand the log 1 plus N by X into Taylor's...\n\n0:39:26\tSPEAKER_00\n Yeah, this is the...\n\n0:39:27\tSPEAKER_00\n And then...\n\n0:39:28\tSPEAKER_03\n Yeah, but the second...\n\n0:39:31\tSPEAKER_03\n Expression that you put is the first order expansion of...\n\n0:39:35\tSPEAKER_03\n Not something.\n\n0:39:36\tSPEAKER_00\n The first order.\n\n0:39:37\tSPEAKER_00\n No, no, no, it's not the first...\n\n0:39:39\tSPEAKER_00\n We have...\n\n0:39:41\tSPEAKER_00\n We can put that X is equal...\n\n0:39:45\tSPEAKER_00\n I is equal to log of...\n\n0:39:59\tSPEAKER_05\n That doesn't follow.\n\n0:40:01\tSPEAKER_00\n I mean, we can put...\n\n0:40:04\tSPEAKER_05\n That... I mean, the top one does not imply the second one.\n\n0:40:10\tSPEAKER_05\n Because the log of a sum is not the same as...\n\n0:40:14\tSPEAKER_00\n Yeah, yeah, yeah, yeah, but we can...\n\n0:40:17\tSPEAKER_00\n We know that, for some, the log of E plus B is equal to log of E plus log.\n\n0:40:24\tSPEAKER_05\n Right.\n\n0:40:25\tSPEAKER_05\n To B.\n\n0:40:26\tSPEAKER_00\n And we can say...\n\n0:40:27\tSPEAKER_00\n Right, so you can...\n\n0:40:28\tSPEAKER_00\n Yes, it is.\n\n0:40:34\tSPEAKER_00\n And we can put this inside.\n\n0:40:38\tSPEAKER_00\n And then we can...\n\n0:40:41\tSPEAKER_00\n You know?\n\n0:40:42\tSPEAKER_05\n No, but...\n\n0:40:44\tSPEAKER_00\n Yeah?\n\n0:40:46\tSPEAKER_05\n I don't see how you get the second expression from the top one.\n\n0:40:51\tSPEAKER_05\n I mean, just more generally here.\n\n0:40:54\tSPEAKER_05\n If you say log of a plus B, the log of a plus B is not...\n\n0:41:04\tSPEAKER_05\n Or a plus B is not the log of E to the a plus E to the B.\n\n0:41:11\tSPEAKER_00\n No, no, no, no, no, no, no, it's not.\n\n0:41:13\tSPEAKER_05\n Right?\n\n0:41:14\tSPEAKER_05\n And that's what you seem to be saying.\n\n0:41:15\tSPEAKER_05\n No, but this is the same...\n\n0:41:17\tSPEAKER_05\n Right?\n\n0:41:18\tSPEAKER_05\n Because you appear you have the a plus B.\n\n0:41:20\tSPEAKER_00\n No, I say...\n\n0:41:21\tSPEAKER_00\n I have a log of E is equal to log of...\n\n0:41:27\tSPEAKER_00\n In this side is equal to log of X plus N.\n\n0:41:32\tSPEAKER_00\n Right.\n\n0:41:33\tSPEAKER_00\n No?\n\n0:41:34\tSPEAKER_00\n Right.\n\n0:41:35\tSPEAKER_00\n And that's how you go from there to the...\n\n0:41:37\tSPEAKER_00\n And then if I apply exponential to half here...\n\n0:41:42\tSPEAKER_00\n Look, here's what's...\n\n0:41:43\tSPEAKER_05\n I mean C equals a plus B.\n\n0:41:45\tSPEAKER_03\n Of capital Y, right?\n\n0:41:46\tSPEAKER_03\n And then...\n\n0:41:47\tSPEAKER_03\n X...\n\n0:41:51\tSPEAKER_02\n X...\n\n0:41:52\tSPEAKER_02\n This is X inside.\n\n0:41:56\tSPEAKER_00\n Right.\n\n0:41:57\tSPEAKER_05\n We have this, no?\n\n0:41:58\tSPEAKER_05\n Yeah, that one's right.\n\n0:41:59\tSPEAKER_05\n Mm-hmm.\n\n0:42:00\tNone\n BEEP BEEP BEEP BEEP\n\n0:42:09\tSPEAKER_00\n BEEP We can put here the set transformation.\n\n0:42:13\tSPEAKER_05\n I see.\n\n0:42:14\tSPEAKER_05\n No?\n\n0:42:15\tSPEAKER_05\n I see.\n\n0:42:16\tSPEAKER_05\n Okay, I understand that.\n\n0:42:18\tSPEAKER_05\n All right, thanks.\n\n0:42:20\tSPEAKER_00\n Yeah, in this case, what we can put here...\n\n0:42:24\tSPEAKER_00\n Y.\n\n0:42:25\tSPEAKER_05\n Okay, so yeah, just by definition, that the individual...\n\n0:42:29\tSPEAKER_05\n So capital X is by definition the same as each of the little X because he's saying that the little X is the log.\n\n0:42:38\tSPEAKER_00\n All right, we can put this.\n\n0:42:41\tSPEAKER_00\n Yeah.\n\n0:42:42\tSPEAKER_00\n And here we can...\n\n0:42:43\tSPEAKER_05\n I think these things are a lot clearer when you can use fonts.\n\n0:42:45\tSPEAKER_05\n Oh, yeah.\n\n0:42:46\tSPEAKER_05\n For fonts.\n\n0:42:47\tSPEAKER_00\n They're saying that which is what...\n\n0:42:48\tSPEAKER_00\n Yeah, yeah, yeah.\n\n0:42:49\tSPEAKER_00\n I understand.\n\n0:42:50\tSPEAKER_00\n Okay.\n\n0:42:51\tSPEAKER_00\n But this is correct.\n\n0:42:52\tSPEAKER_00\n Sure.\n\n0:42:53\tSPEAKER_00\n And now I can do...\n\n0:42:56\tSPEAKER_00\n I can put log...\n\n0:42:59\tSPEAKER_00\n Of EX...\n\n0:43:02\tSPEAKER_00\n Plus log.\n\n0:43:08\tSPEAKER_05\n Yeah, so I understand now.\n\n0:43:11\tSPEAKER_05\n And this is...\n\n0:43:12\tSPEAKER_06\n Yeah.\n\n0:43:15\tNone\n Yeah.\n\n0:43:18\tSPEAKER_03\n Right.\n\n0:43:19\tSPEAKER_06\n Let's call that.\n\n0:43:21\tSPEAKER_00\n Right.\n\n0:43:22\tSPEAKER_00\n Okay, thanks.\n\n0:43:24\tSPEAKER_00\n Well, the idea, well, we have fixed this, segue.\n\n0:43:30\tSPEAKER_05\n Okay, so now once you get that one, then you...\n\n0:43:33\tSPEAKER_05\n Then do a first or second order or something, Taylor?\n\n0:43:36\tSPEAKER_00\n Yeah.\n\n0:43:37\tSPEAKER_00\n This is an linear relation that is to develop this in...\n\n0:43:40\tSPEAKER_00\n Backter Taylor's say.\n\n0:43:42\tSPEAKER_00\n Sure.\n\n0:43:43\tSPEAKER_00\n Right.\n\n0:43:44\tSPEAKER_00\n And for that, well, the goal is to estimate a PDF for the noise speech.\n\n0:43:54\tSPEAKER_00\n When we have a statistic for clean speech and for the noise speech.\n\n0:44:05\tSPEAKER_00\n And the way to obtain the PDF for the noise speech is...\n\n0:44:12\tSPEAKER_00\n Well, we know this statistic.\n\n0:44:15\tSPEAKER_00\n And we know the notes is...\n\n0:44:17\tSPEAKER_00\n Well, we can apply first order of the vector Taylor series of the order...\n\n0:44:24\tSPEAKER_00\n The order that we want to increase the complexity of the problem.\n\n0:44:28\tSPEAKER_00\n And then when we have a expression for the...\n\n0:44:32\tSPEAKER_00\n Mean that variance of the noise speech.\n\n0:44:37\tSPEAKER_00\n We apply a technique of minimum mean square estimation to obtain the expected value of the clean speech given the...\n\n0:44:53\tSPEAKER_00\n And this statistic for the noise speech, the statistic for clean speech and the statistic of the noise speech.\n\n0:45:04\tSPEAKER_00\n This only that.\n\n0:45:06\tSPEAKER_00\n But the idea is that...\n\n0:45:08\tSPEAKER_03\n And the model of clean speech is a code book, right?\n\n0:45:11\tSPEAKER_03\n Yeah.\n\n0:45:12\tSPEAKER_00\n We have a code boot with different density Gaussian.\n\n0:45:18\tSPEAKER_00\n We can put the...\n\n0:45:23\tSPEAKER_00\n For the clean speech, the probability of the clean speech is equal to...\n\n0:45:30\tSPEAKER_02\n Well, we got the data.\n\n0:45:50\tSPEAKER_05\n So, how much in the work they reported, how much noise speech did you need to get good enough statistics for to get this mapping?\n\n0:46:07\tSPEAKER_00\n I don't know, sadly.\n\n0:46:10\tSPEAKER_00\n Yeah.\n\n0:46:11\tSPEAKER_00\n I need this...\n\n0:46:12\tSPEAKER_00\n I don't know, sadly.\n\n0:46:14\tSPEAKER_05\n I think what's certainly characteristic of a lot of the data in this test is that you don't have...\n\n0:46:23\tSPEAKER_05\n The training set may not be a great estimator for the noise in the test set.\n\n0:46:29\tSPEAKER_05\n Sometimes it is and sometimes it's on.\n\n0:46:32\tSPEAKER_00\n Yeah, the clean speech, the code book for clean speech, I am using themit.\n\n0:46:37\tSPEAKER_00\n And I have now 64 Gaussian.\n\n0:46:44\tSPEAKER_05\n And what are you using for the noise?\n\n0:46:47\tSPEAKER_00\n I estimate the noises.\n\n0:46:49\tSPEAKER_00\n For the noises, I usually use one Gaussian.\n\n0:46:53\tSPEAKER_05\n And you train it up entirely from non-speech sections in the test?\n\n0:47:00\tSPEAKER_00\n Yes, the first experiment that I do is only to calculate this value.\n\n0:47:10\tSPEAKER_00\n The compensation of the dictionary one time using the noise at the beginning of the sentence, this is the first experiment.\n\n0:47:20\tSPEAKER_00\n And I fix this for all the sentences.\n\n0:47:27\tSPEAKER_00\n Because well, the VDS matters.\n\n0:47:30\tSPEAKER_00\n In fact, the first thing that I do is to obtain an expression for E.\n\n0:47:37\tSPEAKER_00\n Probability is expression of E.\n\n0:47:39\tSPEAKER_00\n That means that the VDS with the VDS we obtain...\n\n0:47:48\tSPEAKER_00\n We obtain the means for each Gaussian and the variance.\n\n0:47:58\tSPEAKER_00\n This is one.\n\n0:48:00\tSPEAKER_00\n This is the compensation of the dictionary.\n\n0:48:03\tSPEAKER_00\n And the other thing that is with this matters is to obtain to calculate this value.\n\n0:48:14\tSPEAKER_00\n Because we can write that the estimation of the Gling speed is equal at a expected value of the Gling speed conditional to the noise seen.\n\n0:48:40\tSPEAKER_00\n The probability of the statistic of the Gling speed and the statistic of the noise.\n\n0:48:47\tSPEAKER_00\n This is the matters that say that we obtain this.\n\n0:48:51\tSPEAKER_00\n And we can put that this is equal to the estimate value of E minus a function that conditional to the naysina.\n\n0:49:06\tSPEAKER_00\n This is the term after the developed this, the term that we obtain.\n\n0:49:18\tSPEAKER_00\n And we can put that this is equal to the naysina minus.\n\n0:49:39\tNone\n Okay.\n\n0:49:49\tSPEAKER_00\n I put this name and I can calculate this.\n\n0:50:12\tSPEAKER_05\n What is the first variable in that probability?\n\n0:50:15\tSPEAKER_05\n The Gaussian.\n\n0:50:22\tSPEAKER_00\n This is the...\n\n0:50:25\tSPEAKER_00\n It's not exactly this.\n\n0:50:28\tSPEAKER_00\n It's modified.\n\n0:50:30\tSPEAKER_00\n If we have the Gling speed, we have the probability of a weight for each Gaussian.\n\n0:50:41\tSPEAKER_00\n And now this weight is different.\n\n0:50:46\tSPEAKER_00\n And I need to calculate this.\n\n0:50:55\tSPEAKER_00\n I can't develop an expression that this.\n\n0:51:20\tSPEAKER_00\n I can calculate this value with the statistic of the noise.\n\n0:51:42\tSPEAKER_00\n I can calculate this value with the statistic of the noise speed that I calculated before with the VTS approximation.\n\n0:51:56\tSPEAKER_00\n And what normalizes?\n\n0:51:59\tSPEAKER_00\n And I know everything.\n\n0:52:02\tSPEAKER_00\n When I developed this in Taylor's series, I can't calculate the mean and variance of the...\n\n0:52:19\tSPEAKER_00\n For each of the Gaussian of the dictionary for the noise speed.\n\n0:52:25\tSPEAKER_00\n And this is fixed.\n\n0:52:27\tSPEAKER_00\n If I never do a new estimation of the noise, this mean and variance are fixed.\n\n0:52:35\tSPEAKER_00\n And for each frame of the speed, the only thing that I need to do is to calculate this in order to calculate the estimation of the Gling speed.\n\n0:52:47\tSPEAKER_00\n Giving a noise speed.\n\n0:52:49\tSPEAKER_05\n So I'm not following this perfectly, but are you saying that all of these estimates are done using estimates of the probability density for the noise that are calculated only from the first 10 frames?\n\n0:53:09\tSPEAKER_05\n And never change throughout anything else.\n\n0:53:11\tSPEAKER_00\n This is one of the estimation that I do.\n\n0:53:14\tSPEAKER_05\n Per utterance?\n\n0:53:16\tSPEAKER_00\n Per utterance.\n\n0:53:18\tSPEAKER_05\n So it's done new for each new address.\n\n0:53:21\tSPEAKER_05\n So this changes the whole mapping for every address.\n\n0:53:24\tSPEAKER_00\n Yeah, it's fixed, the dictionary.\n\n0:53:25\tSPEAKER_00\n And the other estimation is when I do the underlying estimation, I change the means and variance of the noise speed.\n\n0:53:36\tSPEAKER_00\n It's time that I detect noise.\n\n0:53:43\tSPEAKER_00\n I do again this, the value, estimate the new mean and variance of the nice speed.\n\n0:53:52\tSPEAKER_00\n And with this new mean and variance, I estimate again.\n\n0:53:58\tSPEAKER_05\n So you estimate it completely forgetting what you had before?\n\n0:54:04\tSPEAKER_00\n Or is there some...\n\n0:54:06\tSPEAKER_00\n No, no, no, no, it's not completely noise.\n\n0:54:08\tSPEAKER_00\n I am doing something like another station of the noise.\n\n0:54:14\tSPEAKER_05\n Now do we know, either from their experience or from yours, that just having two parameters that mean variance is enough?\n\n0:54:26\tSPEAKER_05\n Yeah, I mean, I know you don't have a lot of data to estimate with, but...\n\n0:54:36\tSPEAKER_00\n I estimate mean and variance for each one of the Gaussian of the code, Boo.\n\n0:54:42\tSPEAKER_05\n No, I'm talking about the noise.\n\n0:54:45\tSPEAKER_00\n There's only one Gaussian.\n\n0:54:47\tSPEAKER_00\n I'm using only one.\n\n0:54:48\tSPEAKER_00\n Right.\n\n0:54:49\tSPEAKER_05\n I don't know.\n\n0:54:50\tSPEAKER_05\n And it's only one...\n\n0:54:54\tSPEAKER_05\n Wait a minute, what's the dimensionality of the Gaussian?\n\n0:54:59\tSPEAKER_00\n It's in after the Melvator Bank.\n\n0:55:02\tSPEAKER_00\n So it's 20...\n\n0:55:04\tSPEAKER_05\n So it's actually 40 numbers that you're getting.\n\n0:55:09\tSPEAKER_05\n Yeah, maybe...\n\n0:55:11\tSPEAKER_00\n The original papers say that only one Gaussian for the noise.\n\n0:55:18\tSPEAKER_05\n Well, yeah, but I mean...\n\n0:55:20\tSPEAKER_05\n Yeah, maybe...\n\n0:55:21\tSPEAKER_05\n No paper is a Bible, you know.\n\n0:55:24\tSPEAKER_05\n The question is whether it would be helpful, particularly if you had more...\n\n0:55:33\tSPEAKER_05\n So suppose you did, this is almost cheating, it certainly isn't real time, but if you suppose you used the real boundaries that you were going to refactor given by the VAD and so forth, or I guess we're going to be given even better boundaries than that.\n\n0:55:46\tSPEAKER_05\n And you take all of the non-speech components in an utterance, so you have a fair amount.\n\n0:55:51\tSPEAKER_05\n Do you benefit from having a better model for the noise? That would be another question.\n\n0:55:57\tSPEAKER_05\n Maybe.\n\n0:55:58\tSPEAKER_05\n So first question would be, to what extent are the errors that you still seeing based on the fact that you have poor boundaries for the non-speech?\n\n0:56:11\tSPEAKER_05\n The second question might be given that you have good boundaries, could you do better if you use more parameters to characterize the noise?\n\n0:56:21\tSPEAKER_05\n Also, another question might be, they are using first term only of the vector Taylor series.\n\n0:56:30\tSPEAKER_05\n If you do a second term, does it get too complicated?\n\n0:56:33\tSPEAKER_05\n Yeah, it's quite complicated.\n\n0:56:35\tSPEAKER_05\n Yeah, okay.\n\n0:56:37\tSPEAKER_05\n I want to ask the last question then.\n\n0:56:42\tSPEAKER_00\n For me, it's the first time that I am working with VTS.\n\n0:56:47\tSPEAKER_05\n Yeah, no, it's interesting. We haven't had anybody work with it before, so it's interesting to get your feedback.\n\n0:56:52\tSPEAKER_00\n It's another type of approximation because it's a statistic approximation to remove the noise.\n\n0:57:01\tSPEAKER_07\n Right.\n\n0:57:05\tSPEAKER_07\n Okay, well, I guess we're about done.\n\n0:57:08\tSPEAKER_07\n So some of the digit forms don't have digits.\n\n0:57:12\tSPEAKER_07\n If you ran out and there were some blanks in there, so not everybody will be reading digits.\n\n0:57:17\tSPEAKER_07\n I guess you've got some right Morgan.\n\n0:57:19\tSPEAKER_07\n I have some.\n\n0:57:20\tSPEAKER_07\n I want you to go ahead and start and I think it's just us down here.\n\n0:57:25\tSPEAKER_02\n Okay, switch off the phone.\n\n0:57:28\tSPEAKER_05\n Leave it on.\n\n0:57:30\tSPEAKER_05\n They prefer to have them on just so that they're continuing to get the distant information.\n\n0:57:35\tSPEAKER_05\n Transcript, LDASH 169.\n\n0:57:38\tSPEAKER_05\n 393 095 798 2760 565 867 611 1 8 2 4 2 6 1 9 0 0 2 7 8 3 8 8 1 2 2 6 7 4 1 9 7 9 4 9 8 5 7 8 7 9 0 9 2 375 417 612 3762 6367 2942\n\n0:58:13\tSPEAKER_04\n Transcript LDASH 167 7 5 6 0 5 373 147 4 4 9 2 7 8 1167 38 85 57 8 164 64 8 203 377 5 263 2857 95672 2 9 0 18 32 2623 32 5 2 7 7 9 4 9 6\n\n0:59:03\tSPEAKER_07\n Transcript LDASH 168 7 9 9 9 2 4 8 8 0 6 9 8 7 0 1 8 4 8 0 3 1 7 8 4 1 7 8 2 5 2 3 2 6 5 9 8 3 6 6 5 4 0 4 1 5 0 5 8 8 2 0 357 2 6 0 6 5 9 7 6 2 8 1 9 5 9 8 11 4 2 0 8 6 7 9 8\n\n0:59:42\tSPEAKER_06\n Transcript LDASH 174 4911 8 4 7 9 2 4 1 2 7 8 9 2 5 1 6 6 367 7 3 2 8 9 7 6 2 7 9 3 6 1 0 5 9 3 5 7 5 6 0 4 8 8 8 2 9 8 5 9 6 7 2 5 0 6 9 4 8 2 2 0 19 269 1\n\n1:00:26\tSPEAKER_05\n Okay Okay\n\n", "summary": [{"summary_text": "SPEAKER and his colleagues are discussing the Euro pitch paper that was accepted. Speaker has been working on line normalization this week, trying different, slightly different approaches. He is trying to play a little bit with the time constant. Speakers are talking about the difference between C0 and C1."}]}