{"filename": "./data/Bro018.txt", "transcript": "0:00:00\tSPEAKER_02\n Okay, so, it's not here, so.\n\n0:00:05\tSPEAKER_06\n Yeah, I would try to explain the thing that I did this week, during this week.\n\n0:00:11\tSPEAKER_06\n Well, you know that I began to work with a new feature to the text voice and voice, where I tried to MLP to with this new feature and the feature from the bass system.\n\n0:00:35\tSPEAKER_04\n The Melcapsum?\n\n0:00:37\tSPEAKER_06\n No, exactly the Melcapsum, the new bass system, the new bass system.\n\n0:00:43\tSPEAKER_06\n Oh, the Aurora system.\n\n0:00:45\tSPEAKER_06\n Yeah, the Aurora system with the new filter, the idea, something like that.\n\n0:00:52\tSPEAKER_06\n And I tried to MLP one that only have three outputs, voice and voice and silence, and other one that have 56 outputs, the probabilities that they have.\n\n0:01:09\tSPEAKER_06\n And I tried to do some experiment of recognition with that.\n\n0:01:14\tSPEAKER_06\n And I only have a result with the MLP with the three outputs.\n\n0:01:19\tSPEAKER_06\n And I put together the 15 features and the three MLP outputs.\n\n0:01:23\tSPEAKER_06\n And while the results are a little bit better but more or less similar.\n\n0:01:30\tSPEAKER_02\n I'm slightly confused.\n\n0:01:31\tSPEAKER_02\n What feeds the three output net?\n\n0:01:35\tSPEAKER_06\n Voice and voice and silence.\n\n0:01:36\tSPEAKER_02\n No, no, what feeds it? What features does it say?\n\n0:01:39\tSPEAKER_06\n The input, the input are the 15, the 15 basses feature with the new code.\n\n0:01:50\tSPEAKER_06\n And the other three features are the variance of the different between the two spectrum.\n\n0:01:57\tSPEAKER_06\n The variance of the autocorrelation function, I said that the first point, because half the height value is 0 and also R0.\n\n0:02:09\tSPEAKER_06\n The first coefficient of the autocorrelation function, that is like the energy with the three features.\n\n0:02:17\tSPEAKER_02\n You wouldn't do like R1 over R0 or something like that.\n\n0:02:22\tSPEAKER_02\n Usually for voice and voice, you do something, you do energy but then you have something like spectral slope, which is you get like R1 over R0 or something like that.\n\n0:02:31\tSPEAKER_06\n What are the R's?\n\n0:02:34\tSPEAKER_01\n Are the correlations?\n\n0:02:35\tSPEAKER_06\n No, autocorrelations, yes, the variance of the autocorrelation function that used that.\n\n0:02:41\tSPEAKER_06\n Well, that's the variance.\n\n0:02:42\tSPEAKER_02\n But if you just say what is, I mean, the first order, one of the different between voice and voice and silence is energy.\n\n0:02:49\tSPEAKER_02\n But the other one is the spectral shape.\n\n0:02:51\tSPEAKER_02\n The spectral shape, yes.\n\n0:02:53\tSPEAKER_02\n Yeah, and so R1 over R0 is what you typically use for that.\n\n0:02:56\tSPEAKER_06\n No, I don't use that. I can use.\n\n0:02:58\tSPEAKER_02\n No, I'm saying that's what people usually typically use.\n\n0:03:01\tSPEAKER_02\n See, because this is just like a single number to tell you does the spectrum look like that or does it look like that?\n\n0:03:10\tSPEAKER_02\n So if it's low energy but the spectrum looks like that or like that, it's probably silence.\n\n0:03:23\tSPEAKER_02\n But if it's low energy and the spectrum looks like that, it's probably unvoiced.\n\n0:03:29\tSPEAKER_02\n Yeah.\n\n0:03:30\tSPEAKER_02\n So if you just had to pick two features to determine voice and voice, you pick something about the spectrum like R1 over R0 and R0.\n\n0:03:42\tSPEAKER_02\n Or you know, you have some other energy measure and like in the old days people did like zero crossing counts.\n\n0:03:50\tSPEAKER_02\n Yeah, yeah.\n\n0:03:51\tSPEAKER_06\n Right.\n\n0:03:53\tSPEAKER_06\n I can also use this.\n\n0:03:55\tSPEAKER_01\n Yeah.\n\n0:03:57\tSPEAKER_06\n Because the result are really better but we have in a point that everything is more or less similar.\n\n0:04:06\tSPEAKER_06\n But not quite the...\n\n0:04:09\tSPEAKER_02\n Right, but it seemed to me that what you were getting at before was that there is something about the difference between the original signal or the original FFT.\n\n0:04:20\tSPEAKER_02\n And what the filter, which is what...\n\n0:04:23\tSPEAKER_02\n And the variance was one take on it.\n\n0:04:25\tSPEAKER_02\n Yeah, I used this too.\n\n0:04:27\tSPEAKER_02\n Right, but it could be something else because suppose you didn't have anything like that.\n\n0:04:30\tSPEAKER_02\n Then in that case, if you have two nets, and this one has three outputs, and this one has whatever, 56 or something.\n\n0:04:44\tSPEAKER_02\n If you were to sum up the probabilities for the voice and for the unvoiced and for the silence here, we found in the past you would do better at voice and voice silence than you do with this one.\n\n0:04:55\tSPEAKER_02\n So just having the three output thing doesn't really value anything.\n\n0:04:59\tSPEAKER_02\n Yeah.\n\n0:05:00\tSPEAKER_02\n The issue is what you feed it.\n\n0:05:03\tSPEAKER_06\n Yeah, I have...\n\n0:05:05\tSPEAKER_06\n Yeah.\n\n0:05:06\tSPEAKER_02\n So you're saying...\n\n0:05:07\tSPEAKER_04\n So you can take the features that go into the voice and voice silence net and feed those into the other one as additional inputs rather.\n\n0:05:14\tSPEAKER_02\n Yeah.\n\n0:05:15\tSPEAKER_02\n Well, that's another way.\n\n0:05:16\tSPEAKER_02\n That wasn't what I was saying, but yeah, that's certainly another thing to do.\n\n0:05:19\tSPEAKER_02\n Now, I was just trying to say, if you bring this into the picture over this, what more does it buy you?\n\n0:05:25\tSPEAKER_02\n And what I was saying is that the only thing that I think that it buys you is based on whether you feed it something different.\n\n0:05:34\tSPEAKER_02\n And something different and something fun to men away.\n\n0:05:37\tSPEAKER_02\n And so the kind of thing that she was talking about before was looking at something...\n\n0:05:43\tSPEAKER_02\n Something about the difference between the log FFT log power and the log magnitude FF spectrum in the filter bank.\n\n0:06:01\tSPEAKER_02\n Yeah.\n\n0:06:04\tSPEAKER_02\n And so the filter bank is chosen, in fact, to sort of integrate out the effects of pitch.\n\n0:06:10\tSPEAKER_02\n And she's saying, you know, trying...\n\n0:06:11\tSPEAKER_02\n So the particular measure that she chose was the variance of this difference.\n\n0:06:16\tSPEAKER_02\n But that might not be the right number.\n\n0:06:19\tSPEAKER_02\n Maybe.\n\n0:06:20\tSPEAKER_02\n I mean, maybe there's something about the variance that's not enough or maybe there's something else that one could use.\n\n0:06:26\tSPEAKER_02\n I think that for me, the thing that struck me was that you want to get something back here.\n\n0:06:32\tSPEAKER_02\n So here's an idea.\n\n0:06:34\tSPEAKER_02\n What about if you skip all the really clever things and just fed the log magnitude spectrum into this?\n\n0:06:44\tSPEAKER_06\n I'm sorry.\n\n0:06:45\tSPEAKER_02\n This is...\n\n0:06:46\tSPEAKER_02\n You have the log magnitude spectrum.\n\n0:06:48\tNone\n Yeah.\n\n0:06:48\tSPEAKER_02\n And you were looking at that and the difference between the filter bank and computing the variance.\n\n0:06:53\tSPEAKER_02\n That's a clever thing to do. What if you stop being clever?\n\n0:06:56\tSPEAKER_02\n And you just took this thing in here because it's a neural net and neural nets are wonderful and figure out what they can...\n\n0:07:03\tSPEAKER_02\n What they most need from things.\n\n0:07:05\tSPEAKER_02\n Yeah.\n\n0:07:06\tSPEAKER_02\n I mean, that's a good act.\n\n0:07:08\tSPEAKER_02\n So I mean, you're trying to be clever and say, what's the statistic that we should get about this difference?\n\n0:07:14\tSPEAKER_02\n But in fact, you know, maybe just feeding this in or feeding both of them in.\n\n0:07:21\tSPEAKER_02\n In other words, saying let it figure out what is the interaction.\n\n0:07:25\tSPEAKER_02\n Especially if you do this over multiple frames, then you have this over time and both kinds of measures and you might get something better.\n\n0:07:39\tSPEAKER_04\n So don't do the division but let the net have everything.\n\n0:07:45\tSPEAKER_01\n That's another thing you could do, yeah.\n\n0:07:47\tSPEAKER_02\n I mean, it seems to me if you have exactly the right thing, then it's better to do it without the net because otherwise you're asking the net to learn this thing.\n\n0:07:59\tSPEAKER_02\n You know, say if you wanted to learn how to do multiplication.\n\n0:08:02\tSPEAKER_02\n I mean, you could feed two numbers that you wanted to multiply into a net and have a bunch of nonlinearities in the middle and train it to get the product at the output.\n\n0:08:12\tSPEAKER_02\n And it would work, but it's kind of crazy because we know how to multiply and you'd be much lower error usually if you just multiply it out.\n\n0:08:21\tSPEAKER_02\n But suppose you don't really know what the right thing is.\n\n0:08:24\tSPEAKER_02\n And that's what these sort of dumb machine learning methods are good at.\n\n0:08:31\tSPEAKER_04\n How long does it take Carmen to train up on a business?\n\n0:08:35\tSPEAKER_06\n Oh, not too much. One day useless.\n\n0:08:39\tSPEAKER_02\n Yeah, it's probably worth it.\n\n0:08:42\tSPEAKER_00\n What are your frame error rates?\n\n0:08:46\tSPEAKER_06\n 56, the frame error rate 56 AC.\n\n0:08:53\tSPEAKER_06\n Is that maybe that's accuracy?\n\n0:08:55\tSPEAKER_00\n The accuracy.\n\n0:08:56\tSPEAKER_00\n 56% accurate for voice unvoiced.\n\n0:08:59\tSPEAKER_06\n No, yes.\n\n0:09:01\tSPEAKER_06\n I don't remember for voice unvoiced.\n\n0:09:03\tSPEAKER_06\n Maybe for the other one.\n\n0:09:04\tSPEAKER_06\n Yeah, for voice unvoiced, hopefully it'd be a lot better.\n\n0:09:06\tSPEAKER_06\n Maybe for voice unvoiced.\n\n0:09:09\tSPEAKER_06\n This is for the other one.\n\n0:09:11\tSPEAKER_06\n I can't say that.\n\n0:09:12\tSPEAKER_06\n But I think that 55 was for the when the output are the 56 foam.\n\n0:09:17\tSPEAKER_06\n That I look in the with the other.\n\n0:09:20\tSPEAKER_06\n The other MLP that we have are more or less the same number.\n\n0:09:23\tSPEAKER_06\n It's a little bit better, but more or less the same.\n\n0:09:26\tSPEAKER_02\n I think at the frame level for 56, I was the kind of number we were getting for.\n\n0:09:32\tSPEAKER_02\n Reduce bandwidth.\n\n0:09:35\tSPEAKER_06\n I think that for the other one for the three output is 62, 63 more or less.\n\n0:09:44\tSPEAKER_06\n That's all?\n\n0:09:45\tSPEAKER_02\n Yeah.\n\n0:09:46\tSPEAKER_06\n That's pretty bad.\n\n0:09:47\tSPEAKER_06\n Yeah, because it's noise also.\n\n0:09:49\tSPEAKER_06\n And we have.\n\n0:09:52\tSPEAKER_02\n I know.\n\n0:09:53\tSPEAKER_02\n But even in training still.\n\n0:09:58\tSPEAKER_02\n Well, actually, so this is a test you should do then.\n\n0:10:01\tSPEAKER_02\n If you're getting 56% over here, that's a noise also, right?\n\n0:10:04\tSPEAKER_02\n Yeah, yeah, yeah.\n\n0:10:05\tSPEAKER_02\n Okay.\n\n0:10:06\tSPEAKER_02\n If you're getting 56 here, try adding together the probabilities of all of the voice phones here and all the unvoiced phones and see what you get then.\n\n0:10:16\tSPEAKER_02\n I bet you get better than 63.\n\n0:10:19\tSPEAKER_06\n Well, I don't know.\n\n0:10:22\tSPEAKER_06\n I think that we have to resolve more.\n\n0:10:25\tSPEAKER_06\n Maybe.\n\n0:10:26\tSPEAKER_06\n I don't know.\n\n0:10:27\tSPEAKER_06\n I'm not sure, but I remember it's a sensitivity.\n\n0:10:30\tSPEAKER_06\n I can't solve that.\n\n0:10:31\tSPEAKER_02\n Okay, but that's a good checkpoint.\n\n0:10:34\tSPEAKER_02\n You should do that anyway.\n\n0:10:36\tSPEAKER_02\n Given this regular old net that's just what you're using for other purposes, add up the probabilities of the different subclasses and see how well you do.\n\n0:10:46\tSPEAKER_02\n Anything that you do over here should be at least as good as that.\n\n0:10:54\tSPEAKER_06\n How do you do that?\n\n0:10:55\tSPEAKER_04\n The targets for the neural net.\n\n0:10:57\tSPEAKER_04\n They come from forced alignments.\n\n0:11:02\tSPEAKER_06\n Timmit.\n\n0:11:03\tSPEAKER_06\n Oh, this is trained on Timmit.\n\n0:11:06\tSPEAKER_02\n Yeah.\n\n0:11:07\tSPEAKER_06\n Okay.\n\n0:11:08\tSPEAKER_06\n Yeah, this is for Timmit.\n\n0:11:09\tSPEAKER_02\n But noisy Timmit?\n\n0:11:10\tSPEAKER_06\n No, it's a Timmit.\n\n0:11:11\tSPEAKER_06\n We have no system with the noise of the TID digits.\n\n0:11:15\tSPEAKER_06\n And now we have another noise system, it also with the noise of Italian database.\n\n0:11:24\tSPEAKER_01\n Yeah.\n\n0:11:27\tSPEAKER_02\n Well, there's going to be, it looks like there's going to be a noisy, some large vocabulary noisy stuff too.\n\n0:11:34\tSPEAKER_02\n Something that's preparing.\n\n0:11:35\tSPEAKER_02\n Yeah.\n\n0:11:36\tSPEAKER_02\n I forget it will be resource management, Wall Street Journal, something.\n\n0:11:41\tSPEAKER_02\n Some red task, actually, that there.\n\n0:11:44\tSPEAKER_02\n Or what?\n\n0:11:45\tSPEAKER_02\n Or a raw?\n\n0:11:46\tSPEAKER_02\n Yeah.\n\n0:11:47\tSPEAKER_02\n Yeah.\n\n0:11:48\tSPEAKER_02\n Yeah.\n\n0:11:54\tSPEAKER_02\n So the issue is whether people make a decision now based on what they've already seen or they make it later.\n\n0:11:57\tSPEAKER_02\n And one of the arguments for making it later is let's make sure that whatever techniques that we're using work for something more than connected digits.\n\n0:12:07\tSPEAKER_01\n So.\n\n0:12:10\tSPEAKER_04\n When are they planning, when would they do that?\n\n0:12:13\tSPEAKER_02\n I think in the summer sometime.\n\n0:12:21\tSPEAKER_01\n Okay.\n\n0:12:22\tSPEAKER_06\n This is the work that I did in this date.\n\n0:12:26\tSPEAKER_06\n And also, I, Henik, last week, say that if I have time, I can't begin to study seriously the French telecom proposal to look at the code and something like that.\n\n0:12:42\tSPEAKER_06\n To know, is that what they are doing?\n\n0:12:45\tSPEAKER_06\n Because maybe that we can have some ideas.\n\n0:12:48\tSPEAKER_06\n But not only to read the proposal, look carefully what they are doing with the program and something like that.\n\n0:12:57\tSPEAKER_06\n And I begin to work also in that.\n\n0:13:01\tSPEAKER_06\n But the first thing that they don't understand is that they are using the lock energy.\n\n0:13:11\tSPEAKER_06\n That this quiet, I don't know why they have some constant in the expression of the law energy.\n\n0:13:20\tSPEAKER_06\n I don't know what that means.\n\n0:13:23\tSPEAKER_04\n They have a constant.\n\n0:13:26\tNone\n Yeah.\n\n0:13:27\tSPEAKER_02\n At the front, it says, a lock energy is equal to the rounded version of 16 over the log of two.\n\n0:13:37\tSPEAKER_01\n Well, this is natural log and maybe something to do with the fact that this is, I have no idea.\n\n0:13:45\tSPEAKER_01\n Yeah, that's what I was thinking.\n\n0:13:47\tSPEAKER_01\n But there's a 64.\n\n0:13:55\tSPEAKER_06\n Because maybe the threshold that they are using and the basis of this value, I don't know exactly.\n\n0:14:03\tSPEAKER_06\n Because I thought maybe they have a meaning, but I don't know what the meaning of this value is.\n\n0:14:09\tSPEAKER_06\n Yeah, that's pretty funny.\n\n0:14:11\tSPEAKER_04\n The number inside the log and raising it to 16 over log is two.\n\n0:14:18\tSPEAKER_01\n Yeah, I'm right.\n\n0:14:24\tSPEAKER_04\n I have to do with the 64.\n\n0:14:28\tSPEAKER_02\n For you know, the 16, the natural log of one over the natural log of two times the natural, I don't know.\n\n0:14:41\tSPEAKER_02\n Maybe something will think of something, but this is, it may just be that they want to have some very small energies.\n\n0:14:49\tSPEAKER_06\n They want to have some kind of a...\n\n0:14:52\tSPEAKER_06\n I can understand the effect of this, because it's too, to do something like that.\n\n0:14:58\tSPEAKER_02\n Well, since you're taking a natural log, it says that when you get down to essentially zero energy, this is going to be the natural log of one, which is zero.\n\n0:15:07\tSPEAKER_02\n So it'll go down to the natural log being the lowest value for this will be zero.\n\n0:15:16\tSPEAKER_02\n So it restricted to being positive and sort of smoothed it for very small energies.\n\n0:15:22\tSPEAKER_02\n Why they chose 64 and something else, that was probably just experimental.\n\n0:15:26\tSPEAKER_02\n Yeah.\n\n0:15:27\tSPEAKER_02\n And the constant in front of it, I have no idea.\n\n0:15:30\tSPEAKER_06\n What?\n\n0:15:32\tSPEAKER_06\n I will look to try if I move this parameter in the code, what happens?\n\n0:15:37\tSPEAKER_06\n Maybe the thresholds are in basis of this.\n\n0:15:42\tSPEAKER_02\n I agree.\n\n0:15:45\tSPEAKER_02\n They probably have some particular fixed pointer arithmetic that they're using.\n\n0:15:49\tSPEAKER_04\n They're just...\n\n0:15:50\tSPEAKER_04\n They do with hardware.\n\n0:15:52\tSPEAKER_02\n Yeah.\n\n0:15:53\tSPEAKER_02\n I mean, there's probably work with fixed pointer integer or something.\n\n0:15:56\tSPEAKER_02\n I think you're supposed to in this stuff anyway, and maybe that puts it in the right realm somewhere.\n\n0:16:03\tSPEAKER_02\n Yeah.\n\n0:16:04\tSPEAKER_02\n I think given that the level you're doing things in floating point on the computer, I don't think it matters to be my guess.\n\n0:16:10\tSPEAKER_06\n This is more of a thing.\n\n0:16:14\tSPEAKER_02\n Okay, and when did Stefan take off?\n\n0:16:17\tSPEAKER_06\n I think that the stuff I will arrive today, which tomorrow...\n\n0:16:21\tSPEAKER_02\n Well, he was gone this first few days, and then you see her for a couple days before he goes to Salt Lake City.\n\n0:16:27\tSPEAKER_06\n I think that he's in Las Vegas until then, that.\n\n0:16:31\tSPEAKER_02\n Yeah.\n\n0:16:32\tSPEAKER_02\n So he's going to a cast, which is good.\n\n0:16:35\tSPEAKER_02\n I don't know if there are many people here, but I cast, so make sure somebody go.\n\n0:16:40\tSPEAKER_04\n Have people sort of stopped going to a cast?\n\n0:16:43\tSPEAKER_02\n People are less consistent about going to a cast, but I think it's still a reasonable form for students to present things.\n\n0:16:53\tSPEAKER_02\n I think for engineering students of any kind, I think it's if you haven't been there much, it's good to go to, get a feel for things, a range of things, not just speech.\n\n0:17:04\tSPEAKER_02\n But I think for sort of diving the world's speech people, I think that ICSOP and Euro-Speech are much more targeted.\n\n0:17:12\tSPEAKER_02\n And then there are these other meetings like HLT and ASRU.\n\n0:17:18\tSPEAKER_02\n So there's actually plenty of meetings that are really relevant to computational speech processing, of one sort or another.\n\n0:17:28\tSPEAKER_02\n So, I mean, I mostly just ignored it because I was too busy, and didn't get to it.\n\n0:17:34\tSPEAKER_02\n So, I want to talk a little bit about what we're talking about this morning, just briefly.\n\n0:17:40\tSPEAKER_00\n Anything else?\n\n0:17:42\tSPEAKER_00\n Yeah, so I guess some of the progress I've been getting my committee members for the calls.\n\n0:17:50\tSPEAKER_00\n And so far, I'm more again, and being at Mike Jordan, and I asked John O'Halla to be agreed.\n\n0:17:56\tSPEAKER_00\n Cool? Yeah, yeah.\n\n0:17:58\tSPEAKER_00\n So, I just need to ask Malik.\n\n0:18:02\tSPEAKER_00\n And then I talked a little bit about continuing with these dynamic acoustic events.\n\n0:18:12\tSPEAKER_00\n And we're thinking about a way to test the completeness of a set of dynamic events, completeness in the sense that if we pick these X number of acoustic events, do they provide sufficient coverage for the phones that we're trying to recognize, or the words that we're going to try to recognize from Iran?\n\n0:18:44\tSPEAKER_00\n So, Morgan and I were discussing a form of a cheating experiment where we get a chosen set of features or acoustic events.\n\n0:19:00\tSPEAKER_00\n And we train up a hybrid system to do phone recognition on timet. So, the idea is if we get good phone recognition results using the set of acoustic events, then that says that these acoustic events are sufficient to cover a set of phones at least found a timet.\n\n0:19:26\tSPEAKER_00\n So, it would be a measure of, are we on the right track with the choices of our acoustic events.\n\n0:19:34\tSPEAKER_00\n So, that's going on. And also just working on my final project for Jordan's class, which is...\n\n0:19:45\tSPEAKER_02\n Actually, let me hold that thought. Let me back up while we're still on it. The other thing I was suggesting though is that given that you're talking about binary features, maybe the first thing to do is just to count and count co-occurrences and get probabilities for discrete HMM.\n\n0:20:03\tSPEAKER_02\n So, that would be pretty simple because it's just to say if you had 10 events that you were counting each frame would only have a thousand possible values for these 10 bits.\n\n0:20:15\tSPEAKER_02\n And so, you could make a table that would say if you had 39 phone categories, it would be a thousand by 39 and just count the co-occurrences and divide them by the...\n\n0:20:27\tSPEAKER_02\n count the co-occurrences between the event and the phone and divide them by the number of occurrences of the phone.\n\n0:20:35\tSPEAKER_02\n And that would give you the likelihood of the event given the phone. And then just use that in a very simple HMM.\n\n0:20:44\tSPEAKER_02\n And you could do phone recognition then and wouldn't have any of the issues of the training of the net or... I mean, it'd be on the simple side.\n\n0:21:00\tSPEAKER_02\n The example I was giving was if you had onset of voicing and end-of-voicing as being two kinds of events, then if you had those on mark correctly and you counted the co-occurrences, you should get it completely right.\n\n0:21:19\tSPEAKER_02\n So, but you'd get all the other distinctions randomly wrong. I mean, there'd be nothing to tell you that. So, if you just do this by counting, then you should be able to find out in a pretty straightforward way whether you have a sufficient set of events to do the kind of level of classification of phones that you'd like.\n\n0:21:42\tSPEAKER_02\n So, that was the idea. And the other thing that we were discussing was, okay, how do you get your training data?\n\n0:21:51\tSPEAKER_02\n Because the Switchboard Transcription Project was half-thousand people or so working off and on over a couple years.\n\n0:22:02\tSPEAKER_02\n Similar amount of data to what you're talking about with Dimit training. So, it seems to me that the only reasonable starting point is to automatically translate the current timid markings into the markings you want.\n\n0:22:22\tSPEAKER_02\n And it won't have the kind of characteristic that you'd like of catching funny kind of things that maybe aren't there from these automatic markings, but it's...\n\n0:22:35\tSPEAKER_04\n It's probably a good place to start.\n\n0:22:37\tSPEAKER_02\n Yeah, and a short amount of time. Just to, again, just to see if that information is sufficient to determine the phones.\n\n0:22:48\tSPEAKER_04\n And you could even then get an idea about how different it is you could maybe take some subset and go through a few sentences, mark them by hand and see how different it is from the clinical ones.\n\n0:23:02\tSPEAKER_04\n Just to get an idea of rough idea of if it really even makes a difference.\n\n0:23:07\tSPEAKER_02\n You get a little feeling for it that way. Yeah, that's probably right.\n\n0:23:10\tSPEAKER_02\n I guess it would be that this is since Dimit's red speech that this would be less of a big deal if you want to look at spontaneous speech before or after.\n\n0:23:20\tSPEAKER_02\n And the other thing would be say if you have these 10 events you want to see what if you took two events or four events or ten events.\n\n0:23:27\tSPEAKER_02\n And hopefully there should be some point in which having more information doesn't tell you really all that much more about what the phones are.\n\n0:23:37\tSPEAKER_04\n You could define other events as being sequences of these events.\n\n0:23:44\tSPEAKER_02\n You could, but the thing is what he's talking about here is a translation to a per frame feature vector.\n\n0:23:57\tSPEAKER_02\n So there's no sequence in that, I think.\n\n0:24:01\tSPEAKER_02\n Unless you've got your second pass over or something after you've got your...\n\n0:24:08\tSPEAKER_02\n Yeah, but we're just talking about something simple here.\n\n0:24:13\tSPEAKER_02\n Yeah, I'm adding complexity.\n\n0:24:16\tSPEAKER_02\n Yeah, with a very simple statistical structure, could you at least verify that you've chosen features that are sufficient?\n\n0:24:30\tSPEAKER_02\n Okay, and you were saying some of these are going to say something else about your class project?\n\n0:24:34\tSPEAKER_00\n Yeah, so for my class project, I'm tinkering with support vector machines, something that we learned in class, and basically just another method for doing classification.\n\n0:24:48\tSPEAKER_00\n So I'm going to apply that to compare it with the results by King and Taylor who did using recurrent known as they recognized a set of phonological features made of mapping from the MFCC's to phonological features.\n\n0:25:09\tSPEAKER_00\n So I'm going to do a similar thing with support vector machines.\n\n0:25:14\tSPEAKER_04\n So what's the advantage of support vector machines?\n\n0:25:19\tSPEAKER_00\n So support vector machines are good with dealing with less amount of data.\n\n0:25:26\tSPEAKER_00\n So if you give it less data, it still does a reasonable job in learning the patterns.\n\n0:25:37\tSPEAKER_02\n I guess they're sort of succinct.\n\n0:25:43\tSPEAKER_04\n Does there is some kind of a distance metric they use or what do they do for classification?\n\n0:25:51\tSPEAKER_00\n So the simple idea behind the support vector machine is you have this feature space, right? Then it finds the optimal separating play between these two different classes.\n\n0:26:10\tSPEAKER_00\n And so at the end of the day, what it actually does is it picks those examples of the features that are closest to the separating boundary and remembers those and uses them to recreate the boundary for the test set.\n\n0:26:32\tSPEAKER_00\n So given these features are these examples, critical examples, which they call support vectors, then given a new example, if the new example falls away from the boundary in one direction, then it's classified as being part of this particular class.\n\n0:26:54\tSPEAKER_04\n So why save the examples? Why not just save what the boundary itself is?\n\n0:27:04\tSPEAKER_00\n Yeah, that's a good question.\n\n0:27:14\tSPEAKER_02\n That's another way of doing it. So I guess it goes back to nearest neighbor sort of thing.\n\n0:27:26\tSPEAKER_02\n When is nearest neighbor good? Well nearest neighbor good is good if you have lots and lots of examples.\n\n0:27:32\tSPEAKER_02\n But of course if you have lots and lots of examples, then it can take a while to use nearest neighbor's lots of lookups. So a long time ago people talked about things where you would have condensed nearest neighbor where you would pick out some representative examples, which would be sufficient to represent to correctly classify everything that came in.\n\n0:27:53\tSPEAKER_04\n I think support vector stuff goes back to that kind of thing. So rather than doing nearest neighbor where you compare to every single one, you just pick a few critical ones.\n\n0:28:07\tSPEAKER_02\n And the neural net approach or gothse mixtures for that matter are sort of fairly brute force kinds of things where you sort of predefined that there's this big bunch of parameters and then you place them as your best can to define the boundaries.\n\n0:28:25\tSPEAKER_02\n And in fact, as you know, these things do take a lot of parameters. And if you have only a minus amount of data, you have trouble learning them.\n\n0:28:35\tSPEAKER_02\n So I guess the idea to this is that it is reputed to be somewhat better in that regard.\n\n0:28:43\tSPEAKER_00\n It can be a reduced parameterization of the model by just keeping certain selected examples.\n\n0:28:55\tSPEAKER_02\n But I don't know if people have done sort of careful comparisons of this on large tasks or anything. Maybe they have. I don't know.\n\n0:29:05\tSPEAKER_03\n So do you get some kind of number between zero and one at the output?\n\n0:29:10\tSPEAKER_00\n Actually, you don't get a nice number between zero and one. You get either a zero or one.\n\n0:29:18\tSPEAKER_00\n Basically, you get a distance measure at the end of the day. And then that distance measure is translated to a zero or one.\n\n0:29:32\tSPEAKER_04\n But that's looking at it for a binary classification. And you get that for each class. You get a zero or one.\n\n0:29:40\tSPEAKER_02\n But you have the distances to work with. Because actually, Mrs. Cippy stayed people to use support vector machines for speech recognition. And they were using it to make probabilities.\n\n0:29:50\tSPEAKER_00\n Yeah, they had a way to translate the distances into a probability with a simple sigmoidal function.\n\n0:30:02\tSPEAKER_02\n So they used sigmoidal or a softmax type thing. And didn't they like exponential or something and divide by the sum of them.\n\n0:30:10\tSPEAKER_02\n Oh, so it is a sigmoidal.\n\n0:30:14\tSPEAKER_04\n Did they get good results with that?\n\n0:30:18\tSPEAKER_02\n No, they were okay. I mean, I don't think they were earth shattering. But I think that this was a couple years ago.\n\n0:30:25\tSPEAKER_02\n I think people were very critical because it was interesting just to try this. And it was the first time they tried it.\n\n0:30:34\tSPEAKER_02\n So the numbers were not incredibly good. But there was reasonable.\n\n0:30:40\tSPEAKER_02\n I don't remember anymore. I don't remember what the task was. It was broadcast news or something.\n\n0:30:48\tSPEAKER_00\n So I'm not planning on doing speech recognition with it. Just doing detection of phonological features.\n\n0:30:59\tSPEAKER_00\n So for example, this feature set called the sound patterns of English is just a bunch of binary valued features.\n\n0:31:11\tSPEAKER_00\n So I don't know if you can say, is this voicing or is this not voicing this sound or is this.\n\n0:31:18\tSPEAKER_00\n Did you find any more mistakes in their table?\n\n0:31:22\tSPEAKER_00\n I haven't gone through my table. Yesterday I brought Chuck the table and I was like, is the mapping from N to this phonological feature called coronal?\n\n0:31:35\tSPEAKER_00\n Should it be a one? Or should it be a coronal instead of not coronal as it was labeled in the paper?\n\n0:31:41\tSPEAKER_00\n So I haven't hunted down all the mistakes yet.\n\n0:31:46\tSPEAKER_02\n But as I was saying, people do get probabilities of these things. And we were just trying to remember how they do.\n\n0:31:52\tSPEAKER_02\n But people have used it for speech recognition. They have gotten probabilities. So they have some conversion from these distances to probabilities.\n\n0:32:00\tSPEAKER_02\n You have the paper, right, the Mississippi State paper. Yeah, if you're interested.\n\n0:32:05\tSPEAKER_00\n I can show you.\n\n0:32:08\tSPEAKER_04\n So in a thing you're doing, you have a vector of ones and zeros for each phone.\n\n0:32:16\tSPEAKER_00\n Is this the class project?\n\n0:32:18\tSPEAKER_00\n Yeah.\n\n0:32:19\tSPEAKER_00\n Is that what you're right? Right, right. So for every phone there is a vector of ones and zeros.\n\n0:32:31\tSPEAKER_00\n Of course, whether it exhibits a particular phonological feature or not.\n\n0:32:36\tSPEAKER_04\n And so when you do your, what is the task for the class project to come up with the phones or to come up with these vectors to see how close they match the phone?\n\n0:32:47\tSPEAKER_00\n To come up with a mapping from MFCCs or some features that to whether there is an existence of a particular phonological feature.\n\n0:33:03\tSPEAKER_00\n And yeah, basically it's to learn a mapping from the MFCCs to phonological features.\n\n0:33:15\tSPEAKER_00\n Is it the answer to your question? I think so.\n\n0:33:18\tSPEAKER_04\n I guess, I mean, I'm not sure what you get out of your system.\n\n0:33:25\tSPEAKER_04\n Do you get out a vector of these ones and zeros and then try to find the closest matching phoneme to that vector?\n\n0:33:32\tSPEAKER_00\n Oh, no, no. I'm not planning to do any phoneme mapping yet.\n\n0:33:38\tSPEAKER_00\n It's basically, it's really simple, basically, a detection of phonological features.\n\n0:33:46\tSPEAKER_00\n I see.\n\n0:33:48\tSPEAKER_00\n Because the, so King and Taylor did this with recurrent neural nets.\n\n0:33:55\tSPEAKER_00\n And their idea was to first find a mapping from MFCCs to phonological features.\n\n0:34:03\tSPEAKER_00\n And then later on, once you have these phonological features, then map that to folks.\n\n0:34:10\tSPEAKER_00\n So I'm sort of reproducing phase one.\n\n0:34:13\tSPEAKER_04\n So they had one recurrent net for each particular feature.\n\n0:34:20\tSPEAKER_04\n Did they compare that? I mean, what if you just did phone recognition and did the reverse look up?\n\n0:34:26\tSPEAKER_04\n So you recognize a phone, then whichever phone was recognized, you spit out its vector of ones and zeros.\n\n0:34:33\tSPEAKER_02\n The spectrary could do that. That's probably not what you're going to do in this class, Brian.\n\n0:34:39\tSPEAKER_02\n So have you had a chance to do this thing we talked about yet with the search and penalty?\n\n0:34:48\tSPEAKER_02\n No, actually, I was going different, that's a good question too, but I was going to ask about the changes to the data in comparing PLP and no capstrom for the SRI system.\n\n0:35:07\tSPEAKER_04\n Well, what I've been changes to data, I'm not sure.\n\n0:35:10\tSPEAKER_02\n So we talked on the phone about this, that there was still a difference of a few percent, and you told me that there was a difference in how the normalization was done.\n\n0:35:20\tSPEAKER_02\n And I was asking if you were going to redo it for PLP with a normalization done as it had been done for the mock-up stream.\n\n0:35:30\tSPEAKER_04\n Right, no, I haven't had a chance to do that.\n\n0:35:32\tSPEAKER_04\n So what I've been doing is trying to figure out, it just seems to me like there's a, well, it seems like there's a bug because the difference in performance is, it's not gigantic, but it's big enough that it seems wrong.\n\n0:35:50\tSPEAKER_02\n I agree, but I thought that the normalization difference was one of the...\n\n0:35:54\tSPEAKER_04\n Yeah, but I don't know how this is.\n\n0:35:55\tSPEAKER_04\n Yeah, I guess I don't think that the normalization difference is going to count for everything. So what I was working on is just going through and checking the headers of the wave files to see if maybe there was a certain type of compression or something that was done that my script wasn't catching.\n\n0:36:13\tSPEAKER_04\n For some subset of the training data, the features I was computing were junk, which would cause it to perform okay, but the models would be all messed up.\n\n0:36:25\tSPEAKER_04\n So I was going through and just double checking that kind of thing first to see if there was just some kind of obvious bug in the way that I was computing the features.\n\n0:36:33\tSPEAKER_04\n Looking at all the sampling rates, make sure all the sampling rates were what HK, what I was assuming they were...\n\n0:36:39\tSPEAKER_04\n Yeah, that makes sense to check out. So I was doing that first before I did these other things just to make sure there wasn't something.\n\n0:36:45\tSPEAKER_02\n Although really, a couple of 3% difference in order or rate could easily come from some difference in normalization, I would think.\n\n0:36:55\tSPEAKER_04\n Yeah, and I think, I'm trying to remember, but I think I recall that Andreas was saying that he was going to run sort of the reverse experiment, which is to try to emulate the normalization that we did, but with ML Cup Straw features.\n\n0:37:15\tSPEAKER_04\n Sort of, you know, back up from the system that he had. I thought he said he was going to have to look back through my email from him.\n\n0:37:23\tSPEAKER_02\n Yeah, he's probably off at the end of his meeting there.\n\n0:37:27\tSPEAKER_02\n Yeah, but yeah, I just think they should be roughly equivalent. I mean, again, the Cambridge folk found the PLP actually be a little better.\n\n0:37:39\tSPEAKER_02\n I mean, the other thing I wondered about was whether there was something just in the bootstrapping of a system which was based on, but maybe not.\n\n0:37:49\tSPEAKER_04\n So one thing that's a little bit, I was looking, I've been studying and going through the logs for the system that Andreas created.\n\n0:37:57\tSPEAKER_04\n And his way that the SRI system looks like it works is that it reads the way files directly and does all of the capture computation stuff on the fly.\n\n0:38:11\tSPEAKER_04\n Right. And so there's no place where these, where the capture files are stored in, where that I can go look at and compare to the PLP one.\n\n0:38:19\tSPEAKER_04\n So, whereas with our features, he's actually storing the capture.\n\n0:38:24\tSPEAKER_04\n Yes, going to read those in, but it looked like he had to give it, even though the capture was already computed, he has to give it a front end parameter file, which talks about the kind of.\n\n0:38:39\tSPEAKER_04\n Computation that his malfunction thing does. So, I don't know if that probably doesn't mess it up, it probably just ignores it if it determines that it's already in the right format or something, but the two processes that happen are a little different.\n\n0:38:55\tSPEAKER_04\n So, anyway, there's stuff there to start with.\n\n0:38:58\tSPEAKER_02\n Yeah. So, okay, let's go back to what you thought I was asking you.\n\n0:39:01\tSPEAKER_04\n Yeah, no, and I didn't have a chance to do that.\n\n0:39:04\tSPEAKER_04\n Same answer anyway. Yeah, I've been working with Jeremy on his project, and then I've been trying to track down this bug.\n\n0:39:16\tSPEAKER_04\n That's a seed front end features.\n\n0:39:18\tSPEAKER_04\n So, one thing that I did notice yesterday, I was studying the, the, the Rostecode.\n\n0:39:23\tSPEAKER_04\n And it looks like we don't have any way to control the frequency range that we use in our analysis. We basically, it looks to me like we do the FFT, and then we just take all the bins, and we use everything.\n\n0:39:39\tSPEAKER_04\n We don't have any set of parameters where we can say, you know, only process from, you know, 110 hertz to 3750.\n\n0:39:47\tSPEAKER_02\n At least I couldn't see any kind of. Yeah, I don't think it's in there. I think it's in the, the filters.\n\n0:39:55\tSPEAKER_02\n So, the FFT is on everything, but the filters, for instance, ignore the lowest bins and the highest bins.\n\n0:40:07\tSPEAKER_02\n What it does is it copies the filter bank, which is created by integrating over FFT bins.\n\n0:40:17\tSPEAKER_02\n When you get the mail, when you get the mail scale. Yeah, it's a, it, it actually copies the, the second filters over to the first.\n\n0:40:31\tSPEAKER_02\n So, the first filters are always, and you can, you can specify a different number of features, different number of filters, I think.\n\n0:40:39\tSPEAKER_02\n So, you can specify a different number of filters, and whatever you specify, the last ones are going to be ignored.\n\n0:40:49\tSPEAKER_02\n So, that, that's a way that you sort of change what the, what the bandwidth is.\n\n0:40:55\tSPEAKER_02\n You, you can't do it without, I think, changing the number of filters.\n\n0:40:59\tSPEAKER_04\n I saw something about, it looked like it was doing something like that, but I didn't quite understand it.\n\n0:41:05\tSPEAKER_02\n So, maybe, yeah. So, the idea is that the very lowest frequencies, and typically the various highest frequencies are kind of junk.\n\n0:41:11\tSPEAKER_02\n Uh-huh. And so, you just, for continuity, you just approximate them by, by the second to highest and second to lowest.\n\n0:41:19\tSPEAKER_02\n It's just a simple thing we put in.\n\n0:41:23\tSPEAKER_02\n And so, but that's a fixed thing, there's nothing to put in. Yeah, I think that's a fixed thing, but see, see my point, if you had, if you had 10 filters, then you would be throwing away a lot at the two ends.\n\n0:41:37\tSPEAKER_02\n And if you had, if you had 50 filters, you'd be throwing away hardly anything.\n\n0:41:43\tSPEAKER_02\n I don't remember there being an independent way of saying we're just going to make you, just from here to here.\n\n0:41:49\tSPEAKER_04\n I don't know, it's actually been a while since I've looked at it. Yeah, I went through the FICAL code and then looked at, it was calling the RUST Alive and things like that.\n\n0:41:56\tSPEAKER_04\n And I didn't, I couldn't see any place where that kind of thing was done, but I didn't quite understand everything that I saw.\n\n0:42:03\tSPEAKER_02\n Yeah, see, I don't know FICAL at all, but it calls RUST with some options.\n\n0:42:09\tSPEAKER_02\n But I think, I don't know, I guess for some particular database, you might find that you could tune that and tweak that to get that a little better, but I think that in general, it's not that critical.\n\n0:42:21\tSPEAKER_02\n I mean, there's, you can, you can throw away stuff below 100 hertz or so and it's just not going to affect phonetic classification at all.\n\n0:42:30\tSPEAKER_04\n The other thing I was thinking about was, is there a, I was wondering if there's maybe certain settings of the parameters when you compute PLP, which would basically cause it to output Malcapsterum.\n\n0:42:45\tSPEAKER_04\n So that in effect, what I could do is use our code to produce Malcapsterum and compare that directly to...\n\n0:42:52\tSPEAKER_02\n Well, it's not precisely, yeah. I mean, what you can do is, you can definitely change the filter bank from being a trapezoidal integration to a triangular one, which is what the typical Malcapsteral filter bank does.\n\n0:43:19\tSPEAKER_02\n So some people have claimed that they got some better performance doing that, so you certainly can do that easily.\n\n0:43:24\tSPEAKER_02\n But the fundamental difference, I mean, there's other small differences.\n\n0:43:28\tSPEAKER_04\n There's a few groups that happen, sorry.\n\n0:43:30\tSPEAKER_02\n Yeah, but, you know, as opposed to the log and the other case.\n\n0:43:33\tSPEAKER_02\n I mean, the fundamental difference that we've seen any kind of difference from before, which is actually an advantage for PLP, I think is that the, the smoothing at the end is autoregressive instead of being kept from kept from location.\n\n0:43:48\tSPEAKER_02\n So it's a little more noise robust.\n\n0:43:53\tSPEAKER_02\n And that's why when people start getting databases that had a little more noise in it, like broadcast news and so on, that's why Cambridge Switched to PLP, I think.\n\n0:44:03\tSPEAKER_02\n So that's a difference that I don't think we put any way to get around since it was an advantage.\n\n0:44:13\tSPEAKER_02\n But we did, we did hear this comment from people at some point that it, they got some better results with the triangular filters rather than the trapezoidal, so that is an option in Rasta.\n\n0:44:28\tSPEAKER_02\n And you can certainly play with that.\n\n0:44:31\tSPEAKER_02\n But I think you're probably doing the right thing to look for books first.\n\n0:44:34\tSPEAKER_04\n Yeah, just, it just seems like this kind of behavior could be caused by, you know, some of the training data being messed up.\n\n0:44:41\tSPEAKER_04\n Yeah, you're sort of getting most of the way there, but there's a, so I started going through and looking, one of the things that I did notice was that the log likelihoods coming out of the recognizer from the PLP data were much lower, much smaller than for the male kept still stuff.\n\n0:45:00\tSPEAKER_04\n And that the average amount of pruning that was happening was therefore a little bit higher for the PLP features.\n\n0:45:08\tSPEAKER_04\n So since he used the same exact pruning thresholds for both, I was wondering if it could be that we're getting more pruning.\n\n0:45:15\tSPEAKER_02\n Oh, he, he, he used the identical pruning thresholds even though the, the range of the, the likelihood, oh well, that's, that's a pretty good point right there.\n\n0:45:25\tSPEAKER_02\n Yeah.\n\n0:45:26\tSPEAKER_02\n So I would think that you might want to do something like, you know, look at a few points to see where you were starting to get significant search errors.\n\n0:45:33\tSPEAKER_04\n Right. Well, what I was going to do is I was going to take a couple of the utterances that he had run through, then run them through again, but modify the pruning threshold and see if it, you know, affects the score.\n\n0:45:46\tSPEAKER_02\n Yeah.\n\n0:45:47\tSPEAKER_02\n But I mean, you could, if, if that looks promising, you could, you know, run the overall test set with a, with a few different pruning thresholds for both.\n\n0:45:57\tSPEAKER_02\n Yeah. And presumably he's running at some pruning threshold that's, that's, you know, gets very few search errors, but is, is relatively, right?\n\n0:46:06\tSPEAKER_04\n I mean, yeah, generally, these things, you, you turn back pruning really far. So I, I didn't think it would be that big a deal because I was freaking well, you'd have it turned back so far that, you know, but you may be in the wrong range for the PLP features for some reason.\n\n0:46:18\tSPEAKER_04\n And the, the, the runtime of the recognizer on the PLP features is longer, which sort of implies that the networks are busier.\n\n0:46:25\tSPEAKER_04\n You know, there's more things it's considering, which goes along with the fact that the matches aren't as good.\n\n0:46:30\tSPEAKER_04\n So, you know, it could be that we're just pruning too much.\n\n0:46:35\tSPEAKER_04\n So yeah.\n\n0:46:37\tSPEAKER_02\n Yeah, maybe just be different kind of distributions and, and yes, so that's, that's another possible thing.\n\n0:46:43\tSPEAKER_02\n They, they should really shouldn't, there's no particular reason why they would be exactly behave exactly the same.\n\n0:46:49\tSPEAKER_02\n Right.\n\n0:46:51\tSPEAKER_04\n So, so there's lots of little differences. Yeah. Yeah.\n\n0:46:56\tSPEAKER_02\n Trying to track it down. Yeah. I guess this was a little bit off topic. I guess I guess I was, I was thinking in terms of that this is being a core item that once we, once we had it going, we would use for a number of the front end things also.\n\n0:47:11\tSPEAKER_03\n That's as far as my stuff goes. Yeah. Well, I tried this mean subtraction method due to Avandano.\n\n0:47:23\tSPEAKER_03\n I'm taking six seconds of speech. I'm using two second FFT analysis frames, step by a half second. So it's a quarter length step.\n\n0:47:34\tSPEAKER_03\n And I take that frame and four, the four, I take the, sorry, I take the current frame and the four past frames and the four future frames.\n\n0:47:42\tSPEAKER_03\n And that, that adds up to six seconds of speech. And I calculate the spectral mean of the log magnitude spectrum over that.\n\n0:47:51\tSPEAKER_03\n And I use that to normalize the current center frame by mean subtraction. And then I move to the next frame and I do it again.\n\n0:48:01\tSPEAKER_03\n Well, actually I calculate all the means first and then I do the subtraction. And I tried that with HDK, the Aurora setup of HDK training on clean TI digits.\n\n0:48:11\tSPEAKER_03\n And it helped in a phony reverberation case where I just use a simulated impulse response. The error rate went from something like 80, from something like 18% to 4%.\n\n0:48:27\tSPEAKER_03\n And on meeting recorded for my digits, my channel F, it went from 41% error to 8% error.\n\n0:48:39\tSPEAKER_04\n On the real data, not with artificial reverb.\n\n0:48:42\tSPEAKER_03\n Right. And that that was trained on clean speech only, which I'm guessing is the reason why the baseline was so bad.\n\n0:48:53\tSPEAKER_02\n And that's actually a little side point is I think that's the first results that we have of any sort on the far field data for recorded in meetings.\n\n0:49:07\tSPEAKER_03\n Well, I'm actually Adam, around the SRI recognizer on the near field on the far field, also he did one 2CM channel and one PDH channel.\n\n0:49:16\tSPEAKER_02\n Oh, I didn't recall that. What kind of numbers was he getting with that?\n\n0:49:20\tSPEAKER_03\n I'm not sure. I think it was about 5% error for the PCM channel.\n\n0:49:27\tSPEAKER_02\n Five. Yeah. So why were you getting 41?\n\n0:49:33\tSPEAKER_03\n I'm guessing it was the training data. Clean TI digits is pretty pristine training data. And if they trained the SRI system on this TV broadcast type stuff, I think it's a much brighter range of channels.\n\n0:49:46\tSPEAKER_02\n No, but wait a minute. I think he was getting 1% error for the near field.\n\n0:50:01\tSPEAKER_02\n Yeah, I think it was getting around 1% for the close mic. So it's still this kind of ratio. It's just, yeah, it's a lot more training data.\n\n0:50:16\tSPEAKER_02\n So it probably should be something we should try then is to see if at some point is to transform the data and then use it for the SRI system.\n\n0:50:28\tSPEAKER_02\n So you have a system which for one reason or another is relatively poor.\n\n0:50:36\tSPEAKER_02\n Yeah. And you have something like 41% error and then you transform it to 8th by doing this work.\n\n0:50:45\tSPEAKER_02\n So here's this other system which is a lot better. There's still this kind of ratio. It's something like 5% error with the distant mic and 1% close mic.\n\n0:50:56\tSPEAKER_02\n So the question is how close to that one can you get if you transform the data using that system?\n\n0:51:02\tSPEAKER_03\n Right. So I guess the SRI system is trained on a lot of broadcast news or switchboard data.\n\n0:51:08\tSPEAKER_04\n Yeah. So do you know which one it is?\n\n0:51:10\tSPEAKER_04\n It's trained on a lot of different things. It's trained on a lot of switchboard, call home, a bunch of different sources, some digits or some digits training in there.\n\n0:51:20\tSPEAKER_03\n One thing I'm wondering about is what this mean subtraction method will do if it's faced with additive noise.\n\n0:51:27\tSPEAKER_03\n Because I don't know what log magnitude spectral subtraction is going to do to additive noise.\n\n0:51:33\tSPEAKER_02\n Yeah. Well, it's not exactly the right thing. But you were already seeing that because there is added noise here.\n\n0:51:40\tSPEAKER_03\n Yeah, that's true. Yeah. It's a good point.\n\n0:51:44\tSPEAKER_03\n So... Okay. So it's a reasonable to expect. It would be helpful if we used it with the SRI system.\n\n0:51:53\tSPEAKER_02\n Yeah. I mean, as helpful. So that's the question. We're often asked this when we work with a system that isn't sort of industry standard grade.\n\n0:52:03\tSPEAKER_02\n And we see some reduction error using some clever method, then we'll work on a good system.\n\n0:52:09\tSPEAKER_02\n So the other one is pretty good system. I think 1% would aerate on digits strings. It's not stellar.\n\n0:52:21\tSPEAKER_02\n But given that this is real digits is supposed to sort of laboratory.\n\n0:52:26\tSPEAKER_02\n And it wasn't trained on this task.\n\n0:52:28\tSPEAKER_02\n And it wasn't trained on this task. Actually, 1% sort of a reasonable range. People would say, I can imagine getting that.\n\n0:52:34\tSPEAKER_02\n And so the 4% or 5% or something is quite poor. If you're doing a 16-digit credit card number, you basically get it wrong almost all the time.\n\n0:52:46\tSPEAKER_02\n So significant reduction error for that would be great.\n\n0:52:52\tSPEAKER_02\n And then... Yeah. So... Yeah. Cool. Sounds good.\n\n0:52:58\tSPEAKER_02\n Right. I actually have to run. So I don't think I can do the digits. But I guess I'll leave my microphone on.\n\n0:53:07\tSPEAKER_04\n Yeah.\n\n0:53:08\tSPEAKER_02\n Yeah. Yeah. Yeah. Yeah. Yeah. You're actually kind of disinterprets. Yeah? Yeah. Yeah. I know. You're quickly.\n\n0:53:28\tSPEAKER_02\n Sorry. I just have to run for another appointment. Okay. Did I? Yeah, I left it.\n\n0:53:32\tSPEAKER_02\n Okay. Okay. Okay. This is transcript L-110. 902-573-266-166-674208. 5169-477-7950. 5602-2577.\n\n0:53:56\tSPEAKER_02\n 6089-07264-5. 2192-89558. 3250-2934-4612-0885.\n\n0:54:14\tSPEAKER_00\n Transcript L-111-362-8332-207-16654268-9006-39334-754-7960-9903-7432-7542. 493-519-103-7452.\n\n0:54:43\tSPEAKER_00\n 519-788-504-940753-758-441-701-8553253-8.\n\n0:55:02\tSPEAKER_04\n Transcript L-112-07876216-4653-1258-477-727-770. 636-34797-776. 529-327-329.\n\n0:55:23\tSPEAKER_04\n 939-389-141-7604-400-867-458-066-359-777. 7355-3245-08.\n\n0:55:41\tSPEAKER_03\n I'm reading transcript L-113-65697-284-4087-5187-405702-425-037-681-779-217-909-0605-68859.\n\n0:56:09\tSPEAKER_03\n 522-55662-911-7206-7162-023-019-023.\n\n0:56:27\tSPEAKER_06\n Transcript L-115-064-732-271-08758-673-755-119-14.\n\n0:56:51\tSPEAKER_06\n 988-419-3102-410-368-219-628-969-186-565-0-3116-639-8-78-398-9.\n\n0:57:20\tNone\n AS6-0810.\n\n", "summary": [{"summary_text": "SPEAKER_02 is trying to explain a new feature to the text voice and voice. Speaker tried to MLP with the new feature and the feature from the new bass system. The results are a little bit better but more or less similar. "}]}