{"filename": "./data/Bro014.txt", "transcript": "0:00:00\tSPEAKER_02\n Channel 3.\n\n0:00:02\tSPEAKER_08\n Yes.\n\n0:00:03\tSPEAKER_08\n Okay.\n\n0:00:04\tNone\n Channel 3.\n\n0:00:05\tSPEAKER_08\n Channel 3.\n\n0:00:07\tSPEAKER_06\n Okay.\n\n0:00:09\tSPEAKER_06\n Did you sell speech recognition last week?\n\n0:00:12\tSPEAKER_06\n Alright.\n\n0:00:14\tSPEAKER_06\n That's the image processing.\n\n0:00:16\tSPEAKER_06\n Yes, again.\n\n0:00:18\tSPEAKER_07\n We did it again, Morgan.\n\n0:00:20\tSPEAKER_06\n Alright.\n\n0:00:22\tSPEAKER_00\n Okay.\n\n0:00:29\tSPEAKER_06\n It's April 5th.\n\n0:00:37\tSPEAKER_06\n Actually, he next to be getting back in town shortly, if he hasn't already.\n\n0:00:41\tSPEAKER_06\n Is he going to come here?\n\n0:00:43\tSPEAKER_06\n Well, we'll drag him here.\n\n0:00:45\tSPEAKER_07\n So when you sit in town, you mean, Oregon?\n\n0:00:48\tSPEAKER_06\n Hey, man, you know this end of the world.\n\n0:00:50\tSPEAKER_06\n That's really what I meant.\n\n0:00:52\tSPEAKER_06\n He's been in Europe.\n\n0:00:54\tSPEAKER_06\n So.\n\n0:00:57\tSPEAKER_07\n I have something just fairly brief to report on.\n\n0:01:08\tSPEAKER_07\n I did some experiments, just a few more experiments before I had to go away for that week.\n\n0:01:17\tSPEAKER_07\n Was it last week or whatever?\n\n0:01:20\tSPEAKER_07\n So what I was starting playing with was, again, this is the HTK back end.\n\n0:01:26\tSPEAKER_07\n I was curious because the way that they train up the models, they go through about four sort of rounds of training.\n\n0:01:36\tSPEAKER_07\n And in the first round, they do, I think it's three iterations.\n\n0:01:50\tSPEAKER_07\n And for the last three rounds, they do seven iterations of re-estimation in each of those three.\n\n0:01:57\tSPEAKER_07\n And so, you know, that's part of what takes so long to train the back end for this.\n\n0:02:03\tSPEAKER_07\n And so, you know, it's the first one that's been in the first three rounds of training.\n\n0:02:09\tSPEAKER_07\n I guess you could say iterations.\n\n0:02:12\tSPEAKER_07\n The first one is three, then seven, seven, and seven.\n\n0:02:16\tSPEAKER_07\n And what these numbers refer to is the number of times that the HMM re-estimation is run.\n\n0:02:24\tSPEAKER_06\n It's this program called HE Rest.\n\n0:02:27\tSPEAKER_07\n So what happens is, at each one of these points, you increase the number of Gaussian's in the model.\n\n0:02:36\tSPEAKER_06\n Oh, right. This was the mix up.\n\n0:02:39\tSPEAKER_07\n Yes, the mix up.\n\n0:02:41\tSPEAKER_07\n And so, in the final one here, you end up with, for all of the digit words, you end up with three mixtures per state.\n\n0:02:53\tSPEAKER_07\n In the final thing. So I had done some experiments where I was, I want to play with the number of mixtures.\n\n0:03:00\tSPEAKER_07\n But I wanted to first test to see if we actually need to do this many iterations early on.\n\n0:03:09\tSPEAKER_07\n And so, I ran a couple of experiments where I reduced that to be three, two, two, five, I think.\n\n0:03:20\tSPEAKER_07\n And I got almost the exact same results.\n\n0:03:23\tSPEAKER_07\n But it runs much, much faster.\n\n0:03:26\tSPEAKER_07\n So I think it only took something like three or four hours to do the full training.\n\n0:03:33\tSPEAKER_07\n As opposed to...\n\n0:03:34\tSPEAKER_07\n As opposed to what, 16 hours or something like that?\n\n0:03:38\tSPEAKER_07\n I mean, you have to do an overnight, basically, the way it is set up now.\n\n0:03:42\tSPEAKER_07\n So, even if we don't do anything else, doing something like this could allow us to turn experiments around a lot faster.\n\n0:03:49\tSPEAKER_06\n And then when you have your final thing...\n\n0:03:50\tSPEAKER_07\n And when you have your final thing, we go back to this.\n\n0:03:53\tSPEAKER_07\n So, and it's a real simple change to make.\n\n0:03:56\tSPEAKER_07\n I mean, it's like one little text file you edit and change those numbers.\n\n0:04:00\tSPEAKER_07\n And you don't do anything else. And then you just run.\n\n0:04:02\tSPEAKER_07\n So it's a very simple change to make and it doesn't seem to hurt all that much.\n\n0:04:06\tSPEAKER_02\n So...\n\n0:04:07\tSPEAKER_02\n You run with three, two, two?\n\n0:04:09\tSPEAKER_07\n I have to look to see what the exact numbers were.\n\n0:04:11\tSPEAKER_07\n I thought it was like three, two, two, five. But I'll double check.\n\n0:04:15\tSPEAKER_07\n It was over a week ago that I did it, so I can't remember exactly.\n\n0:04:20\tSPEAKER_07\n But it's so much faster.\n\n0:04:22\tSPEAKER_07\n It makes a big difference.\n\n0:04:24\tSPEAKER_07\n So we could do a lot more experiments and throw a lot more stuff in there.\n\n0:04:27\tSPEAKER_07\n That's great.\n\n0:04:28\tSPEAKER_07\n Oh, the other thing that I did was...\n\n0:04:30\tSPEAKER_07\n I compiled the HTK stuff for the Linux boxes.\n\n0:04:34\tSPEAKER_07\n So we have this big thing that we got from IBM, which is a five processor machine, really fast.\n\n0:04:41\tSPEAKER_07\n But it's running Linux. So you can now run your experiments on that machine.\n\n0:04:46\tSPEAKER_07\n And you can run five at a time and it runs as fast as five different machines.\n\n0:04:52\tSPEAKER_07\n So I've forgotten now what the name of that machine is, but I can send an email around about it.\n\n0:04:59\tSPEAKER_07\n And so we've got it now.\n\n0:05:01\tSPEAKER_07\n HTK is compiled for both the Linux and for the sparks.\n\n0:05:05\tSPEAKER_07\n You have to make sure that in your.cshrc it detects whether you're running on a Linux or a spark and points to the right executables.\n\n0:05:16\tSPEAKER_07\n And you may not have had that in your.cshrc before if you were always just running the spark.\n\n0:05:22\tSPEAKER_07\n So I can tell you exactly what you need to do to get all of that to work.\n\n0:05:28\tSPEAKER_07\n But it'll really increases what we can run on.\n\n0:05:31\tSPEAKER_07\n So together with the fact that we've got these faster Linux boxes and it takes less time to do these, we should be able to crank through a lot more experiments.\n\n0:05:42\tSPEAKER_07\n So after I did that, then what I wanted to do was try increasing the number of mixers just to see how that affects performance.\n\n0:05:51\tSPEAKER_06\n Yeah, in fact, you could do something like keep exactly the same procedure and then add a fifth thing onto it.\n\n0:06:01\tNone\n Exactly.\n\n0:06:02\tSPEAKER_00\n So at the middle where the arrows are showing, that's you're adding one more mixture per state?\n\n0:06:09\tSPEAKER_07\n Let's see, it goes from this, let's try to go backwards. At this point it's two mixtures per state.\n\n0:06:21\tSPEAKER_07\n So this just adds one except that actually for the silence model, it's six mixtures per state.\n\n0:06:30\tSPEAKER_07\n So it goes to two. And I think what happens here is...\n\n0:06:39\tSPEAKER_06\n Might be between a shared...\n\n0:06:41\tSPEAKER_07\n Yeah, I think that's what it is or something.\n\n0:06:44\tSPEAKER_07\n Yeah, it's...\n\n0:06:47\tSPEAKER_07\n I can't remember now what happens at that first one. I have to look it up and see.\n\n0:06:53\tSPEAKER_07\n Because they start off with an initial model, which is just this global model, and then they split it to the individuals.\n\n0:07:01\tSPEAKER_07\n And so it may be that that's what's happening here. I have to look it up and see. I don't exactly remember.\n\n0:07:12\tSPEAKER_07\n So that's it.\n\n0:07:13\tSPEAKER_06\n Right. So what else?\n\n0:07:19\tSPEAKER_02\n Yeah, there was a conference call this Tuesday.\n\n0:07:26\tSPEAKER_02\n I don't know yet what happened Tuesday, but the points that they were supposed to discuss is still things like the weights.\n\n0:07:38\tSPEAKER_06\n Oh, this is a conference call for Aurora participants, sort of thing. I see.\n\n0:07:44\tSPEAKER_06\n Do you know who was... since we weren't in on it, do you know who was in from OGI?\n\n0:07:49\tSPEAKER_06\n Was he involved or was it Sunil?\n\n0:07:52\tSPEAKER_06\n Yeah, right.\n\n0:07:53\tSPEAKER_03\n Oh, you don't know.\n\n0:07:54\tSPEAKER_03\n Okay.\n\n0:07:55\tSPEAKER_02\n All right.\n\n0:07:58\tSPEAKER_02\n Yeah.\n\n0:07:59\tSPEAKER_02\n So the points where the weights...\n\n0:08:01\tSPEAKER_02\n Oh, to weight, the different error rates that are obtained from different languages and conditions.\n\n0:08:09\tSPEAKER_02\n It's not clear that they will keep the same kind of weighting. Right now it's a weighting on improvements.\n\n0:08:16\tSPEAKER_02\n Some people are giving that it would be better to have weights on...\n\n0:08:21\tSPEAKER_02\n Well, to combine error rates before computing improvement.\n\n0:08:25\tSPEAKER_02\n And the fact is that right now for the English, they have weights... they combine error rates.\n\n0:08:33\tSPEAKER_02\n And the other language is they combine improvements. It's not the very consistent.\n\n0:08:40\tSPEAKER_02\n Yeah.\n\n0:08:41\tSPEAKER_02\n And so, well, this is a point.\n\n0:08:47\tSPEAKER_02\n And right now, actually, there is a thing also that happens with the current weight.\n\n0:08:52\tSPEAKER_02\n It's that very non-significant improvement on the well-matched case, resulting in huge differences in the final number.\n\n0:09:02\tSPEAKER_02\n So, perhaps they will change the weights to...\n\n0:09:09\tSPEAKER_07\n How should that be done?\n\n0:09:11\tSPEAKER_07\n I mean, it seems like there's a simple way...\n\n0:09:16\tSPEAKER_07\n This seems like an obvious mistake or something.\n\n0:09:18\tSPEAKER_06\n Well, I mean, the fact that it's inconsistent is an obvious mistake.\n\n0:09:21\tSPEAKER_06\n But the other thing... I don't know, I haven't thought of through, but one would think that each...\n\n0:09:27\tSPEAKER_06\n It's like, if you say, what's the best way to do an average, an arithmetic average or geometric average?\n\n0:09:33\tSPEAKER_06\n It depends what you want to show.\n\n0:09:35\tSPEAKER_06\n Each one is going to have a different characteristic.\n\n0:09:38\tSPEAKER_07\n So...\n\n0:09:39\tSPEAKER_07\n It seems like they should do like the percentage improvement or something, rather than the absolute improvement.\n\n0:09:45\tSPEAKER_07\n Well, they are doing that.\n\n0:09:47\tSPEAKER_06\n No, it is relative.\n\n0:09:49\tSPEAKER_06\n But the question is, do you average the relative improvements or do you average the error rates and take the relative improvement of that?\n\n0:09:56\tSPEAKER_06\n And the thing is, it's not just a period average because of these ratings.\n\n0:10:01\tSPEAKER_06\n It's a weighted average.\n\n0:10:03\tSPEAKER_02\n Yeah, and so, when you average the relative improvement, it tends to give a lot of importance to the when-match case, because the baseline is already very good.\n\n0:10:17\tSPEAKER_07\n Why don't they not look at improvements, but just look at your scores.\n\n0:10:21\tSPEAKER_07\n Figure out how to combine the scores with a weight or whatever, and then give you a score.\n\n0:10:26\tSPEAKER_07\n Here's your score.\n\n0:10:27\tSPEAKER_07\n And then they can do the same thing for the baseline system. Here's its score.\n\n0:10:29\tSPEAKER_07\n And then you can look at...\n\n0:10:30\tSPEAKER_06\n Well, that's what you're seeing as one of the things they could do.\n\n0:10:33\tSPEAKER_06\n Just when you get all done, I think that they...\n\n0:10:36\tSPEAKER_06\n I was in there, but I think they started off this process with an ocean that you should be significantly better than the previous standard.\n\n0:10:44\tSPEAKER_06\n And so they said, how much is significantly better and so they said, well, you should have half the errors or something that you had before.\n\n0:10:54\tSPEAKER_06\n So it's...\n\n0:10:57\tSPEAKER_06\n But it does seem like...\n\n0:10:59\tSPEAKER_06\n It does seem like it's more logical to combine them first and then do the...\n\n0:11:03\tSPEAKER_02\n Combining error rates?\n\n0:11:04\tSPEAKER_02\n Yeah.\n\n0:11:05\tSPEAKER_02\n Yeah.\n\n0:11:06\tSPEAKER_02\n Well, but there is still this problem of ways.\n\n0:11:10\tSPEAKER_02\n When you combine error rates, it tends to give more importance to the difficult cases.\n\n0:11:15\tSPEAKER_02\n And some people think that they have different opinions about this.\n\n0:11:21\tSPEAKER_02\n The people think that it's more important to look at 12-10% relative improvement on well-matched cases than 12-50% on the mismatched.\n\n0:11:31\tSPEAKER_02\n And other people think that it's more important to improve a lot on the mismatch.\n\n0:11:36\tSPEAKER_07\n It sounds like they don't really have a good idea about what the final application is going to be.\n\n0:11:41\tSPEAKER_06\n Well, you know, the thing is that if you look at the numbers on the more difficult cases, if you really believe that was going to be the predominant use, none of this would be good enough.\n\n0:11:56\tSPEAKER_06\n Nothing anybody...\n\n0:11:57\tSPEAKER_06\n Whereas you sort of, with some reasonable error recovery, could imagine in the better cases these systems working.\n\n0:12:05\tSPEAKER_06\n So, I think the hope would be that it would work well for the good cases and it would have reasonable soft degradation as you got to worse and worse conditions.\n\n0:12:20\tSPEAKER_07\n Yeah.\n\n0:12:21\tSPEAKER_07\n I guess what I'm...\n\n0:12:23\tSPEAKER_07\n I mean, I was thinking about it in terms of if I were building the final product and I was going to test to see which front end I wanted to use.\n\n0:12:30\tSPEAKER_07\n Try to wait things depending on the exact environment that I was going to be using the system in if I...\n\n0:12:36\tSPEAKER_06\n But no, no, no. I mean, this isn't the operating theater.\n\n0:12:39\tSPEAKER_06\n I mean, they don't really know, I think.\n\n0:12:43\tSPEAKER_07\n So, if they don't know, doesn't that suggest a way for them to go?\n\n0:12:50\tSPEAKER_07\n You assume everything's equal. I mean, you...\n\n0:12:52\tSPEAKER_06\n Well, I think one thing to do is to just not rely on a single number to maybe have three numbers.\n\n0:13:00\tSPEAKER_06\n And say, here's how much you improve the relatively clean case.\n\n0:13:06\tSPEAKER_06\n And here's a real match case and here's how much you...\n\n0:13:11\tSPEAKER_07\n So, not try to combine them.\n\n0:13:13\tSPEAKER_06\n Yeah, actually it's true. I've forgotten this.\n\n0:13:15\tSPEAKER_06\n But, well matched, it's not actually clean. What it is is just that...\n\n0:13:22\tSPEAKER_06\n The training and testing are similar.\n\n0:13:24\tSPEAKER_06\n So, I guess what you would do in practice is you try to get as many examples of similar sort of stuff as you could.\n\n0:13:31\tSPEAKER_06\n And then...\n\n0:13:32\tSPEAKER_06\n So, the argument for that being the more important thing is that you're going to try and do that.\n\n0:13:38\tSPEAKER_06\n But you want to see how badly it deviates from that when the...\n\n0:13:42\tSPEAKER_07\n So...\n\n0:13:45\tSPEAKER_07\n So, you should wait those other conditions very, you know, really small.\n\n0:13:48\tSPEAKER_07\n But, no, that's more of an information kind of thing.\n\n0:13:51\tSPEAKER_06\n That's an argument for it. Let me give you the opposite argument.\n\n0:13:54\tSPEAKER_06\n The opposite argument is you're never really going to have a good sample of all these different things.\n\n0:13:58\tSPEAKER_06\n Meaning, are you going to have examples with Windows open, half open, full open, going 70, 60, 50, 40 miles an hour on what kind of roads, with what passing you, with...\n\n0:14:09\tSPEAKER_06\n I think that you could make the opposite argument that the well-matched case is a fantasy.\n\n0:14:15\tSPEAKER_06\n So, I think the thing is that if you look at the well-matched case versus the medium and the mismatched case, we're seeing really, really big differences in performance, right?\n\n0:14:29\tSPEAKER_06\n And you wouldn't like that to be the case.\n\n0:14:33\tSPEAKER_06\n You wouldn't like this. As soon as you step outside, you know, a lot of the cases...\n\n0:14:36\tSPEAKER_07\n A lot of the cases... A little teach him to roll their window up.\n\n0:14:39\tSPEAKER_06\n I mean, these cases, if you go from the... I mean, remember the numbers right off, but if you go from the well-matched case to the medium, it's not an enormous difference in the training testing situation.\n\n0:14:55\tSPEAKER_06\n And it's a really big performance drop.\n\n0:14:59\tSPEAKER_06\n So, yeah, I mean, the reference one, for instance, this is back old on Italian, was like 6% of the error for the well-matched and 18% for the medium matched and 60% for the...\n\n0:15:14\tSPEAKER_06\n for how they mismatched.\n\n0:15:17\tSPEAKER_06\n And, you know, these other systems, we helped it out quite a bit, but still there's something like a factor or two or something between well-matched and medium matched.\n\n0:15:26\tSPEAKER_06\n And so, I think that if what you're... if the goal of this is to come up with robust features, it does mean...\n\n0:15:33\tSPEAKER_06\n so you could argue, in fact, that the well-matched is something you shouldn't be looking at at all.\n\n0:15:38\tSPEAKER_06\n That the goal is to come up with features that will still give you reasonable performance.\n\n0:15:45\tSPEAKER_06\n You know, it's again, gentle degradation, even though the testing condition is not the same as the training.\n\n0:15:53\tSPEAKER_06\n So, you know, I could argue strongly that something like the medium mismatch, which is, you know, not pathological, but...\n\n0:16:00\tSPEAKER_06\n What was the medium mismatch condition again?\n\n0:16:04\tSPEAKER_02\n Yeah, medium mismatch is everything with the far microphone, but trained on low-noisy condition, low speed and stop-car, and tested on high-speed conditions.\n\n0:16:21\tSPEAKER_06\n Right, so it's still the same microphone in both cases, but there's a mismatch between the car conditions.\n\n0:16:31\tSPEAKER_06\n And that's... you could argue that's a pretty realistic situation, and I'd almost argue for waiting that highest, but the way they have it now, I guess it's... they compute the relative improvement first and then average that with a waiting.\n\n0:16:46\tSPEAKER_06\n And so then that makes the highly matched, the really big thing.\n\n0:16:53\tSPEAKER_06\n So, since they have these three categories, it seems like the reasonable thing to do is to go across the languages and to come up with an improvement for each of those.\n\n0:17:04\tSPEAKER_06\n And say, okay, in the highly matched case, this is what happens, in the... the... so the medium, if this happens, in the highly mismatched, that happens.\n\n0:17:16\tSPEAKER_06\n And you should see a gentle degradation through that.\n\n0:17:25\tSPEAKER_06\n But I think that... I gather that in these meetings, it's really tricky to make anything... can he policy change?\n\n0:17:38\tSPEAKER_06\n Because everybody has their own opinion.\n\n0:17:43\tSPEAKER_04\n Yeah.\n\n0:17:46\tSPEAKER_02\n So, yeah. But there is probably a big change that we made is that the baseline, they want to have a new baseline, perhaps, which is the MFCC, but with voice activity detector.\n\n0:18:03\tSPEAKER_02\n And apparently, some people are pushing to still keep this 50% number, so they want to have at least 50% improvement on the baseline, but it should be a much better baseline.\n\n0:18:21\tSPEAKER_02\n And if we look at the result that's summing the sound, just putting the VAD in the baseline improves like more than 20%, which would mean that 50% on this new baseline is like more than 60% improvement.\n\n0:18:37\tSPEAKER_06\n So, nobody would be there, probably, right?\n\n0:18:40\tSPEAKER_02\n Right, nobody would be there.\n\n0:18:42\tSPEAKER_06\n Good. What to do.\n\n0:18:46\tSPEAKER_06\n So, who's VAD? Is this...\n\n0:18:51\tSPEAKER_02\n They didn't decide yet. I guess this was one point of the conference.\n\n0:18:56\tSPEAKER_02\n But...\n\n0:19:00\tSPEAKER_02\n Yeah.\n\n0:19:04\tSPEAKER_06\n I think that would be good. I mean, it's not that the design of the VAD isn't important, but it does seem to be a lot of work to do a good job on that, as well as being a lot of work to do a good job on the feature design.\n\n0:19:22\tSPEAKER_06\n So, if we can cut down on that, maybe we can make some progress.\n\n0:19:28\tSPEAKER_02\n But I guess, perhaps...\n\n0:19:35\tSPEAKER_02\n Yeah. So, one told that perhaps it's not fair to do that because to make a good VAD, you don't have enough to do the business features.\n\n0:19:53\tSPEAKER_02\n So, you really need to put more in the different things.\n\n0:20:00\tSPEAKER_06\n Yeah.\n\n0:20:05\tSPEAKER_07\n Sure. But I'm confused. What do you mean?\n\n0:20:10\tSPEAKER_06\n Yeah. But, let's say, MFCC, for instance, doesn't have anything related to the pitch. So, just for example. So, suppose you've got what you really want to do is put a good pitch detector on there, and if it gets a non-imbeguous...\n\n0:20:25\tSPEAKER_06\n Oh, I see.\n\n0:20:26\tSPEAKER_06\n...if it gets a non-imbeguous result, then you definitely in a region with speech.\n\n0:20:31\tSPEAKER_07\n So, there's this assumption that the voice activity detector can only use the MFCC?\n\n0:20:36\tSPEAKER_02\n That's not clear, but...\n\n0:20:38\tSPEAKER_06\n Well, for the baseline.\n\n0:20:40\tSPEAKER_06\n Yeah. So, if you use other features, then it's just a question of what is your baseline?\n\n0:20:45\tSPEAKER_06\n What is it that you're supposed to do better than? And so, having the baseline be the MFCCs means that people could choose to pour their effort into trying to do really good VAD.\n\n0:20:56\tSPEAKER_06\n But they seem like two separate issues, right?\n\n0:20:59\tSPEAKER_06\n I mean, there's sort of separate. Unfortunately, there's coupling between them, which is part of what I think Stefan is getting to is that you can choose your features in such a way as to improve the VAD.\n\n0:21:07\tSPEAKER_06\n And you also can choose your features in such a way as to improve recognition.\n\n0:21:11\tSPEAKER_06\n But you should do both, right?\n\n0:21:13\tSPEAKER_06\n You should do both. And I think that this still makes...\n\n0:21:16\tSPEAKER_06\n I still think this makes sense as a baseline.\n\n0:21:18\tSPEAKER_06\n It's just saying, as a baseline, we know that we had the MFCCs before, lots of people have done voice activity detectors.\n\n0:21:25\tSPEAKER_06\n You might as well pick some voice activity detector and make that the baseline, just like you picked some version of HDK and made that the baseline.\n\n0:21:32\tSPEAKER_06\n And then let's try to make everything better. And if one of the ways you make it better is by having your features be better features for the VAD than that's so be it.\n\n0:21:44\tSPEAKER_06\n But at least you have a starting point that's...\n\n0:21:48\tSPEAKER_06\n Because some of the people didn't have a VAD at all, I guess, right? And then they look pretty bad.\n\n0:21:55\tSPEAKER_06\n And in fact, what they were doing wasn't so bad at all.\n\n0:21:58\tSPEAKER_07\n Yeah, it seems like you should try to make your baseline as good as possible.\n\n0:22:02\tSPEAKER_07\n And if it turns out that you can't improve on that, well, I mean, nobody wins and you just use MFCC, right?\n\n0:22:09\tSPEAKER_06\n Yeah, I mean, it seems like...\n\n0:22:12\tSPEAKER_06\n It should include sort of the current state of the art that you want to try and improve.\n\n0:22:18\tSPEAKER_06\n And MFCCs, or PLP or something, it seems like a reasonable baseline for the features.\n\n0:22:24\tSPEAKER_06\n And anybody doing this task is going to have some sort of voice activity detection at some level.\n\n0:22:29\tSPEAKER_06\n Some way they might use the whole recognizer to do it, rather than a separate thing.\n\n0:22:34\tSPEAKER_06\n But they'll have it on some level.\n\n0:22:38\tSPEAKER_07\n Seems like whatever they choose, they shouldn't purposefully brain damage a part of the system to make a worse baseline.\n\n0:22:47\tSPEAKER_06\n Well, I think people just... it wasn't that they purposefully brain damage, I think people hadn't really thought through about the VAD issue.\n\n0:22:56\tSPEAKER_06\n And then when the proposals actually came in, half of them had VADs and half of them didn't.\n\n0:23:02\tSPEAKER_06\n And half the did did well and half the didn't did poorly so.\n\n0:23:07\tSPEAKER_02\n Yeah, I'm sorry, we see what happened with this.\n\n0:23:14\tSPEAKER_02\n Yeah, so what happened since last week is quite from BOTGID's experiments on VAD on the baseline.\n\n0:23:30\tSPEAKER_02\n And these experiments also are using some kind of noise compensation, so spectra-suppraction.\n\n0:23:40\tSPEAKER_02\n And putting on nine normalization just after this.\n\n0:23:45\tSPEAKER_02\n So having spectra-suppraction, LDA filtering and on nine normalization.\n\n0:23:49\tSPEAKER_02\n So which is similar to the proposal one, but with spectra-suppraction in addition.\n\n0:23:56\tSPEAKER_02\n And it seems that on nine normalization doesn't help further when you have spectra-suppraction.\n\n0:24:04\tSPEAKER_07\n Is this related to the issue that you brought up a couple of meetings ago with the musical tones?\n\n0:24:10\tSPEAKER_02\n I have no idea because the issue I brought up was with a very simple spectra-suppraction approach.\n\n0:24:17\tSPEAKER_02\n The one that they use at OGI is one from the proposed or a proposal, which might be much better.\n\n0:24:28\tSPEAKER_02\n So yeah, I asked Sunil for more information about that, but I don't know yet.\n\n0:24:39\tSPEAKER_02\n And what's happened here is that we have this kind of new reference system which use a nice clean-down sampling of sampling, which uses a new filter that's much shorter, and which also gets the frequency bit of 64 hours, which was not done for the proposal.\n\n0:25:02\tSPEAKER_02\n When we say we have that, Sunil, have it now too or? No. No. Okay. Because we're still testing. So we have the result for just the features.\n\n0:25:13\tSPEAKER_02\n We are currently testing with putting the neural network into Kerti.\n\n0:25:20\tSPEAKER_02\n It seems to improve on the well-matched case, but it's a little bit worse on the mismatched, highly mismatched.\n\n0:25:31\tSPEAKER_02\n I mean, when we put the neural network, and with the current weight thing, I think it would be better because the one-matched case is better.\n\n0:25:41\tSPEAKER_05\n But how much worse since the weighting might change? How much worse is it on the other conditions when you say it's a little worse?\n\n0:25:48\tSPEAKER_02\n It's like... 10% relative.\n\n0:25:57\tSPEAKER_06\n Okay. But it has the latency is much shorter.\n\n0:26:09\tSPEAKER_02\n When I say it's worse, it's not... I compare proposal 2 to proposal 1.\n\n0:26:15\tSPEAKER_02\n Putting neural network compared to not having any neural network. This new system is better because as this 64 hours cutoff, clean, don't sampling, and what else? Yeah, good VAD.\n\n0:26:42\tSPEAKER_05\n But the latency... but you've got latency shorter now. Yeah. So it's better than the system that we had before.\n\n0:26:53\tSPEAKER_02\n Yeah, mainly because of the 64 hours and the good VAD.\n\n0:27:04\tSPEAKER_02\n And then I took this system and we put the old filters also. So we have this good system with good VAD, with the short filter and with the long filter.\n\n0:27:16\tSPEAKER_02\n And with the short filter it's not worse. So why is it?\n\n0:27:24\tSPEAKER_06\n Okay, so that's all fine. But what you're saying is that when you do these... let me try to understand. When you do these same improvements to proposal 1, that on the things are somewhat better in proposal 2 for the well-matched case and somewhat worse for the other two cases.\n\n0:27:46\tSPEAKER_06\n So now that these other things are in there, is it the case maybe that the additions of proposal 2 over proposal 1 are less important?\n\n0:28:00\tSPEAKER_02\n Yeah, probably.\n\n0:28:01\tSPEAKER_02\n Okay. So yeah, but it's a good thing anyway to have shorter delay. Then we try to do something like proposal 2, but using also have the G features.\n\n0:28:21\tSPEAKER_02\n So there is this G L T part which is just standard features and then junior 2 neural networks.\n\n0:28:32\tSPEAKER_02\n And it doesn't seem to help. However, we just have one result which is the Italian mismatch.\n\n0:28:41\tSPEAKER_05\n Okay. There was a start of some effort and something related to voicing or something.\n\n0:28:55\tSPEAKER_02\n Yeah. So basically we try to find good features that will be useful voicing detection.\n\n0:29:05\tSPEAKER_02\n But it's still on the... basically we're still paying with my laptop.\n\n0:29:15\tSPEAKER_07\n What sorts of features are you looking at?\n\n0:29:19\tSPEAKER_02\n So we would be looking at the variance of the spectrum of the excitation, something like this, which is really I have a voiced sound.\n\n0:29:32\tSPEAKER_07\n What does that mean? The variance of the spectrum of excitation?\n\n0:29:38\tSPEAKER_02\n Yeah. So basically the spectrum of excitation.\n\n0:29:45\tSPEAKER_06\n Okay. What you're calling the excitation is that recall is you're subtracting the male filter spectrum from the FFT spectrum.\n\n0:29:59\tSPEAKER_02\n So we have the male filter bank, we have the FFT.\n\n0:30:03\tSPEAKER_06\n So it's not really an excitation, but it's something that hopefully tells you something about the excitation.\n\n0:30:08\tSPEAKER_02\n Yeah, that's right.\n\n0:30:11\tSPEAKER_01\n Yeah.\n\n0:30:13\tSPEAKER_01\n There's some histograms.\n\n0:30:16\tSPEAKER_01\n Yeah, that's...\n\n0:30:18\tSPEAKER_02\n Yeah, so for a voiced portion we have something that has a mean around 0.3 and for a voiced portion the mean is 0.59.\n\n0:30:31\tSPEAKER_02\n But the variance seems quite...\n\n0:30:34\tSPEAKER_07\n How do you know... how did you get your voiced and unvoiced truth data?\n\n0:30:39\tSPEAKER_02\n We used a timet and we used the cannon guns between the phones and...\n\n0:30:48\tSPEAKER_01\n But if we look at one send, apparently it's good.\n\n0:30:54\tSPEAKER_02\n Yeah, but yeah.\n\n0:30:58\tSPEAKER_02\n So it's noisy timet, that's right.\n\n0:31:04\tSPEAKER_02\n It seems quite robust to know, so when we take mid-row, this parameter across time for the same values and that's very close.\n\n0:31:15\tSPEAKER_02\n Yes, so there is this, there will be also the...\n\n0:31:21\tSPEAKER_02\n Something like the maximum of the other relation functions.\n\n0:31:25\tSPEAKER_07\n Is this a trained system or is it a system where you just pick some thresholds?\n\n0:31:30\tSPEAKER_02\n How does it work?\n\n0:31:34\tSPEAKER_02\n Right now we're just trying to find some features.\n\n0:31:38\tSPEAKER_02\n Hopefully I think what we want to have is to put these features in kind of...\n\n0:31:45\tSPEAKER_02\n Well, to obtain a statistical model of these features, just to use an neural network.\n\n0:31:52\tSPEAKER_02\n Hopefully these features would help.\n\n0:31:55\tSPEAKER_07\n Because it seems like what you said about the mean of the voiced and the unvoiced, that seemed pretty encouraging.\n\n0:32:02\tSPEAKER_06\n Well, yes, except the variance was big.\n\n0:32:04\tSPEAKER_07\n Well, I don't know that I would trust that so much because you're doing these canonical mappings from timet lablings, right?\n\n0:32:09\tSPEAKER_07\n So really that's sort of a cartoon picture about what's voiced and unvoiced.\n\n0:32:14\tSPEAKER_07\n So that could be giving you a lot of variance.\n\n0:32:18\tSPEAKER_07\n It may be that you're finding something good and that the variance is sort of artificial because of how you're getting your truth.\n\n0:32:25\tSPEAKER_06\n Yeah, but another way of looking at it might be that, I mean, we are coming up with feature sets after all.\n\n0:32:31\tSPEAKER_06\n So another way of looking at it is that the melkepster, melke spectrum, melkepster, any of these variants, give you this smooth spectrum.\n\n0:32:41\tSPEAKER_06\n It's a spectral envelope.\n\n0:32:43\tSPEAKER_06\n By going back to the FFT, you're getting something that is more like the raw data.\n\n0:32:50\tSPEAKER_06\n So the question is, what characterization, and you're playing around with this, another way of looking at it, is what characterization of the difference between the raw data and the smooth version is something that you're missing that could help.\n\n0:33:06\tSPEAKER_06\n So I mean, looking at different statistical measures of that difference, coming up with some things and just trying them out and seeing if you add them onto the feature vector, is that make things better or worse in noise.\n\n0:33:17\tSPEAKER_06\n Where you really just, the way I'm looking at it is not so much you're trying to find the best world's best voiced unvoiced classifier, but it's more that, you know, try some different statistical characteristics of that difference back to the raw data.\n\n0:33:30\tSPEAKER_06\n Right.\n\n0:33:31\tSPEAKER_06\n And maybe there's something there that the system can use.\n\n0:33:34\tSPEAKER_02\n Yeah, but the more of use is that, the more of use is that, well, using the FFT, you just give you just information about if it's voiced or not voiced mainly.\n\n0:33:51\tSPEAKER_02\n Yeah.\n\n0:33:53\tSPEAKER_02\n This is why we started to look.\n\n0:33:56\tSPEAKER_06\n Well, that's the way what I'm arguing is that, yeah, I mean, what I'm arguing is that that that's gives you your intuition.\n\n0:34:04\tSPEAKER_06\n But in reality, it's, you know, there's all this, this overlap and so forth.\n\n0:34:09\tSPEAKER_06\n And, but what I'm saying is that maybe okay, because what you're really getting is not actually voiced or sound voiced, both for the fact the reason of the overlap and then, you know, structural reasons like the one the Chuck said, that in fact, well, the data itself is, that you're working with is not perfect.\n\n0:34:27\tSPEAKER_06\n So, I'm saying is maybe that's not a killer because you're just getting some characterization, one that's driven by your intuition about voiced and voiced certainly, but just some characterization of something back in the, in the, in the almost raw data rather than the smooth version.\n\n0:34:44\tSPEAKER_06\n Your intuition is driving you towards particular kinds of statistical characterizations of what's missing from the spectra envelope.\n\n0:34:56\tSPEAKER_06\n Obviously, something about the excitation.\n\n0:35:00\tSPEAKER_06\n And what is it about the excitation?\n\n0:35:02\tSPEAKER_06\n And, you know, and you're not getting the excitation anyway, you know, so, so I would almost take especially if these trainings and so forth or faster, but almost just take a scatter shot.\n\n0:35:13\tSPEAKER_06\n A scatter shot at a few different ways of look of characterizing that difference and you have one of them, but, and see, you know, which of them helps?\n\n0:35:22\tSPEAKER_07\n So, is the idea that you're going to take whatever features you develop and just add them on to the feature vector? Or what's the use of the voice, unvoiced detector?\n\n0:35:33\tSPEAKER_02\n I guess we don't know exactly yet, but, yeah. It's not part of a VAD system that you're doing?\n\n0:35:45\tSPEAKER_02\n Oh, okay.\n\n0:35:47\tSPEAKER_02\n Yeah, it could be, it could be a neural network that does voice and voice detection, so the big neural networks that does, on the specification.\n\n0:36:07\tSPEAKER_06\n But each one of the mixture components, I mean, you have variants only, so it's kind of like you're just multiplying together these, probably some individual features within each mixture.\n\n0:36:22\tSPEAKER_06\n So it's so...\n\n0:36:25\tSPEAKER_07\n I think it's an 8 thing. It seems like a good idea.\n\n0:36:28\tSPEAKER_06\n Yeah.\n\n0:36:30\tSPEAKER_06\n Yeah, I mean, I know that people doing some robustness things are always back, we're just doing, just being gross, just throwing in the FFT and actually it wasn't so bad.\n\n0:36:49\tSPEAKER_06\n So, and you know that it's got to hurt you a little bit to not have a smooth spectral envelope, so there must be something else that you get in return for that.\n\n0:37:03\tSPEAKER_07\n So, how does, maybe I'm going into much detail, but how exactly do you make the difference between the FFT and the smooth spectral envelope?\n\n0:37:13\tSPEAKER_07\n Well, yeah, how is that?\n\n0:37:19\tSPEAKER_02\n We just...\n\n0:37:22\tSPEAKER_01\n We have the 23 coefficient of after the FFT and we understand this coefficient between the other frequency range and the interpolation between the point is given for the triangular filter, the value of the triangular filter.\n\n0:37:46\tSPEAKER_01\n And these weight we obtained is mod.\n\n0:37:50\tSPEAKER_06\n So, you essentially take the values that you get in the triangular filter and extend them, just sort of like a rectangle.\n\n0:37:57\tSPEAKER_06\n That's at that value.\n\n0:38:00\tSPEAKER_02\n So, yeah, we have one point for one energy for a filter bank, which is the energy that's centroid on the surface.\n\n0:38:08\tSPEAKER_07\n So, you end up with a vector that's the same length as the FFT vector, and then you just compute differences and sum the differences.\n\n0:38:19\tSPEAKER_02\n And I think the variance is computed only from like 200 hertz to 1500, because...\n\n0:38:31\tSPEAKER_02\n Right.\n\n0:38:32\tSPEAKER_02\n...1500, because yeah.\n\n0:38:34\tSPEAKER_02\n...20000.\n\n0:38:35\tSPEAKER_02\n Above seems that some voices on can add also like noisy part on the African.\n\n0:38:47\tSPEAKER_06\n Yeah, but no, it's being sensed to look at.\n\n0:38:49\tSPEAKER_06\n So, this is...\n\n0:38:50\tSPEAKER_07\n...basically.\n\n0:38:51\tSPEAKER_07\n Basically, this is comparing an original version of a signal to a smoothed version of the same signal.\n\n0:38:56\tSPEAKER_06\n Right. So, this is...\n\n0:38:58\tSPEAKER_06\n I mean, you could argue about whether it should be linear interpolation or zero-thord or...\n\n0:39:03\tSPEAKER_06\n...anyway, something like this is what you're feeding your recognizer, typically.\n\n0:39:08\tSPEAKER_06\n Like which...\n\n0:39:09\tSPEAKER_06\n No, so the male capstream is the...\n\n0:39:12\tSPEAKER_06\n...capstream of this spectrum, or the long spectrum, whatever.\n\n0:39:17\tSPEAKER_06\n You're subtracting in...\n\n0:39:19\tSPEAKER_06\n...power domain or log domain.\n\n0:39:21\tSPEAKER_06\n Okay, so it's sort of like division.\n\n0:39:23\tSPEAKER_06\n You do that, you have this vector.\n\n0:39:25\tSPEAKER_06\n So, ratio?\n\n0:39:26\tSPEAKER_06\n Yeah.\n\n0:39:28\tSPEAKER_06\n But anyway...\n\n0:39:31\tSPEAKER_07\n...and that's...\n\n0:39:32\tSPEAKER_07\n So, what's the intuition behind this kind of a thing?\n\n0:39:35\tSPEAKER_07\n I don't really know the signal processing well enough to understand what...\n\n0:39:38\tSPEAKER_07\n...what is that doing?\n\n0:39:40\tSPEAKER_02\n Yeah, like the sub-exam.\n\n0:39:42\tSPEAKER_02\n What we would like to have is some spectrum of the excitation signal, which is for a very strong, ideally, a full strain.\n\n0:39:52\tSPEAKER_02\n And for a voiced, it's something that's more flat.\n\n0:39:56\tSPEAKER_02\n Right.\n\n0:39:57\tSPEAKER_02\n And the way to do this is that, well, we have the FFT because it's computing the system.\n\n0:40:03\tSPEAKER_02\n And we have the male filter bands.\n\n0:40:06\tSPEAKER_02\n And so, if we like remove the male filter band from the FFT, we have something that's close to the excitation signal.\n\n0:40:18\tSPEAKER_02\n Okay.\n\n0:40:19\tSPEAKER_02\n Something that's like a train of both strain, a voiced sound, and that's...\n\n0:40:24\tSPEAKER_02\n I see.\n\n0:40:26\tSPEAKER_07\n So, do you have a picture that...\n\n0:40:27\tSPEAKER_07\n...is this for a voiced segment, this picture?\n\n0:40:29\tSPEAKER_07\n Yeah.\n\n0:40:30\tSPEAKER_07\n What does it look like for unvoiced?\n\n0:40:32\tSPEAKER_01\n No, I'm voicing over.\n\n0:40:34\tSPEAKER_01\n Oh, thanks.\n\n0:40:36\tSPEAKER_01\n So, you know...\n\n0:40:38\tSPEAKER_02\n This is the...\n\n0:40:40\tSPEAKER_01\n This is another voiced accent.\n\n0:40:42\tSPEAKER_01\n You know, is this part between the frequency that we are considered for the situation, for the difference, and this is the difference.\n\n0:40:48\tSPEAKER_07\n This is the difference, okay?\n\n0:40:50\tSPEAKER_02\n Yeah, because we begin in 15.\n\n0:40:56\tSPEAKER_07\n So...\n\n0:40:58\tSPEAKER_07\n Does the periodicity of this signal say something about the pitch?\n\n0:41:03\tSPEAKER_07\n The pitch?\n\n0:41:04\tSPEAKER_07\n Yeah.\n\n0:41:05\tSPEAKER_06\n That's like fundamental frequency.\n\n0:41:06\tSPEAKER_06\n So, I mean...\n\n0:41:07\tSPEAKER_06\n Day-on-see.\n\n0:41:08\tSPEAKER_06\n I mean, to first order, what you're doing, you can ignore all the details and all the ways which is these are complete lies, that what you're doing in future extraction for speech recognition is you have, in your head, a simplified production model for speech, in which you have a periodic, a great periodic source of strivings and filters.\n\n0:41:31\tSPEAKER_06\n First order for speech recognition, you say, I don't care about the source, right?\n\n0:41:35\tSPEAKER_06\n So, you just want to find out what the filters are.\n\n0:41:37\tSPEAKER_06\n The filters, roughly act like an overall resonances and so forth, that's prositing the excitation.\n\n0:41:47\tSPEAKER_06\n So, if you look at the spectral envelope, just the very smooth properties of it, you get something closer to that.\n\n0:41:53\tSPEAKER_06\n And the notion is, if you have the full spectrum of all the little minigritty details, that that has the effect of both, and it would be a multiplication in frequency domain, so that would be like an addition in log, a spectrum domain.\n\n0:42:08\tSPEAKER_06\n And so, this is saying, well, if you really do have that, so a vocal tract envelope, and you subtract that off, what you get is the excitation.\n\n0:42:16\tSPEAKER_06\n I call that lies because you don't really have that.\n\n0:42:18\tSPEAKER_06\n You just have some kind of signal processing trickery to get something that's kind of smooth.\n\n0:42:23\tSPEAKER_06\n It's not really what's happening in the vocal tract.\n\n0:42:25\tSPEAKER_06\n So, you're really getting the vocal excitation.\n\n0:42:27\tSPEAKER_06\n That's why I was referring to it in a more conservative way when I was saying, well, it's the excitation.\n\n0:42:36\tSPEAKER_06\n It's not really the excitation.\n\n0:42:38\tSPEAKER_06\n It's whatever it is that's different between...\n\n0:42:40\tSPEAKER_06\n So, standing back from that, you sort of say there is this very detailed representation.\n\n0:42:44\tSPEAKER_06\n You go to a smooth representation.\n\n0:42:46\tSPEAKER_06\n You go to a smooth representation because it typically generalizes better.\n\n0:42:50\tSPEAKER_06\n But, whenever you smooth, you lose something.\n\n0:42:53\tSPEAKER_06\n So, the question is, have you lost something you can use?\n\n0:42:56\tSPEAKER_06\n Probably you wouldn't want to go to the extreme of just saying, okay, our features that will be the FFT.\n\n0:43:01\tSPEAKER_06\n Because we really think we do gain something in robustness from going to something smoother.\n\n0:43:05\tSPEAKER_06\n But maybe there's something that we missed.\n\n0:43:07\tSPEAKER_06\n So, what is it?\n\n0:43:08\tSPEAKER_06\n And then you go back to the intuition that, well, you don't really get the excitation, but you get something related to it.\n\n0:43:13\tSPEAKER_06\n And as you can see from those pictures, you do get something that shows some periodicity in frequency.\n\n0:43:19\tSPEAKER_06\n And sometimes.\n\n0:43:21\tSPEAKER_06\n That's really nice.\n\n0:43:23\tSPEAKER_07\n So, you don't have one for unvoiced picture?\n\n0:43:26\tSPEAKER_01\n No, I don't think so.\n\n0:43:28\tSPEAKER_06\n But presumably you'll see something that won't have this kind of regularity and frequency.\n\n0:43:36\tSPEAKER_07\n I would like to see those pictures.\n\n0:43:39\tSPEAKER_07\n Yeah.\n\n0:43:40\tSPEAKER_06\n Yeah.\n\n0:43:45\tSPEAKER_07\n And so, you said this is pretty doing this kind of thing.\n\n0:43:47\tSPEAKER_07\n It's pretty robust to noise.\n\n0:43:49\tSPEAKER_02\n It seems, yeah.\n\n0:43:51\tSPEAKER_02\n The mean is different.\n\n0:43:53\tSPEAKER_01\n Because the histogram is different.\n\n0:43:57\tSPEAKER_02\n And I know that the kind of robustness to noise, so if you take this frame from the noisy utterance, and the same frame from the king utterance,\n\n0:44:09\tSPEAKER_07\n do you end up with a similar difference over here? Yeah.\n\n0:44:13\tSPEAKER_07\n Okay.\n\n0:44:14\tSPEAKER_01\n Cool.\n\n0:44:15\tSPEAKER_01\n Because here the same frame for the clean speed.\n\n0:44:18\tSPEAKER_01\n Oh, that's clean.\n\n0:44:19\tSPEAKER_01\n Okay.\n\n0:44:20\tSPEAKER_01\n There are differences because here the FFT is only with 256 points.\n\n0:44:26\tSPEAKER_01\n And this is with 512.\n\n0:44:28\tSPEAKER_01\n Okay.\n\n0:44:29\tSPEAKER_02\n This is kind of interesting also because if we use the standard frame length of 25 milliseconds, it happens is that for low pitched voice because of the frame length, you don't really have.\n\n0:44:49\tSPEAKER_02\n You don't clearly see this period of structure because of the first logo for each each of you.\n\n0:44:56\tSPEAKER_07\n So this one include is a longer.\n\n0:44:58\tSPEAKER_02\n It's like 50 milliseconds.\n\n0:45:00\tSPEAKER_02\n 50 minutes.\n\n0:45:01\tSPEAKER_02\n Yeah.\n\n0:45:02\tSPEAKER_02\n But it's the same frame.\n\n0:45:04\tSPEAKER_07\n What's that time frequency trade off thing, right?\n\n0:45:07\tSPEAKER_07\n I see.\n\n0:45:08\tSPEAKER_07\n Sorry.\n\n0:45:09\tSPEAKER_07\n Oh, so is this the difference here?\n\n0:45:13\tSPEAKER_01\n No, this is the same frame.\n\n0:45:16\tSPEAKER_07\n Oh, that's the original.\n\n0:45:19\tSPEAKER_02\n Yeah, so with the short frame basically, the period is not enough to use these kind of neat things.\n\n0:45:25\tSPEAKER_01\n But yeah.\n\n0:45:27\tSPEAKER_02\n Yeah, so probably we'll have to use like long, long frames.\n\n0:45:34\tSPEAKER_07\n Oh, that's interesting.\n\n0:45:36\tSPEAKER_06\n Maybe.\n\n0:45:39\tSPEAKER_06\n Well, I mean, it looks better.\n\n0:45:42\tSPEAKER_06\n But the thing is if you're actually asking if you actually need to do very long and FFT and maybe pushing things.\n\n0:45:53\tSPEAKER_07\n Would you want to do this kind of difference thing after you do spectral subtraction?\n\n0:46:01\tSPEAKER_06\n Maybe.\n\n0:46:13\tSPEAKER_06\n The spectral subtraction is being done at what level is it being done at the level of FFT bins or at the level of a male spectrum or something.\n\n0:46:24\tSPEAKER_02\n I guess it depends.\n\n0:46:26\tSPEAKER_06\n I mean, how are they doing it?\n\n0:46:28\tSPEAKER_02\n I guess Erickson is still doing that.\n\n0:46:35\tSPEAKER_02\n So yeah, I'm not really...\n\n0:46:43\tSPEAKER_06\n So in that case, it might not make much difference at all.\n\n0:46:46\tSPEAKER_07\n It seems like you'd want to do it on the FFT bins.\n\n0:46:49\tSPEAKER_07\n Maybe.\n\n0:46:50\tSPEAKER_07\n I mean, if you were going to edit it for this purpose, that is.\n\n0:46:55\tSPEAKER_05\n Yeah.\n\n0:47:01\tSPEAKER_06\n Okay.\n\n0:47:03\tSPEAKER_06\n What else?\n\n0:47:07\tSPEAKER_02\n So we'll perhaps try to convince the JIP people to use a new FFT.\n\n0:47:22\tSPEAKER_06\n Okay.\n\n0:47:25\tSPEAKER_06\n Has anything happened yet on this business of having some sort of standard...\n\n0:47:30\tSPEAKER_02\n Sorry, sir.\n\n0:47:32\tSPEAKER_02\n Not yet, but I will go down.\n\n0:47:36\tSPEAKER_02\n No, they are.\n\n0:47:37\tSPEAKER_02\n I think they're more time because they're...\n\n0:47:42\tSPEAKER_07\n When is the next Aurora deadline?\n\n0:47:49\tSPEAKER_05\n Early June?\n\n0:47:52\tSPEAKER_05\n Late June?\n\n0:47:53\tSPEAKER_05\n Not early June?\n\n0:47:56\tSPEAKER_06\n Okay.\n\n0:48:02\tSPEAKER_06\n And he's been doing all the talking, but...\n\n0:48:04\tSPEAKER_06\n Yeah.\n\n0:48:05\tSPEAKER_06\n This is by the way a bad thing.\n\n0:48:08\tSPEAKER_06\n We're trying to get female voices in this record as well.\n\n0:48:12\tSPEAKER_06\n Make sure Carmen talks as well.\n\n0:48:16\tSPEAKER_06\n But is he pretty much been talking about what you're doing also?\n\n0:48:20\tSPEAKER_01\n I am doing this.\n\n0:48:22\tSPEAKER_05\n Yes.\n\n0:48:23\tSPEAKER_01\n I don't know.\n\n0:48:25\tSPEAKER_01\n I think that's for the recognition.\n\n0:48:27\tSPEAKER_04\n The meeting record that is better than that can be speaking to you.\n\n0:48:36\tSPEAKER_06\n Well, we'll get to Spanish voices sometime.\n\n0:48:41\tSPEAKER_06\n We do.\n\n0:48:42\tSPEAKER_06\n We want to recognize you too.\n\n0:48:45\tSPEAKER_01\n And the result for the TVG.\n\n0:48:48\tSPEAKER_01\n The video record that we did for each people.\n\n0:48:52\tSPEAKER_06\n No, we like...\n\n0:48:55\tSPEAKER_06\n We're in the...\n\n0:48:57\tSPEAKER_05\n We're in the Lord Hermansky work in the frame of mind.\n\n0:49:00\tSPEAKER_05\n We like higher rates.\n\n0:49:03\tSPEAKER_05\n That way there's lots of work to do.\n\n0:49:06\tSPEAKER_05\n That's...\n\n0:49:09\tSPEAKER_05\n Anything to...\n\n0:49:11\tSPEAKER_08\n Not much is new.\n\n0:49:13\tSPEAKER_08\n I talked about what I'm trying to do last time.\n\n0:49:16\tSPEAKER_08\n I said I was going to use Avandano's method of using a transformation to map from long analysis frames, which I used for removing reverberation to short analysis frames for feature calculation.\n\n0:49:30\tSPEAKER_08\n He has a trick for doing that involving viewing the DFT as a matrix.\n\n0:49:37\tSPEAKER_08\n But I decided not to do that after all because I realized to use that I'd need to have these short analysis frames get plugged directly into the feature computation somehow.\n\n0:49:50\tSPEAKER_08\n And right now I think our feature computation is set up to take audio as input in general.\n\n0:49:57\tSPEAKER_08\n So I decided that I'll do the reverberation removal on the long analysis windows and then just re-sensitize audio and then send that.\n\n0:50:06\tSPEAKER_06\n This is in order to use the SRI system.\n\n0:50:11\tSPEAKER_08\n Or even if I'm using R system I was thinking it might be easier to re-sensitize the audio because then I could just use FeeCalc as it is and I wouldn't have to change the code.\n\n0:50:23\tSPEAKER_06\n Yeah, I mean it's certainly in a short turn.\n\n0:50:29\tSPEAKER_05\n This sounds easier.\n\n0:50:31\tSPEAKER_05\n Yeah, I mean longer term if it turns out to be useful when I want to.\n\n0:50:36\tSPEAKER_06\n Right, that's true.\n\n0:50:39\tSPEAKER_06\n No, you may be putting other kinds of errors in from the recent analysis.\n\n0:50:46\tSPEAKER_08\n Okay, I don't know anything about recent analysis.\n\n0:50:49\tSPEAKER_05\n But I'm not sure if you're likely to think that is.\n\n0:51:02\tSPEAKER_05\n It's a reasonable way to go for an initial thing.\n\n0:51:05\tSPEAKER_05\n We can look at exactly what you end up doing and figure out if there's something that could be heard by the end part of the process.\n\n0:51:14\tSPEAKER_08\n Okay.\n\n0:51:20\tSPEAKER_08\n That's, that's it, that's it.\n\n0:51:24\tSPEAKER_06\n Anything to?\n\n0:51:26\tSPEAKER_00\n Well, I've been continuing reading.\n\n0:51:29\tSPEAKER_00\n I went off on a little tangent this past week looking at Modulations Spectrum stuff and learning a bit about what it is and the importance of it in speech recognition.\n\n0:51:46\tSPEAKER_00\n I found some neat papers, historical papers from Kanadera, Hermanski and Array.\n\n0:51:56\tSPEAKER_00\n And they did a lot of experiments where they take speech and they modify the, they measure the relative importance of having different portions of the Modulation Spectrum intact.\n\n0:52:14\tSPEAKER_00\n And they find that the spectrum between one and 16 hertz in the Modulation is important for speech recognition.\n\n0:52:24\tSPEAKER_06\n Sure, I mean this sort of goes back to earlier stuff by Drillman.\n\n0:52:28\tSPEAKER_06\n And the MSG features were sort of built up this notion.\n\n0:52:32\tSPEAKER_06\n But I guess I thought you had brought this up in the context of targets somehow.\n\n0:52:38\tSPEAKER_06\n Right.\n\n0:52:40\tSPEAKER_06\n But it's not, I mean they're sort of not in the same kind of category as a phonetic target or a syllabic target or a more like a feature or something.\n\n0:52:46\tSPEAKER_00\n I was thinking more like using them as the inputs to the detectors.\n\n0:52:51\tSPEAKER_06\n Oh, I see.\n\n0:52:53\tSPEAKER_06\n Well, that's sort of what MSG does.\n\n0:52:55\tSPEAKER_06\n Right. So it's, but, but, yeah.\n\n0:53:01\tSPEAKER_06\n We'll talk more about it later.\n\n0:53:03\tSPEAKER_06\n We can talk more about it later.\n\n0:53:07\tSPEAKER_05\n Would you dig it?\n\n0:53:09\tSPEAKER_05\n Let's do dig it.\n\n0:53:13\tSPEAKER_05\n You start.\n\n0:53:15\tSPEAKER_08\n Reading transcript L-5617686691.\n\n0:53:25\tSPEAKER_08\n 7921.\n\n0:53:28\tSPEAKER_08\n 20350125.\n\n0:53:33\tSPEAKER_08\n 40564334.\n\n0:53:39\tSPEAKER_08\n 9290-3114-8629.\n\n0:53:45\tSPEAKER_08\n 4136256690.\n\n0:53:51\tSPEAKER_08\n 4367-615298.\n\n0:53:56\tSPEAKER_08\n 76633377823.\n\n0:54:02\tSPEAKER_08\n 842-614627.\n\n0:54:07\tSPEAKER_06\n Transcript L-55.\n\n0:54:10\tSPEAKER_06\n Or transcript L-55.\n\n0:54:14\tSPEAKER_06\n 687-715-075.\n\n0:54:18\tSPEAKER_06\n 896-03865.\n\n0:54:22\tSPEAKER_06\n 566-2002-96.\n\n0:54:26\tSPEAKER_06\n 848-9164.\n\n0:54:29\tSPEAKER_06\n 1686-24013.\n\n0:54:33\tSPEAKER_06\n 3126-619960.\n\n0:54:37\tSPEAKER_06\n 837-08080.\n\n0:54:40\tSPEAKER_06\n 6236-4006-9743.\n\n0:54:45\tSPEAKER_07\n Transcript L-49.\n\n0:54:48\tSPEAKER_07\n 884259-7450.\n\n0:54:52\tSPEAKER_07\n 787-0106158.\n\n0:54:57\tSPEAKER_07\n 742-503970.\n\n0:55:02\tSPEAKER_07\n 858-034714.\n\n0:55:06\tSPEAKER_07\n 06044-2001.\n\n0:55:11\tSPEAKER_07\n 2293-3128.\n\n0:55:15\tSPEAKER_07\n 8558-558-691.\n\n0:55:20\tSPEAKER_07\n 358-294017.\n\n0:55:24\tSPEAKER_00\n Transcript L-50.\n\n0:55:27\tSPEAKER_00\n 9067-3933.\n\n0:55:32\tSPEAKER_00\n 08308-3481.\n\n0:55:38\tSPEAKER_00\n 21365-3159.\n\n0:55:43\tSPEAKER_00\n 4084305211.\n\n0:55:48\tSPEAKER_00\n 924-584-5504.\n\n0:55:52\tSPEAKER_00\n 2226168155.\n\n0:55:58\tSPEAKER_00\n 707-087-8402-803-160507.\n\n0:56:07\tSPEAKER_02\n Transcript L-53.\n\n0:56:11\tSPEAKER_02\n 5954-883914.\n\n0:56:16\tSPEAKER_02\n 860310-9753.\n\n0:56:21\tSPEAKER_02\n 55529-3365.\n\n0:56:26\tSPEAKER_02\n 337-074710.\n\n0:56:31\tSPEAKER_02\n 6418-3166.\n\n0:56:35\tSPEAKER_02\n 576-89596.\n\n0:56:39\tSPEAKER_02\n 228-3305595.\n\n0:56:45\tSPEAKER_02\n 355-059-615-025.\n\n0:56:52\tSPEAKER_01\n Transcript L-54.\n\n0:56:56\tSPEAKER_01\n 1431771032.\n\n0:57:02\tSPEAKER_01\n 9882-488812.\n\n0:57:08\tSPEAKER_01\n 1310576812.\n\n0:57:15\tSPEAKER_01\n 628875912.\n\n0:57:22\tSPEAKER_01\n 5272-8617498-0000709.\n\n0:57:32\tSPEAKER_01\n 862-458892.\n\n0:57:38\tSPEAKER_01\n 221-196783.\n\n", "summary": [{"summary_text": "SPEAKER sold speech recognition last week. It's April 5th. He's been in Europe. He'll be back in town shortly. Speaker did some experiments with the HTK back end. He did it before he had to go away for a week."}]}