{"filename": "./data/Bro003.txt", "transcript": "0:00:00\tNone\n Challenge?\n\n0:00:01\tSPEAKER_01\n Challenge.\n\n0:00:02\tSPEAKER_05\n So we think we're going to.\n\n0:00:07\tSPEAKER_05\n Okay, good.\n\n0:00:08\tSPEAKER_05\n Alright, going again.\n\n0:00:11\tSPEAKER_05\n So we're going to go around this before and do our digits.\n\n0:00:16\tSPEAKER_05\n Transcript, 1311-1330.\n\n0:00:20\tSPEAKER_05\n 323-4765.\n\n0:00:25\tSPEAKER_05\n 531-6241.\n\n0:00:30\tSPEAKER_05\n 677-890-94003.\n\n0:00:37\tSPEAKER_05\n 0158-17353.\n\n0:00:41\tSPEAKER_05\n 268-03624307.\n\n0:00:46\tSPEAKER_05\n 4.\n\n0:00:49\tSPEAKER_05\n 5069-4, 74857-9615-07802.\n\n0:00:54\tSPEAKER_05\n 090-90-604001.\n\n0:00:59\tSPEAKER_05\n 2.\n\n0:01:02\tSPEAKER_01\n I'm reading transcript.\n\n0:01:04\tSPEAKER_01\n 1391-1410-677-890-698.\n\n0:01:14\tSPEAKER_01\n 01319-16237-34.\n\n0:01:23\tSPEAKER_01\n 4.\n\n0:01:24\tSPEAKER_01\n 5.\n\n0:01:25\tSPEAKER_01\n 6.\n\n0:01:27\tSPEAKER_01\n 847-920-75.\n\n0:01:33\tSPEAKER_01\n 03696.\n\n0:01:36\tSPEAKER_01\n 0931003.\n\n0:01:40\tSPEAKER_01\n 1.\n\n0:01:42\tSPEAKER_01\n 2.\n\n0:01:43\tSPEAKER_01\n 3097.\n\n0:01:46\tSPEAKER_01\n 5267-983.\n\n0:01:50\tSPEAKER_01\n 6706.\n\n0:01:54\tSPEAKER_02\n Okay, I've got transcript 1271-1290.\n\n0:02:00\tSPEAKER_02\n 1710-281-207134.\n\n0:02:08\tSPEAKER_02\n 509-6080-7386-888818813.\n\n0:02:17\tSPEAKER_02\n 934-0394-042-021-2038232.\n\n0:02:29\tSPEAKER_02\n 42816-535-8308.\n\n0:02:36\tSPEAKER_02\n 659-1076.\n\n0:02:40\tSPEAKER_02\n 7662-879.\n\n0:02:46\tSPEAKER_02\n 0057804-141.\n\n0:02:53\tSPEAKER_03\n Transcript number 1291-1310.\n\n0:02:58\tSPEAKER_03\n 23902-38152-47467-5670-9401-00.\n\n0:03:12\tSPEAKER_03\n 07260.\n\n0:03:15\tSPEAKER_03\n 1604-645-23407-26440-74188-885-63989-00391.\n\n0:03:35\tSPEAKER_00\n Transcript number 1171-1190.\n\n0:03:45\tSPEAKER_00\n 83435-9439-0309691.\n\n0:03:51\tSPEAKER_00\n 203-556-086-304-0117882-89551-00214-36702-479-5905-7351.\n\n0:04:15\tSPEAKER_00\n 479-5905-7356-669-465-7.\n\n0:04:27\tSPEAKER_07\n Okay, this is Barry Chen and I'm reading transcript 1351-1370.\n\n0:04:35\tSPEAKER_07\n 4507-8928-71489-859-369-7159-047301-00106-243467-544-677-789-844-6389-00.\n\n0:05:00\tSPEAKER_07\n 544-677-899-899-001-1247-349-253-5008-48.\n\n0:05:19\tSPEAKER_08\n Transcript 1371-13905-6705-9263-305-0455-049162-30002-192-466-7208-5-0386-9088-7408-8408.\n\n0:05:48\tSPEAKER_08\n 3245-456-923.\n\n0:05:58\tSPEAKER_05\n Yeah, you don't actually need to say the name.\n\n0:06:01\tSPEAKER_05\n I'll probably bleep that out.\n\n0:06:02\tSPEAKER_05\n Okay.\n\n0:06:03\tSPEAKER_05\n These are not mine.\n\n0:06:05\tSPEAKER_05\n Oh.\n\n0:06:06\tSPEAKER_05\n Okay.\n\n0:06:07\tSPEAKER_05\n Not that there's anything defamatory about 857.\n\n0:06:15\tSPEAKER_05\n Okay.\n\n0:06:18\tSPEAKER_05\n So here's what I have.\n\n0:06:19\tSPEAKER_05\n I was just trying to add things I think that we should do today.\n\n0:06:23\tSPEAKER_05\n It's what I have for an agenda and so far.\n\n0:06:27\tSPEAKER_05\n We should talk a little bit about plants for the field trip next week.\n\n0:06:32\tSPEAKER_05\n A number of string field trip to OGI.\n\n0:06:38\tSPEAKER_05\n And mostly, first of all, about the logistics for it.\n\n0:06:42\tSPEAKER_05\n Then maybe later on, the meeting we should talk about, actually, might accomplish.\n\n0:06:49\tSPEAKER_05\n And then, kind of go around to see what people have been doing and talk about that progress record, essentially.\n\n0:06:58\tSPEAKER_05\n And then another topic I had was that Dave here said, give me something to do.\n\n0:07:05\tSPEAKER_05\n And I have failed so far on doing that and so we can discuss that a little bit, find some holes and some things that someone could use and help with these things.\n\n0:07:14\tSPEAKER_05\n I'm going to move into that current here.\n\n0:07:18\tSPEAKER_05\n Okay.\n\n0:07:19\tSPEAKER_05\n Always count on that.\n\n0:07:20\tSPEAKER_05\n That's a really good question.\n\n0:07:22\tSPEAKER_05\n So.\n\n0:07:23\tSPEAKER_05\n And then talk a little bit about disks and resource issues that started to work out.\n\n0:07:32\tSPEAKER_05\n And then anything else that he has that isn't in that list?\n\n0:07:39\tSPEAKER_01\n I was just wondering, does this mean the battery is dying and I should change it?\n\n0:07:45\tSPEAKER_05\n I think that means the battery is okay.\n\n0:07:48\tSPEAKER_01\n Oh, okay.\n\n0:07:49\tSPEAKER_01\n Yeah, that's good.\n\n0:07:50\tSPEAKER_01\n Because it's full.\n\n0:07:52\tSPEAKER_05\n All right.\n\n0:07:53\tSPEAKER_05\n Full of electrons.\n\n0:07:55\tSPEAKER_05\n Okay.\n\n0:07:56\tSPEAKER_05\n Okay.\n\n0:08:02\tSPEAKER_05\n So I'm going to start this with this mundane thing.\n\n0:08:07\tSPEAKER_05\n It was kind of my bright idea to have us take a plane that leaves at 7.20 in the morning.\n\n0:08:14\tSPEAKER_05\n Oh, yeah.\n\n0:08:15\tSPEAKER_05\n This is a reason I did it was because otherwise for those of us who have to come back the same day is really not much of a visit.\n\n0:08:25\tSPEAKER_05\n So the issue is how we ever accomplished that.\n\n0:08:32\tSPEAKER_05\n What part of the time do you live in?\n\n0:08:35\tSPEAKER_07\n I live in the corner of campus.\n\n0:08:38\tSPEAKER_07\n Okay.\n\n0:08:39\tSPEAKER_07\n South East corner.\n\n0:08:41\tSPEAKER_05\n Okay.\n\n0:08:42\tSPEAKER_05\n So would it be easier?\n\n0:08:43\tSPEAKER_05\n Those of you who are not used to this area can be very tricky to get to the airport at 6.30.\n\n0:08:51\tSPEAKER_05\n So would it be easier for you if you came here and I drove you?\n\n0:09:00\tSPEAKER_05\n Yeah, bridge.\n\n0:09:01\tSPEAKER_05\n Yeah.\n\n0:09:02\tSPEAKER_05\n Okay.\n\n0:09:03\tSPEAKER_05\n Okay.\n\n0:09:04\tSPEAKER_05\n So if everybody can get here at 6.\n\n0:09:06\tSPEAKER_05\n Yeah.\n\n0:09:07\tSPEAKER_05\n I'm afraid you can do that.\n\n0:09:08\tSPEAKER_05\n I guess.\n\n0:09:09\tSPEAKER_05\n Yeah.\n\n0:09:10\tSPEAKER_05\n Anyway.\n\n0:09:11\tSPEAKER_02\n So was that the enough time?\n\n0:09:16\tSPEAKER_05\n Yeah.\n\n0:09:17\tSPEAKER_05\n So I'll just pull up in front at 6.\n\n0:09:22\tSPEAKER_05\n And yeah, that'll be plenty of time.\n\n0:09:24\tSPEAKER_05\n It won't be bad traffic that time of day.\n\n0:09:26\tSPEAKER_02\n I guess once you get past the bridge.\n\n0:09:29\tSPEAKER_02\n That would be the opening.\n\n0:09:31\tSPEAKER_02\n Yeah.\n\n0:09:32\tSPEAKER_02\n Once you get past the turn off to the day bridge.\n\n0:09:35\tSPEAKER_05\n Well, the turn off bridge.\n\n0:09:36\tSPEAKER_05\n Yeah.\n\n0:09:37\tSPEAKER_05\n Won't even do that.\n\n0:09:38\tSPEAKER_05\n I mean, just go down.\n\n0:09:39\tSPEAKER_05\n Yeah.\n\n0:09:40\tSPEAKER_05\n Okay.\n\n0:09:41\tSPEAKER_05\n And the mountain with the King 988, 888.\n\n0:09:43\tSPEAKER_05\n So it's about 30 minutes to get there.\n\n0:09:47\tSPEAKER_05\n So it leaves us 50 minutes before the plane.\n\n0:09:50\tSPEAKER_05\n Yeah.\n\n0:09:51\tSPEAKER_05\n Great.\n\n0:09:52\tSPEAKER_05\n Okay.\n\n0:09:53\tSPEAKER_05\n So that'll, I mean, still not going to be really easy.\n\n0:09:56\tSPEAKER_05\n Well, particularly for the Burian, we're not staying overnight.\n\n0:10:00\tSPEAKER_05\n We're not bringing anything.\n\n0:10:02\tSPEAKER_05\n We're going to take a little bit.\n\n0:10:04\tSPEAKER_05\n We're going to have a paper.\n\n0:10:06\tSPEAKER_05\n We're going to do a little bit.\n\n0:10:08\tSPEAKER_05\n Don't bring a foot locker and we'll be okay.\n\n0:10:11\tSPEAKER_05\n So staying overnight, I figured he wouldn't need a great big.\n\n0:10:15\tSPEAKER_05\n Oh, yeah.\n\n0:10:16\tSPEAKER_05\n Anyway.\n\n0:10:17\tSPEAKER_05\n Okay.\n\n0:10:18\tSPEAKER_05\n Six a.m.\n\n0:10:19\tSPEAKER_05\n Front.\n\n0:10:20\tSPEAKER_05\n Six a.m. in front.\n\n0:10:22\tSPEAKER_05\n I'll be here.\n\n0:10:25\tSPEAKER_05\n I'll give you my phone number.\n\n0:10:28\tSPEAKER_05\n I'll give you a few minutes.\n\n0:10:30\tSPEAKER_05\n Wait a minute.\n\n0:10:31\tSPEAKER_05\n Wait a minute.\n\n0:10:32\tSPEAKER_05\n Wait a minute.\n\n0:10:33\tSPEAKER_05\n Wait a minute.\n\n0:10:34\tSPEAKER_05\n Wait a minute.\n\n0:10:35\tSPEAKER_05\n Wait a minute.\n\n0:10:36\tSPEAKER_05\n Wait a minute.\n\n0:10:37\tSPEAKER_05\n Wait a minute.\n\n0:10:38\tSPEAKER_05\n Wait a minute.\n\n0:10:39\tSPEAKER_05\n Wait a minute.\n\n0:10:40\tSPEAKER_05\n Okay.\n\n0:10:41\tSPEAKER_05\n That was the real, real important stuff.\n\n0:10:45\tSPEAKER_05\n I figured maybe wait on the potential goals for the meeting until we talk about what's been going on.\n\n0:10:53\tSPEAKER_05\n So what's been going on?\n\n0:10:56\tSPEAKER_05\n Let me start over here.\n\n0:11:00\tSPEAKER_08\n Well, the duration of the French test data.\n\n0:11:10\tSPEAKER_08\n Well, this is a digital French database, which is a microphone speech.\n\n0:11:14\tSPEAKER_08\n Don't suffer to make it worse.\n\n0:11:17\tSPEAKER_08\n I've had a noise to one part, which is actually the Aurora 2 noises.\n\n0:11:25\tSPEAKER_08\n So this is the training part.\n\n0:11:28\tSPEAKER_08\n And the remaining part are useful testing with one or two kind of noises.\n\n0:11:35\tSPEAKER_08\n So this is almost ready.\n\n0:11:42\tSPEAKER_08\n I'm preparing the HTK baseline for this task.\n\n0:11:47\tNone\n Okay.\n\n0:11:48\tSPEAKER_05\n So the HTK baseline, so this is using Melcadstrand.\n\n0:11:56\tSPEAKER_05\n Yeah.\n\n0:11:58\tSPEAKER_05\n Again, I guess the plan is to then give in this.\n\n0:12:06\tSPEAKER_05\n What's the plan again?\n\n0:12:10\tSPEAKER_05\n The plan we've been doing.\n\n0:12:13\tSPEAKER_05\n So just remind me of what you were going to do.\n\n0:12:16\tSPEAKER_05\n You just described what you've been doing.\n\n0:12:18\tSPEAKER_05\n Yeah.\n\n0:12:19\tSPEAKER_05\n So if you could remind me of what you're going to be doing.\n\n0:12:21\tSPEAKER_08\n Yeah.\n\n0:12:22\tSPEAKER_08\n Well, I'm like a cube.\n\n0:12:27\tSPEAKER_08\n I should definitely shoot.\n\n0:12:28\tSPEAKER_08\n Actually, we want to analyze three dimensions, the feature dimension, the training data dimension, and the test data dimension.\n\n0:12:44\tSPEAKER_08\n Well, what we want to do is first we have number for each task.\n\n0:12:53\tSPEAKER_08\n So we have the integer task, the Italian task, the French task, and the Finnish task.\n\n0:12:58\tSPEAKER_08\n So we have numbers with systems.\n\n0:13:01\tSPEAKER_08\n I mean, I mean, you run the work strain on the task data.\n\n0:13:07\tSPEAKER_08\n And then we have systems with neural networks trained on data from the same language, if possible, but using a more generic database, which is for the tickly balance.\n\n0:13:26\tSPEAKER_05\n So we had talked, I guess we had talked at one point about maybe the language ID corpus.\n\n0:13:33\tSPEAKER_08\n Yeah, but this corpus, there is the call OM and the callFranco.\n\n0:13:40\tSPEAKER_08\n The callFranco is for language identification.\n\n0:13:43\tSPEAKER_08\n Anyway, these corpus are telephone speech, so this could be a group of four.\n\n0:13:54\tSPEAKER_08\n Because the speech database are not telephone speech.\n\n0:14:00\tSPEAKER_08\n They are not sample to eight kilohertz, but they are not telephone bandwidth.\n\n0:14:06\tSPEAKER_05\n So it's funny, isn't it? I mean, because this whole thing is for telephone.\n\n0:14:12\tSPEAKER_08\n Yeah, but the idea is to compute the feature before sending them to the...\n\n0:14:18\tSPEAKER_08\n Well, you don't send speech use and features, compute, not the...\n\n0:14:23\tSPEAKER_05\n Yeah, I know, but the reason is...\n\n0:14:26\tSPEAKER_05\n So the point is that it's the features are computed locally, and so they aren't necessarily telephone bandwidth or telephone.\n\n0:14:36\tSPEAKER_02\n Did you happen to find out anything about the OGI multilingual database?\n\n0:14:41\tSPEAKER_05\n Yeah, that's what I meant.\n\n0:14:43\tSPEAKER_05\n I said, there's an OGI language ID, not the callFranco.\n\n0:14:48\tSPEAKER_05\n Yeah, there are also two other databases.\n\n0:14:51\tSPEAKER_08\n One, they call the multilingual database, and another one is 22 language.\n\n0:14:57\tSPEAKER_08\n But it's also a different speech. Oh, they are.\n\n0:15:02\tSPEAKER_05\n Well, but I'm not sure...\n\n0:15:08\tSPEAKER_05\n I mean, the bandwidth shouldn't be such an issue, right?\n\n0:15:11\tSPEAKER_05\n Because this is down sample filtered, right?\n\n0:15:14\tSPEAKER_05\n So it's just the fact that it's not telephone.\n\n0:15:17\tSPEAKER_05\n And there are so many other differences between these different databases.\n\n0:15:22\tSPEAKER_05\n I mean, some of the stuff's recorded in the car, some of the... I mean, there's many different acoustic differences.\n\n0:15:28\tSPEAKER_05\n So I'm not sure...\n\n0:15:30\tSPEAKER_05\n I mean, else we're going to include a bunch of car recordings in the training database.\n\n0:15:35\tSPEAKER_05\n I'm not sure if it's completely rules it out.\n\n0:15:39\tSPEAKER_05\n If our major goal is to have the metacontext, and you figure that there's going to be a mismatch in acoustic conditions, does it make it much worse to sort of add another mismatch if you will?\n\n0:15:53\tSPEAKER_05\n I guess the question is, how important is it to get multiple languages in there?\n\n0:16:00\tSPEAKER_08\n Yeah, but...\n\n0:16:03\tSPEAKER_08\n Yeah.\n\n0:16:06\tSPEAKER_08\n Well, actually, for the moment, if we do not want to use these different databases, we already have an English and French microphone speech.\n\n0:16:17\tSPEAKER_05\n So that's why I think we're using a sort of multilingual...\n\n0:16:22\tSPEAKER_08\n Yeah, for the multilingual part, we were thinking about using these three databases,\n\n0:16:26\tSPEAKER_05\n and the difference in the metacontext.\n\n0:16:30\tSPEAKER_08\n Actually, these three databases are generic databases. So for Italian, which is close to Spanish, French, the attitudes we have, digits training data, and also more general training data.\n\n0:16:49\tSPEAKER_05\n Well, we also have this broadcast news that we were talking about taking off the disk, which is this microchannel data for language.\n\n0:16:57\tSPEAKER_08\n Yeah, brups.\n\n0:16:58\tSPEAKER_08\n Yeah, there is also a timid.\n\n0:17:00\tSPEAKER_08\n Yeah, I would use timid.\n\n0:17:03\tSPEAKER_05\n Yeah, so it's probably a stuff around.\n\n0:17:06\tSPEAKER_05\n Okay, so anyway, the basic plan is to test this cube.\n\n0:17:11\tNone\n Yes, thank you.\n\n0:17:13\tSPEAKER_05\n The fillet filled in, yeah.\n\n0:17:16\tSPEAKER_08\n Okay, yeah, and brups, we were thinking that, perhaps, the cross-language issue is not so big of an issue, well-reviewed, brub-fusion, not focused too much on that cross-language stuff.\n\n0:17:31\tSPEAKER_08\n I mean, training on that on the language and testing for another language.\n\n0:17:38\tSPEAKER_08\n Perhaps the most important is to have neural networks trained on the target languages, with general database, general databases.\n\n0:17:48\tSPEAKER_08\n So that, well, the guy who has to develop an application with one language can use the net train on that language, or a generic net, but in other terms,\n\n0:17:58\tSPEAKER_05\n That's how you mean using the net. So if you're talking about for producing these discriminative features, you can't do that, because what they are asking for is a feature set.\n\n0:18:10\tSPEAKER_05\n Right, and so we're the ones who have been weird by doing this training.\n\n0:18:16\tSPEAKER_05\n But if we say, no, you have to have a different feature set for each language, I think this is very, very bad.\n\n0:18:22\tSPEAKER_05\n Oh, yeah.\n\n0:18:24\tSPEAKER_05\n Yeah, I mean, in principle, I mean, concessually, sort of like they want, well, they want a replacement for Melcafster.\n\n0:18:31\tSPEAKER_05\n So they say, okay, this is the year 2000.\n\n0:18:33\tSPEAKER_05\n We've got something much better than Melcafster, it's, you know, Gavaldi-Gook.\n\n0:18:36\tSPEAKER_05\n And so Gavaldi-Gook features, but these Gavaldi-Gook features are supposed to be good for any language.\n\n0:18:42\tSPEAKER_05\n Because you don't know who's going to call, and you know, I mean, so it's, it's, it's, how do you know what language?\n\n0:18:49\tSPEAKER_05\n So it picks up the phone.\n\n0:18:51\tSPEAKER_05\n So this is their English.\n\n0:18:52\tSPEAKER_05\n So it picks up the phone, right?\n\n0:18:54\tSPEAKER_08\n And you pick up the application, there is a target, the English one, the application.\n\n0:18:59\tSPEAKER_05\n So, yeah, you pick up the phone.\n\n0:19:03\tSPEAKER_05\n Yeah, you talk the phone and it sends features in.\n\n0:19:06\tSPEAKER_05\n Okay, so the phone doesn't know what your language is.\n\n0:19:11\tSPEAKER_08\n If it's the phone, but, but that's the image that they could be the, the server side.\n\n0:19:16\tSPEAKER_05\n It could be, but that's the image they have.\n\n0:19:19\tSPEAKER_05\n So that's, that's, I mean, one could argue all over the place about how things really will be in 10 years.\n\n0:19:25\tSPEAKER_05\n But the particular image that the cellular industry has right now is that it's distributed to be recognition where the probabilistic part and the semantics and so forth are all on the servers, and you compute features on the phone.\n\n0:19:39\tSPEAKER_05\n So that's, that's what we're involved.\n\n0:19:41\tSPEAKER_05\n You might, you might not agree that that's the way it will be in 10 years, but that's, that's what they're asking for.\n\n0:19:47\tSPEAKER_05\n So, so I think that the, it is an important issue whether it works cross-language.\n\n0:19:53\tSPEAKER_05\n Now it's the OGI folks perspective right now that probably that's not the biggest deal.\n\n0:19:59\tSPEAKER_05\n And that the biggest deal is the, you know, acoustic environment mismatch.\n\n0:20:05\tSPEAKER_05\n And they may very well be right, but I was hoping we could just do a task and determine if that was true.\n\n0:20:11\tSPEAKER_05\n That's true. We don't need to worry so much. Maybe, maybe we have a couple of languages in the training set, and that gives us enough breadth that, that, that the rest doesn't matter.\n\n0:20:22\tSPEAKER_05\n The other thing is this notion of training to, which I guess they're starting to look at up there, training to something more like articulate-toy features.\n\n0:20:33\tSPEAKER_05\n And if you have something that's just good for distinguishing different articulate-toy features, that should just be good across, you know, either into languages.\n\n0:20:42\tSPEAKER_05\n Yeah, so I don't, I don't, unfortunately, I don't, I see what you're coming, where you're coming from, I think, but I don't think we can, you know,\n\n0:20:47\tSPEAKER_08\n so we really have to do tests with real cross-language, I mean, for instance, training on English and testing in Italian, or we can train, or else, can we train a net on a range of languages, which can include the test, the target language.\n\n0:21:10\tSPEAKER_05\n Yeah, so there's, there's, this is complex. So, ultimately, is this saying, I think it doesn't fit within their image that you switch nets based on language.\n\n0:21:23\tSPEAKER_05\n Now, can you include the target language?\n\n0:21:29\tSPEAKER_05\n From a pure standpoint, it'd be nice not to, because then you can say, because surely someone is going to say at some point, okay, so you put in the German and the Finnish, now what do you do when somebody has Portuguese?\n\n0:21:46\tSPEAKER_05\n You know, and however, you aren't, it isn't actually a constraint in this evaluation.\n\n0:21:56\tSPEAKER_05\n So I would say, if it looks like there's a big difference to put it in, then we'd make note of it, and then we'd probably put in the other, because we have so many other problems in trying to get things to work well here, that it's not so bad as long as we know it, and we say, look, we did do this.\n\n0:22:12\tSPEAKER_02\n So ideally, what you'd want to do is you'd want to run it with and without the target language in a training set for a wide range of languages.\n\n0:22:21\tSPEAKER_02\n And that way you can say, well, you know, we're going to build it for what we think are the most common ones, but if that somebody is with a different language, you know, here's what, here's what's likely to happen.\n\n0:22:33\tSPEAKER_05\n And the truth is that it's not like there are, I mean, although there are thousands of languages, from the point of view of cellular companies, there aren't.\n\n0:22:42\tSPEAKER_05\n There's, you know, there's 50, there's something, you know, so, and they aren't, you know, the exception of Finnish, which I guess is pretty different from most things.\n\n0:22:53\tSPEAKER_05\n It's, most of them are like at least some of the others, I guess, that's why I guess this vanishes like the town.\n\n0:23:03\tSPEAKER_05\n I guess Finnish is a little bit like Hungarian, I suppose, right?\n\n0:23:07\tSPEAKER_05\n I don't know.\n\n0:23:08\tSPEAKER_05\n I don't know.\n\n0:23:09\tSPEAKER_05\n I know that, I mean, I'm not like this, but I guess Hungarian and Finnish, and one of the languages from the former Soviet Union is sort of the same family, but it's just this film.\n\n0:23:20\tSPEAKER_05\n The countries that are pretty far apart from one another, people are rode in on horses.\n\n0:23:29\tSPEAKER_07\n Okay.\n\n0:23:34\tSPEAKER_07\n Oh, my turn.\n\n0:23:35\tSPEAKER_07\n Okay.\n\n0:23:36\tSPEAKER_07\n Let's see, I spent the last week looking over Stefan Schulder, and understanding some of the data.\n\n0:23:46\tSPEAKER_07\n I reinstalled the HTK, the free version.\n\n0:23:51\tSPEAKER_07\n So, everybody's now using 3.0, which is the same version that OGI is using.\n\n0:23:57\tSPEAKER_07\n Oh, good.\n\n0:23:58\tSPEAKER_07\n Yeah, so, without any licensing big deals or anything like that.\n\n0:24:03\tSPEAKER_07\n And so, we've been talking about this cube thing, and it's beginning more and more looking like the, the Borg cube thing.\n\n0:24:14\tSPEAKER_07\n It's really gargantuan.\n\n0:24:17\tSPEAKER_07\n But, I...\n\n0:24:19\tSPEAKER_05\n I'm not going to be a similar one.\n\n0:24:22\tSPEAKER_07\n I'm not a resistant person.\n\n0:24:24\tSPEAKER_07\n Exactly.\n\n0:24:27\tSPEAKER_07\n Yeah, so, I've been looking at a Timmit stuff.\n\n0:24:32\tSPEAKER_07\n The stuff that we've been working on with Timmit, trying to get a, a labels file so we can train up a net on Timmit, and test the difference between this net train on Timmit and a net trained on digits alone, and seeing if it hurts or helps.\n\n0:24:52\tSPEAKER_05\n And again, just to clarify, when you're talking about training, have you been talking about training, have you been net for Tandem?\n\n0:24:58\tSPEAKER_05\n Yeah, yeah, I'm very...\n\n0:25:00\tSPEAKER_05\n And the inputs are POP and Delta.\n\n0:25:03\tSPEAKER_07\n Well, the inputs are one dimension of the cube, which we've talked about.\n\n0:25:09\tSPEAKER_07\n It being PLP, MFCCs, J-Rasta, LVA.\n\n0:25:17\tSPEAKER_05\n Yeah, but your initial things you're making one choice there.\n\n0:25:20\tSPEAKER_07\n Yeah, just PLP.\n\n0:25:22\tSPEAKER_07\n I haven't decided on an initial thing.\n\n0:25:25\tSPEAKER_07\n Probably something like PLP.\n\n0:25:29\tSPEAKER_05\n Yeah.\n\n0:25:30\tSPEAKER_05\n So, you take PLP and you...\n\n0:25:35\tSPEAKER_05\n You use HDK with it with the transform features using the neural net that's trained, and the training could either be from digits itself or from Timmit.\n\n0:25:46\tSPEAKER_05\n Right.\n\n0:25:47\tSPEAKER_05\n And then the testing would be these other things which might be foreign language.\n\n0:25:52\tSPEAKER_05\n Right.\n\n0:25:53\tSPEAKER_05\n I see.\n\n0:25:54\tSPEAKER_05\n I get in the picture about the cube.\n\n0:25:56\tSPEAKER_05\n Okay.\n\n0:25:57\tSPEAKER_05\n Okay.\n\n0:25:58\tSPEAKER_05\n I mean, those listening to this will not have a picture either, so I guess I'm not in worse off.\n\n0:26:03\tSPEAKER_05\n Somebody just told me the cube.\n\n0:26:06\tSPEAKER_05\n It sounds...\n\n0:26:07\tSPEAKER_05\n I get it.\n\n0:26:08\tSPEAKER_05\n I think I get it.\n\n0:26:09\tSPEAKER_02\n Yeah.\n\n0:26:10\tSPEAKER_02\n So, when you said that you're getting the labels for Timmit, what do you mean?\n\n0:26:15\tSPEAKER_07\n Oh, I'm just transforming them from the standard Timmit transcriptions to do a nice long, huge P-file.\n\n0:26:24\tSPEAKER_02\n Were the digits hand labeled for phones?\n\n0:26:28\tSPEAKER_02\n Or were they those labels automatically?\n\n0:26:30\tSPEAKER_07\n Oh, yeah. Those were automatically derived by Dan using embedded training in the alignment.\n\n0:26:39\tSPEAKER_05\n Oh, but which Dan?\n\n0:26:41\tSPEAKER_07\n Alice.\n\n0:26:42\tSPEAKER_07\n Okay.\n\n0:26:43\tNone\n Yeah.\n\n0:26:45\tSPEAKER_06\n So.\n\n0:26:46\tSPEAKER_02\n I was just wondering because that test...\n\n0:26:50\tSPEAKER_02\n I think you're doing this test because you wanted to determine whether or not having general speech performs as well as having specific speech.\n\n0:27:00\tSPEAKER_02\n That's right.\n\n0:27:01\tSPEAKER_05\n Well, especially when you go over the different languages again, because you would...\n\n0:27:05\tSPEAKER_05\n The different languages have different words from the physics of it.\n\n0:27:08\tSPEAKER_02\n I was just wondering if the fact that Timmit, who is in a hand labeled stuff from Timmit, might be confused the results that you get.\n\n0:27:18\tSPEAKER_05\n I think it would, but on the other hand, it might be better.\n\n0:27:23\tSPEAKER_02\n But if it's better, it may be better because it was handed.\n\n0:27:26\tSPEAKER_05\n Yeah, so probably use it.\n\n0:27:28\tSPEAKER_05\n I mean, you know, I guess I'm Sonic Cavalier, but I mean, I think the point is you have a bunch of labels and hand-marked...\n\n0:27:38\tSPEAKER_05\n I guess actually Timmit was not entirely hand-marked.\n\n0:27:41\tSPEAKER_05\n It was automatically first and then corrected.\n\n0:27:44\tSPEAKER_05\n But it might be a better source.\n\n0:27:52\tSPEAKER_05\n So, you're right. It would be another interesting scientific question to ask.\n\n0:27:56\tSPEAKER_05\n Is it because it's a broad source or because it was, you know, carefully?\n\n0:28:00\tSPEAKER_05\n And that's something you could ask.\n\n0:28:02\tSPEAKER_05\n But given limited time, I think the main thing is if it's a better thing for you to run across languages on this training tandem system.\n\n0:28:09\tSPEAKER_02\n What about the differences in the phone sets?\n\n0:28:12\tSPEAKER_07\n Between languages?\n\n0:28:14\tSPEAKER_02\n No, between Timmit and the physics.\n\n0:28:17\tSPEAKER_07\n Oh, right.\n\n0:28:19\tSPEAKER_07\n Well, there's a mapping from the 61 phonemes in Timmit to 56, the XE56.\n\n0:28:27\tSPEAKER_07\n And then the digits phonemes, there's about 22 or 24 of them.\n\n0:28:34\tSPEAKER_07\n Out of that 56?\n\n0:28:36\tSPEAKER_07\n Out of that 56.\n\n0:28:38\tSPEAKER_07\n So, it's definitely broader.\n\n0:28:45\tSPEAKER_08\n But actually the issue of phonemes, phonemapics, will arise when we will do several languages.\n\n0:28:54\tSPEAKER_08\n Because some phonemes are not in every languages.\n\n0:29:01\tSPEAKER_08\n So, we plan to develop a subset of phonemes that includes all the phonemes of training languages.\n\n0:29:11\tSPEAKER_08\n Using the two words, kind of 100 of boots.\n\n0:29:15\tSPEAKER_08\n Yeah, super set.\n\n0:29:17\tSPEAKER_08\n Yeah, super set.\n\n0:29:20\tSPEAKER_00\n I look for some per form.\n\n0:29:26\tSPEAKER_00\n For English, American English.\n\n0:29:29\tSPEAKER_00\n And the language who have more phonemes are the English of the language.\n\n0:29:39\tSPEAKER_00\n But, for example, in Spain, in the Spanish half, several phonemes that does not appear in the English and we are too complete.\n\n0:29:50\tSPEAKER_00\n But for that, in this, we must do a lot of work because we need to generate the transcription for the database that we have.\n\n0:30:03\tSPEAKER_04\n Other than the languages, there are reasons not to use Timmit phonemes.\n\n0:30:08\tSPEAKER_04\n Because it's larger.\n\n0:30:10\tSPEAKER_04\n Is it supposed to be X-E?\n\n0:30:13\tSPEAKER_07\n Oh.\n\n0:30:14\tSPEAKER_07\n I mean, why map the 61 to 56?\n\n0:30:17\tSPEAKER_07\n I don't know.\n\n0:30:18\tSPEAKER_05\n I figured if that happened to start with you or was it, or was there, yeah, so it's what you did that.\n\n0:30:24\tSPEAKER_05\n But I think basically there were several phonemes that were just hardly over there.\n\n0:30:29\tSPEAKER_02\n Yeah, and I think some of them, they were making distinctions between silence at the end and silence at the beginning.\n\n0:30:35\tSPEAKER_02\n And really, most silence.\n\n0:30:38\tSPEAKER_02\n And it was things like that that got it mapped down.\n\n0:30:40\tSPEAKER_05\n Yeah, especially a system like ours, which is a discriminative system.\n\n0:30:43\tSPEAKER_05\n You know, you really ask him to map the learn.\n\n0:30:46\tSPEAKER_02\n There's not much different.\n\n0:30:48\tSPEAKER_02\n The ones that are gone, I think, or they also, they also, and Timmit had like a glottal stop, which basically a short period of silence.\n\n0:30:56\tSPEAKER_02\n Well, we have that now too.\n\n0:30:58\tSPEAKER_02\n I don't know.\n\n0:30:59\tSPEAKER_05\n It's actually pretty common that a lot of the recognition systems people use have things like, like say, 39, simple symbols, right?\n\n0:31:07\tSPEAKER_05\n And then they get the variety by by bringing in the context.\n\n0:31:11\tSPEAKER_05\n And that context.\n\n0:31:13\tSPEAKER_05\n So we actually have them usually large number.\n\n0:31:16\tSPEAKER_05\n We'll be 10 to use here.\n\n0:31:20\tSPEAKER_05\n So actually, maybe now you've got me sort of intrigued, but there's...\n\n0:31:26\tSPEAKER_05\n Can you describe what's on the cube?\n\n0:31:29\tSPEAKER_07\n I think that's a good idea to talk about the whole cube, and maybe we can cut out sections in the cube for people to work on.\n\n0:31:38\tSPEAKER_07\n Okay.\n\n0:31:39\tSPEAKER_05\n So even the one in the quarter doesn't, since we're not running a video camera, we'll get this.\n\n0:31:44\tSPEAKER_05\n If you use a board, it'll help us anyway.\n\n0:31:47\tSPEAKER_05\n Okay, point out one of the limitations of this.\n\n0:31:50\tSPEAKER_05\n You've got to worry less, right?\n\n0:31:52\tSPEAKER_07\n Yeah, worry less.\n\n0:31:53\tSPEAKER_07\n Can you walk around too? No.\n\n0:31:56\tSPEAKER_07\n Okay, well, basically the cube will have three dimensions.\n\n0:32:02\tSPEAKER_07\n First dimension is the features that we're going to use.\n\n0:32:08\tSPEAKER_07\n And the second dimension is the training corpus.\n\n0:32:15\tSPEAKER_07\n And that's the training on the discriminant neural net.\n\n0:32:20\tSPEAKER_07\n And the last dimension happens...\n\n0:32:25\tSPEAKER_05\n Yeah, so the training for HDK is always...\n\n0:32:29\tSPEAKER_05\n That's always set up for the individual test, right?\n\n0:32:32\tSPEAKER_05\n There's some training data and some test data.\n\n0:32:34\tSPEAKER_05\n Right, right.\n\n0:32:35\tSPEAKER_07\n This is for ANN only.\n\n0:32:40\tSPEAKER_07\n And the training for the HDK models is always fixed for whatever language you're testing on.\n\n0:32:48\tSPEAKER_07\n And then there's the testing corpus.\n\n0:32:58\tSPEAKER_07\n So then I think it's probably instructive to go and show you the features that we were talking about.\n\n0:33:07\tSPEAKER_07\n So let's see.\n\n0:33:08\tSPEAKER_07\n It's a healthy L.\n\n0:33:09\tSPEAKER_07\n Okay, what?\n\n0:33:10\tSPEAKER_07\n BLP.\n\n0:33:11\tSPEAKER_07\n FST.\n\n0:33:14\tSPEAKER_08\n MSG.\n\n0:33:15\tSPEAKER_07\n MSG.\n\n0:33:17\tSPEAKER_08\n J-Rasta.\n\n0:33:18\tSPEAKER_07\n J-Rasta.\n\n0:33:19\tSPEAKER_07\n And J-Rasta L.E.\n\n0:33:23\tSPEAKER_08\n J-Rasta L.E.\n\n0:33:24\tSPEAKER_08\n J-Rasta L.E.\n\n0:33:26\tSPEAKER_07\n Multiband.\n\n0:33:27\tSPEAKER_07\n Multiband.\n\n0:33:28\tSPEAKER_08\n So there would be multiband before...\n\n0:33:39\tSPEAKER_08\n Before the tour, I mean...\n\n0:33:42\tSPEAKER_07\n Yeah, just the multiband features, right?\n\n0:33:44\tSPEAKER_07\n Yeah.\n\n0:33:47\tSPEAKER_08\n So something like the CT with advanced.\n\n0:33:54\tSPEAKER_08\n And then multiband after networks, meaning that you would have...\n\n0:33:59\tSPEAKER_08\n You run networks, the script that you run, the script for each band.\n\n0:34:04\tSPEAKER_08\n And using the outputs of these networks or the linear outputs.\n\n0:34:09\tSPEAKER_08\n Something like that.\n\n0:34:11\tSPEAKER_02\n Yeah.\n\n0:34:14\tSPEAKER_02\n What about no?\n\n0:34:15\tSPEAKER_02\n Oh.\n\n0:34:16\tSPEAKER_02\n You don't include that because it's part of the base.\n\n0:34:20\tSPEAKER_05\n We do have a baseline system that's the smell capture, right?\n\n0:34:26\tSPEAKER_08\n But...\n\n0:34:27\tSPEAKER_08\n Not for the A and M.\n\n0:34:30\tSPEAKER_08\n Okay.\n\n0:34:31\tSPEAKER_08\n So yeah, we could add a CT.\n\n0:34:34\tSPEAKER_05\n Probably should.\n\n0:34:35\tSPEAKER_05\n At least conceptually, you know, it doesn't mean you actually have to do it.\n\n0:34:39\tSPEAKER_05\n Conceptually, it makes sense, so it's a baseline.\n\n0:34:42\tSPEAKER_02\n It'd be an interesting test just to have...\n\n0:34:44\tSPEAKER_02\n Just to do MFCC with the neural mat.\n\n0:34:47\tSPEAKER_02\n And everything else the same.\n\n0:34:48\tSPEAKER_02\n Compare that with just that MFCC without the net.\n\n0:34:51\tSPEAKER_02\n Yeah.\n\n0:34:52\tSPEAKER_07\n I think Dan did some of that in his previous Aurora experiments.\n\n0:35:00\tSPEAKER_07\n And with the net, it's wonderful.\n\n0:35:03\tSPEAKER_07\n And now the net's just baseline.\n\n0:35:06\tSPEAKER_05\n I think OGI folks have been doing it too.\n\n0:35:09\tSPEAKER_05\n Because I think they're for a bunch of their experiments.\n\n0:35:11\tSPEAKER_05\n They used a no-cam study.\n\n0:35:12\tSPEAKER_05\n Yeah, actually.\n\n0:35:15\tSPEAKER_05\n Of course, that's there.\n\n0:35:17\tSPEAKER_05\n It's here.\n\n0:35:18\tSPEAKER_07\n Okay.\n\n0:35:19\tSPEAKER_07\n Okay.\n\n0:35:20\tSPEAKER_07\n For the training corpus, we have the digits from the various languages.\n\n0:35:32\tSPEAKER_07\n English, Spanish, French, what else do we have?\n\n0:35:46\tSPEAKER_08\n The finish.\n\n0:35:48\tSPEAKER_08\n The finish.\n\n0:35:49\tSPEAKER_00\n Where did that come from?\n\n0:35:53\tSPEAKER_00\n Italy, no.\n\n0:35:54\tSPEAKER_00\n Italy, yes.\n\n0:35:56\tSPEAKER_00\n Italian.\n\n0:35:57\tSPEAKER_02\n Is that distributed with Aurora or Aurora?\n\n0:36:03\tSPEAKER_08\n So English, the finish and Italian are Aurora.\n\n0:36:08\tSPEAKER_08\n And Spanish and French is something that we can use in addition to Aurora.\n\n0:36:14\tSPEAKER_08\n What?\n\n0:36:15\tSPEAKER_05\n Yes, the German brother, Spanish and stuff on both the French.\n\n0:36:29\tSPEAKER_07\n Okay.\n\n0:36:31\tSPEAKER_07\n And...\n\n0:36:33\tSPEAKER_07\n Oh, yeah.\n\n0:36:35\tSPEAKER_07\n Is it French French or Belgian?\n\n0:36:37\tSPEAKER_07\n It's French French.\n\n0:36:39\tSPEAKER_00\n French French.\n\n0:36:40\tSPEAKER_00\n French French.\n\n0:36:47\tSPEAKER_00\n French French.\n\n0:36:48\tSPEAKER_05\n I think that is more important than French French.\n\n0:36:53\tSPEAKER_05\n Yeah, probably.\n\n0:36:54\tSPEAKER_05\n Yeah.\n\n0:36:55\tSPEAKER_05\n Yeah, everybody always insists the Belgium is absolutely pure French.\n\n0:36:58\tSPEAKER_05\n But he says those pre-easions talk about it.\n\n0:37:04\tSPEAKER_05\n He likes Belgian fries too.\n\n0:37:10\tSPEAKER_07\n And then we have a broader corpus like Timit.\n\n0:37:22\tSPEAKER_07\n Timit's so far.\n\n0:37:23\tSPEAKER_07\n Spanish.\n\n0:37:24\tSPEAKER_07\n Spanish stories.\n\n0:37:27\tSPEAKER_00\n I buy you tea.\n\n0:37:29\tSPEAKER_07\n What about TI digit?\n\n0:37:32\tSPEAKER_07\n All these Aurora data is derived from TI digits.\n\n0:37:39\tSPEAKER_07\n Basically, they corrupted it with different kinds of noises at different SNR levels.\n\n0:37:49\tSPEAKER_05\n And I think Stefan was saying there's some broader material in the French also.\n\n0:37:53\tSPEAKER_05\n Yeah, we could use it.\n\n0:37:55\tNone\n Okay.\n\n0:37:56\tSPEAKER_00\n French data.\n\n0:37:58\tSPEAKER_00\n Spanish stories.\n\n0:38:00\tSPEAKER_07\n Spanish.\n\n0:38:02\tSPEAKER_07\n Spanish something.\n\n0:38:04\tSPEAKER_07\n Yeah.\n\n0:38:05\tSPEAKER_07\n Okay.\n\n0:38:06\tSPEAKER_03\n The Aurora people actually corrupted themselves or just specifies a signal on signal noise ratio.\n\n0:38:14\tSPEAKER_07\n They corrupted it themselves, but they also included the noise files for us, right?\n\n0:38:21\tSPEAKER_07\n Yeah.\n\n0:38:22\tSPEAKER_07\n So we can go ahead and corrupt other things.\n\n0:38:25\tSPEAKER_05\n I'm just curious to come here.\n\n0:38:26\tSPEAKER_05\n I mean, I couldn't tell if you were joking or is it Mexican Spanish?\n\n0:38:29\tSPEAKER_05\n No, no, no.\n\n0:38:30\tSPEAKER_00\n Oh, no, no.\n\n0:38:31\tSPEAKER_05\n Spanish is Spanish.\n\n0:38:32\tSPEAKER_05\n Spanish is Spanish.\n\n0:38:33\tSPEAKER_05\n Spanish is Spanish.\n\n0:38:34\tSPEAKER_07\n Okay.\n\n0:38:35\tNone\n Spanish is Spanish.\n\n0:38:36\tSPEAKER_05\n Spanish is Spanish.\n\n0:38:37\tSPEAKER_05\n Spanish is Spanish.\n\n0:38:38\tSPEAKER_05\n Yeah, we're really covered.\n\n0:38:39\tSPEAKER_05\n Okay.\n\n0:38:40\tSPEAKER_05\n Yeah, no different.\n\n0:38:42\tSPEAKER_08\n Yes.\n\n0:38:43\tSPEAKER_08\n From Paris.\n\n0:38:44\tSPEAKER_08\n Oh, from Paris.\n\n0:38:46\tSPEAKER_08\n Yeah.\n\n0:38:47\tSPEAKER_07\n Timit's from lots of different places.\n\n0:38:57\tSPEAKER_05\n It's from Texas.\n\n0:39:00\tSPEAKER_04\n It's from Texas.\n\n0:39:01\tSPEAKER_05\n It's not really from the US either.\n\n0:39:06\tSPEAKER_07\n Okay.\n\n0:39:07\tSPEAKER_07\n And within the training corpus, we're thinking about training with noise.\n\n0:39:15\tSPEAKER_07\n So incorporating the same kinds of noises that Aurora is incorporating in their training corpus.\n\n0:39:24\tSPEAKER_07\n I don't think we were given the unseen noise conditions.\n\n0:39:30\tSPEAKER_05\n I think what they were saying was that for this next test, there's going to be some of the cases where they have the same type of noises you were given beforehand, and in some cases where you're not.\n\n0:39:43\tSPEAKER_07\n Okay.\n\n0:39:44\tSPEAKER_05\n So presumably that'll be part of the topic of analysis of the test results.\n\n0:39:48\tSPEAKER_05\n How will you do when it's matching noise?\n\n0:39:50\tSPEAKER_05\n How will you do when it's not?\n\n0:39:52\tSPEAKER_05\n Right.\n\n0:39:53\tSPEAKER_07\n I think that's right.\n\n0:39:54\tSPEAKER_07\n So I guess we can't train on the unseen noise conditions.\n\n0:39:58\tSPEAKER_07\n Well, it matters.\n\n0:39:59\tSPEAKER_05\n Not seen.\n\n0:40:00\tSPEAKER_07\n It matters, yeah.\n\n0:40:01\tSPEAKER_06\n Yeah.\n\n0:40:02\tSPEAKER_05\n I mean, it does seem to me that a lot of times when you train with something that's at least a little bit noisy, it can help you out in other kinds of noise, even if it's not matching, just because there's some more variance that you've built into things.\n\n0:40:19\tSPEAKER_05\n But exactly how well your work will, how near it is to what you have at the time.\n\n0:40:28\tSPEAKER_05\n Okay, so that's your training corpus and then your testing corpus?\n\n0:40:33\tSPEAKER_07\n The testing corpus are just the same one that's oral testing.\n\n0:40:40\tSPEAKER_07\n And that includes the English, Italian, Finnish.\n\n0:40:58\tSPEAKER_07\n We're going to get German, right?\n\n0:41:04\tSPEAKER_05\n Well, so yeah, the final test on the English.\n\n0:41:10\tSPEAKER_07\n The Spanish perhaps?\n\n0:41:12\tSPEAKER_07\n Oh, yeah, we can test on the Spanish.\n\n0:41:14\tSPEAKER_08\n But the oral test.\n\n0:41:16\tSPEAKER_05\n Oh, yeah.\n\n0:41:18\tSPEAKER_05\n Oh, there's Spanish testing in Europe.\n\n0:41:21\tSPEAKER_08\n Not yet, but...\n\n0:41:23\tSPEAKER_00\n Yeah, it's providing.\n\n0:41:25\tSPEAKER_08\n They're preparing it.\n\n0:41:26\tSPEAKER_08\n Well, according to Hineki, it would be good at this at the end of November.\n\n0:41:35\tSPEAKER_05\n Okay, so I think like seven things in each column, so that's 343 different systems that are going to be developed.\n\n0:41:47\tSPEAKER_05\n There's three of you.\n\n0:41:49\tSPEAKER_01\n 100.\n\n0:41:50\tSPEAKER_01\n What about noise conditions?\n\n0:41:53\tSPEAKER_01\n What?\n\n0:41:56\tSPEAKER_05\n Don't we need to put in the column for noise conditions?\n\n0:42:00\tSPEAKER_07\n You're just trying to be difficult.\n\n0:42:03\tSPEAKER_07\n Well, when I put these testings on there, I'm assuming there's three tests.\n\n0:42:10\tSPEAKER_07\n Type A, type B and type C.\n\n0:42:14\tSPEAKER_07\n And they're all going to be tested with one training of the HTK system.\n\n0:42:20\tSPEAKER_07\n Test all three different types of noise conditions.\n\n0:42:23\tSPEAKER_07\n Test A is like a match, noise.\n\n0:42:25\tSPEAKER_07\n Test B is a slightly mismatched.\n\n0:42:27\tSPEAKER_07\n And test C is a mismatched channel.\n\n0:42:31\tSPEAKER_01\n And do we do all our training on clean data?\n\n0:42:36\tSPEAKER_07\n No, no, no.\n\n0:42:37\tSPEAKER_07\n We're going to be training on the noise files that we do have.\n\n0:42:44\tSPEAKER_05\n So, yeah, so I guess the question is how long does it take to do a training?\n\n0:42:50\tSPEAKER_05\n I mean, it's not totally crazy.\n\n0:42:53\tSPEAKER_05\n I mean, a lot of these are built-in things.\n\n0:42:55\tSPEAKER_05\n We know we have programs that compute POP, we have MSG, we have JVET.\n\n0:42:58\tSPEAKER_05\n You know, a lot of these things, which is kind of how people take in a huge amount of developments, just trying it out.\n\n0:43:04\tSPEAKER_05\n So we actually can't be quite a few experiments.\n\n0:43:06\tSPEAKER_05\n But how long does it take?\n\n0:43:09\tSPEAKER_05\n We think one of these trainings.\n\n0:43:15\tSPEAKER_02\n That's a good question.\n\n0:43:16\tSPEAKER_02\n What about combinations of them?\n\n0:43:18\tSPEAKER_05\n Oh, yeah, that's right.\n\n0:43:20\tSPEAKER_05\n I mean, because so, for instance, I think the major advantage of MSG, yeah.\n\n0:43:24\tSPEAKER_05\n What's the point?\n\n0:43:25\tSPEAKER_05\n The major advantage of MSG, I see that we've seen in the past, is combined with POP.\n\n0:43:35\tSPEAKER_07\n Now this is turning into a fourth dimensional queue.\n\n0:43:40\tSPEAKER_02\n Oh, you just select multiple things on the one dimension.\n\n0:43:44\tSPEAKER_07\n Oh, yeah, okay.\n\n0:43:46\tSPEAKER_05\n Yeah, so I mean, you don't want to see seven cheeses too.\n\n0:43:58\tSPEAKER_05\n POP is 21.\n\n0:44:00\tSPEAKER_05\n Different combinations.\n\n0:44:03\tSPEAKER_03\n It's not a complete set of combinations, don't we?\n\n0:44:05\tSPEAKER_03\n What?\n\n0:44:06\tSPEAKER_03\n It's not a complete set of combinations, though.\n\n0:44:08\tSPEAKER_06\n Yeah, I hope not.\n\n0:44:09\tSPEAKER_07\n Yeah, that would be...\n\n0:44:11\tSPEAKER_05\n Yeah, so POP and MSG, I think we definitely want to try, because we've had a lot of good experience with putting this together.\n\n0:44:23\tSPEAKER_02\n When you do that, you're increasing the size of the inputs to the net.\n\n0:44:26\tSPEAKER_02\n Do you have to...\n\n0:44:27\tSPEAKER_02\n Well, so it doesn't increase the number of trainings.\n\n0:44:31\tSPEAKER_02\n I'm just wondering about number of parameters in the net.\n\n0:44:34\tSPEAKER_02\n Do you have to worry about keeping that the same length?\n\n0:44:37\tSPEAKER_05\n I don't think so.\n\n0:44:38\tSPEAKER_04\n There's a computation limit, doesn't it?\n\n0:44:40\tSPEAKER_04\n Yeah, I mean, just more computation.\n\n0:44:42\tSPEAKER_04\n Excuse me?\n\n0:44:43\tSPEAKER_04\n Isn't there like a limit on the computation, or latency, or something like that, for a large amount?\n\n0:44:47\tSPEAKER_05\n Oh, yeah, we haven't talked about that in a new then, and all that.\n\n0:44:50\tSPEAKER_05\n Yeah.\n\n0:44:51\tSPEAKER_05\n So it's not really a limit.\n\n0:44:52\tSPEAKER_05\n What it is is that there's...\n\n0:44:54\tSPEAKER_05\n There's a...\n\n0:44:55\tSPEAKER_05\n Just...\n\n0:44:56\tSPEAKER_05\n If you're using a megabyte, then I'll say that's very nice, but of course, you will remember growing a cheap cell phone.\n\n0:45:04\tSPEAKER_05\n And I think the computation isn't so much a problem.\n\n0:45:11\tSPEAKER_05\n I think it's more than that, right?\n\n0:45:13\tSPEAKER_05\n And the expensive cell phones, expensive handhelds, and so forth, are going to have lots of memory.\n\n0:45:19\tSPEAKER_05\n So it's just that, as people see, the cheap cell phones is being the biggest market.\n\n0:45:25\tSPEAKER_05\n So...\n\n0:45:26\tSPEAKER_05\n But yeah, I was just realizing that actually it doesn't explode out.\n\n0:45:32\tSPEAKER_05\n It's not only through the cell, but it's...\n\n0:45:39\tSPEAKER_05\n But it doesn't really explode out the number of trainings, because these are all trained individually.\n\n0:45:46\tSPEAKER_05\n And so if you have all of these nets trained in some place, then you can combine their outputs and do the care transformation and so forth.\n\n0:45:59\tSPEAKER_05\n And so what it uploads out is the number of test things.\n\n0:46:06\tSPEAKER_05\n And the number of times you do that last part, that last part I think is so...\n\n0:46:10\tSPEAKER_05\n It's got to be pretty quick.\n\n0:46:13\tSPEAKER_05\n And it's just running the data through...\n\n0:46:17\tSPEAKER_02\n Well, you got to do the care transformation.\n\n0:46:19\tSPEAKER_02\n What about a net that's trained on multiple languages?\n\n0:46:22\tSPEAKER_02\n Is that just separate nets for each language, then combined, or is that actually one net trained?\n\n0:46:27\tSPEAKER_08\n Probably one net.\n\n0:46:30\tSPEAKER_08\n One would think one.\n\n0:46:34\tSPEAKER_05\n But I don't think we tested that.\n\n0:46:39\tSPEAKER_08\n So in the broader training course, we can use the three or combinations of two languages.\n\n0:46:53\tSPEAKER_02\n In one net.\n\n0:46:57\tSPEAKER_05\n Yeah, so I guess the first thing is, if we know how long a training takes, if we can train up all these combinations, then we can start working on testing of them individually and in combination.\n\n0:47:15\tSPEAKER_05\n And putting them in combination, I think is not as much a computationally as they're training with the net in the first place.\n\n0:47:30\tSPEAKER_08\n It's not too much.\n\n0:47:33\tSPEAKER_08\n But there is a testicle, so it's nice training.\n\n0:47:39\tSPEAKER_05\n It's a lot of things to learn.\n\n0:47:46\tSPEAKER_05\n How long does it take for an APK training?\n\n0:47:49\tSPEAKER_08\n It's around six or so, I think.\n\n0:47:53\tSPEAKER_00\n For training at this thing?\n\n0:47:56\tSPEAKER_00\n For the Italian, maybe one day.\n\n0:48:02\tSPEAKER_00\n Running on what?\n\n0:48:06\tSPEAKER_05\n I don't know what is the value.\n\n0:48:11\tSPEAKER_05\n I don't know what the value is.\n\n0:48:16\tSPEAKER_04\n I don't know.\n\n0:48:20\tSPEAKER_04\n I don't know.\n\n0:48:24\tSPEAKER_08\n It's not so long because the data is about 30 yards of speech.\n\n0:48:40\tSPEAKER_05\n There's no way we can begin to do any significant amount here unless we use multiple machines.\n\n0:48:57\tSPEAKER_05\n What machines are fast, what machines are used a lot, are we still using P-Make?\n\n0:49:12\tSPEAKER_05\n Once you get the basic thing set up, you have all these combinations.\n\n0:49:30\tSPEAKER_08\n I would say two days.\n\n0:49:37\tSPEAKER_00\n I think you folks are probably the only ones using it.\n\n0:49:47\tSPEAKER_05\n It's faster to do it on the spurred board.\n\n0:49:55\tSPEAKER_05\n It's still a little faster on the spurred board.\n\n0:50:13\tSPEAKER_07\n Adam did some testing.\n\n0:50:21\tSPEAKER_07\n You run on a spurred and then you can do other things on your computer.\n\n0:50:27\tSPEAKER_05\n You could set up 10 different jobs on spurred boards and have 10 other jobs running on different computers.\n\n0:50:39\tSPEAKER_05\n It's going to take that sort of thing.\n\n0:50:47\tSPEAKER_05\n I kind of like this because we have very limited time.\n\n0:50:57\tSPEAKER_05\n We have quite a bit of computational resource available.\n\n0:51:05\tSPEAKER_05\n We can look across the institute and now a little things are being used.\n\n0:51:19\tSPEAKER_05\n We've gotten before about voice-down voice silence, detection features, and I think it's a great thing to go to.\n\n0:51:37\tSPEAKER_05\n I like about this.\n\n0:51:57\tSPEAKER_05\n This is what you're thinking of doing in short terms.\n\n0:52:07\tSPEAKER_05\n Adam sort out about what's the best way to really attack this as a mass problem in terms of using many machines.\n\n0:52:27\tSPEAKER_05\n We can then present to them what it is that we're doing.\n\n0:52:41\tSPEAKER_05\n We can pull things out of this list that we think they are doing sufficiently.\n\n0:53:01\tSPEAKER_07\n How they go to the net trade region?\n\n0:53:11\tSPEAKER_07\n For the net trade on digits, we have been using 400 border hidden units.\n\n0:53:21\tSPEAKER_07\n The digit's nets will be correspond to about 20 phonemes.\n\n0:53:33\tSPEAKER_07\n We're actually broader classes, actually finer classes.\n\n0:53:53\tSPEAKER_00\n Carmen, did you have something else to add?\n\n0:54:03\tSPEAKER_00\n I tried to do a different thing with the HTG program.\n\n0:54:23\tSPEAKER_05\n I don't know what is better if you look at us or J. Rasta.\n\n0:54:37\tSPEAKER_05\n J. Rasta is more complicated.\n\n0:54:57\tSPEAKER_05\n J. Rasta is more complicated.\n\n0:55:17\tSPEAKER_05\n There are more ways that it can go wrong.\n\n0:55:27\tSPEAKER_00\n I think to recognize the Italian digit with the NetWorps and also to try another NetWorps with the Spanish digit.\n\n0:55:53\tSPEAKER_00\n The data base was at difficult work last week with the level of time that I have the difference with the level of time.\n\n0:56:29\tSPEAKER_05\n I'm sorry.\n\n0:56:39\tSPEAKER_00\n The Spanish level was in different formats for the program to train the NetWorps.\n\n0:56:59\tSPEAKER_00\n You just have to be properly converting the labels.\n\n0:57:19\tSPEAKER_00\n I don't know what I asked to do.\n\n0:57:39\tSPEAKER_00\n I think that with LiveCat I can transfer to ACS format.\n\n0:57:53\tSPEAKER_00\n I want to put ACS format to ACS format and then use LiveCat to do that.\n\n0:58:13\tSPEAKER_05\n It seems like there are some peculiarities of the dimensions that are getting sorted out.\n\n0:58:37\tSPEAKER_05\n We have a lot more computation.\n\n0:58:55\tSPEAKER_05\n I was thinking two things.\n\n0:59:13\tSPEAKER_07\n I thought of this as not in stages but more on the time axis.\n\n0:59:33\tSPEAKER_05\n I was thinking of how much you can realistically do.\n\n0:59:53\tSPEAKER_05\n I was thinking of how much you can do.\n\n1:00:13\tSPEAKER_05\n I still think we could do a lot of it.\n\n1:00:33\tSPEAKER_07\n The second thing was about scratch space.\n\n1:00:51\tSPEAKER_05\n I want to clarify my point about that.\n\n1:01:11\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:01:31\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:01:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:02:11\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:02:31\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:02:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:03:11\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:03:31\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:03:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:04:11\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:04:31\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:04:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:05:11\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:05:31\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:05:51\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:06:11\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:06:31\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:06:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:07:11\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:07:31\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:07:51\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:08:11\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:08:31\tSPEAKER_02\n I want to clarify my point about how much you can do.\n\n1:08:51\tSPEAKER_08\n I want to clarify my point about how much you can do.\n\n1:09:11\tSPEAKER_08\n I want to clarify my point about how much you can do.\n\n1:09:31\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:09:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:10:11\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:10:31\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:10:51\tSPEAKER_05\n I want to clarify my point about how much you can do.\n\n1:11:11\tSPEAKER_05\n The last topic I had here was Dave's fine offer to do something.\n\n1:11:31\tSPEAKER_05\n I was thinking perhaps if additionally to all this experiment with this not really research,\n\n1:11:59\tSPEAKER_08\n it's not really research, but it's running programs. The closer look at the speed noise detection or voice sound detection.\n\n1:12:29\tSPEAKER_02\n The thing that Sue Neill was talking about with the labels, the thing that was running through these models very quickly,\n\n1:13:01\tSPEAKER_05\n and maybe that's the only problem I have with it is the same reason why I thought it would be a good thing to do. Let's fall back to that.\n\n1:13:21\tSPEAKER_05\n That's good.\n\n1:13:31\tSPEAKER_05\n What an additional clever person could help with when we're really in crunch or time.\n\n1:13:41\tSPEAKER_05\n So over the years, if he's interested in voice and voice silencing, he could do a lot.\n\n1:14:01\tSPEAKER_05\n I think it's a good thing to do with the holidays and the middle of it to get a lot done.\n\n1:14:11\tSPEAKER_05\n The very fact that it is just work and it's running programs and so forth is exactly why it's possible that some piece of it could be handed to someone to do because it's not.\n\n1:14:21\tSPEAKER_05\n That's a question. We don't have to solve it right this second, but we can think of some piece that's well defined that he could help with.\n\n1:14:33\tSPEAKER_02\n What about training up a multilingual map?\n\n1:14:41\tSPEAKER_00\n It's good to have the label between them and Spanish or something like that.\n\n1:14:51\tSPEAKER_05\n So what we were just saying was that I was arguing for if possible coming up with something that really was development and wasn't research because we have a time crunch.\n\n1:15:19\tSPEAKER_05\n So if there's something that would save some time for someone else to do, then we should think of that first.\n\n1:15:29\tSPEAKER_05\n So I think that's the only way to do a core job is to do a core job.\n\n1:15:49\tSPEAKER_05\n So I think that's the only way to do a core job is to do a core job.\n\n1:15:59\tSPEAKER_05\n And the other tricky thing is that we are, even though we don't have a strict prohibition on memory size and computation and complexity, clearly there's a limitation to it.\n\n1:16:21\tSPEAKER_05\n So I think that's one of the very important things to do with the organization, at least some kind of harmonic, or something.\n\n1:16:31\tSPEAKER_05\n This is another whole thing, take a while to develop.\n\n1:16:35\tSPEAKER_05\n And then one of the things along with current speech recognition is that we really use the whole way of the harmonious information.\n\n1:16:53\tSPEAKER_05\n So I think the other suggestion just came up was what about having worked on the multi-lingual super-set and coming up with that and training and that on that.\n\n1:17:21\tSPEAKER_05\n Is that our multiple database? What would you think? What would this task consist of?\n\n1:17:31\tSPEAKER_08\n Yeah, it would consist in creating the super-set, modifying the labels for matching the super-set.\n\n1:17:51\tSPEAKER_05\n So you're creating the changing labels on timid or on multiple languages? Yeah, with the treated languages.\n\n1:18:01\tSPEAKER_07\n So you have to create a mapping from each language to the super-set.\n\n1:18:21\tSPEAKER_07\n So you have a machine readable IPA sort of thing. And they have a website that Stefan was showing us has all the English phonemes and their Sampa correspondent phonemes.\n\n1:18:41\tSPEAKER_07\n And then they have Spanish and German have all sorts of languages mapping to the Sampa phonemes.\n\n1:18:51\tSPEAKER_00\n You're comparing the Sampa's version to Albaist.\n\n1:19:11\tSPEAKER_02\n international. No, it's it's saying that you use a special die critical stuff which you can't you can't print out a husky. So the sample is just mapping. Got it. What does OGI\n\n1:19:23\tSPEAKER_05\n have done anything about this issue? Do they have do they have any kind of\n\n1:19:28\tSPEAKER_08\n superset they already have? I don't think so well. They they're going actually the other way defining funny blisters. So they just throw the speech from all\n\n1:19:48\tSPEAKER_02\n different languages together then clustered in the 60 or 50 or whatever. I think they've\n\n1:19:54\tSPEAKER_08\n not done it during multiple language yet but what they did is to training English nets with all the phonemes and then training English nets with kind of 17 I think it was 70 automatic root glasses. Yeah automatically dried but yeah I think so. And the result was that apparently when testing on cross language it was better but you didn't add didn't have all the results when you showed me that\n\n1:20:28\tSPEAKER_05\n but so that doesn't make an interesting question though. Is there some way that we should tie into that? Right I mean if if in fact that is a better thing to do should we have the training with our own categories and now we're saying well how do we have to cross language in one way is to come to the superset but they're trying to come up with clusters.\n\n1:21:08\tSPEAKER_05\n Do we think there's something wrong with that? I think it does something wrong with\n\n1:21:12\tSPEAKER_08\n okay well because well for a moment we're testing on digits perhaps you using broad phonemes classes it's okay for classifying your digits but as soon as you will have more words words can differ with only a single phonemes which could be the same class. So\n\n1:21:35\tSPEAKER_05\n right although you are not using this for the future generation. Yeah but you will ask the net to put\n\n1:21:47\tSPEAKER_02\n a one for the plus so you're saying there may not be enough information coming out of a net to\n\n1:21:56\tSPEAKER_03\n help discriminate the words. Like most confusions are with it from classes. I think\n\n1:22:04\tSPEAKER_04\n Larry was saying like obstetricians are only confused with obstetricians. So maybe we could look\n\n1:22:14\tSPEAKER_07\n at articulatory. Did they not do that? I don't think so. They were looking at both\n\n1:22:23\tSPEAKER_05\n phonemes but they were talking about it but that sort of a question of what they did because that's the other route to go. So suppose you don't really market it to really market your features you really want to look at the acoustics and see where we can get them. So the second class way of doing it is to look at the phones that are labeled and translate them into acoustic and articulatory features. It won't really be right you won't have these\n\n1:22:57\tSPEAKER_02\n old and laughing things. So the targets of the net are these articulatory features. Right. But that implies that you can have more than one honor at a time.\n\n1:23:05\tSPEAKER_05\n That's right. You either do that or you have an fulfillment.\n\n1:23:07\tSPEAKER_05\n I see. And I don't know if our software, if the version of the quick net that we're using allows for that.\n\n1:23:18\tSPEAKER_07\n Do you know? It allows for multiple targets being one.\n\n1:23:22\tSPEAKER_07\n We have gotten soft targets to work.\n\n1:23:27\tSPEAKER_05\n To work that way. Yeah. Okay. So that's another thing that could be that.\n\n1:23:33\tSPEAKER_05\n We could just translate instead of translating to a superset just translate to a articulatory feature. So the articulatory features are training that.\n\n1:23:43\tSPEAKER_05\n The fact even though it's a smaller number, it's still fine because you have the combinations.\n\n1:23:50\tSPEAKER_05\n So in fact it has every distinction in it.\n\n1:23:54\tSPEAKER_05\n But you should go across on your just.\n\n1:23:58\tSPEAKER_02\n We do an interesting thing. It's very not a fact too.\n\n1:24:00\tSPEAKER_02\n We could, if you had the phone labels you could replace them by their articulatory features and then feed in a vector with those things turned on based on what there's supposed to be for each phone.\n\n1:24:18\tSPEAKER_02\n Let's see if it's a big win. Do you know what I'm saying?\n\n1:24:24\tSPEAKER_02\n So I mean if your net is going to be outputting a vector of basically well it's going to have probabilities but let's say they were ones and zeros then you know for each.\n\n1:24:36\tSPEAKER_02\n I don't know if you know this for your testing data but if you know for your test data what the string of phones is and you have them aligned then you can just instead of going through the net just create the vector for each phone and feed that in to see if that data helps.\n\n1:24:58\tSPEAKER_02\n Let me think about this as I was talking with TNIC and he said that there was a guy at AT&T who spent 18 months working on a single feature and because they had done some cheating experiments.\n\n1:25:08\tSPEAKER_05\n This was the guy that we were just talking that we saw in campus who's the lawyer's fault.\n\n1:25:14\tSPEAKER_05\n He was on our hands.\n\n1:25:15\tSPEAKER_05\n Right okay.\n\n1:25:16\tSPEAKER_02\n So he was doing it.\n\n1:25:17\tSPEAKER_02\n And they had done a cheating experiment or something right?\n\n1:25:19\tSPEAKER_02\n He didn't mention that part.\n\n1:25:21\tSPEAKER_02\n But he said that I guess before they had him work on this they had done some experiment where if they could get that one feature right it dramatically improved the results I was thinking you know if you think about this that it would be interesting experiment just to see you know if you did get all of those right.\n\n1:25:37\tSPEAKER_05\n Should be because if you get all of them in there that defines all of the phones that's the squirtle I'm saying.\n\n1:25:41\tSPEAKER_05\n Right and you've got all the phones right so that doesn't help us.\n\n1:25:46\tSPEAKER_05\n Oh yeah it would be an interesting cheating experiment because we are using it in this funny way we're converting it into features.\n\n1:25:52\tSPEAKER_02\n And then you also don't know what error they've got on the HTK side you know it sort of gives you the best you could hope for.\n\n1:26:02\tSPEAKER_04\n The soft training of the nets still requires the vector to sum to one.\n\n1:26:08\tSPEAKER_04\n This one up to one.\n\n1:26:09\tSPEAKER_04\n So you can't really feed it like two articulatory features that are on at the same time with ones because it will kind of normalize them down to one half or something like that.\n\n1:26:19\tSPEAKER_08\n But the rest you have destroyed the binon.\n\n1:26:22\tSPEAKER_08\n Not many areas.\n\n1:26:23\tSPEAKER_08\n You know you can use it.\n\n1:26:25\tSPEAKER_07\n It's a six.\n\n1:26:28\tSPEAKER_07\n No it's actually sigmoid x.\n\n1:26:30\tSPEAKER_08\n So if you choose sigmoids.\n\n1:26:32\tSPEAKER_07\n I think apparently the linear outputs.\n\n1:26:40\tSPEAKER_04\n Linear outputs?\n\n1:26:41\tSPEAKER_04\n No what you want.\n\n1:26:42\tSPEAKER_04\n If you're going to do a KL transfer mod.\n\n1:26:46\tSPEAKER_07\n Right.\n\n1:26:47\tSPEAKER_07\n Right.\n\n1:26:48\tSPEAKER_07\n But during the training we're trained on sigmoid x and then at the end just chop off the final non-miniarity.\n\n1:26:58\tSPEAKER_05\n We're up there.\n\n1:27:00\tSPEAKER_05\n Oh no.\n\n1:27:01\tSPEAKER_05\n OK.\n\n1:27:18\tNone\n Really fun.\n\n1:27:22\tNone\n Yes.\n\n", "summary": [{"summary_text": "SPEAKER and his friends are going to do the challenge. They will do their digits. Transcripts are: 1311-1330, 323-4765, 531-6241, 5069-4, 74857-9615-07802, 090-90-604001, 3097, 5267-983, 6706, 0931003, 03696."}]}