{"filename": "./data/Bro013.txt", "transcript": "0:00:00\tNone\n We're going.\n\n0:00:07\tNone\n Okay.\n\n0:00:10\tNone\n Close your door.\n\n0:00:15\tSPEAKER_05\n Thanks.\n\n0:00:18\tSPEAKER_05\n Door in the way up.\n\n0:00:22\tSPEAKER_05\n Yeah, I'm going to get this other door.\n\n0:00:25\tSPEAKER_05\n Okay.\n\n0:00:32\tSPEAKER_05\n So, what are we talking about today?\n\n0:00:40\tSPEAKER_03\n Well, first of all, perhaps these meeting record or digits?\n\n0:00:45\tSPEAKER_05\n Oh, yeah.\n\n0:00:46\tSPEAKER_05\n That was kind of interesting.\n\n0:00:48\tSPEAKER_05\n Both the SRI system and for one thing, that sure shows the difference between having a lot of training data or not.\n\n0:01:01\tSPEAKER_05\n The best kind of number we have on English, on near microphone only is 3 or 4%.\n\n0:01:11\tSPEAKER_05\n And it's significantly better than that using fairly simple front ends on the SRI system.\n\n0:01:23\tSPEAKER_05\n So, I think that that's using pretty huge amount of data.\n\n0:01:30\tSPEAKER_05\n Mostly not digits, of course, but then again, well, yeah, in fact, mostly not digits.\n\n0:01:35\tSPEAKER_05\n So, in this case, what is this using digits in the digital image?\n\n0:01:42\tSPEAKER_05\n Did anybody mention about whether the SRI system is doing the digits?\n\n0:01:50\tSPEAKER_05\n The word as a word model or as a sub-phone.\n\n0:01:56\tSPEAKER_03\n I guess it's a lot of fault models.\n\n0:02:01\tSPEAKER_03\n Yeah, I think so because it's very huge system.\n\n0:02:06\tSPEAKER_03\n But so, there is one difference.\n\n0:02:08\tSPEAKER_03\n Well, the SRI system, the result for the SRI system that are presented here are with adaptation.\n\n0:02:13\tSPEAKER_03\n So, there is a complete system including online, supervised adaptation.\n\n0:02:21\tSPEAKER_03\n If you don't use adaptation, the error rate is around 50% more.\n\n0:02:30\tSPEAKER_05\n Okay, is that much?\n\n0:02:33\tSPEAKER_03\n Yeah, it's quite significant.\n\n0:02:37\tSPEAKER_05\n Still.\n\n0:02:39\tSPEAKER_05\n But what I think I'd be interested to do given that is that we should take, I guess, as somebody is going to do this right, is to take some of these tandem things, feed it into the SRI system.\n\n0:02:52\tSPEAKER_03\n Yeah.\n\n0:02:54\tSPEAKER_03\n Yeah, because...\n\n0:02:56\tSPEAKER_03\n But I guess the main point is the data because I'm not sure or back down this is very simple, but still know what the attempts to improve it, that's a thing that what I mean.\n\n0:03:10\tSPEAKER_03\n Which I tried to do.\n\n0:03:13\tSPEAKER_05\n Yeah, but he's doing with the same data, right?\n\n0:03:16\tSPEAKER_05\n So there's two things to be infected.\n\n0:03:19\tSPEAKER_05\n One is that there's something simple that's wrong with the back end, playing number states.\n\n0:03:24\tSPEAKER_05\n I don't know if he got to the point of playing with the number of Gaussian's.\n\n0:03:29\tSPEAKER_05\n But, you know, but yeah, so far he hadn't gotten any improvement, but that's all with the same data, which is pretty small.\n\n0:03:41\tSPEAKER_03\n So you could retrain some of these tandem?\n\n0:03:45\tSPEAKER_05\n Well, you could do that, but I'm saying even with that part not retrained.\n\n0:03:50\tSPEAKER_05\n Just using having the HMMs, much better HMMs, yeah.\n\n0:03:58\tSPEAKER_05\n But just train those HMMs using different features, features coming from RRAS now.\n\n0:04:05\tSPEAKER_03\n But what would be interesting to see also is perhaps it's not really the amount of data but the recording conditions, I don't know, because it's probably not the problem of noise, because our features are supposed to be robust today.\n\n0:04:20\tSPEAKER_03\n It's not the problem of channel because there is normalization with respect to the channel.\n\n0:04:27\tSPEAKER_05\n So, I'm sorry, what is the problem that you're trying to explain?\n\n0:04:33\tSPEAKER_03\n The fact that the result with the tandem or a system model.\n\n0:04:37\tSPEAKER_03\n So much worse?\n\n0:04:38\tSPEAKER_03\n No, so much worse.\n\n0:04:39\tSPEAKER_05\n Oh, but I'm almost certain that it has to do with the amount of training data.\n\n0:04:50\tSPEAKER_05\n It's orders of magnitude on.\n\n0:04:54\tSPEAKER_03\n Yeah, but retrained on the own digits and it's a digit task.\n\n0:04:58\tSPEAKER_05\n But having a huge, if you look at what commercial places do, they use a huge amount of data.\n\n0:05:03\tSPEAKER_05\n This is a modest amount of data.\n\n0:05:06\tSPEAKER_05\n So, ordinarily you would say, well given that you have enough occurrences of the digits, you can just train the digits rather than with it.\n\n0:05:14\tSPEAKER_05\n But the thing is if you have a huge, you know, the word models, but if you have a huge amount of data, then you're going to have many occurrences of similar to the alpha one.\n\n0:05:24\tSPEAKER_05\n And that's just a huge amount of training point.\n\n0:05:30\tSPEAKER_05\n So, I think it has to be that because as you say, this is near microphone.\n\n0:05:35\tSPEAKER_05\n It's really pretty clean data.\n\n0:05:38\tSPEAKER_05\n Now, some of it could be the fact that, let's see, in these multi-trained things, did we include noisy data in the training?\n\n0:05:47\tSPEAKER_05\n I mean, that could be hurting us actually for the quick.\n\n0:05:49\tSPEAKER_03\n Yeah, actually we see that the clean train for proposals are better.\n\n0:05:55\tSPEAKER_05\n It is better.\n\n0:05:56\tSPEAKER_05\n Yeah, because this is clean data.\n\n0:05:58\tSPEAKER_05\n So, that's not too surprising.\n\n0:06:01\tSPEAKER_03\n But, I guess what I meant is that, well, let's say if we add enough data to train on the meeting record digits, I guess we could have better examples of this.\n\n0:06:18\tSPEAKER_03\n What I meant is that perhaps you can learn something from this, what's wrong?\n\n0:06:26\tSPEAKER_03\n What is different between the IDGids and these digits?\n\n0:06:30\tSPEAKER_05\n What kind of numbers are we getting on the IDGids?\n\n0:06:33\tSPEAKER_03\n It's 0.8 persons.\n\n0:06:38\tSPEAKER_05\n Oh, I see.\n\n0:06:39\tSPEAKER_05\n So, on the actual TIDGIDGID database, we're getting 28 percent.\n\n0:06:43\tSPEAKER_05\n And here we're getting three or three, let's say three for this.\n\n0:06:47\tSPEAKER_05\n Yeah, sure.\n\n0:06:49\tSPEAKER_05\n But I mean 0.8 percent is something like double or triple, what people have gotten who have worked very hard at doing that.\n\n0:07:02\tSPEAKER_05\n And also, as you point out, there's adaptation in these numbers also.\n\n0:07:05\tSPEAKER_05\n So, if you put the adaptation off, then for the English near, you get something like 2 percent.\n\n0:07:12\tSPEAKER_05\n And here you had something like 3.4.\n\n0:07:15\tSPEAKER_05\n And I could easily see that difference coming from this huge amount of data that was trained on.\n\n0:07:21\tSPEAKER_05\n So, I don't think there's anything magical here.\n\n0:07:24\tSPEAKER_05\n It's a simple HGK system with a modest amount of data.\n\n0:07:27\tSPEAKER_05\n And this is a modern system.\n\n0:07:31\tSPEAKER_05\n It has a lot of nice points to it.\n\n0:07:36\tSPEAKER_05\n So, the HGK is an older HGK, you know, so.\n\n0:07:40\tSPEAKER_05\n Yeah, it's not that surprising.\n\n0:07:42\tSPEAKER_05\n For me, it just meant a practical point that if we want to publish results on digits that people pay attention to, we probably should, because we've had the problem before, we can show some nice improvement on something that seems like too large a number.\n\n0:08:01\tSPEAKER_05\n And people don't necessarily think it's so serious.\n\n0:08:11\tSPEAKER_05\n Yeah, so the 3.4 percent for this is, looks, why is it, it's an interesting question of us.\n\n0:08:20\tSPEAKER_05\n Why is it 3.4 percent for the digits reported in this environment, as opposed to the 0.8 percent for the original TI digits database?\n\n0:08:38\tSPEAKER_05\n Yeah, given the same, yes, so ignoring the SRA system for a moment, just looking at the NM system, if we're getting 0.8 percent, which, yes, it's high.\n\n0:08:52\tSPEAKER_05\n It's awfully high, but it's, you know, it's high.\n\n0:08:59\tSPEAKER_05\n Why is it 4 times it's high?\n\n0:09:03\tSPEAKER_05\n More.\n\n0:09:05\tSPEAKER_05\n I guess this much would be harder.\n\n0:09:10\tSPEAKER_05\n Yeah, I guess.\n\n0:09:11\tSPEAKER_05\n Right, I mean, even though it's close mic, there still really is background noise.\n\n0:09:18\tSPEAKER_05\n And I suspect when the TI digits were recorded if somebody fumbled or said something wrong or something, they probably made them take it over.\n\n0:09:28\tSPEAKER_05\n I mean, there's no attempt to have it be realistic in any sense at all.\n\n0:09:34\tSPEAKER_03\n And it's quite different.\n\n0:09:37\tSPEAKER_03\n Yeah, it's very, very clean.\n\n0:09:40\tSPEAKER_03\n And it's like, it's got a Uricorn, whereas it's a mid-range, it's a mid-range, sometimes you have breath noise.\n\n0:09:51\tSPEAKER_05\n Right, yeah, so I think they were, it's got a little extra.\n\n0:09:57\tSPEAKER_05\n Yeah, I think it's, it's, so, yeah, I think it's, it's an indication it's hard.\n\n0:10:03\tSPEAKER_05\n Yeah, again, that's true either way.\n\n0:10:10\tSPEAKER_05\n I mean, so take a look at the, yeah, so I result in a much better, but still you're getting something like 1.3% for things that are the same data as in TI digits, the same text.\n\n0:10:25\tSPEAKER_05\n And I'm sure the same system would get 0.3, 0.4% or something on the actual TI digits.\n\n0:10:35\tSPEAKER_05\n So this, I think, on both systems, these digits are showing up as harder.\n\n0:10:42\tSPEAKER_05\n Which I find so interesting, because I think this is closer to, I mean, still red, but I still think it's much closer to what, what people actually face.\n\n0:10:55\tSPEAKER_05\n And they're dealing with people saying digits over the telephone.\n\n0:10:58\tSPEAKER_05\n I don't think, I mean, I'm sure they wouldn't erase the numbers, but I don't think that the, the, the company is, the telephone speech get anything like 0.4% on their digits.\n\n0:11:11\tSPEAKER_05\n I'm sure they get, I mean, for one thing people do, from now prove don't have middle America access.\n\n0:11:21\tSPEAKER_05\n So you ask it has, as many people.\n\n0:11:25\tSPEAKER_05\n It's not many different ways.\n\n0:11:31\tSPEAKER_05\n Okay, that was that topic. What else we got?\n\n0:11:38\tSPEAKER_05\n Did we end up giving up on, on, in a year speech submissions?\n\n0:11:42\tSPEAKER_05\n Man, Otilo and Dan Elles are submitting something.\n\n0:11:46\tSPEAKER_03\n Yeah, I guess the only thing with these, the meeting recorder.\n\n0:11:57\tSPEAKER_03\n So I think, yeah, basically give it.\n\n0:12:03\tSPEAKER_05\n Now, for the, for the, we do have stuff for a run, right?\n\n0:12:09\tSPEAKER_05\n Yeah, yeah, yeah, for sure.\n\n0:12:14\tSPEAKER_03\n Yeah. Well, that's fine.\n\n0:12:18\tSPEAKER_05\n So, so we have a couple, couple of little things on meeting recorder.\n\n0:12:22\tSPEAKER_05\n You don't, we don't have to fly it with papers.\n\n0:12:25\tSPEAKER_05\n We don't have to prove anything to anybody.\n\n0:12:28\tSPEAKER_05\n That's fine.\n\n0:12:31\tSPEAKER_05\n Anything else?\n\n0:12:32\tSPEAKER_03\n Yeah, well, so perhaps the place that we've been working on.\n\n0:12:38\tSPEAKER_03\n Yeah, we have put the good VAD in the system.\n\n0:12:43\tNone\n It really makes a huge difference.\n\n0:12:49\tSPEAKER_03\n So yeah, I think this is perhaps one of the reason why our system was that, not the best because with the new VAD, there is a similar to the, that still come with ourselves.\n\n0:13:02\tSPEAKER_03\n Perhaps even better sometimes.\n\n0:13:06\tSPEAKER_03\n So there is this point.\n\n0:13:11\tSPEAKER_03\n The problem is that it's very big and still have to think how to, where to put it.\n\n0:13:21\tSPEAKER_03\n Because it, what is VAD, yield some delay.\n\n0:13:28\tSPEAKER_03\n And we, if we put it on the server side, it doesn't work because of the server side features.\n\n0:13:33\tSPEAKER_03\n So you already have the LDA applied from the terminal side to your cumulative delay.\n\n0:13:40\tSPEAKER_03\n So the VAD should be before the LDA, which means perhaps on the terminal side and then smaller.\n\n0:13:50\tSPEAKER_05\n So where does good VAD come from?\n\n0:13:53\tSPEAKER_03\n It's from OGI.\n\n0:13:55\tSPEAKER_03\n So it's the network with the huge amount of, the huge units and nine input frames compared to the VAD that was in the proposal, which has a very small amount of hidden units and fewer inputs.\n\n0:14:15\tSPEAKER_05\n This is the one they had originally.\n\n0:14:18\tSPEAKER_05\n Yeah, but they had to be rid of it because of the space.\n\n0:14:24\tSPEAKER_03\n But the assumption is that we'll be able to make a VAD that's smaller than that.\n\n0:14:32\tSPEAKER_05\n Well, so that's the problem.\n\n0:14:35\tSPEAKER_05\n But the other thing is to use a different VAD entirely.\n\n0:14:41\tSPEAKER_05\n I don't know what the thinking was amongst the LCPOQ, but if everybody agreed to use this VAD.\n\n0:14:53\tSPEAKER_03\n Or they just one apparently they don't want to fix it really because they think there is some interaction with you.\n\n0:15:00\tSPEAKER_03\n Feature extraction and video frame dropping.\n\n0:15:06\tSPEAKER_03\n But they still want to just to give some requirement from this VAD because it will not be part of the standard.\n\n0:15:19\tSPEAKER_03\n So it must be at least somewhat fixed but not completely.\n\n0:15:24\tSPEAKER_03\n So there just will be some requirements that are still not yet.\n\n0:15:30\tSPEAKER_05\n But I was thinking that sure there may be some interaction, but I don't think we need to be stuck on using our OGI's VAD with somebody else's smaller.\n\n0:15:43\tSPEAKER_05\n Yeah.\n\n0:15:44\tSPEAKER_05\n That's good.\n\n0:15:51\tSPEAKER_03\n So there is this thing.\n\n0:15:55\tSPEAKER_03\n Yeah.\n\n0:15:57\tSPEAKER_03\n I designed a new filter because when I designed the filters, we showed a delay from the LCPOQ filters.\n\n0:16:05\tSPEAKER_03\n There was one filter with 60ms delay and the other 10ms.\n\n0:16:10\tSPEAKER_03\n Right. You'd like to suggest that both could have 65.\n\n0:16:14\tSPEAKER_03\n I think it's 65.\n\n0:16:16\tSPEAKER_03\n Yeah.\n\n0:16:17\tSPEAKER_03\n But should have 65 because I didn't gain anything.\n\n0:16:20\tSPEAKER_03\n So I did that and it's running.\n\n0:16:24\tSPEAKER_03\n Let's see.\n\n0:16:25\tSPEAKER_03\n Let's see if I have one.\n\n0:16:27\tSPEAKER_03\n But the filter is of course closer to the reference filter.\n\n0:16:37\tSPEAKER_04\n Yeah.\n\n0:16:40\tSPEAKER_05\n So that means logically, the principle should be better, so probably it will be worse.\n\n0:16:48\tSPEAKER_05\n Or the basic perverse nature of reality.\n\n0:16:51\tSPEAKER_05\n Yeah.\n\n0:16:52\tSPEAKER_05\n Okay.\n\n0:16:53\tSPEAKER_05\n Yeah.\n\n0:16:57\tSPEAKER_03\n Yeah.\n\n0:16:58\tSPEAKER_03\n And then we've started to work with this.\n\n0:17:01\tSPEAKER_03\n Vice to the vice.\n\n0:17:03\tSPEAKER_03\n And we will perhaps try to have a new system with MSG stream.\n\n0:17:16\tSPEAKER_03\n So something that's similar to the proposal too, but with MSG stream.\n\n0:17:31\tSPEAKER_04\n Okay.\n\n0:17:40\tSPEAKER_01\n Now, we're going to play with Matt Lat and to found some parameter robust for voice and voice decision, but only to play.\n\n0:17:51\tSPEAKER_01\n And we found that maybe when it's a classical parameter, the variance between the FFT of the signal and the small spectrum of time after the Melfilter bank.\n\n0:18:10\tSPEAKER_01\n And while it's smaller, it's good for clean speech.\n\n0:18:14\tSPEAKER_01\n It's quite good for noise speech.\n\n0:18:18\tSPEAKER_01\n But we must have a big statistic with timid.\n\n0:18:23\tSPEAKER_01\n And it's not right yet to use, well, I don't know.\n\n0:18:29\tSPEAKER_03\n Yeah.\n\n0:18:30\tSPEAKER_03\n So basically we want to look at something like excitation signal.\n\n0:18:35\tSPEAKER_03\n Right.\n\n0:18:36\tSPEAKER_03\n Which is a variance of 15.\n\n0:18:40\tSPEAKER_01\n Yeah.\n\n0:18:41\tSPEAKER_01\n I have here for one thing, for one frame.\n\n0:18:45\tSPEAKER_01\n The mix of the two noise and noise.\n\n0:18:48\tSPEAKER_01\n And the signal is this, clean and this noise.\n\n0:18:57\tSPEAKER_01\n They are the two, the mix, the big.\n\n0:19:00\tSPEAKER_01\n The signal is for clean.\n\n0:19:02\tSPEAKER_05\n Well, there's no, these axes are labeled.\n\n0:19:05\tSPEAKER_01\n So I don't know what this axis is.\n\n0:19:07\tSPEAKER_01\n This axis is frame.\n\n0:19:12\tSPEAKER_05\n And what's this?\n\n0:19:14\tSPEAKER_01\n This is energy, logarithm energy of the spectrum.\n\n0:19:19\tSPEAKER_01\n No, this is the variance, the difference between the spectrum of the signal and FFT of each frame of the signal and the small spectrum of time after the Melfilter.\n\n0:19:36\tSPEAKER_01\n For the two.\n\n0:19:38\tSPEAKER_01\n And the here they are to signal this is for clean and this is for noise.\n\n0:19:44\tSPEAKER_05\n Oh, there's two things on the same graph.\n\n0:19:46\tSPEAKER_01\n Yeah, I don't know.\n\n0:19:47\tSPEAKER_01\n I think that they have another graph.\n\n0:19:50\tSPEAKER_04\n Which is clean?\n\n0:19:52\tSPEAKER_04\n Which is noise?\n\n0:19:53\tSPEAKER_03\n I think the lower one is noise.\n\n0:19:55\tSPEAKER_01\n The lower is noise and the height is clean.\n\n0:19:57\tSPEAKER_05\n Okay, so it's harder to distinguish.\n\n0:20:00\tSPEAKER_05\n It's hard.\n\n0:20:01\tSPEAKER_05\n But it's worth the answer, of course.\n\n0:20:03\tSPEAKER_01\n Oh, I must have clean.\n\n0:20:06\tSPEAKER_01\n I don't have two different.\n\n0:20:08\tSPEAKER_05\n Yeah, presumably when there is a...\n\n0:20:12\tSPEAKER_03\n So this should be voiced.\n\n0:20:16\tSPEAKER_01\n Yeah, this height is voiced portion.\n\n0:20:20\tSPEAKER_01\n And this is the noise portion.\n\n0:20:23\tSPEAKER_01\n And this is more or less like this.\n\n0:20:25\tSPEAKER_01\n But I must have to have two pictures.\n\n0:20:29\tSPEAKER_01\n This is for example for one frame, the spectrum of the signal.\n\n0:20:35\tSPEAKER_01\n And this is the smooth version of the spectrum after ML filter bank.\n\n0:20:42\tSPEAKER_01\n Yeah.\n\n0:20:43\tSPEAKER_01\n And this is...\n\n0:20:44\tSPEAKER_01\n This is not the different.\n\n0:20:46\tSPEAKER_01\n This is trying to obtain with LPC model, the spectrum, but using MATLAB without going factor and...\n\n0:20:56\tSPEAKER_01\n Not pre-efficient.\n\n0:20:57\tSPEAKER_01\n Not pre-efficient, nothing.\n\n0:20:59\tSPEAKER_01\n And I think that this is good.\n\n0:21:01\tSPEAKER_01\n This is quite similar.\n\n0:21:04\tSPEAKER_01\n This is another frame, how I obtain the envelope, the same envelope, with the ML filter bank.\n\n0:21:17\tSPEAKER_05\n Right.\n\n0:21:18\tSPEAKER_05\n So now I wonder, I mean, do you want to...\n\n0:21:22\tSPEAKER_05\n I know you want to get it something orthogonal from what you get with the smooth spectrum.\n\n0:21:28\tSPEAKER_05\n But if you were really trying to get a voicetant voice, do you want to totally ignore that?\n\n0:21:33\tSPEAKER_05\n I mean, do you...\n\n0:21:34\tSPEAKER_05\n I mean, clearly a very big, very big cues for a voicetant voice come from a spectrum slope and so on.\n\n0:21:42\tNone\n Right.\n\n0:21:43\tSPEAKER_03\n Yeah, well, this would be...\n\n0:21:46\tSPEAKER_03\n This would be perhaps an addition of parameters.\n\n0:21:49\tSPEAKER_03\n Yeah, I see.\n\n0:21:51\tSPEAKER_01\n Yeah, because when the noise is clear, in this section is clear, if a high value is indicative that this voice frame and no one...\n\n0:22:05\tSPEAKER_05\n Yeah, we probably won't.\n\n0:22:07\tSPEAKER_05\n Certainly, if you want to do a good voicetant voice, it's actually a need of few features.\n\n0:22:12\tSPEAKER_05\n Each feature is myself.\n\n0:22:14\tSPEAKER_05\n I don't know, but people look at it slow.\n\n0:22:18\tSPEAKER_05\n First-dollar correlation coefficient, by by power, or...\n\n0:22:23\tSPEAKER_05\n There's...\n\n0:22:27\tSPEAKER_05\n I guess we probably don't have enough computation to do a simple pitched detector or something.\n\n0:22:35\tSPEAKER_05\n A pitched detector, you could have an estimate of what the...\n\n0:22:42\tSPEAKER_05\n Or maybe you could just do it going through the FFTs, or you could get out some probable harmonic structure.\n\n0:22:49\tSPEAKER_05\n Right?\n\n0:22:50\tSPEAKER_01\n You have read, you have a paper.\n\n0:22:55\tSPEAKER_01\n The paper just gives me just the...\n\n0:22:59\tSPEAKER_01\n I don't know, but...\n\n0:23:01\tSPEAKER_01\n They are some problem.\n\n0:23:03\tSPEAKER_01\n Yeah, that's a matter of...\n\n0:23:05\tSPEAKER_01\n It's another problem.\n\n0:23:07\tSPEAKER_03\n Yeah, there is...\n\n0:23:10\tSPEAKER_03\n This fact, actually, if you...\n\n0:23:12\tSPEAKER_03\n Look at this spectrum.\n\n0:23:15\tSPEAKER_03\n Yeah.\n\n0:23:16\tSPEAKER_03\n What's this again?\n\n0:23:18\tSPEAKER_03\n Is it the main field?\n\n0:23:20\tSPEAKER_01\n Yeah, like this.\n\n0:23:21\tSPEAKER_01\n Uptime like this.\n\n0:23:23\tSPEAKER_03\n So, the envelope here is the output of the MFFFF.\n\n0:23:26\tSPEAKER_03\n And what we clearly see is that in some cases, and clearly appears here, and the harmonics are resolved by the...\n\n0:23:36\tSPEAKER_03\n Well, there is still a pair after MFFF.\n\n0:23:40\tSPEAKER_03\n And it happens for a pitched noise, because the width of the low frequency MFFF is sometimes even smaller than pitch.\n\n0:23:51\tSPEAKER_03\n Yeah, it's a problem.\n\n0:23:53\tSPEAKER_03\n Right?\n\n0:23:54\tSPEAKER_03\n 150 hertz.\n\n0:23:59\tSPEAKER_03\n And so what happens is that this...\n\n0:24:03\tSPEAKER_03\n Add additional variability to this envelope.\n\n0:24:07\tSPEAKER_03\n Yeah.\n\n0:24:10\tSPEAKER_03\n So we were thinking to modify the mass spectrum to have something that's smaller on low frequencies.\n\n0:24:21\tSPEAKER_05\n That's a separate thing, yeah.\n\n0:24:23\tSPEAKER_04\n Yeah, it's a separate thing, yeah.\n\n0:24:27\tSPEAKER_04\n Yeah, maybe so.\n\n0:24:30\tSPEAKER_05\n Yeah, so, yeah, but that was time I was just starting with the FFT.\n\n0:24:34\tSPEAKER_05\n You could do a very rough thing to estimate pitch.\n\n0:24:39\tSPEAKER_05\n And given that, you could come up with some kind of estimate of how much of the...\n\n0:24:52\tSPEAKER_04\n The energy was explained by...\n\n0:24:57\tSPEAKER_04\n by those harmonics.\n\n0:25:03\tSPEAKER_05\n It's very...\n\n0:25:09\tSPEAKER_05\n The...\n\n0:25:11\tSPEAKER_05\n The metal does give a smooth thing, but as you say, it's not that smooth here.\n\n0:25:14\tSPEAKER_05\n So if you just subtract it off, you're the S of the harmonics, then something like this would end up with quite a bit lower energy.\n\n0:25:26\tSPEAKER_05\n First, 50 hertz or so.\n\n0:25:29\tSPEAKER_05\n And if it was noisy, the proportion of it would go down to B.\n\n0:25:36\tSPEAKER_04\n And if it was on lowest, there's nothing.\n\n0:25:39\tSPEAKER_04\n So you had to be able to pick out voiced segments.\n\n0:25:43\tSPEAKER_05\n At least it should be another cue.\n\n0:25:53\tSPEAKER_04\n Okay.\n\n0:25:56\tSPEAKER_05\n That's what's going on.\n\n0:26:01\tSPEAKER_02\n So, I went to talk with Mike Jordan this week, and shared with him the ideas about extending the Larry Saul work.\n\n0:26:16\tSPEAKER_02\n And I asked him some questions about factorial HMM.\n\n0:26:20\tSPEAKER_02\n So like later down the line, when we come up with these feature detectors, how do we model the time series that happens?\n\n0:26:33\tSPEAKER_02\n And we talked a little bit about factorial HMMs and how when you're doing inference, or when you're doing recognition, there's like simple, but turbid stuff that you can do for these HMMs.\n\n0:26:46\tSPEAKER_02\n And the great advantages that a lot of times the factorial HMMs don't over-learn the problem there.\n\n0:26:55\tSPEAKER_02\n They have a limited number of parameters and they focus directly on the subproblems at hand.\n\n0:27:01\tSPEAKER_02\n So you can imagine five or so parallel features transitioning independently.\n\n0:27:09\tSPEAKER_02\n And then at the end, you couple these factorial HMMs with undirected links based on some more data.\n\n0:27:19\tSPEAKER_02\n So he seemed like really interested in this and said this is something very dual wall and learned a lot.\n\n0:27:29\tSPEAKER_02\n And I've just been continuing reading about certain things, thinking maybe using modulation spectrum stuff to as features also in the sub-air, because it seems like the modulation spectrum tells you a lot about the intelligibility of certain words and stuff.\n\n0:28:04\tSPEAKER_02\n So yeah, just about it.\n\n0:28:13\tSPEAKER_00\n Okay, and so I've been looking at Avandano's work.\n\n0:28:20\tSPEAKER_00\n I'll try to write up in my next status report, and I'll write down what he's doing, but it's an approach to deal with reverberation, or the aspect of his work that I'm interested in.\n\n0:28:31\tSPEAKER_00\n The idea is that normally, and analysis frames are too short to encompass reverberation effects in full.\n\n0:28:42\tSPEAKER_00\n You miss most of the reverberation tail in a 10 millisecond window.\n\n0:28:46\tSPEAKER_00\n And so you'd like it to be that the reverberation response is simply convolved in, but it's not really with these 10 millisecond frames.\n\n0:29:00\tSPEAKER_00\n But if you take, say, a two millisecond window, I'm sorry, a two second window, then in a room like this, most of the reverberation response is included in the window.\n\n0:29:12\tSPEAKER_00\n And then things are more linear.\n\n0:29:17\tSPEAKER_00\n It is more like the reverberation response is simply convolved.\n\n0:29:21\tSPEAKER_00\n And you can use channel normalization techniques.\n\n0:29:25\tSPEAKER_00\n Like in his thesis, he's assuming that the reverberation response is fixed, he just does mean subtraction, which is like removing the DC component of the modulation spectrum.\n\n0:29:36\tSPEAKER_00\n And that's supposed to deal pretty well with the reverberation.\n\n0:29:44\tSPEAKER_00\n And the neat thing is you can't take these two second frames and feed them to a speed recognizer.\n\n0:29:51\tSPEAKER_00\n So he does this method training, the spectral resolution for time resolution.\n\n0:30:01\tSPEAKER_00\n And synthesizes a new representation, which is with, say, 10 second frames, but a lower frequency resolution.\n\n0:30:13\tSPEAKER_00\n So I don't really know the theory.\n\n0:30:15\tSPEAKER_00\n I guess these are called time frequency representations.\n\n0:30:18\tSPEAKER_00\n And he's making the time finer grain in the frequency resolution.\n\n0:30:25\tSPEAKER_00\n Let's find grain.\n\n0:30:29\tSPEAKER_00\n So I guess my first stab actually in continuing his work is to re-implement this thing, which changes the time and frequency resolutions, because he doesn't have code for me, so that it will take some reading about the theory.\n\n0:30:44\tSPEAKER_00\n I don't really know the theory.\n\n0:30:47\tSPEAKER_00\n Oh, and another first step is, so the way I want to extend his work is make it able to deal with a time varying reverberation response.\n\n0:30:57\tSPEAKER_00\n And we don't really know how fast the reverberation response is varying in the meeting recorder data.\n\n0:31:07\tSPEAKER_00\n So we have this blockly squares, echo counselor implementation.\n\n0:31:15\tSPEAKER_00\n And I want to try finding the response between a near mic and the table mic for someone using the echo counselor and looking at the echo counselor tabs.\n\n0:31:26\tSPEAKER_00\n And then see how fast that varies from block to block that should give an idea of how fast the reverberation response is changing.\n\n0:31:33\tSPEAKER_04\n Okay.\n\n0:31:40\tSPEAKER_05\n I think we're sort of done.\n\n0:31:46\tSPEAKER_05\n Yes, we did it.\n\n0:31:48\tSPEAKER_05\n We did it and go home.\n\n0:31:51\tSPEAKER_05\n Okay.\n\n0:31:56\tSPEAKER_03\n I'm reading transcript L-40, 3, 4, 9, 1, 0, 5, 1, 8, 3, 6, 2, 0, 5, 7, 0, 4, 1, 9, 6, 0, 1, 4, 4, 9, 5, 7, 3, 7, 6, 1, 4, 2, 0, 5, 2, 7, 8, 9, 9, 3, 6, 6, 3, 8, 9, 7, 1, 7, 8, 3, 1, 9, 3, 0, 1, 9, 5, 7, 5, 5, 1, 8, 0, 8, 2, 9, 8, 4, 6, 1, 9, 4, 8, 1, 2,\n\n0:32:38\tSPEAKER_00\n So I think you read some of the zeros as always and some of zeros. Is there a particular way we're supposed to read them?\n\n0:32:49\tSPEAKER_03\n There are only zeros here.\n\n0:32:51\tSPEAKER_05\n No, oh, it's 0 and 0, two ways that we say that digit.\n\n0:32:56\tSPEAKER_03\n So it's perhaps in the sheets, it should be another sign photo.\n\n0:33:02\tSPEAKER_03\n If we want to, the guy to say photo.\n\n0:33:05\tSPEAKER_05\n No, I mean, I think people will do what they say.\n\n0:33:07\tSPEAKER_05\n It's okay.\n\n0:33:08\tSPEAKER_05\n I mean, digit recognition is done before.\n\n0:33:10\tSPEAKER_05\n You have two pronunciations for that value.\n\n0:33:15\tSPEAKER_03\n It's perhaps more difficult for the people to prepare the database.\n\n0:33:18\tSPEAKER_03\n If, because they already put me in the order.\n\n0:33:22\tSPEAKER_03\n No, they just write pronounce 0 or 0.\n\n0:33:25\tSPEAKER_05\n They write down OH or they write down ZRO.\n\n0:33:28\tSPEAKER_03\n Yeah, but if each other, she'd be prepared with a different sign photo.\n\n0:33:32\tSPEAKER_05\n But people wouldn't know what that, well, I mean, there is no convention for it.\n\n0:33:36\tSPEAKER_05\n Yeah.\n\n0:33:37\tSPEAKER_05\n I mean, you'd have to tell them, okay, when we write this, say it, they just want people to read the digits as you would in early work.\n\n0:33:44\tSPEAKER_05\n And people say it different ways.\n\n0:33:47\tSPEAKER_00\n Okay, is this a change from the last batch of, of, um, forms?\n\n0:33:51\tSPEAKER_00\n Because in the last batch, it was spelled out, which one you should read.\n\n0:33:54\tSPEAKER_05\n Yes, that's right.\n\n0:33:55\tSPEAKER_05\n It was spelled out and they decided they wanted to get at more of the way people would really say.\n\n0:33:59\tSPEAKER_05\n Okay.\n\n0:34:00\tSPEAKER_05\n That's also why they're, they're bunched together in these different groups.\n\n0:34:03\tSPEAKER_05\n Okay.\n\n0:34:04\tSPEAKER_05\n So it's, yeah, so it's, it's, it's, it's, it's, they're being spying.\n\n0:34:09\tSPEAKER_05\n Transcript L-39.\n\n0:34:13\tSPEAKER_05\n 2326-1014-2475.\n\n0:34:18\tSPEAKER_05\n 938-726-2627.\n\n0:34:22\tSPEAKER_05\n 6734-2224.\n\n0:34:26\tSPEAKER_05\n 2964040882.\n\n0:34:31\tSPEAKER_05\n 879-94082.\n\n0:34:36\tSPEAKER_05\n 780-395123.\n\n0:34:40\tSPEAKER_05\n 559-8142.\n\n0:34:44\tSPEAKER_05\n 0209-2926.\n\n0:34:49\tSPEAKER_05\n Actually, let me just, since it's spread up, I was just, it was hard not to be self-conscious about that one.\n\n0:34:54\tSPEAKER_05\n The reasons we just discussed it.\n\n0:34:56\tSPEAKER_05\n But I realized that, that, um, when I'm talking on the phone, certainly, and, and seeing these numbers, I almost always say zero.\n\n0:35:05\tSPEAKER_05\n And because, because, uh, it's too solvable, so it's, it's more likely to understand what I said.\n\n0:35:11\tSPEAKER_05\n That, that's the habit I'm in.\n\n0:35:13\tSPEAKER_05\n But some people say, oh, okay.\n\n0:35:16\tSPEAKER_02\n Yeah, I normally say, oh, it's easier to say.\n\n0:35:19\tSPEAKER_05\n Yeah, it's true.\n\n0:35:20\tSPEAKER_05\n Yeah, so, so, uh, no, don't think about it.\n\n0:35:23\tSPEAKER_05\n Oh, no.\n\n0:35:26\tSPEAKER_02\n Okay, I'm reading transcript L-38.\n\n0:35:30\tSPEAKER_02\n 545-032-858.\n\n0:35:35\tSPEAKER_02\n 338-904109.\n\n0:35:39\tSPEAKER_02\n 850-711-140.\n\n0:35:44\tSPEAKER_02\n 2161-82-5678.\n\n0:35:49\tSPEAKER_02\n 576-82004.\n\n0:35:54\tSPEAKER_02\n 710-0587-756.\n\n0:36:00\tSPEAKER_02\n 561-371913.\n\n0:36:05\tSPEAKER_02\n 436-009-9220.\n\n0:36:10\tSPEAKER_00\n I'm reading transcript L-37.\n\n0:36:14\tSPEAKER_00\n 0519-0327-1669.\n\n0:36:20\tSPEAKER_00\n 627-026-4510.\n\n0:36:26\tSPEAKER_00\n 542-9501.\n\n0:36:30\tSPEAKER_00\n 711-271-8123.\n\n0:36:35\tSPEAKER_00\n 4084-57-622-9.\n\n0:36:41\tSPEAKER_00\n 823-6726-764.\n\n0:36:46\tSPEAKER_00\n 927-3123.\n\n0:36:51\tSPEAKER_00\n 936-861-9177.\n\n0:36:57\tSPEAKER_01\n Transcript L-36.\n\n0:37:01\tSPEAKER_01\n 044-1629-0.\n\n0:37:05\tSPEAKER_01\n 477-3845654688.\n\n0:37:13\tSPEAKER_01\n 312-525459.\n\n0:37:19\tSPEAKER_01\n 970-698-5851.\n\n0:37:25\tSPEAKER_01\n 0832-973-145.\n\n0:37:32\tSPEAKER_01\n 6493-844223.\n\n0:37:39\tSPEAKER_01\n 4553-0245-422.\n\n0:37:46\tSPEAKER_01\n 682-189-819.\n\n0:37:54\tSPEAKER_05\n I have no access in postcode.\n\n0:38:09\tNone\n There is some technical problem here.\n\n", "summary": [{"summary_text": "SPEAKER_03 is playing Gaussian games with the number of Gaussian states. The best kind of number we have on English, on near microphone only is 3 or 4%. The SRI system uses a lot of fault models. Speaker_03 would like to feed some of these tandem things into the SRI. system."}]}