{"filename": "./data/Bro025.txt", "transcript": "0:00:00\tSPEAKER_03\n Alright, we're off.\n\n0:00:04\tSPEAKER_04\n Just test test.\n\n0:00:06\tSPEAKER_04\n Just test me.\n\n0:00:08\tSPEAKER_04\n Yeah.\n\n0:00:09\tNone\n Okay.\n\n0:00:10\tNone\n Okay.\n\n0:00:11\tSPEAKER_04\n So, there's two sheets of paper in front of us.\n\n0:00:24\tSPEAKER_04\n This is the arm wrestling?\n\n0:00:26\tSPEAKER_00\n Yeah, we formed a coalition, actually.\n\n0:00:29\tSPEAKER_00\n We already made it into one.\n\n0:00:31\tSPEAKER_04\n Oh, good.\n\n0:00:32\tSPEAKER_04\n Excellent.\n\n0:00:33\tSPEAKER_04\n That's the best thing.\n\n0:00:34\tSPEAKER_04\n Tell me about it.\n\n0:00:37\tSPEAKER_02\n So, it's well, it's spectacular.\n\n0:00:39\tSPEAKER_02\n Subjection or we know, finish, right?\n\n0:00:41\tSPEAKER_02\n We're bending on the big bits.\n\n0:00:46\tSPEAKER_02\n Each risk where I'm at.\n\n0:00:49\tSPEAKER_02\n Perfect.\n\n0:00:50\tSPEAKER_02\n And then with the estimation of knowing depending on the arm, it's moving at a time.\n\n0:00:57\tSPEAKER_02\n It's working out frequency.\n\n0:01:00\tSPEAKER_02\n It's very simple.\n\n0:01:02\tSPEAKER_02\n And the best result.\n\n0:01:06\tSPEAKER_02\n But you see, you're on 50 bands with a winner filter.\n\n0:01:13\tSPEAKER_02\n And there is no noise addition.\n\n0:01:15\tSPEAKER_02\n It's good because it's difficult.\n\n0:01:19\tSPEAKER_02\n Are you looking at one or two?\n\n0:01:26\tSPEAKER_02\n Yeah, so the sheet that gives you 3.66.\n\n0:01:30\tSPEAKER_02\n The second sheet, this, about the same, it's the same idea, but it's working on med bands.\n\n0:01:41\tSPEAKER_02\n And it's a spectrosupportion instead of a winner filter.\n\n0:01:45\tSPEAKER_02\n And there is also a noise addition after cleaning up the main bits.\n\n0:01:52\tNone\n Well, there is a term.\n\n0:01:55\tNone\n Let me know.\n\n0:01:57\tSPEAKER_04\n Yeah, I mean, it's actually very similar.\n\n0:02:05\tSPEAKER_04\n I mean, if you look at databases, the one that has the smallest.\n\n0:02:14\tSPEAKER_04\n The one that has the smallest overall number is actually better on the finish and Spanish.\n\n0:02:21\tSPEAKER_04\n But it is worse on the, I mean, on the DI digits.\n\n0:02:32\tSPEAKER_04\n So, probably doesn't matter that much either way.\n\n0:02:40\tSPEAKER_04\n But when you say unified, do you mean it's one piece of software now?\n\n0:02:45\tSPEAKER_02\n So no, we are already setting up software.\n\n0:02:50\tNone\n Should be ready.\n\n0:02:54\tSPEAKER_03\n So, what's happened?\n\n0:02:55\tSPEAKER_03\n I think I've missed something.\n\n0:02:57\tSPEAKER_04\n Okay, so a week ago, maybe you weren't around when you and I came close here.\n\n0:03:01\tSPEAKER_04\n You didn't go to your night?\n\n0:03:02\tSPEAKER_04\n Yeah, I didn't.\n\n0:03:03\tSPEAKER_04\n Oh, okay, so yeah, let's summarize.\n\n0:03:05\tSPEAKER_04\n And then if I summarize, somebody can tell me if I'm wrong, which will also be possibly helpful.\n\n0:03:09\tSPEAKER_04\n What if I just press here?\n\n0:03:10\tSPEAKER_04\n I hope this is still working.\n\n0:03:15\tSPEAKER_04\n We looked at, after coming back from Qualcomm, we had very strong feedback.\n\n0:03:23\tSPEAKER_04\n And I think it was, he didn't think there was an eye opinion also that, you know, we sort of spread out to look at a number of different ways of doing the only suppression.\n\n0:03:33\tSPEAKER_04\n But given limited time, it was sort of time to choose one.\n\n0:03:40\tSPEAKER_04\n And so the retail series hadn't really worked out that much.\n\n0:03:46\tSPEAKER_04\n The subspace stuff had not worked with so much.\n\n0:03:51\tSPEAKER_04\n So it sort of came down to spectral subtraction versus refiltoring.\n\n0:03:55\tSPEAKER_04\n We had a long discussion about how they were the same and how they were completely different.\n\n0:04:00\tSPEAKER_04\n And I mean, fundamentally, the same sort of thing, but the math is a little different so that there's an exponent difference in, you know, what's the ideal filtering, depending on how you construct the problem.\n\n0:04:14\tSPEAKER_04\n And I guess after that meaning sort of made more sense to me, because if you're dealing with powerspectra, then how are you going to choose your error?\n\n0:04:26\tSPEAKER_04\n And typically you'll do something like variance. So that means there'll be something like the square of the power spectra.\n\n0:04:32\tSPEAKER_04\n Whereas when you're doing the, looking at it the other way, you're going to be dealing with signals and you're going to have to looking at power of noise power that you're trying to reduce.\n\n0:04:43\tSPEAKER_04\n So there should be a difference of, you know, conceptually of a factor too in the exponent.\n\n0:04:50\tSPEAKER_04\n But there's so many different little factors that you adjust in terms of over subtraction and so forth that arguably you're, and the choice of do you operate on the Melvans or the operate on the FFT beforehand.\n\n0:05:12\tSPEAKER_04\n There are so many other choices to make that are almost, well, if not independent, certainly in addition to the choice of whether you, the respective subtraction or when you're filtering, that again, we sort of felt the gang should just sort of figure out which it is they want to do.\n\n0:05:30\tSPEAKER_04\n And then let's pick it, go forward with it. So that was, that was last week. And we said, take a week, go arm wrestle, you know, figure it out.\n\n0:05:40\tSPEAKER_04\n And the joke there was that each of them had specialized in one of them. And so they, so instead they went to your somebody and bonded and they can go to a single, single piece of software.\n\n0:05:51\tSPEAKER_04\n Another, another victory for international collaboration.\n\n0:05:57\tSPEAKER_03\n So so you guys have combined for you're going to be combining software.\n\n0:06:01\tSPEAKER_00\n Well, the piece of software has like plenty of options like you can pass command line arguments. So depending on that, it becomes either spec with subtraction or we're filtering.\n\n0:06:10\tSPEAKER_04\n Well, that's fine. But the important thing is that there is a piece of software that you that we all will be using. Yeah.\n\n0:06:16\tSPEAKER_02\n Yeah, it's just one piece of software.\n\n0:06:18\tSPEAKER_02\n And we want to make optimize parameters. Sure. But still so there is a piece of software.\n\n0:06:33\tSPEAKER_02\n How is how good is that? I don't have a sense of. It's just one person. Best system. It's between. We are single.\n\n0:06:50\tSPEAKER_04\n Yeah. But compared to the last evaluation, which we started for before, but we were considerably far behind. And the thing is this doesn't have neural net in yet, for instance.\n\n0:06:59\tSPEAKER_04\n So it's so it's it's not using our full ballot bag of tricks, if you will. And it is very close performance to the best thing that was there before.\n\n0:07:11\tSPEAKER_04\n But you know, looking at another way, maybe more importantly, we didn't have any explicit noise handling stationary dealing with we didn't explicitly have anything to deal with stationary noise. And now we do.\n\n0:07:26\tSPEAKER_03\n So will the neural net operate on the output from either the weener filtering or the spectral subtraction? Well, so so arguably what we should do, I mean, I gather you have, it sounds like you have a few more days of nailing things down with the software and so on.\n\n0:07:43\tSPEAKER_04\n But but arguably what we should do is, even though the software can do many things, we should for now pick a set of things, these things, I would guess.\n\n0:07:54\tSPEAKER_04\n And not change that and then focus on everything that's left. And I think you know that our goal should be by next week when he comes back to really just to have a firm path for the for the time he's gone of what things will be attacked.\n\n0:08:14\tSPEAKER_04\n So I would I would think that what we would want to do is not thoughts with this stuff for a while because what will happen is we'll change many other things in the system. And then we'll probably want to come back to this and possibly make some other choices.\n\n0:08:27\tSPEAKER_04\n But just conceptually where does the neural net do you want to run it on the output of the spectrally subtraction? Well, depending on its size, well, one question is, is it on the server side or is it on the terminal side?\n\n0:08:41\tSPEAKER_04\n If it's on the server side, we probably don't have to worry too much about size. So that's kind of an argument for that. We do still, however, have to consider its latency. So the issue is is, for instance, could we have a neural net that only looked at the past?\n\n0:08:55\tSPEAKER_04\n What we've done in the past is to use the neural net to transform all of the features that we use. So this is done early on. This is essentially, I guess it's more or less like a speech enhancement technique here.\n\n0:09:13\tSPEAKER_04\n We're just kind of creating new, if not new speech, at least new FFTs that have, which could be turned into speech, that have some of the noise removed. After that, we still do a mess of other things to produce a bunch of features.\n\n0:09:29\tSPEAKER_04\n And then those features are not now currently transformed by the neural net. And then the way that we had it in our proposal 2 before, we had the neural net transform features and we had the untransformed features, which, I guess you actually did linearly transform with KLT, but to our Thogon-Lyzen, but they were not processed through a neural net.\n\n0:09:52\tSPEAKER_04\n And Stefan's idea with that, as a recall, was that you'd have one part of the feature vector that was very discriminant in another part that wasn't, which would smooth things a bit for those occasions when the testing set was quite different than what you'd change your discriminant features for.\n\n0:10:09\tSPEAKER_04\n So all of that is still seems like a good idea. The thing is now we know some other constraints. We can't have unlimited amounts of latency. That's still being debated by people in Europe, but no matter how they end up there, it's not going to be unlimited amounts, so we have to be a little conscious of that.\n\n0:10:32\tSPEAKER_04\n So there's the neural net issue, there's the VAD issue, and there's the second stream thing. And I think last time we agreed that those are the three things that have to get focused on.\n\n0:10:47\tSPEAKER_03\n What was the issue with the VAD?\n\n0:10:49\tSPEAKER_04\n Well, better ones are good.\n\n0:10:52\tSPEAKER_03\n And so the default boundaries that they provide are okay, that's not all that great. I guess they still allow 200 milliseconds on either side, is that for the audience?\n\n0:11:04\tSPEAKER_02\n So the VAD issue is outside the beginning.\n\n0:11:11\tSPEAKER_02\n The speech pose, which is sometimes the speech that comes, you have to pose this down to 1.25 seconds. Wow! More than one second.\n\n0:11:23\tSPEAKER_02\n And it seems to us that this way of dropping the beginning and end is not... we can do better. Because this way of dropping the frames that improve for the baseline by 14% and so we already showed that we are currently in the end improve by 100% percent.\n\n0:11:47\tSPEAKER_03\n And so the top of the VAD that they provide? No.\n\n0:11:53\tSPEAKER_02\n Oh, okay. There's this 14.\n\n0:12:18\tSPEAKER_02\n And if we just take only the VAD probably is computed on the clean signal and apply them on the far-being test, the nuances, then results are much better.\n\n0:12:36\tSPEAKER_02\n In some case, the VAD is zero already, right?\n\n0:12:40\tSPEAKER_03\n So it means that there is still... how much latency does the VAD and... is the signal again?\n\n0:12:52\tSPEAKER_02\n Right now it's under undeniable, so it's 14 milliseconds plus the rank ordering should be...\n\n0:13:02\tSPEAKER_00\n So we have another 10 frames. The rank ordering, I'm sorry.\n\n0:13:10\tSPEAKER_00\n There's this... there's this... the... the filtering of the probabilities on the...\n\n0:13:16\tSPEAKER_04\n We don't think the media is going to be... we have 11.\n\n0:13:34\tSPEAKER_04\n So, yeah, I was just noticing on this that it makes reference to delay. So what's the... if you ignore... the VAD is sort of in parallel, isn't it?\n\n0:13:48\tSPEAKER_04\n With the... I mean, the additive with the... the LDA in the winter filtering.\n\n0:13:54\tSPEAKER_00\n Yeah, so what happened right now we removed that delay of the LDA.\n\n0:13:58\tSPEAKER_00\n So we're... I mean, if... so which is like... if we reduce the delay of VAD... so the... the final delay is now... is determined by the delay of the VAD.\n\n0:14:08\tSPEAKER_00\n Because the LDA doesn't have any delay. So if you reduce the delay of the VAD, I mean, it's like... effectively reducing the delay.\n\n0:14:14\tSPEAKER_03\n How much delay was on the LDA?\n\n0:14:18\tSPEAKER_00\n So the LDA and the VAD both had 100 milliseconds delay. So when they were in parallel, so which means you pick either one of them.\n\n0:14:24\tSPEAKER_00\n The biggest order. So right now that LDA delay is removed.\n\n0:14:29\tSPEAKER_04\n And there didn't seem to be any penalty for that. But there didn't seem to be any penalty for making it causal.\n\n0:14:35\tSPEAKER_00\n Oh no, it actually made it like 0.1% better or something.\n\n0:14:40\tSPEAKER_04\n It's just winter filter is 40 milliseconds today.\n\n0:14:45\tSPEAKER_00\n Yeah, so that's the one which Stefan was discussing like...\n\n0:14:48\tSPEAKER_00\n The smoothing. Yeah, you smoothed it and then delay the decision by.\n\n0:14:55\tSPEAKER_04\n Right, okay. So that's really not bad. So we may in fact... we'll see what they decide.\n\n0:15:00\tSPEAKER_04\n We may in fact have the latency time available to have an Earl Madden. I mean, it sounds like we probably will.\n\n0:15:09\tSPEAKER_04\n So that'd be good. Because it certainly always helped us before.\n\n0:15:16\tSPEAKER_03\n What amount of latency are you thinking about when you see it?\n\n0:15:19\tSPEAKER_04\n Well, they're disputing it. They're saying one group is saying 130 milliseconds and another group is saying 250 milliseconds.\n\n0:15:27\tSPEAKER_04\n 250 is what it was before actually. So some people are lobbying to make it shorter.\n\n0:15:36\tSPEAKER_03\n Were you thinking of the 250 or the 137th position?\n\n0:15:41\tSPEAKER_04\n Well, when we find that out, it might change exactly how we do it is all.\n\n0:15:46\tSPEAKER_04\n I mean, how much effort do we put into making it causal?\n\n0:15:49\tSPEAKER_04\n I mean, I think the neural net will probably do better if it looks a little bit of the future.\n\n0:15:54\tSPEAKER_04\n But it will probably work to some extent to look only at the past.\n\n0:15:58\tSPEAKER_04\n And we limited machine and human time and effort and how much time should we put into that.\n\n0:16:08\tSPEAKER_04\n So it'll be helpful if we find out from the standards, folks, whether they're going to restrict that or not.\n\n0:16:16\tSPEAKER_04\n But I think at this point our major concern is making the performance better.\n\n0:16:20\tSPEAKER_04\n And if something has to take a little longer in latency in order to do it, that's a secondary issue.\n\n0:16:29\tSPEAKER_04\n But if we get told otherwise, then we may have to clamp down a bit more.\n\n0:16:42\tSPEAKER_00\n So one difference that was there is like we tried computing the delta and then doing the frame dropping.\n\n0:16:50\tSPEAKER_00\n The earlier system was do the frame dropping and then compute the delta on the.\n\n0:16:56\tSPEAKER_04\n So this kind of an adult. Yeah. Oh, so that's fixed in us.\n\n0:17:01\tSPEAKER_00\n Yeah. So we have now delta and then so the frame dropping is the last thing that we do.\n\n0:17:07\tSPEAKER_00\n So we have what we do is we compute the silence probability converted into that binary flag.\n\n0:17:12\tSPEAKER_00\n And then in the end you up sampled it to match the final features number of.\n\n0:17:19\tSPEAKER_00\n It seems to be helping on the well match condition.\n\n0:17:21\tSPEAKER_00\n So that's why this improvement I got from the last result.\n\n0:17:24\tSPEAKER_00\n So and it actually reduced a little bit on the high mismatch.\n\n0:17:27\tSPEAKER_00\n So the final weight is it's better because the well match is the weighted more than.\n\n0:17:33\tSPEAKER_04\n So I mean you were doing a lot of changes. Did you happen to notice how much.\n\n0:17:38\tSPEAKER_04\n Change was due to just this frame dropping problem.\n\n0:17:41\tSPEAKER_00\n You had something on it, right?\n\n0:17:44\tSPEAKER_02\n Just a friend dropping problem. Yeah, but it's difficult. Sometimes we would change to things together.\n\n0:17:54\tSPEAKER_04\n But it's around maybe it's less than my personal.\n\n0:17:58\tSPEAKER_04\n Yeah.\n\n0:17:59\tSPEAKER_04\n But like we're saying there's four or five things like that.\n\n0:18:03\tSPEAKER_04\n Pretty shocked. Soon you're talking real improvement.\n\n0:18:09\tSPEAKER_02\n And the proposal that you're not that flexible. So working on that.\n\n0:18:14\tSPEAKER_01\n Mm hmm.\n\n0:18:17\tSPEAKER_04\n Oh, that's a real good point.\n\n0:18:21\tSPEAKER_02\n You can be the same guy.\n\n0:18:25\tSPEAKER_04\n Might be hard if it's at the server side, right?\n\n0:18:30\tSPEAKER_02\n Well, we can be the friend dropping server side or we can't just be careful.\n\n0:18:42\tSPEAKER_03\n Okay.\n\n0:18:45\tSPEAKER_03\n You have.\n\n0:18:47\tSPEAKER_03\n So when you maybe I don't quite understand how this works, but.\n\n0:18:52\tSPEAKER_03\n Couldn't you just send all of the frames, but mark the ones that are supposed to be dropped.\n\n0:18:56\tSPEAKER_03\n Because you have a bunch more bandwidth, right?\n\n0:18:59\tSPEAKER_04\n Well, you could, you know, I mean, it it always seemed to us that it would be kind of nice to in addition to reducing insertions actually use a plus bandwidth.\n\n0:19:09\tSPEAKER_04\n But nobody seems to care about that in this evaluation.\n\n0:19:14\tSPEAKER_03\n That's why the net use.\n\n0:19:17\tSPEAKER_03\n If the net's on the server side, then it could use all of the frames.\n\n0:19:22\tSPEAKER_00\n Yes, it could be like, you mean you just transmit everything and then finally drop the frames after the neuralite, right?\n\n0:19:28\tSPEAKER_00\n Yeah, that's one thing which you could even mark them.\n\n0:19:32\tSPEAKER_00\n Yeah, right now we have the server.\n\n0:19:34\tSPEAKER_00\n Right now what we did is like we just we just have this additional bit which goes along the features saying it's currently it's a speech or a non speech.\n\n0:19:43\tSPEAKER_00\n So there is no frame dropping till the final features like including the deltas are computed.\n\n0:19:47\tSPEAKER_00\n And after the delta's are computed, you just pick up the ones that are marked silence and then drop them.\n\n0:19:53\tSPEAKER_04\n So be more or less the same thing with the neural net, I guess.\n\n0:19:56\tSPEAKER_00\n So that's what that's what this is doing right now.\n\n0:20:00\tSPEAKER_00\n Yeah.\n\n0:20:02\tSPEAKER_04\n Okay.\n\n0:20:09\tSPEAKER_04\n So what's that's good set of work that.\n\n0:20:16\tSPEAKER_00\n Just one more thing like should we do something more for the noise estimation because we still.\n\n0:20:21\tSPEAKER_04\n Yeah, I was wondering about that. I hate to written that down there.\n\n0:20:26\tNone\n Actually, I did this experiment.\n\n0:20:29\tSPEAKER_02\n We just used in frames.\n\n0:20:32\tSPEAKER_02\n We take the first 15 frames of the judgements.\n\n0:20:35\tSPEAKER_04\n Yeah.\n\n0:20:38\tSPEAKER_02\n I tried just breaking the.\n\n0:20:51\tSPEAKER_02\n But of course, I didn't play.\n\n0:21:00\tSPEAKER_04\n Yeah, well, it's not surprising to be worse first time, but it does seem like some compromise between always depending on the first 15 frames and always depending on pause is a good idea.\n\n0:21:26\tSPEAKER_04\n Maybe you have to wait the estimate from the first 15 frames more heavily than was done in your first attempt.\n\n0:21:38\tSPEAKER_04\n Yeah.\n\n0:21:41\tSPEAKER_04\n I mean, do you have any way of assessing how well or how poorly the noise estimation is currently doing?\n\n0:21:55\tSPEAKER_02\n Yeah.\n\n0:21:58\tSPEAKER_00\n Was there any experiment with because I did the only experiment what I tried was I used the channel zero-watt for the noise estimation and frame dropping.\n\n0:22:08\tSPEAKER_00\n So I don't have a split like which one help more.\n\n0:22:13\tSPEAKER_00\n So it was the best result I could get.\n\n0:22:19\tSPEAKER_04\n So that's something you could do with this final system, right?\n\n0:22:26\tSPEAKER_04\n Just do this everything that is in this final system except use the channel zero for the noise estimation.\n\n0:22:35\tSPEAKER_00\n Yeah.\n\n0:22:37\tSPEAKER_04\n And then see how much better it gets.\n\n0:22:40\tSPEAKER_04\n If it's essentially not better than it's probably not worth.\n\n0:22:45\tSPEAKER_00\n Yeah, but the Ginters argument is slightly different. It's like even if I use a channel zero-watt, I'm just averaging the the pause spectrum.\n\n0:22:54\tSPEAKER_00\n But the Ginters argument is like if it is a non stationary segment, then he doesn't update the noise spectrum.\n\n0:23:00\tSPEAKER_00\n So it's like it tries to capture only the stationary part.\n\n0:23:04\tSPEAKER_00\n And so the averaging is like different from updating the noise spectrum only during stationary segments.\n\n0:23:12\tSPEAKER_00\n So the Ginters was arguing that even if you have a very good VAD averaging it like over the whole thing is not a good idea.\n\n0:23:19\tSPEAKER_00\n Because you are averaging the stationary and the non stationary and finally you end up getting something which is not really the same.\n\n0:23:25\tSPEAKER_00\n Anyway, you can't remove the stationary part from the signal.\n\n0:23:30\tSPEAKER_00\n No, using these messages.\n\n0:23:32\tSPEAKER_00\n Yeah, so you just update only the stationary components.\n\n0:23:37\tSPEAKER_00\n So that's still slight difference from what Ginters is trying in.\n\n0:23:43\tSPEAKER_04\n Well, yeah. And also there's just the fact that although we're trying to do very well in this evaluation, we actually would like to have something that worked well in general.\n\n0:23:56\tSPEAKER_04\n And relying on having 15 frames at the front or something is pretty.\n\n0:24:02\tSPEAKER_04\n I mean, you might not.\n\n0:24:08\tSPEAKER_04\n So it certainly be more robust to different kinds of input if you had at least some updates.\n\n0:24:18\tSPEAKER_04\n Well, what do you guys see as being what you would be doing in the next week given what's happened?\n\n0:24:33\tSPEAKER_00\n We have the VAD.\n\n0:24:38\tSPEAKER_00\n Was that VAD?\n\n0:24:50\tSPEAKER_02\n Okay.\n\n0:25:17\tSPEAKER_02\n Yeah.\n\n0:25:29\tSPEAKER_03\n So I don't remember what you said.\n\n0:25:34\tSPEAKER_03\n The answer to my question earlier.\n\n0:25:37\tSPEAKER_03\n Were you trained in that on after you've done the spectral subtraction or the different net?\n\n0:25:42\tSPEAKER_00\n Yeah, which is a new that's a neural it is some of the VAD net.\n\n0:25:48\tSPEAKER_00\n So that VAD was trained on the noisy features.\n\n0:25:52\tSPEAKER_00\n So right now we have like we have the cleaned up features so we can have a better VAD by turning the net on the clean up speeches.\n\n0:26:02\tSPEAKER_00\n But we need a VAD for noise estimation also.\n\n0:26:13\tSPEAKER_03\n Can you use the same net to do both for can use the same net that you that I was talking about to the VAD?\n\n0:26:23\tSPEAKER_00\n It actually comes at the very end.\n\n0:26:26\tSPEAKER_00\n So the net the final net I mean which is the feature net so that actually comes after a chain of like LDA plus everything.\n\n0:26:33\tSPEAKER_00\n So it's like it takes a long time to get a decision out of it and I can actually do it for final frame dropping but not for the V.\n\n0:26:40\tSPEAKER_00\n Noise estimation.\n\n0:26:41\tSPEAKER_04\n See the idea is that the initial decision to that that you're in silence or speech happens pretty quickly.\n\n0:26:52\tSPEAKER_03\n Is that used by somebody's own?\n\n0:26:56\tSPEAKER_03\n Yeah, that sort of fed forward and you say well flush everything it's not speech anymore.\n\n0:26:59\tSPEAKER_03\n I thought it would be used for doing frame dropping.\n\n0:27:03\tSPEAKER_04\n It is used.\n\n0:27:06\tSPEAKER_04\n Yeah, it's only used well it's used for frame dropping.\n\n0:27:11\tSPEAKER_04\n It's used for end of utterance because you know there's if you have more than 500 milliseconds of of non speech then you figure it's end of utterance.\n\n0:27:21\tSPEAKER_04\n Something like that so.\n\n0:27:24\tSPEAKER_02\n I see.\n\n0:27:52\tSPEAKER_04\n Yeah, so probably the VAD and maybe testing out the noise estimation a little bit and keeping the same method but seeing if the noise estimation could be improved.\n\n0:28:10\tSPEAKER_04\n It's sort of related issues.\n\n0:28:12\tSPEAKER_04\n It probably makes sense to move from there and then later on in the month I think we want to start including the neural at the end.\n\n0:28:31\tSPEAKER_04\n Okay, anything else?\n\n0:28:44\tSPEAKER_04\n Didn't fall.\n\n0:28:49\tSPEAKER_04\n Our effort would have been devastated.\n\n0:28:54\tSPEAKER_04\n So Henik is coming back next week?\n\n0:29:04\tSPEAKER_04\n No, no, he's dropped into the US.\n\n0:29:11\tSPEAKER_04\n So the idea was that we'd sort out where we're going next with this work before he left on his next trip.\n\n0:29:25\tSPEAKER_04\n Good.\n\n0:29:28\tSPEAKER_04\n Very you just got through your qual so I don't know if you have much to say but...\n\n0:29:37\tSPEAKER_01\n Now just looking into some of the things that John O'Halla and Henik gave as feedback as a starting point for the project.\n\n0:29:51\tSPEAKER_01\n In my proposal I was thinking about starting from a set of phonological features or a subset of them.\n\n0:30:00\tSPEAKER_01\n It might not be necessarily a good idea according to John. He said these phonological features are sort of figments of imagination also.\n\n0:30:13\tSPEAKER_04\n In conversational speech in particular, I think you can put them in pretty reliably in synthetic speech but we don't have too much trouble recognizing synthetic speech since we created in the first place.\n\n0:30:24\tSPEAKER_01\n Yeah, so a better way would be something more data-driven just looking at the data and seeing what's similar and what's not similar.\n\n0:30:34\tSPEAKER_01\n I'm taking a look at some of Sun Gita's work on traps.\n\n0:30:42\tSPEAKER_01\n She did something where the traps she clustered the temporal patterns of certain phonemes in average over many, many contexts and some things tended to cluster.\n\n0:31:03\tSPEAKER_01\n So I've stopped Constance clustered very well. Silence was by its own self and Vocalic was clustered.\n\n0:31:15\tSPEAKER_01\n So those are interesting things.\n\n0:31:18\tSPEAKER_03\n Now you're sort of looking to try to gather a set of these types of features.\n\n0:31:23\tSPEAKER_01\n Right, yeah. See where I could start off from a set of small features and continue to iterate and find a better set.\n\n0:31:43\tSPEAKER_04\n Okay, well, short meeting. It's okay. So next we hopefully will get Tina Kear to join us.\n\n0:31:53\tSPEAKER_03\n Digits.\n\n0:31:57\tSPEAKER_04\n Digits.\n\n0:32:01\tSPEAKER_04\n Okay, let me go ahead and get my glasses on so I can see. Okay. Transcript L-327.\n\n0:32:13\tSPEAKER_04\n 821-067-40000-800-4176-1281-630-224-1912-650-869-4624-8919-1485-6845-388-383-80-4518-829135-0-234-44812-2\n\n0:32:48\tSPEAKER_02\n Transcript L-328-9060-3955-984-3165-343-114-4166-4194-33-7655-505-754-075-666-8 630-5487-701-812-831-5734-8703-68\n\n0:33:25\tSPEAKER_03\n Transcript L-329-9977-30368-7627-1700-0996-9388-96987-099 2126-937206-672-308-949-8032-631-489-6444-2669-318-791-3247\n\n0:34:04\tSPEAKER_00\n Transcript L-330-2360-9593-546-348-6675-3704-3844-866-3675-8705-5739-150-9016-22-409-277-701-9206-8967-896701-9206-8967-660 164-191-2428\n\n0:34:39\tSPEAKER_01\n Transcript L-331-3788-9100-623-270-385-138-183795-096-6610-197-541-2420-41-11-11-197-142-121-107-8 096-761-0197-541-240-41-5612-309-1-6057-6528-341-164739-4528-8507 Okay, and we're up.\n\n", "summary": [{"summary_text": "SPEAKER_03, Speaker_04 and Speaker 02 are setting up the software. They are doing an arm wrestling test on two sheets of paper. The one with the smallest overall number is better on the finish and Spanish than the one that has the smallest number."}]}