{"filename": "./data/Bro010.txt", "transcript": "0:00:00\tSPEAKER_04\n Okay, we're on.\n\n0:00:07\tSPEAKER_05\n Okay, what are we talking about today?\n\n0:00:14\tSPEAKER_01\n I don't know.\n\n0:00:18\tSPEAKER_01\n We have news from the conference talk.\n\n0:00:23\tSPEAKER_01\n This was program for yesterday.\n\n0:00:30\tSPEAKER_05\n Oh, I'm sorry.\n\n0:00:33\tSPEAKER_05\n Now I know what you're talking about.\n\n0:00:34\tSPEAKER_05\n No one told me anything.\n\n0:00:38\tSPEAKER_04\n This was the talk where they were supposed to try to decide.\n\n0:00:41\tSPEAKER_04\n To decide what to do.\n\n0:00:44\tSPEAKER_05\n That would have been a good thing to find out for this meeting.\n\n0:00:47\tSPEAKER_05\n I have no idea.\n\n0:00:52\tSPEAKER_05\n So, let's assume for right now we're just kind of plugging on ahead because even if they tell us that the worlds are different, we're still interested in doing what we're doing.\n\n0:01:06\tSPEAKER_05\n So what are you doing?\n\n0:01:09\tSPEAKER_01\n Well, we've a little bit worked on trying to see what were the bugs and the problems with the latencies.\n\n0:01:23\tSPEAKER_01\n We took the LDA filters and redesigned new filters using recursive filters.\n\n0:01:33\tSPEAKER_05\n So when you say we did something similar as that.\n\n0:01:36\tSPEAKER_05\n I'm sorry.\n\n0:01:37\tSPEAKER_01\n Who is doing that?\n\n0:01:42\tSPEAKER_01\n So we took the filters, the fear filters, and we designed our filters that have the same frequency response.\n\n0:01:57\tSPEAKER_01\n Well, similar.\n\n0:01:59\tSPEAKER_01\n But that have shorter delays.\n\n0:02:03\tSPEAKER_01\n So they had two filters, one for the low frequency bands and another for the high frequency bands.\n\n0:02:08\tSPEAKER_01\n So we redesigned two filters and the low frequency bands has 64 milliseconds of delay and the high frequency band filter has something like 11 milliseconds compared to the 200 milliseconds of the high-high filters.\n\n0:02:25\tSPEAKER_01\n But it's not yet tested.\n\n0:02:27\tSPEAKER_01\n So we have the filters but we still have to implement the routine that does recursive filtering.\n\n0:02:33\tSPEAKER_05\n You had a discussion with Sonia about this though?\n\n0:02:35\tSPEAKER_05\n No.\n\n0:02:38\tSPEAKER_05\n You should talk with them.\n\n0:02:41\tSPEAKER_05\n No, the whole problem happened before was coordination.\n\n0:02:45\tSPEAKER_05\n So you need to discuss with them what we're doing because they could be doing the same thing.\n\n0:02:53\tSPEAKER_01\n I don't know if that's what they were trying to do.\n\n0:02:58\tSPEAKER_01\n I'm trying to do something different like taking while using filter that takes only a past.\n\n0:03:05\tSPEAKER_01\n This is just a little bit different.\n\n0:03:07\tSPEAKER_01\n But I will send him an email and tell him exactly what we are doing.\n\n0:03:12\tSPEAKER_05\n Yeah.\n\n0:03:15\tSPEAKER_05\n We just have to be in contact more.\n\n0:03:17\tSPEAKER_05\n I think that the fact that we did that was, had that thing with the latency.\n\n0:03:21\tSPEAKER_05\n It was a decade of the fact that there wasn't enough communication.\n\n0:03:25\tSPEAKER_01\n Yeah.\n\n0:03:30\tSPEAKER_01\n Well, there is one remark about these filters that they don't have a linear phase.\n\n0:03:39\tSPEAKER_01\n So, but I don't know.\n\n0:03:42\tSPEAKER_01\n Rapid.\n\n0:03:43\tSPEAKER_01\n Rapid doesn't hurt because the phase is almost linear.\n\n0:03:49\tSPEAKER_01\n And so, yeah, for the delay, I give you air.\n\n0:03:56\tSPEAKER_01\n It's a computing done.\n\n0:03:58\tSPEAKER_01\n The five-hertz modulation frequency, which is the most important for speech.\n\n0:04:07\tSPEAKER_01\n This is the first thing.\n\n0:04:10\tSPEAKER_05\n So that would be a reduction of 136 milliseconds.\n\n0:04:15\tSPEAKER_05\n Which, what was the total we ended up with?\n\n0:04:19\tSPEAKER_01\n 330.\n\n0:04:21\tSPEAKER_01\n So that would be within.\n\n0:04:23\tSPEAKER_01\n Yeah, but there are other points actually, which will perhaps add some more delay.\n\n0:04:30\tSPEAKER_01\n Is that some other stuff in the process where perhaps not very correct.\n\n0:04:38\tSPEAKER_01\n Like the down sampling, which has simply dropping frames.\n\n0:04:44\tSPEAKER_01\n So we will try also to add a nice down sampling having a filter.\n\n0:04:49\tSPEAKER_01\n That, that, well, a low pass filter at 25 hertz.\n\n0:04:54\tSPEAKER_01\n Because when we look at the LDA filters, well, they are basically low pass, but they leave a lot of what's above 25 hertz.\n\n0:05:05\tSPEAKER_01\n And so, yeah, this would be another filter, which would add 10 milliseconds again.\n\n0:05:12\tSPEAKER_01\n Yeah, and then the third thing is that basically the way online normalization was done is just using this recursion on the feature stream.\n\n0:05:32\tSPEAKER_01\n But this is a filter, so it has also a delay.\n\n0:05:36\tSPEAKER_01\n And when we look at this filter actually has a delay of 85 milliseconds.\n\n0:05:42\tSPEAKER_01\n So if we want to be very correct, so if we want to the estimation of the mean to be, well, the right estimation of the mean, we have to take 85 milliseconds in the future.\n\n0:05:59\tSPEAKER_05\n That's a little bit of a problem.\n\n0:06:03\tSPEAKER_01\n But, well, when we add up everything, it would be at 65 plus 10 plus for the down sampling plus 85 for the online normalization.\n\n0:06:18\tSPEAKER_01\n So it's, yeah, plus 80 for the neural net and PCA.\n\n0:06:24\tSPEAKER_01\n So it would be around 240.\n\n0:06:27\tSPEAKER_01\n What's the allowable?\n\n0:06:33\tSPEAKER_05\n 250.\n\n0:06:36\tSPEAKER_05\n Which there's some discussion of.\n\n0:06:39\tSPEAKER_04\n What were they thinking of changing it to?\n\n0:06:41\tSPEAKER_05\n Well, the people who we had very low latency wanted to be low, very narrow latency bound.\n\n0:06:50\tSPEAKER_05\n And people have longer latency down.\n\n0:06:53\tSPEAKER_05\n So fortunately, we're the main ones with long latency.\n\n0:06:57\tSPEAKER_01\n But yeah, and basically the best proposed on that something like 30 or 40 milliseconds.\n\n0:07:04\tSPEAKER_05\n So they were basically, I mean, they were more or less trading computation for performance.\n\n0:07:10\tSPEAKER_05\n And we were trading latency for performance.\n\n0:07:14\tSPEAKER_05\n And they were dealing with noise explicitly and we weren't.\n\n0:07:18\tSPEAKER_05\n So I think of it as complimentary.\n\n0:07:20\tSPEAKER_05\n I think the best systems.\n\n0:07:23\tSPEAKER_05\n So everything that we did in a way was it was just adamantly insisting on going in with the brain damage system.\n\n0:07:30\tSPEAKER_05\n Which is something actually we've done a lot over the last 15 years.\n\n0:07:34\tSPEAKER_05\n We say, well, this is the way we do it.\n\n0:07:38\tSPEAKER_05\n And then we do it.\n\n0:07:39\tSPEAKER_05\n And then someone else does something that's straightforward.\n\n0:07:43\tSPEAKER_05\n So this was a test that largely had as with noise.\n\n0:07:46\tSPEAKER_05\n And we did absolutely nothing explicitly to handle the added noise.\n\n0:07:51\tSPEAKER_05\n We just trained up systems to be more discriminant.\n\n0:07:56\tSPEAKER_05\n And we did this Rastelike filtering, which just on the log domain, and it's attending to handle convolutional noise.\n\n0:08:04\tSPEAKER_05\n We actually did nothing about that.\n\n0:08:07\tSPEAKER_05\n So the spectral subtraction schemes, a couple of places, seemed to do a nice job.\n\n0:08:17\tSPEAKER_05\n And so we're talking about putting some of that in, still keeping some of our stuff.\n\n0:08:21\tSPEAKER_05\n I think you should be able to end up with a system that's better than both.\n\n0:08:24\tSPEAKER_05\n But clearly, the way that we're operating for this other stuff does involve some latency.\n\n0:08:28\tSPEAKER_05\n To get rid of most of that latency, you get down to 40 or 50 milliseconds.\n\n0:08:32\tSPEAKER_05\n We'd have to throw out most of what we're doing.\n\n0:08:35\tSPEAKER_05\n And I don't think there's any good reason for it.\n\n0:08:38\tSPEAKER_05\n And the application actually, I mean, you're speaking to a recognizer.\n\n0:08:42\tSPEAKER_05\n I'm a remote server.\n\n0:08:44\tSPEAKER_05\n And having a quarter second versus some processing to clean it up doesn't seem like it's that.\n\n0:08:52\tSPEAKER_05\n You could deal.\n\n0:08:53\tSPEAKER_05\n These aren't large vocabulary things, so the decoder should take a really long time.\n\n0:08:57\tSPEAKER_04\n And I don't think anybody's going to notice the difference between a quarter of a second of latency and 30 milliseconds of latency.\n\n0:09:04\tSPEAKER_05\n No.\n\n0:09:05\tSPEAKER_05\n What does- What was your experience when you were doing stuff with the surgical?\n\n0:09:11\tSPEAKER_05\n Microscopes and so forth.\n\n0:09:15\tSPEAKER_05\n How long was it from when somebody finished an utterance to when something started happening?\n\n0:09:27\tSPEAKER_04\n We had a silence detector, so we would look for the end of an utterance based on the silence detector.\n\n0:09:35\tSPEAKER_04\n And I can't remember now if the top of my head, how many frames of silence we had to detect before we would declare it to be the end of an utterance.\n\n0:09:46\tSPEAKER_04\n But it was, I would say it was probably around the order of 250 milliseconds.\n\n0:09:51\tSPEAKER_05\n Yeah.\n\n0:09:52\tSPEAKER_05\n And that's when you'd start doing things.\n\n0:09:55\tSPEAKER_04\n Yeah, we did the backtrace at that point to get the answer.\n\n0:09:58\tSPEAKER_04\n Of course, I didn't take too long at that point.\n\n0:10:00\tSPEAKER_04\n It was pretty quick.\n\n0:10:01\tSPEAKER_05\n So you had a quarter second delay before plus some little processing time.\n\n0:10:10\tSPEAKER_05\n And then the microscope would start moving or something.\n\n0:10:14\tSPEAKER_05\n Right.\n\n0:10:15\tSPEAKER_05\n And there's physical inertia there, so probably the motion itself.\n\n0:10:19\tSPEAKER_04\n And it felt to the users that it was instantaneous.\n\n0:10:24\tSPEAKER_04\n I mean, as fast as talking to a person, I don't think anybody ever complained about the delay.\n\n0:10:30\tSPEAKER_05\n So you would think as long as it's under half a second or something.\n\n0:10:33\tSPEAKER_04\n Yeah.\n\n0:10:34\tSPEAKER_04\n I don't remember the exact numbers, but something like that.\n\n0:10:40\tSPEAKER_04\n I don't think you can really tell a person, I don't think a person can tell the difference between a quarter of a second and a hundred milliseconds.\n\n0:10:50\tSPEAKER_04\n Yeah.\n\n0:10:51\tSPEAKER_04\n I'm not even sure if you can tell the difference between a quarter of a second and a half a second.\n\n0:10:54\tSPEAKER_04\n Yeah.\n\n0:10:55\tSPEAKER_04\n I mean, it just feels so quick.\n\n0:10:57\tSPEAKER_05\n Yeah, if you said, what's the shortest route to the opera?\n\n0:11:06\tSPEAKER_05\n And it took half a second to get back to you.\n\n0:11:09\tSPEAKER_05\n Yeah.\n\n0:11:10\tSPEAKER_05\n I mean, it might be too abrupt.\n\n0:11:13\tSPEAKER_05\n You might have to put it in.\n\n0:11:15\tSPEAKER_04\n It may feel different than talking to a person because when we talk to each other, we tend to step on each other's utterances.\n\n0:11:21\tSPEAKER_04\n Yeah.\n\n0:11:27\tSPEAKER_04\n So like if I'm asking you a question, you may start answering before I'm even done.\n\n0:11:30\tSPEAKER_04\n Right.\n\n0:11:31\tSPEAKER_05\n So it would probably feel different, but I don't think it would feel slow.\n\n0:11:36\tSPEAKER_05\n All right.\n\n0:11:37\tSPEAKER_05\n Not anyway.\n\n0:11:38\tSPEAKER_05\n I mean, I think we could cut, we know else we could cut down on the neural net time by, by, by, uh, playing around a little bit going more into the past or something like that.\n\n0:11:45\tSPEAKER_05\n We talked about that.\n\n0:11:47\tSPEAKER_04\n How far away do you think the neural net is going to relate and see from the neural net caused by how far ahead you're looking?\n\n0:11:53\tSPEAKER_05\n And there's also, well, there's neural net and there's also this multi-frame, uh, KLT.\n\n0:12:02\tSPEAKER_04\n Was it in the recurrent neural nets where they weren't looking ahead at all?\n\n0:12:07\tSPEAKER_05\n They weren't looking ahead much.\n\n0:12:10\tSPEAKER_04\n They looked ahead a little bit.\n\n0:12:13\tSPEAKER_05\n Yeah, I mean, you could do this with a recurrent net.\n\n0:12:18\tSPEAKER_05\n But you also could just, I mean, we have an experiment with this, but I imagine you could predict a label from more in the past than in the future.\n\n0:12:35\tSPEAKER_05\n We've done some stuff with that before.\n\n0:12:37\tSPEAKER_05\n I think it works okay.\n\n0:12:39\tSPEAKER_04\n We've always had, usually we use the symmetric windows, but yeah, but we played a little bit with asymmetric.\n\n0:12:46\tSPEAKER_05\n You can do it.\n\n0:12:49\tSPEAKER_05\n So, that's what you're busy with.\n\n0:12:54\tSPEAKER_05\n Oh, yeah.\n\n0:12:57\tSPEAKER_00\n Also, we were thinking to apply the spectral saturation from Ericsson and to change the contextual RKLT for LDA.\n\n0:13:15\tSPEAKER_04\n Change the way?\n\n0:13:17\tSPEAKER_00\n The contextual RKLT.\n\n0:13:19\tSPEAKER_04\n I'm missing that last word.\n\n0:13:21\tSPEAKER_00\n KLT.\n\n0:13:22\tSPEAKER_00\n KLT, oh, KLT.\n\n0:13:24\tSPEAKER_00\n I'm just using LDA, this community.\n\n0:13:29\tSPEAKER_01\n Yeah.\n\n0:13:30\tSPEAKER_00\n How do you mean?\n\n0:13:35\tSPEAKER_04\n What is the advantage of that?\n\n0:13:38\tSPEAKER_01\n Well, it's that, well, for a moment we have something that's discriminant and nonlinear.\n\n0:13:43\tSPEAKER_01\n And the other is linear, but it's not discriminant.\n\n0:13:46\tSPEAKER_01\n I thought, well, it's a linear transformation.\n\n0:13:51\tSPEAKER_05\n So, at least just to understand maybe what the difference was between how much you were getting from just putting the frames together and how much you're getting from the discriminative, what the nonlinear already does for you or doesn't do for you.\n\n0:14:03\tSPEAKER_05\n Just to understand it a little better, I guess.\n\n0:14:07\tSPEAKER_01\n What, yeah.\n\n0:14:10\tSPEAKER_01\n Actually, what we want to do, perhaps it's to replace 212, something that's discriminant, but linear.\n\n0:14:18\tSPEAKER_01\n And to see if it's fitting proof of work or the non-discriminating of transformation.\n\n0:14:25\tSPEAKER_01\n And if the new run net is better than this.\n\n0:14:28\tSPEAKER_05\n Yeah, well, that's why I'm honest.\n\n0:14:30\tSPEAKER_05\n To see whether, whether having a neural net really buys you anything.\n\n0:14:33\tSPEAKER_05\n I mean, it did look like it buys you something over just the KLT, but maybe it's just discrimination.\n\n0:14:39\tSPEAKER_05\n And maybe, yeah, maybe the nonlinear discrimination isn't necessary.\n\n0:14:44\tSPEAKER_05\n Good to know.\n\n0:14:46\tSPEAKER_05\n But the other part you're saying was the spectrosotraction.\n\n0:14:49\tSPEAKER_05\n So, just kind of, at what stage do you do that?\n\n0:14:52\tSPEAKER_05\n Do you, doing that?\n\n0:14:55\tSPEAKER_01\n So, it would be on the...\n\n0:14:58\tSPEAKER_01\n An undemanding.\n\n0:15:00\tSPEAKER_00\n Yeah.\n\n0:15:01\tSPEAKER_00\n Okay, so just do that on the phone before.\n\n0:15:03\tSPEAKER_00\n We were thinking to do before after the video.\n\n0:15:06\tSPEAKER_00\n Or we don't know exactly when we spent it before after the video.\n\n0:15:13\tSPEAKER_05\n So, you know that the way that there's one thing that would be no good to find out about from this conference call is that what they were talking about, what they're proposing doing, was having a third party run a good VAD and determine boundaries.\n\n0:15:32\tSPEAKER_05\n Yeah.\n\n0:15:33\tSPEAKER_05\n And then given those boundaries, then everybody do the recognition.\n\n0:15:38\tSPEAKER_05\n The reason for that was that if someone, one group put in the VAD and another didn't, or one had a better VAD than the other, since they're not viewing that as being part of the task and that any manufacturer would put a bunch of effort on having some kind of good speech-science detection still wouldn't be perfect.\n\n0:16:03\tSPEAKER_05\n But I mean, the argument was let's not have that be part of this task.\n\n0:16:07\tSPEAKER_05\n Let's separate that out.\n\n0:16:10\tSPEAKER_05\n And so, I guess they argued about that yesterday.\n\n0:16:14\tSPEAKER_05\n And I'm sorry, I don't know the answer, but we should find out.\n\n0:16:17\tSPEAKER_05\n I'm sure we'll find out soon what they decided.\n\n0:16:23\tSPEAKER_05\n So, yeah, so there's a question of the VAD, but otherwise it's on the Mel filter bank energy, I guess.\n\n0:16:31\tSPEAKER_05\n You're doing the thing.\n\n0:16:33\tSPEAKER_05\n And you're just attracting in the power domain, or magnitude domain, probably power domain.\n\n0:16:42\tSPEAKER_01\n I guess it's power domain.\n\n0:16:44\tSPEAKER_01\n I don't remember exactly.\n\n0:16:46\tSPEAKER_01\n So it's before everything else.\n\n0:16:48\tSPEAKER_05\n If you look at the theory, it should be in the power domain.\n\n0:16:51\tSPEAKER_05\n But I've seen implementations for people to do the magnitude domain.\n\n0:16:55\tSPEAKER_05\n They ask people why and they strike their shoulders and say, oh, it works.\n\n0:17:04\tSPEAKER_05\n And I guess this is mysterious.\n\n0:17:06\tSPEAKER_05\n I mean, people who do this a lot, I guess, have developed little tricks of the trade.\n\n0:17:10\tSPEAKER_05\n I mean, there's this, you don't just subtract the estimate of the noise spectrum, you subtract it at times or less.\n\n0:17:18\tSPEAKER_01\n Good.\n\n0:17:20\tSPEAKER_01\n Yeah.\n\n0:17:21\tSPEAKER_01\n And generally, this, so you have the estimation of the power spectrum of the noise.\n\n0:17:28\tSPEAKER_01\n You multiply this by a factor, which is dependent on the SNR.\n\n0:17:32\tSPEAKER_01\n So when the signal level is more important, compared to this noise level, the coefficient is small around one.\n\n0:17:44\tSPEAKER_01\n But when the signal level is a small compared to the noise level, the coefficient is more important.\n\n0:17:55\tSPEAKER_01\n And this reduce, actually, the musical noise, which is more important during silence portions.\n\n0:18:01\tSPEAKER_01\n The energy is small.\n\n0:18:04\tSPEAKER_01\n So there are tricks like this.\n\n0:18:06\tSPEAKER_01\n Yeah.\n\n0:18:09\tSPEAKER_04\n Is the estimate of the noise spectrum a running estimate?\n\n0:18:16\tSPEAKER_05\n Yeah.\n\n0:18:18\tSPEAKER_05\n Well, that's, I mean, that's what differs from different tasks and different spectral subtraction methods.\n\n0:18:25\tSPEAKER_05\n I mean, if you have a fair assurance that the noise is quite stationary, then the smartest thing to do is use as much data as possible to estimate the noise, get a much better estimate and subtract it off.\n\n0:18:41\tSPEAKER_05\n But if it's varying at all, which is going to be the case from almost any real situation, you have to do it online with some forgetting factors.\n\n0:18:51\tSPEAKER_04\n So do you, is there some long window that extends into the past over which you calculate the average?\n\n0:18:59\tSPEAKER_05\n Well, there's a lot of different ways of computing the noise spectrum.\n\n0:19:02\tSPEAKER_05\n So one of the things that Hans Gunter Hirsch did, and other people, actually, he's, isn't anyone, I guess, was to take some period of speech and in each band to develop a histogram.\n\n0:19:20\tSPEAKER_05\n So to get a decent histogram of these energies takes at least a few seconds, really.\n\n0:19:26\tSPEAKER_05\n But you can do it with a smaller amount, but it's pretty rough.\n\n0:19:31\tSPEAKER_05\n And in fact, I think the NIST standard method of determining signal noise ratio is based on this.\n\n0:19:38\tSPEAKER_05\n So a couple of seconds?\n\n0:19:40\tSPEAKER_05\n No, it's based on this kind of method, this histogram method.\n\n0:19:43\tSPEAKER_05\n So you have a histogram.\n\n0:19:44\tSPEAKER_05\n Now, if you have signal and you have noise, you basically have these two bumps in histogram.\n\n0:19:50\tSPEAKER_05\n She could approximate its two Gaussian's.\n\n0:19:53\tSPEAKER_04\n But don't they overlap sometimes?\n\n0:19:55\tSPEAKER_05\n Oh, yeah.\n\n0:19:56\tSPEAKER_05\n So you have a mixture of two Gaussian's.\n\n0:19:58\tSPEAKER_05\n Yeah.\n\n0:19:59\tSPEAKER_05\n Right, you can use EM to figure out what it is.\n\n0:20:01\tSPEAKER_05\n So basically now you have this mixture of two Gaussian's.\n\n0:20:03\tSPEAKER_05\n You know what they are, and I mean, sorry, you estimate what they are.\n\n0:20:07\tSPEAKER_05\n And so this gives you what the signal is and what the noise energy is in that band and the spectrum.\n\n0:20:13\tSPEAKER_05\n And then you look over the whole thing and then you have a noise spectrum.\n\n0:20:16\tSPEAKER_05\n So Hans-Gunther Hirsch and others have used that kind of method.\n\n0:20:20\tSPEAKER_05\n And the other thing to do is which is sort of more trivial and obvious is to determine through magical means that there's no speech in some period and see what the spectrum is.\n\n0:20:33\tSPEAKER_05\n And you know, that's strictly due, it has mistakes.\n\n0:20:38\tSPEAKER_05\n And if you've got enough time, this other method appears to be somewhat more reliable.\n\n0:20:43\tSPEAKER_05\n A variant on that for just determining signals and noise ratio is to just, you can do an iterative thing, yeah, I'm like thing to determine means only, I guess it is EM still, but just determine the means only.\n\n0:21:06\tSPEAKER_05\n Don't worry about the variances.\n\n0:21:08\tSPEAKER_04\n And then just use those mean values as being the noise ratio in that band.\n\n0:21:14\tSPEAKER_04\n Depending on where the window was that you used to calculate the signal and noise ratio.\n\n0:21:22\tSPEAKER_05\n Yeah, sure.\n\n0:21:23\tSPEAKER_05\n But, that's certainly because if you start looking to the future, right?\n\n0:21:26\tSPEAKER_04\n Okay, well that was my question.\n\n0:21:27\tSPEAKER_05\n Yeah, I mean, if you just, if you, at the beginning you have some gas.\n\n0:21:33\tSPEAKER_05\n Yes, some gas.\n\n0:21:36\tSPEAKER_05\n Yeah, interesting question. I wonder how they did.\n\n0:21:38\tSPEAKER_01\n Actually, it's if you want to have good estimation on non-stationary noise, you have to look in the future.\n\n0:21:45\tSPEAKER_01\n I mean, if you take your window and build your Instagram on this window, what you can expect is to have an estimation of the noise in the middle of the window.\n\n0:21:55\tSPEAKER_01\n Not at the end, so.\n\n0:21:56\tSPEAKER_01\n Well, yeah, but what does, what does our hotel do?\n\n0:22:01\tSPEAKER_01\n They just look in the past, I guess it works because the noise are almost stationary.\n\n0:22:07\tSPEAKER_05\n Well, the thing, I mean, you talk about non-stationary noise, but I think that sexual subtraction is rarely, is not going to work really well for non-stationary noise.\n\n0:22:15\tSPEAKER_01\n Well, if you have a good estimation of the noise, yeah, because, what do you, let's talk about it.\n\n0:22:20\tSPEAKER_01\n That's hard to do.\n\n0:22:21\tSPEAKER_05\n Yeah, that's hard to do.\n\n0:22:22\tSPEAKER_05\n So, I think that what is, what's more common is that you're going to be helped with slowly varying or stationary noise.\n\n0:22:32\tSPEAKER_05\n That's what spectral subtraction will help with, practically speaking.\n\n0:22:35\tSPEAKER_05\n If it varies a lot, to get a good estimate, you need a few seconds of speech, even if it's centered.\n\n0:22:42\tSPEAKER_05\n If you need a few seconds to get a decent estimate, but it's changed a lot in a few seconds, then, you know, it's kind of a problem.\n\n0:22:50\tSPEAKER_05\n I mean, imagine five hertz is the middle of the speech modulation spectrum, right?\n\n0:22:55\tSPEAKER_05\n So imagine a jackhammer growing in five hertz.\n\n0:22:58\tSPEAKER_05\n I mean, good luck, so.\n\n0:23:00\tSPEAKER_01\n So in this case, yeah, sure, you can.\n\n0:23:05\tSPEAKER_01\n But I think, uh, earth does experiment with windows of, like, between 500 milliseconds in one second.\n\n0:23:14\tSPEAKER_01\n And, well, 500 was not so bad.\n\n0:23:18\tSPEAKER_01\n And he worked on non-stationary noise.\n\n0:23:21\tSPEAKER_01\n He's like, noise modulated with, well, with, with, with, and between modulation, so things like that.\n\n0:23:29\tSPEAKER_04\n So, what is, uh, windows centered around that?\n\n0:23:34\tSPEAKER_01\n Yeah, well, I think, yeah, when the paper we show that, actually, the estimation of the noise is delayed while it's, there is, you have to center the window.\n\n0:23:44\tSPEAKER_05\n Yeah.\n\n0:23:45\tSPEAKER_05\n No, I understand it's better to do, but I just think that, uh, for real noises, what, what's most likely to happen is that there'll be some things that are relatively stationary where you can use one or another spectral subtraction thing.\n\n0:23:57\tSPEAKER_05\n And, uh, there's a lot of things where it's not so stationary.\n\n0:24:00\tSPEAKER_05\n I mean, you can always pick something that, that falls between your methods.\n\n0:24:05\tSPEAKER_05\n But I don't know if, you know, sinusoidally, amplitude modulated noise is sort of a big problem in practice, I think.\n\n0:24:14\tSPEAKER_04\n Yeah.\n\n0:24:15\tSPEAKER_04\n We could probably get a really good estimate of the noise if we just went to the noise files and built the averages from them.\n\n0:24:22\tSPEAKER_01\n What do you, he's actually, but if the noise is stationary, perhaps we don't even need some kind of noise estimation algorithm, just take the beginning of the utterance.\n\n0:24:39\tSPEAKER_01\n Oh, yeah, sure.\n\n0:24:40\tSPEAKER_01\n I know, I don't know if people try this for, well, everybody seems to use some kind of adaptive, but, but, but, but, it's game, but, you know, stationary useful.\n\n0:24:50\tSPEAKER_05\n Very useful. Very slow adaptation.\n\n0:24:52\tSPEAKER_05\n Right. The word stationary is a very precise statistical meaning, but, you know, in, in signal processing, really, what we're talking about, I think, is things that change slowly compared with our processing techniques.\n\n0:25:04\tSPEAKER_05\n So, if you're driving along in a car, I, I would think that most of the time the nature of the noise is going to change relatively slowly.\n\n0:25:12\tSPEAKER_05\n It's not going to stay absolutely the same if you, if you check it out five minutes later, you may be in a different part of the road or whatever, but it's, it's using the local characteristics.\n\n0:25:25\tSPEAKER_05\n Time is probably going to work pretty well, but you could get hurt a lot if you just took something from the beginning of all the speech of, you know, an hour speech and that lighter.\n\n0:25:35\tSPEAKER_05\n So, they may be, you know, maybe overly complicated for, for this test, but, but, but, I don't know.\n\n0:25:45\tSPEAKER_05\n But what you're saying, you know, makes sense though. I mean, if possible, you should, you should make it center of the center of the window, but we're already having problems with these delay.\n\n0:25:59\tSPEAKER_05\n Yeah, it's a bit of a waste without it.\n\n0:26:08\tSPEAKER_04\n If they're going to provide a voice activity detector that will tell you the boundaries of the speech, then couldn't you just go outside those boundaries and do your estimate there?\n\n0:26:21\tSPEAKER_04\n Oh yeah.\n\n0:26:24\tSPEAKER_05\n Yeah, so I imagine that's what they're doing, right?\n\n0:26:30\tSPEAKER_05\n They're probably looking in non-speech sections and getting some, yeah, they have some kind of threshold on the previous estimate.\n\n0:26:38\tSPEAKER_01\n So, yeah, I think, I think, Ericsson used this kind of threshold.\n\n0:26:46\tSPEAKER_01\n Yeah, so they have an estimate of the noise level and they put a threshold like 6 or 10 dB above.\n\n0:26:54\tSPEAKER_01\n What's under this threshold is used to update the estimate.\n\n0:26:58\tSPEAKER_01\n Isn't that right?\n\n0:27:00\tSPEAKER_00\n I think so.\n\n0:27:02\tSPEAKER_00\n So, it's, yeah.\n\n0:27:03\tSPEAKER_01\n It's like saying what's under the threshold is silence.\n\n0:27:06\tSPEAKER_05\n Does trans talk harm do the same thing?\n\n0:27:10\tSPEAKER_01\n I, you know, perhaps?\n\n0:27:13\tSPEAKER_00\n No, I have no idea what that is.\n\n0:27:25\tSPEAKER_05\n Okay, we're done with that.\n\n0:27:29\tSPEAKER_05\n Let's see.\n\n0:27:31\tSPEAKER_05\n Maybe we talked about a couple of other things, briefly, just things that we've been chatting about.\n\n0:27:37\tSPEAKER_05\n And these meetings yet, so you're coming up with your Quiles proposal.\n\n0:27:43\tSPEAKER_05\n And when I just give a two, three minute summary of what you're about to be doing.\n\n0:27:51\tSPEAKER_02\n Two, three, you can be sure of that.\n\n0:27:55\tSPEAKER_02\n Well, I've talked to somebody already, but I'm looking into extending the work done by Larry Saw and John Allen and Mazinari.\n\n0:28:06\tSPEAKER_02\n They have a system that's a multi-band system, but the multi-band is a little different than the way that we've been doing multi-band in the past, where we've been taking subband features and training up these new formats and on phonetic targets and then combining them somehow down the line.\n\n0:28:31\tSPEAKER_02\n They're taking subband features and training up a detector that detects for these phonetic features.\n\n0:28:43\tSPEAKER_02\n For example, it presents a detector to detect sonorous.\n\n0:28:50\tSPEAKER_02\n And so what it basically is, there's at the lowest level, it's an AND gate.\n\n0:28:59\tSPEAKER_02\n So on each subband, you have several independent tests to test whether there's the existence of sonorous in a subband.\n\n0:29:09\tSPEAKER_02\n And then it's combined by a soft AND gate.\n\n0:29:13\tSPEAKER_02\n And then at the higher level, for every, if the higher level, there's a soft or gate.\n\n0:29:21\tSPEAKER_02\n If this detector detects the presence of sonorous in any of the subband, then the or gate at the top says, okay, well, this frame has evidence of sonorous.\n\n0:29:35\tSPEAKER_04\n What are some of the low-level detectors that they use?\n\n0:29:38\tSPEAKER_02\n Well, the low-level detectors are logistic regressions.\n\n0:29:44\tSPEAKER_05\n And the one other way, basically, is one of the units in our neural networks.\n\n0:29:51\tSPEAKER_05\n That's all it is.\n\n0:29:52\tSPEAKER_05\n It's a sigmite with weighted sum of TMP.\n\n0:29:56\tSPEAKER_05\n Is it trained by gradient?\n\n0:29:59\tSPEAKER_02\n Yes.\n\n0:30:00\tSPEAKER_02\n So he uses an EM algorithm to train up these parameters for logistic regression?\n\n0:30:07\tSPEAKER_05\n Well, actually, so he's using EM to get the targets.\n\n0:30:12\tSPEAKER_05\n So you have this AND gate, calling an AND gate, but it's a product, product rule thing at the output.\n\n0:30:19\tSPEAKER_05\n And then he uses, and then feeding into that, or, I'm sorry, it's nor at the output, isn't it?\n\n0:30:26\tSPEAKER_05\n Yeah, that's the product.\n\n0:30:27\tSPEAKER_05\n And then he has each of these AND things.\n\n0:30:34\tSPEAKER_05\n So they're little neural units, and they have to have targets.\n\n0:30:42\tSPEAKER_05\n So the targets come from the EM.\n\n0:30:45\tSPEAKER_04\n And so are each of these low-level detectors?\n\n0:30:52\tSPEAKER_04\n Are these something that you decide ahead of time, like I'm going to look for this particular feature, and look at this frequency, or what are they looking at?\n\n0:31:01\tSPEAKER_04\n What are their input?\n\n0:31:02\tSPEAKER_02\n Right, so the, okay, so, for each subband, there are basically several measures of SNR and correlation.\n\n0:31:12\tSPEAKER_02\n Oh, okay.\n\n0:31:13\tSPEAKER_02\n And he said there's like 20 of these per subband.\n\n0:31:19\tSPEAKER_02\n And for every subband, you just take ahead of time, I'm going to have like five independent logistic tests.\n\n0:31:29\tSPEAKER_02\n And you initialize these parameters in some way, and use the EM to come up with your training targets for the low-level detectors.\n\n0:31:41\tSPEAKER_02\n And then once you get that done, you train the whole thing on maximum likelihood.\n\n0:31:48\tSPEAKER_02\n And he showed that using this method to detect sonarances is very robust compared to two typical full band Gaussian mixture estimations of sonnets.\n\n0:32:05\tSPEAKER_02\n And so that's just one detector.\n\n0:32:09\tSPEAKER_02\n And you can imagine building many of these detectors on different features, you get enough of these detectors together, then you have enough information to do higher-level discrimination, example discriminating between phones, and then you keep working your way up and telling you to build a full recognizer.\n\n0:32:28\tSPEAKER_02\n So that's the direction I'm thinking about going.\n\n0:32:33\tSPEAKER_02\n Cool.\n\n0:32:34\tSPEAKER_05\n It has a number of properties that I really like.\n\n0:32:39\tSPEAKER_05\n I mean, one is going towards using narrow band information for phonetic features of some sort rather immediately going for the typical sound units.\n\n0:32:54\tSPEAKER_05\n Another thing I like about it is that this thing is going to be explicitly trained for a product of errors rule, which is what Alan keep pointing out that Fletcher is observed in the 20s for people listening to narrow band stuff.\n\n0:33:10\tSPEAKER_05\n That's Friday's time.\n\n0:33:12\tSPEAKER_05\n And the third thing I like about it is, and we've played around with this in a different kind of way a little bit, but it hasn't been a dominant way of evaporating, I think.\n\n0:33:27\tSPEAKER_05\n This issue of where the targets come from.\n\n0:33:30\tSPEAKER_05\n I mean, in our case, when we've been training at multi-band things, the way we get the targets for the individual bands is that we get the phonetic label of the sound.\n\n0:33:44\tSPEAKER_05\n But this is saying, that's maybe what our ultimate goal is, or not ultimate, but an ultimate goal is getting these small sound units. But along the way, what should we be training these intermediate things for?\n\n0:34:03\tSPEAKER_05\n I mean, because we don't know that this is a particularly good feature. There's no way someone in the audience yesterday was asking, well, couldn't you have people go through a market for the individual bands and say where they're in the first place on earth?\n\n0:34:17\tSPEAKER_05\n But I think having a bunch of people listening to critical band-wide, I think it would be possible. It's all going to sound like sign waves to you more or less. Well, narrow band.\n\n0:34:33\tSPEAKER_05\n I think it's very hard for someone to make that determination. So we don't really know how those should be labeled. It could be that you should not be paying that much attention to certain bands for certain sounds, in order to get the results.\n\n0:34:54\tSPEAKER_05\n So what we have been doing there to sort of mixing it all together is certainly much, much cruder than that. We train these things up on the final label. Now we have, I guess, done experiments. You've probably done stuff where you have done separate the therapies on the different force alignment on the subband labels.\n\n0:35:17\tSPEAKER_05\n Yeah, you've done that. Did that help at all? It helps for one iteration, but anything after that, it doesn't help. So that may or may not be helpful because in the sense that's the same sort of thing. You're taking global information and determining how you should.\n\n0:35:37\tSPEAKER_05\n But this is, I think, a little more direct. How do they measure the performance of their detector? Well, he's just actually looking at the confusions between sound and non-sound.\n\n0:35:50\tSPEAKER_05\n So he hasn't applied it to recognition, or if he did, he didn't talk about it. And one of the concerns in the audience actually was that he did a comparison to an old foil that asked the old standard recognizing it with, well, no filter bank at the front and HM admins and so forth.\n\n0:36:13\tSPEAKER_05\n And it didn't do nearly as well, especially in noise. But the good questions in the audience was, well, yeah, but that was great for that. I mean, the use of a very smooth, a spectral envelope is something that has evolved generally a good thing for speech recognition.\n\n0:36:33\tSPEAKER_05\n But if you knew that what you were going to do is detect sounder, it's not. So sounder, it's almost like voice down voice to accept, I guess, that the voice stops are also called up joints.\n\n0:36:46\tSPEAKER_05\n So it's, it's, but with the exception of the stops, I guess it's pretty much the same as voice down voice, right? So, so if you knew you were doing that, if you were doing something safe for a vocoder, you wouldn't use the same kind of features. You would use something that was sensitive to the periodicity and not just the envelope. And so in that sense, it was an unfair test.\n\n0:37:12\tSPEAKER_05\n So I think the question was right. It was, in that sense, an unfair test. Nonetheless, it was one that was interesting because this is what we are actually using for speech recognition, these sort of envelopes.\n\n0:37:24\tSPEAKER_05\n This says that perhaps even trying to use them the best way we can that we ordinarily do with Gaussian mixers and, did you mention so forth, you don't actually do that well on determining whether something is sounder or not, which means you're going to make errors between similar sounds that are sounder or instrument.\n\n0:37:43\tSPEAKER_04\n Didn't they also do some kind of an oracle experiment where they said if we could detect sounder and perfectly and then show how it would improve speech recognition, I thought I remember hearing about an experiment like that.\n\n0:37:58\tSPEAKER_05\n These same people? I don't remember that. That's, you're right. That's exactly the question to follow up this discussion. I suppose you did that. Got that right.\n\n0:38:11\tSPEAKER_01\n Yeah. What could be the other low level detectors and for other kind of features in addition to detecting sounder and sounder?\n\n0:38:24\tSPEAKER_02\n That's what you want to go for. So, what? Oh, build other other, other, other different different features.\n\n0:38:35\tSPEAKER_02\n Let's see. Yeah, I don't know. Easiest thing would be to go do some voicing stuff, but that's very similar to sounder.\n\n0:38:55\tSPEAKER_04\n When we talked with John O'Halla the other day, we made a list of some of the things like forcation, abrupt closure, our coloring, naizality, voicing.\n\n0:39:08\tSPEAKER_05\n Yeah, so is it half doesn't like that better? Now this was coming at it from a different angle, but maybe it's a good way to start with these things, which John felt that a human annotator would be able to reliably mark.\n\n0:39:22\tSPEAKER_05\n So the sort of things he felt would be difficult for a human annotator to reliably mark would be tongue position.\n\n0:39:29\tSPEAKER_04\n Please, thanks. Yeah. Yeah. There's also things like stress.\n\n0:39:35\tSPEAKER_05\n But stress doesn't fit in this thing of coming up with features that will distinguish words from one another.\n\n0:39:43\tSPEAKER_05\n It's a good thing to mark and will probably help us ultimately.\n\n0:39:46\tSPEAKER_04\n Yeah, there's a few cases where it can like permit, permit, but that's not very common in English. In other languages, it's more important.\n\n0:39:57\tSPEAKER_05\n Well, yeah, but either case you'd write P, R, I, T, you get the word right.\n\n0:40:02\tSPEAKER_04\n No, I'm saying, I thought you were saying that stress doesn't help you distinguish between words.\n\n0:40:08\tSPEAKER_04\n Oh, I see what you're saying. As long as you get the secret. We're talking about transcriptionists.\n\n0:40:13\tSPEAKER_04\n Yeah, yeah, yeah. Yeah. Yeah. Right. So where it could help is maybe at a higher level. Right. Yeah. Understandings. Yeah. Yeah. Yeah.\n\n0:40:20\tSPEAKER_05\n Exactly. But that's this afternoon's meeting. Yeah. That's what I understand. That's what I'm saying.\n\n0:40:27\tSPEAKER_05\n Yeah. So that's, yeah, that's, you know, the neat thing.\n\n0:40:34\tSPEAKER_02\n So, oh, how that's going to help you with these transcription of the leading data?\n\n0:40:41\tSPEAKER_04\n Well, I don't know. We, we sort of didn't get that far. We just talked about some possible features that could be marked by humans.\n\n0:40:52\tSPEAKER_04\n And because of having maybe some extra transcribe or time, we thought we could go through and mark some portion of the data for that.\n\n0:41:00\tSPEAKER_05\n Yeah. That's not an immediate problem. We have a lot of extra transcribe.\n\n0:41:05\tSPEAKER_05\n Right. But I'm long term, I guess, Chuck is going to continue to dialogue with John.\n\n0:41:12\tSPEAKER_04\n Well, we'll end up doing some. I'm definitely interested in this area too.\n\n0:41:17\tSPEAKER_04\n A acoustic feature. Okay. Stuff.\n\n0:41:20\tSPEAKER_05\n Yeah. I think it's an interesting, interesting way to go.\n\n0:41:24\tSPEAKER_05\n I said, it's an amazing thing. There's never good things.\n\n0:41:29\tSPEAKER_05\n So, we're going to talk maybe two, three minutes about what we've been talking about, right?\n\n0:41:36\tSPEAKER_03\n Yeah. Okay. So, we're interested in methods for far-makes, speech recognition, mainly methods to deal with the reverberation in the far-makes signals.\n\n0:41:48\tSPEAKER_03\n So, one approach would be, say, MSG and PLP, like was used in Aurora 1, and there are other approaches which actually attempt to remove the reverberation instead of being robust to it like MSG.\n\n0:42:04\tSPEAKER_03\n And so, we're interested in comparing the performance of a robust approach like MSG with these speech enhancement or do reverberation approaches.\n\n0:42:17\tSPEAKER_03\n And it looks like we're going to use the meeting recorded digits that after that.\n\n0:42:24\tSPEAKER_01\n And the dear reverberation algorithm. Can you give some more details on this? Use one microphone.\n\n0:42:31\tSPEAKER_03\n Several microphones. Okay. Well, there was something that was done by a guy named Carla, so I forget his last name. He worked with Hinat, who Evan Donnell. It was like Rasta in the sense of it was deconvolution by filtering, except he used a longer time window like a second maybe. And the reason for that is Rasta's time window is too short to include the whole reverberation.\n\n0:43:02\tSPEAKER_03\n I don't know what you call the reverberation response. If you see what I mean. The reverberation filter for my mouth to that mic is like, it's too long in the time domain for the Rasta filtering to take care of it.\n\n0:43:18\tSPEAKER_03\n And then there are a couple of other speech enhancement approaches which haven't been tried for speech recognition yet, but have just been tried for enhancement, which have the assumption that you can do LPC analysis of the signal you get at the far microphone.\n\n0:43:37\tSPEAKER_03\n And the all-pull filter that you get out of that should be good. It's just the excitation signal that is going to be distorted by the reverberation.\n\n0:43:49\tSPEAKER_03\n And so you can try and reconstruct a better excitation signal and feed that through the all-pull filter and get enhanced speech with reverberation produced.\n\n0:44:04\tSPEAKER_05\n There's also this echo cancellation stuff that's sort of chasing. So when we're seeing these digits now, we do have a close microphone signal. And then there's the distant microphone signal.\n\n0:44:20\tSPEAKER_05\n And you could, as a kind of baseline, say, okay, given that we have both of these, we should be able to do a cancellation so that we essentially identify the system in between the linear time and the varying system between the two microphones and re-cancel it out to some reasonable approximation.\n\n0:44:45\tSPEAKER_05\n That's not a practical thing. If you don't have a close mic, we thought that by making a good baseline. It still won't be perfect because there's no noise.\n\n0:45:00\tSPEAKER_05\n But there are single microphone methods that I think people have done for this kind of due reverberation. Do you know any references to any? Because I was, I literally thought that I guess when people are working with single microphones, they are more trying to do, well, not very,\n\n0:45:29\tSPEAKER_01\n well, there is the event and work, but also trying to find the deconvolution filter, but not in the time domain, but in the stream of features. But there's someone working on this in mons, so perhaps, yeah, we should try to, it's working on this on trying to, on reverberation.\n\n0:46:03\tSPEAKER_05\n The first paper on this is going to have great references. I can tell you what I mean. I always go to have references, especially when reviewers read it or one of the authors, and you're okay, you cited me.\n\n0:46:21\tSPEAKER_01\n Well, it did deconvolution, and it did some fancier things like training different network and different reverberation conditions, and then trying to find the best one.\n\n0:46:36\tSPEAKER_05\n The other thing that Dave was talking about earlier was multiple mic things, where they're all distant. So, I mean, there's all this work in the race, but the other thing is, what can we do that's clever, that can take some advantage of only two mics, particularly if there's an obstruction between them.\n\n0:46:57\tSPEAKER_05\n It creates a shadow, which is helpful, it's part of why you have such good direction. We've two ears, even though they're not several feet apart, for most people, since.\n\n0:47:12\tSPEAKER_05\n That could help though. That's what it's for. It's basically heads for, separate ears.\n\n0:47:30\tSPEAKER_04\n Okay, I think that's all we have this week, and I think it's digit time. Actually, for some reason, the digit forms are blank. I think that maybe due to the fact that Adam ran out of digits, and didn't have time to regenerate it.\n\n0:47:48\tSPEAKER_04\n Well, this is no real reason to write our names on here. If you want to put your credit card numbers, or do we need the names for the other stuff? Yeah, I do need your names and the time and all that, because we put that into the key files.\n\n0:48:03\tSPEAKER_05\n Okay, that's why we have the forms. Okay, yeah, I didn't notice this. I was sitting here. I was in a box reading.\n\n0:48:12\tSPEAKER_05\n So, I guess we're done. I'll do my credit card later.\n\n", "summary": [{"summary_text": "SPEAKER and Sonia took the LDA filters and redesigned new filters using recursive filters. The new filters have the same frequency response as the old ones, but shorter delays. They have the filters, but they still have to implement the routine that does recursively filtering."}]}