{"filename": "./data/Bro019.txt", "transcript": "0:00:00\tSPEAKER_06\n We're on.\n\n0:00:02\tSPEAKER_06\n 24th?\n\n0:00:03\tSPEAKER_02\n Yeah.\n\n0:00:04\tSPEAKER_02\n Joggy's a mic, wireless?\n\n0:00:06\tSPEAKER_02\n Yes.\n\n0:00:07\tSPEAKER_02\n Wireless headset?\n\n0:00:08\tSPEAKER_00\n Yes.\n\n0:00:09\tSPEAKER_00\n Okay.\n\n0:00:10\tSPEAKER_03\n Yeah, for you at this.\n\n0:00:12\tSPEAKER_06\n Yeah, we abandoned the lapel because they sort of were not too hot, not too cold.\n\n0:00:19\tSPEAKER_06\n They were far enough away that you got more background noise and so forth, but they weren't so close that they got quite the really good.\n\n0:00:29\tSPEAKER_06\n They didn't, I'm saying the right, they were not so far away that they were really good representative distant mics.\n\n0:00:36\tSPEAKER_06\n On the other hand, they were not so close that they got rid of all the interference, so it didn't seem to be a good point to them.\n\n0:00:42\tSPEAKER_06\n On the other hand, if you only had to have one mic in some ways, you could argue that lapel was a good choice precisely because it's in the middle.\n\n0:00:49\tSPEAKER_06\n There's some kinds of junk that you get with these things that you don't get with lapel, little mouth clerks, and breaths, and so forth.\n\n0:00:55\tSPEAKER_06\n They're worse with these than with lapel, but given the choice, we, there seemed to be very strong opinions for getting rid of lapels.\n\n0:01:06\tSPEAKER_06\n So...\n\n0:01:07\tSPEAKER_02\n You mic numbers.\n\n0:01:08\tSPEAKER_03\n Your mic number is written on the back of that unit there?\n\n0:01:11\tSPEAKER_03\n Oh, yeah.\n\n0:01:12\tSPEAKER_03\n And then the channel number is usually one less than that.\n\n0:01:16\tSPEAKER_03\n Oh, okay.\n\n0:01:17\tSPEAKER_03\n It's one less than what's written on the back.\n\n0:01:19\tSPEAKER_03\n Okay.\n\n0:01:20\tSPEAKER_03\n So you should be zero actually.\n\n0:01:22\tSPEAKER_06\n Yep.\n\n0:01:25\tSPEAKER_06\n Or your channel number.\n\n0:01:26\tSPEAKER_06\n You should do a lot of talking so we get a lot more of your pronunciations.\n\n0:01:29\tSPEAKER_03\n So what we usually do is we typically will have our meetings and then at the end of the meetings we'll read the digits.\n\n0:01:37\tSPEAKER_03\n Everybody goes around and reads the digit session.\n\n0:01:39\tSPEAKER_03\n The bottom of their form.\n\n0:01:40\tSPEAKER_03\n Our 19?\n\n0:01:41\tSPEAKER_03\n Our 19.\n\n0:01:42\tSPEAKER_03\n Yeah, we're a succession of our 19.\n\n0:01:44\tSPEAKER_06\n If you say so.\n\n0:01:47\tSPEAKER_06\n Okay, do we have any kind of agenda?\n\n0:01:52\tSPEAKER_06\n What's going on?\n\n0:01:55\tSPEAKER_06\n I guess...\n\n0:01:56\tSPEAKER_06\n So...\n\n0:01:57\tSPEAKER_06\n So they'll see here for the summer, right?\n\n0:02:00\tSPEAKER_06\n So one thing is to talk about a kickoff meeting maybe.\n\n0:02:06\tSPEAKER_06\n And then just, I guess, progress reports individually.\n\n0:02:14\tSPEAKER_06\n And then plans for where we go between now and then pretty much.\n\n0:02:23\tSPEAKER_03\n I could say a few words about some of the compute stuff that's happening around here.\n\n0:02:28\tSPEAKER_03\n So the people in the group know.\n\n0:02:31\tSPEAKER_06\n Okay.\n\n0:02:32\tSPEAKER_06\n Why don't you start with that?\n\n0:02:35\tSPEAKER_03\n So we just put in an order for about 12 new machines to use as sort of a compute farm.\n\n0:02:44\tSPEAKER_03\n And we ordered to send blade 100s.\n\n0:02:48\tSPEAKER_03\n And I'm not sure exactly how long it'll take for those to come in.\n\n0:02:52\tSPEAKER_03\n But in addition, we're running...\n\n0:02:55\tSPEAKER_03\n So the plan for using these is we're running P-Make and Customs here in Andreas has sort of gotten that all fixed up and up to speed.\n\n0:03:03\tSPEAKER_03\n And he's got a number of little utilities that make it very easy to run things using P-Make and Customs.\n\n0:03:10\tSPEAKER_03\n You don't actually have to write P-Make scripts and things like that.\n\n0:03:13\tSPEAKER_03\n The simplest thing.\n\n0:03:14\tSPEAKER_03\n And I can send an email around or maybe I should do an FAQ on the website about it or something.\n\n0:03:20\tSPEAKER_03\n But an email that points to the FAQ.\n\n0:03:23\tSPEAKER_03\n There's a command that you can use called Run command, Run-Command, Run-Hipin command.\n\n0:03:29\tSPEAKER_03\n And if you say that and then some job that you want to execute, it will find the fastest currently available machine and export your job to that machine.\n\n0:03:40\tSPEAKER_03\n And run it there and it'll duplicate your environment.\n\n0:03:43\tSPEAKER_03\n So you can try this as a simple test with the LS command.\n\n0:03:47\tSPEAKER_03\n So you can say Run-Command, LS, and it'll actually export that.\n\n0:03:53\tSPEAKER_03\n LS command to some machine in the institute and do an LS on your current directory.\n\n0:03:58\tSPEAKER_03\n So substitute LS for whatever command you want to run.\n\n0:04:01\tSPEAKER_03\n And that's a simple way to get started using this.\n\n0:04:05\tSPEAKER_03\n And so soon when we get all the new machines up, then we'll have lots more compute to use.\n\n0:04:12\tSPEAKER_03\n Now one of the nice things is that each machine that's part of the P-Make and Customs network has attributes associated with it.\n\n0:04:20\tSPEAKER_03\n Attributes like how much memory the machine has, what its speed is, what its operating system.\n\n0:04:25\tSPEAKER_03\n And when you use something like Run-Command, you can specify those attributes for your program.\n\n0:04:30\tSPEAKER_03\n For example, if you only want your thing to run under Linux, you can give it the Linux attribute.\n\n0:04:35\tSPEAKER_03\n And then it will find the fastest available Linux machine and run it on that.\n\n0:04:39\tSPEAKER_03\n So you can control where your jobs go, to some extent, all the way down to an individual machine.\n\n0:04:44\tSPEAKER_03\n Each machine has an attribute, which is the name of itself.\n\n0:04:47\tSPEAKER_03\n So you can give that as an attribute and it'll only run on that.\n\n0:04:50\tSPEAKER_03\n And if there's already a job running on some machine that you're trying to select, your job will get queued up.\n\n0:04:56\tSPEAKER_03\n And then when that resource, that machine becomes available, your job will yet exported there.\n\n0:05:01\tSPEAKER_03\n So there's a lot of nice features to it and it kind of helps to balance the load of the machines.\n\n0:05:06\tSPEAKER_03\n And right now, Andreas and I have been the main ones using it.\n\n0:05:09\tSPEAKER_03\n And where the SRI recognizer has all this P-Make custom stuff built into it.\n\n0:05:14\tSPEAKER_06\n So as I understand here, he's using all the machines and you're using all the machines.\n\n0:05:18\tSPEAKER_06\n Yeah, exactly.\n\n0:05:21\tSPEAKER_03\n Yeah, you know, I sort of got started using the recognizer just recently and I fired off a training job and then I fired off a recognition job and I get this email about midnight from Andreas saying, are you running two trainings simultaneously?\n\n0:05:36\tSPEAKER_03\n My jobs are not getting run.\n\n0:05:38\tSPEAKER_03\n So I had to back off a little bit.\n\n0:05:40\tSPEAKER_03\n But as soon as we get some more machines, then we'll have more compute available.\n\n0:05:45\tSPEAKER_03\n So that's just a quick update.\n\n0:05:48\tSPEAKER_03\n What we've got.\n\n0:05:50\tSPEAKER_05\n I have a question about the parallelization.\n\n0:05:53\tSPEAKER_05\n So let's say I'm like a thousand little jobs to do.\n\n0:05:57\tSPEAKER_05\n How do I do it with run command?\n\n0:06:00\tSPEAKER_03\n You could write a script, which called run command on each subjob.\n\n0:06:05\tSPEAKER_03\n Right.\n\n0:06:06\tSPEAKER_03\n But you probably want to be careful with that because you don't want to saturate the network.\n\n0:06:13\tSPEAKER_03\n So you should probably not run more than say ten jobs yourself at any one time.\n\n0:06:22\tSPEAKER_03\n Just because then it would keep other people.\n\n0:06:25\tSPEAKER_03\n Well, it's not that so much as that, you know, if everybody ran 50 jobs at once, then it would just bring everything to a halt and people's jobs would get delayed.\n\n0:06:34\tSPEAKER_03\n So it's sort of a sharing thing.\n\n0:06:37\tSPEAKER_03\n So you should try to limit it to sometime, some number around ten jobs at a time.\n\n0:06:42\tSPEAKER_03\n So if you had a script, for example, that had a thousand things that needed to run, you'd somehow need to put some logic in there.\n\n0:06:48\tSPEAKER_03\n If you were going to use run command to only have ten of those going at a time, and then when one of those finished, you'd fire off another one.\n\n0:06:56\tSPEAKER_06\n I remember I figured whether it was when the Rutgers or Hopkins workshop, I remember one of the workshops I was at there where I was really excited because I got 25 machines and there's some kind of p-make-like thing that sent things out.\n\n0:07:08\tSPEAKER_06\n So all 25 people were sending things to all 25 machines.\n\n0:07:11\tSPEAKER_06\n And things were a lot less efficient than if you just used your own machine.\n\n0:07:15\tSPEAKER_06\n Yeah, exactly.\n\n0:07:16\tSPEAKER_03\n It was a very cool thing.\n\n0:07:17\tSPEAKER_03\n Yeah, you have to be a little bit careful.\n\n0:07:20\tSPEAKER_03\n But you can also, if you have that level of parallelization, and you don't want to have to worry about writing the logic in a Perl script to take care of that, you can use p-make.\n\n0:07:30\tSPEAKER_03\n And you're basically right to make a file that, you know, your final job depends on these one thousand things.\n\n0:07:38\tSPEAKER_03\n And when you run p-make on your make file, you can give it the dash capital J and a number, and that number represents how many machines to use at once.\n\n0:07:49\tSPEAKER_03\n And it'll make sure that it never goes above that.\n\n0:07:52\tSPEAKER_03\n Okay.\n\n0:07:53\tSPEAKER_04\n So it's not systematically queued.\n\n0:07:57\tSPEAKER_04\n I mean, all the japs are running.\n\n0:08:00\tSPEAKER_04\n If you launch 20 japs, they're all running.\n\n0:08:03\tSPEAKER_04\n It depends.\n\n0:08:04\tSPEAKER_03\n Because if you run command that I mentioned before, doesn't know about other things that you might be running.\n\n0:08:11\tSPEAKER_03\n So it would be possible to run a hundred run jobs at once.\n\n0:08:16\tSPEAKER_03\n And they wouldn't know about each other.\n\n0:08:18\tSPEAKER_03\n But if you use p-make, then it knows about all the jobs that it has to run.\n\n0:08:23\tSPEAKER_03\n And it can control how many are runs simultaneously.\n\n0:08:27\tSPEAKER_06\n So run command doesn't use p-make?\n\n0:08:29\tSPEAKER_03\n It uses export under-lyingly.\n\n0:08:31\tSPEAKER_03\n But it's meant to be run one job at a time.\n\n0:08:35\tSPEAKER_03\n So you could fire off a thousand of those.\n\n0:08:37\tSPEAKER_03\n And it doesn't know any one of those doesn't know about the other ones that are running.\n\n0:08:41\tSPEAKER_06\n So why would one use that rather than p-make?\n\n0:08:44\tSPEAKER_03\n Well, if you have, like for example, if you didn't want to write a p-make script, and you just had an HTK training job that you know is going to take six hours to run.\n\n0:08:55\tSPEAKER_03\n And somebody's using the machine you typically use.\n\n0:08:59\tSPEAKER_03\n You can say run command and your HTK thing.\n\n0:09:01\tSPEAKER_03\n And it'll find another machine, the fastest currently available machine, and run your job.\n\n0:09:07\tSPEAKER_06\n Now does it have the same sort of behavior as p-make?\n\n0:09:09\tSPEAKER_06\n Which is that, you know, if you run something and somebody's machine, they come in and hit a key, then it's...\n\n0:09:13\tSPEAKER_03\n Yes, yeah.\n\n0:09:14\tSPEAKER_03\n There are...\n\n0:09:16\tSPEAKER_03\n Right.\n\n0:09:17\tSPEAKER_03\n So some of the machines at the institute have this attribute called NOEVICT.\n\n0:09:22\tSPEAKER_03\n And if you specify that in one of your attribute lines, then it'll go to a machine which your job won't be evicted from.\n\n0:09:30\tSPEAKER_03\n But the machines that don't have that attribute, if a job gets fired up on that, which could be somebody's desktop machine, and they were at lunch, they come back from lunch, and they start typing on the console, then your machine will get evicted...\n\n0:09:43\tSPEAKER_03\n Your job will get evicted from their machine and be restarted on another machine automatically.\n\n0:09:47\tSPEAKER_03\n So which can cause you to lose time, right?\n\n0:09:50\tSPEAKER_03\n If you had a two hour job and you got halfway through, and then somebody came back to their machine and got evicted.\n\n0:09:55\tSPEAKER_03\n So if you don't want your job to run on a machine where it could be evicted, then you give it that minus the attribute, you know, NOEVICT.\n\n0:10:03\tSPEAKER_03\n And it'll pick up a machine that it can't be evicted.\n\n0:10:06\tSPEAKER_06\n What about...\n\n0:10:08\tSPEAKER_06\n Remember, it was used to be an issue, maybe it's not anymore, that if you...\n\n0:10:13\tSPEAKER_06\n If something required...\n\n0:10:14\tSPEAKER_06\n If your machine required somebody hitting a key in order to evict things around it, so you could work, but if you were logged into it from home, and you weren't hitting any keys because you were home.\n\n0:10:25\tSPEAKER_03\n Yeah, I'm not sure how that works.\n\n0:10:27\tSPEAKER_03\n It seems like Andreas did something for that.\n\n0:10:30\tSPEAKER_03\n Okay, we can ask him.\n\n0:10:32\tSPEAKER_03\n Yeah, I don't know whether monitors, the keyboard, or it actually looks at the console, TTY, so maybe if you echoed something to the...\n\n0:10:40\tSPEAKER_06\n You probably wouldn't door it in early though, you're right.\n\n0:10:43\tSPEAKER_06\n You probably wouldn't order it in early.\n\n0:10:44\tSPEAKER_06\n I mean, you're sort of...\n\n0:10:45\tSPEAKER_06\n You're at home and you're trying to log in, it takes forever to even log in, and then you probably go screw this.\n\n0:10:50\tSPEAKER_03\n Yeah, so...\n\n0:10:52\tSPEAKER_03\n Yeah, I'm not sure about that one.\n\n0:10:55\tSPEAKER_06\n Yeah.\n\n0:10:56\tSPEAKER_06\n Okay.\n\n0:10:58\tSPEAKER_02\n I knew a little orientation about this environment and how to run some jobs here, because I never did anything so far for these exhibitions.\n\n0:11:08\tSPEAKER_02\n Maybe I'll ask you after the meeting.\n\n0:11:10\tSPEAKER_03\n Yeah, and also, Stefan's a really good resource for that feature.\n\n0:11:15\tSPEAKER_03\n Okay, I'm sure.\n\n0:11:16\tSPEAKER_03\n Especially with regard to the Aurora stuff.\n\n0:11:18\tSPEAKER_03\n He knows that stuff better than I do.\n\n0:11:21\tSPEAKER_07\n Okay.\n\n0:11:23\tSPEAKER_06\n Well, when we...\n\n0:11:27\tSPEAKER_06\n Sinales and Sier...\n\n0:11:29\tSPEAKER_06\n I'm been one of these.\n\n0:11:31\tSPEAKER_06\n That one, you tell us what's up with you.\n\n0:11:34\tSPEAKER_06\n Which would be not bad, hopefully.\n\n0:11:36\tSPEAKER_02\n Yeah.\n\n0:11:37\tSPEAKER_02\n So...\n\n0:11:39\tSPEAKER_02\n I don't know, shall I start from...\n\n0:11:42\tSPEAKER_02\n I don't know, how...\n\n0:11:43\tSPEAKER_02\n Okay, I think I'll start from the post...\n\n0:11:46\tSPEAKER_02\n Aurora submission maybe.\n\n0:11:49\tSPEAKER_02\n Yeah.\n\n0:11:50\tSPEAKER_02\n Yeah, after the submission, what I've been working on really was to take other submissions and then...\n\n0:11:57\tSPEAKER_02\n...over their system, what they submitted, because we didn't have any speech and enhancement system.\n\n0:12:15\tSPEAKER_02\n So I tried...\n\n0:12:18\tSPEAKER_02\n...and...\n\n0:12:28\tSPEAKER_02\n...and then I found that...\n\n0:12:32\tSPEAKER_02\n...when you were combined with LD8, you used a form of movement over there.\n\n0:12:42\tSPEAKER_03\n Are you saying LDA?\n\n0:12:44\tSPEAKER_02\n Yeah, LDA.\n\n0:12:45\tSPEAKER_02\n Yeah.\n\n0:12:46\tSPEAKER_02\n So just the LDF filters.\n\n0:12:47\tSPEAKER_02\n I just plug in...\n\n0:12:48\tSPEAKER_02\n I just take the capsule coefficients coming from their system and then plug in LD on top of that.\n\n0:12:53\tSPEAKER_02\n But LDF filters that I used was different from what we submitted in the proposal.\n\n0:12:57\tSPEAKER_02\n What I did was I took the LDF filters designed using clean speech.\n\n0:13:03\tSPEAKER_02\n Mainly because the speech is already cleaned up after the enhancement.\n\n0:13:06\tSPEAKER_02\n So instead of using this...\n\n0:13:09\tSPEAKER_02\n...narrow band LDF filters that we submitted, I got new filters.\n\n0:13:13\tSPEAKER_02\n So that seems to be giving...\n\n0:13:16\tSPEAKER_02\n...improving over their system slightly, but not very significant.\n\n0:13:22\tSPEAKER_02\n And that was...\n\n0:13:29\tSPEAKER_02\n...showing any improvement over...\n\n0:13:32\tSPEAKER_02\n...finally by plugging in an LD8.\n\n0:13:34\tSPEAKER_02\n And so then after that I added the online normalization also on top of that.\n\n0:13:40\tSPEAKER_02\n And there also, I found that I have made some changes to their time constant that I used.\n\n0:13:47\tSPEAKER_02\n Because it has a mean and variance update time constant, which is not suitable for the enhanced speech in whatever we tried on the proposal one.\n\n0:13:57\tSPEAKER_02\n But I didn't play with that time constant a lot.\n\n0:14:02\tSPEAKER_02\n I just found that I have to reduce the value...\n\n0:14:04\tSPEAKER_02\n I mean I have to increase the time constant or reduce the value of the update value.\n\n0:14:08\tSPEAKER_02\n That's all I found so I had to...\n\n0:14:11\tSPEAKER_02\n Yeah, and the other thing what I tried was...\n\n0:14:15\tSPEAKER_02\n I just took the baseline and then ran it with the endpoint information.\n\n0:14:24\tSPEAKER_02\n Just the Aurora baseline to see that how much the baseline itself improves...\n\n0:14:29\tSPEAKER_02\n...by just supplying the information of the speech and non-speech.\n\n0:14:34\tSPEAKER_02\n And I found that the baseline itself improves by 22% by just giving the...\n\n0:14:40\tSPEAKER_06\n I can back up a second.\n\n0:14:42\tSPEAKER_06\n I missed something.\n\n0:14:44\tSPEAKER_06\n I guess my line wondered that when you added the online normalization and so forth...\n\n0:14:49\tSPEAKER_06\n...things got better again.\n\n0:14:51\tSPEAKER_06\n No, no, no.\n\n0:14:52\tSPEAKER_02\n Things didn't get better with the same time constant that we used.\n\n0:14:56\tSPEAKER_06\n No, no, with a different time constant.\n\n0:14:57\tSPEAKER_02\n With a different time constant, I found that...\n\n0:14:59\tSPEAKER_02\n...I mean I didn't get an improvement over not using online normalization.\n\n0:15:02\tSPEAKER_02\n Oh, no, I didn't.\n\n0:15:04\tSPEAKER_02\n Because I found that I would have to change the value of the update factor.\n\n0:15:08\tSPEAKER_02\n But I played with...\n\n0:15:09\tSPEAKER_02\n...play quite a bit to make it better than...\n\n0:15:12\tSPEAKER_02\n Okay.\n\n0:15:13\tSPEAKER_02\n So it's still not with online normalization didn't give me any improvement.\n\n0:15:16\tSPEAKER_02\n And...\n\n0:15:18\tSPEAKER_02\n So...\n\n0:15:20\tSPEAKER_02\n So I just stopped there with the speech announcement.\n\n0:15:24\tSPEAKER_02\n The other thing what I tried was adding the endpoint information to the baseline...\n\n0:15:29\tSPEAKER_02\n...and that itself gives like 22% because the second...\n\n0:15:33\tSPEAKER_02\n...the new phase is going to be with the end-pointed speech.\n\n0:15:35\tSPEAKER_02\n And just to get a feel of how much the baseline itself is going to change...\n\n0:15:38\tSPEAKER_02\n...by adding this endpoint information.\n\n0:15:40\tSPEAKER_03\n So people won't even have to worry about doing speech non-speech.\n\n0:15:44\tSPEAKER_02\n Yeah, that's what the feeling is like.\n\n0:15:47\tSPEAKER_02\n They're going to give the endpoint information.\n\n0:15:49\tSPEAKER_06\n I guess the issue is that people do that anyway.\n\n0:15:52\tSPEAKER_06\n Everybody does that.\n\n0:15:53\tSPEAKER_06\n I mean, I wanted to see given that you're doing that...\n\n0:15:56\tSPEAKER_06\n...what are the best features that you have.\n\n0:15:58\tSPEAKER_06\n I see.\n\n0:15:59\tSPEAKER_06\n So...\n\n0:16:00\tSPEAKER_06\n I mean, clearly they're interact.\n\n0:16:01\tSPEAKER_06\n So I don't know that I entirely agree with it.\n\n0:16:03\tSPEAKER_06\n But it might be...\n\n0:16:05\tSPEAKER_06\n In some ways it might be better to...\n\n0:16:08\tSPEAKER_06\n...rather than giving the endpoints to have a standard that everybody uses...\n\n0:16:11\tSPEAKER_06\n...and then interacts with.\n\n0:16:13\tSPEAKER_06\n But, you know, it's still something reasonable.\n\n0:16:16\tSPEAKER_03\n So are people supposed to assume that there is...\n\n0:16:20\tSPEAKER_03\n...are people not supposed to use any speech outside of those endpoints?\n\n0:16:24\tSPEAKER_03\n Or can you then...\n\n0:16:25\tSPEAKER_03\n No, no, that's not.\n\n0:16:26\tSPEAKER_02\n So I think each outside of it for estimating background noise.\n\n0:16:29\tSPEAKER_02\n Exactly.\n\n0:16:30\tSPEAKER_02\n I guess that is what the consensus is.\n\n0:16:32\tSPEAKER_02\n You will...\n\n0:16:33\tSPEAKER_02\n You will be given the information about the beginning and the end of speech.\n\n0:16:37\tSPEAKER_02\n But the whole speech is available to you.\n\n0:16:39\tSPEAKER_06\n Okay.\n\n0:16:40\tSPEAKER_06\n So should make the spectral subtraction style things work even better...\n\n0:16:43\tSPEAKER_02\n...because you don't have the mistakes.\n\n0:16:45\tNone\n Yeah.\n\n0:16:46\tSPEAKER_02\n Okay.\n\n0:16:47\tSPEAKER_02\n So that...\n\n0:16:48\tSPEAKER_02\n That baseline itself...\n\n0:16:49\tSPEAKER_02\n I mean, it improves by 20 to 1.\n\n0:16:51\tSPEAKER_02\n And I found that in one of the speech that carcases...\n\n0:16:54\tSPEAKER_02\n...proves by just 50% by just putting the endpoints.\n\n0:16:57\tSPEAKER_02\n Wow.\n\n0:16:58\tSPEAKER_02\n And you don't need any speech in answer.\n\n0:17:00\tSPEAKER_02\n So the baseline itself improves by 50%.\n\n0:17:05\tSPEAKER_02\n Yeah, by 50%.\n\n0:17:06\tSPEAKER_06\n Yeah, so it's going to be harder to...\n\n0:17:08\tSPEAKER_02\n Yeah.\n\n0:17:09\tSPEAKER_02\n Big that actually.\n\n0:17:10\tSPEAKER_02\n Yeah.\n\n0:17:11\tSPEAKER_02\n So that is when the qualification criteria was reduced...\n\n0:17:15\tSPEAKER_02\n...from 50% to something like 25% for well-matched.\n\n0:17:18\tSPEAKER_02\n I think they have actually changed the qualification criteria now.\n\n0:17:22\tSPEAKER_02\n And yeah, I guess after that...\n\n0:17:25\tSPEAKER_02\n...I just went home for...\n\n0:17:27\tSPEAKER_02\n I just had a vacation for...\n\n0:17:28\tSPEAKER_02\n Sorry.\n\n0:17:29\tSPEAKER_02\n Okay.\n\n0:17:30\tSPEAKER_06\n That's good.\n\n0:17:31\tSPEAKER_06\n That's good.\n\n0:17:32\tSPEAKER_02\n Yeah.\n\n0:17:33\tSPEAKER_02\n And I came back and I started working on...\n\n0:17:35\tSPEAKER_02\n...some other speech enhancement algorithm.\n\n0:17:37\tSPEAKER_02\n I mean, so from the submission...\n\n0:17:39\tSPEAKER_02\n...you are found that people have tried to...\n\n0:17:41\tSPEAKER_02\n...spectral subtraction and venerable filtering.\n\n0:17:43\tSPEAKER_02\n These are the main approaches...\n\n0:17:45\tSPEAKER_02\n...what people have tried.\n\n0:17:46\tSPEAKER_02\n So just to...\n\n0:17:47\tSPEAKER_02\n...just to fill the space with some few more speech enhancement...\n\n0:17:51\tSPEAKER_02\n...algues them to see whether it...\n\n0:17:53\tSPEAKER_02\n...I've been working on this...\n\n0:17:55\tSPEAKER_02\n...signal subspace approach for speech enhancement...\n\n0:17:58\tSPEAKER_02\n...where you...\n\n0:17:59\tSPEAKER_02\n...take the noise-y signal and decompose into signal...\n\n0:18:03\tSPEAKER_02\n...and the noise subspace...\n\n0:18:05\tSPEAKER_02\n...and then try to estimate the clean speech from the signal person...\n\n0:18:08\tSPEAKER_02\n...nois subspace.\n\n0:18:09\tSPEAKER_02\n And so I've been actually running some...\n\n0:18:12\tSPEAKER_02\n...so far I've been trying it only on MATLAB...\n\n0:18:14\tSPEAKER_02\n...to test whether it was first or not.\n\n0:18:17\tSPEAKER_02\n And then I'll put it to see...\n\n0:18:19\tSPEAKER_02\n...then update it with the repository once I've...\n\n0:18:21\tSPEAKER_02\n...finally giving you some positive result.\n\n0:18:24\tSPEAKER_06\n So you said one thing...\n\n0:18:27\tSPEAKER_06\n...I wanted to jump on for a second.\n\n0:18:29\tSPEAKER_06\n So now you're getting tuned into the repository...\n\n0:18:32\tSPEAKER_06\n...thing that he has here and so we'll have a...\n\n0:18:35\tSPEAKER_06\n...simple place for this stuff.\n\n0:18:37\tSPEAKER_06\n It's cool.\n\n0:18:38\tSPEAKER_06\n So maybe just briefly...\n\n0:18:41\tSPEAKER_06\n...you could remind us about the related experience...\n\n0:18:44\tSPEAKER_06\n...because you did some stuff...\n\n0:18:45\tSPEAKER_06\n...you talked about last week I guess...\n\n0:18:47\tSPEAKER_06\n...where you were also combining something...\n\n0:18:50\tSPEAKER_06\n...both of you I guess we're combining something...\n\n0:18:52\tSPEAKER_06\n...from the telecom system with...\n\n0:18:55\tSPEAKER_06\n...I know whether it was system one or system two...\n\n0:18:59\tSPEAKER_04\n...it was system one.\n\n0:19:01\tSPEAKER_04\n So the main thing that we did is...\n\n0:19:06\tSPEAKER_04\n...just to take the spectrosuppraction from the front silicon...\n\n0:19:09\tSPEAKER_04\n...which provide us some speech samples...\n\n0:19:12\tSPEAKER_06\n...that are with noise removed.\n\n0:19:15\tSPEAKER_06\n So let me just stop you there.\n\n0:19:17\tSPEAKER_06\n So then one distinction is that...\n\n0:19:19\tSPEAKER_06\n...you were taking the actual front telecom features...\n\n0:19:22\tSPEAKER_06\n...and then applying something...\n\n0:19:24\tSPEAKER_02\n No, there was a slight difference.\n\n0:19:26\tSPEAKER_02\n...I mean, these are extractors at the handset.\n\n0:19:32\tSPEAKER_02\n Yeah.\n\n0:19:33\tSPEAKER_02\n Because they had another back end blinding...\n\n0:19:35\tSPEAKER_06\n Yeah, but that's what I mean.\n\n0:19:37\tSPEAKER_06\n Sorry, I'm not being clear.\n\n0:19:39\tSPEAKER_06\n What I meant was you had something like Kepstra or something.\n\n0:19:43\tSPEAKER_06\n And so one difference is that I guess you were taking...\n\n0:19:46\tSPEAKER_06\n...spec graph.\n\n0:19:47\tSPEAKER_04\n Yeah.\n\n0:19:48\tSPEAKER_04\n But I guess it's exactly the same thing...\n\n0:19:50\tSPEAKER_04\n...because on the handset they just...\n\n0:19:53\tSPEAKER_04\n...applied the Wiener filter...\n\n0:19:55\tSPEAKER_04\n...and then compute Kepstra features.\n\n0:19:57\tSPEAKER_02\n Yeah, the Kepstra...\n\n0:19:58\tSPEAKER_02\n...the difference is like...\n\n0:19:59\tSPEAKER_02\n...there may be a slight difference in the way...\n\n0:20:01\tSPEAKER_02\n...because they use exactly the baseline system...\n\n0:20:04\tSPEAKER_02\n...for computing the Kepstra once you have the speech.\n\n0:20:07\tSPEAKER_02\n If we are using our own code...\n\n0:20:09\tSPEAKER_02\n...that could be the only difference.\n\n0:20:11\tSPEAKER_02\n But you got some sort of different results...\n\n0:20:14\tSPEAKER_06\n...I'm trying to understand that.\n\n0:20:16\tSPEAKER_04\n Yeah, I think we should...\n\n0:20:19\tSPEAKER_04\n...have a table with all the results...\n\n0:20:21\tSPEAKER_04\n...because I don't know...\n\n0:20:22\tSPEAKER_04\n...I don't exactly know what are your results.\n\n0:20:25\tSPEAKER_04\n Okay.\n\n0:20:26\tSPEAKER_04\n Yeah, but so we did this...\n\n0:20:28\tSPEAKER_04\n...and another difference, I guess, is that we just applied...\n\n0:20:32\tSPEAKER_04\n...properse our one system after this...\n\n0:20:34\tSPEAKER_04\n...with our modification to reduce the delay of the ADA filters.\n\n0:20:40\tSPEAKER_04\n And other slight modifications...\n\n0:20:43\tSPEAKER_04\n...but it was the full proposal one.\n\n0:20:45\tSPEAKER_04\n In your case, you tried...\n\n0:20:46\tSPEAKER_04\n...only a little bit...\n\n0:20:47\tSPEAKER_04\n...just putting it the ADA and maybe...\n\n0:20:49\tSPEAKER_04\n...on the optimization.\n\n0:20:50\tSPEAKER_02\n After that, I don't know the situation.\n\n0:20:52\tSPEAKER_04\n So we just tried directly to...\n\n0:20:55\tSPEAKER_04\n...just keep the system as it was.\n\n0:20:58\tSPEAKER_04\n And...\n\n0:21:00\tSPEAKER_04\n...when we plug the spectra-attraction...\n\n0:21:04\tSPEAKER_04\n...it improves significantly.\n\n0:21:07\tSPEAKER_04\n But what seems clear also is that...\n\n0:21:11\tSPEAKER_04\n...we have to retune...\n\n0:21:13\tSPEAKER_04\n...the time constants of the online organization...\n\n0:21:16\tSPEAKER_04\n...because if we keep the value that was submitted...\n\n0:21:20\tSPEAKER_04\n...it doesn't help at all.\n\n0:21:22\tSPEAKER_04\n You can remove online organization...\n\n0:21:24\tSPEAKER_04\n...or put it, it doesn't change anything.\n\n0:21:26\tSPEAKER_04\n As long as you have the spectra-attraction.\n\n0:21:29\tSPEAKER_04\n But you can still find...\n\n0:21:31\tSPEAKER_04\n...some kind of optimum somewhere...\n\n0:21:34\tSPEAKER_04\n...and we don't know where exactly.\n\n0:21:36\tSPEAKER_04\n So it sounds like...\n\n0:21:39\tSPEAKER_06\n...you should look at some tables of results...\n\n0:21:42\tSPEAKER_06\n...or something and see where...\n\n0:21:44\tSPEAKER_06\n...where they were different when we can learn from it.\n\n0:22:02\tSPEAKER_02\n Without any change.\n\n0:22:03\tSPEAKER_02\n Yeah.\n\n0:22:04\tSPEAKER_04\n Well, we change it.\n\n0:22:07\tSPEAKER_04\n We have to have...\n\n0:22:09\tSPEAKER_04\n...alie filters.\n\n0:22:11\tSPEAKER_04\n There are other things that we...\n\n0:22:13\tSPEAKER_04\n...finally were shown to improve.\n\n0:22:15\tSPEAKER_04\n So like the 64-hz cutoff...\n\n0:22:18\tSPEAKER_04\n...it doesn't seem to hurt on TI digits, finally.\n\n0:22:22\tSPEAKER_04\n Maybe because of other changes.\n\n0:22:25\tSPEAKER_04\n Well, there are some minor changes.\n\n0:22:30\tSPEAKER_04\n And right now if we look at the results...\n\n0:22:34\tSPEAKER_04\n...it's always better than...\n\n0:22:38\tSPEAKER_04\n...it seems always better than the French Telecom for mismatch.\n\n0:22:42\tSPEAKER_04\n I mismatch.\n\n0:22:44\tSPEAKER_04\n And it still slightly worse for well-matched.\n\n0:22:48\tSPEAKER_04\n But this is not significant.\n\n0:22:52\tSPEAKER_04\n But the problem is that it's not significant.\n\n0:22:54\tSPEAKER_04\n But if you put this in the spreadsheet...\n\n0:23:00\tSPEAKER_04\n...it's still worse, even with very minor...\n\n0:23:05\tSPEAKER_04\n...even if it's only slightly worse for well-matched.\n\n0:23:08\tSPEAKER_04\n And significantly better for HM.\n\n0:23:12\tSPEAKER_04\n But well, I don't think it's important.\n\n0:23:16\tSPEAKER_04\n Because when they will change their mid-track...\n\n0:23:20\tSPEAKER_04\n...mainly because of when you plug the frame dropping...\n\n0:23:24\tSPEAKER_04\n...in the baseline system...\n\n0:23:27\tSPEAKER_04\n...it will improve a lot HM and MM.\n\n0:23:30\tSPEAKER_04\n So I guess what will happen?\n\n0:23:37\tSPEAKER_04\n I don't know what will happen.\n\n0:23:39\tSPEAKER_04\n But the different contribution I think for a different test set will be more...\n\n0:23:44\tSPEAKER_02\n HM and MM will also go down significantly in the spreadsheet.\n\n0:23:49\tSPEAKER_02\n But the well-matched may still...\n\n0:23:52\tSPEAKER_02\n...I mean, the well-matched may be the one which is least affected by adding the endpoint information.\n\n0:23:58\tSPEAKER_02\n So the MM and HM are going to be hugely affected.\n\n0:24:03\tSPEAKER_02\n Yeah.\n\n0:24:06\tSPEAKER_02\n But everything is like...\n\n0:24:09\tSPEAKER_02\n...that's how they reduce the qualification to 25% or something.\n\n0:24:15\tSPEAKER_06\n But are they changing the waiting?\n\n0:24:19\tSPEAKER_02\n No, I guess they're going ahead with the same rating.\n\n0:24:25\tSPEAKER_06\n I don't understand that.\n\n0:24:27\tSPEAKER_06\n I guess I have been part of the discussion.\n\n0:24:30\tSPEAKER_06\n So it seems to me that the well-matched condition is going to be unusual.\n\n0:24:35\tSPEAKER_06\n In this case, unusual.\n\n0:24:38\tSPEAKER_06\n Because you don't actually have good matches ordinarily for what any particular person's car is like.\n\n0:24:49\tSPEAKER_06\n Or it seems like something like the middle one is more natural.\n\n0:24:58\tSPEAKER_06\n So I don't know why the well-matched is...\n\n0:25:04\tSPEAKER_02\n Yeah, but actually the well-matched...\n\n0:25:14\tSPEAKER_02\n I mean, the well-matched condition is not like the warning PI-Tits where you have all the training conditions exactly like replicated in that testing condition.\n\n0:25:26\tSPEAKER_02\n Also, this is not calibrated by SNR or something. The well-matched has also some mismatching match.\n\n0:25:35\tSPEAKER_06\n The well-matched has mismatch.\n\n0:25:37\tSPEAKER_02\n Also some slight mismatches.\n\n0:25:39\tSPEAKER_02\n Unlike the PI-Tits where it's perfectly matched because it's artificially added now.\n\n0:25:43\tSPEAKER_02\n But this is natural recording.\n\n0:25:45\tSPEAKER_06\n So remind me of what well-matched you've told many times.\n\n0:25:48\tSPEAKER_02\n The well-matched is defined like it's 70% of the whole database is useful training and 30% of the full testing.\n\n0:25:54\tSPEAKER_04\n So it means that if the database is large enough, it's matched.\n\n0:25:58\tSPEAKER_04\n Because in each set you have a range of conditions.\n\n0:26:04\tSPEAKER_06\n So I mean, yeah, unless they deliberately chose it to be different, which they didn't because they wanted to be well-matched.\n\n0:26:10\tSPEAKER_06\n It is pretty much so it's sort of saying that you're in heat though.\n\n0:26:14\tSPEAKER_06\n It's not guaranteed.\n\n0:26:16\tSPEAKER_02\n Because the main reason for the mismatch is coming from the amount of noise and the silence frames and all those present in the database.\n\n0:26:25\tSPEAKER_06\n Again, if you have enough, if you have enough.\n\n0:26:28\tSPEAKER_06\n So it's sort of like if you're saying, okay, so much as you train your dictation machine for talking into your computer, you have a car.\n\n0:26:37\tSPEAKER_06\n And so you drive it around a bunch and record noise conditions or something.\n\n0:26:41\tSPEAKER_06\n And then I don't think that's very realistic.\n\n0:26:46\tSPEAKER_06\n I guess they're saying that if you were a company that was selling the stuff commercially, that you would have a bunch of people driving around in a bunch of cars and you would have something that was roughly similar.\n\n0:26:58\tSPEAKER_06\n And maybe that's the argument, but I'm not sure I'd buy it.\n\n0:27:01\tSPEAKER_06\n So, well, it's gone.\n\n0:27:14\tSPEAKER_04\n Yeah, we are also playing in trying to put other spectrosuppraction in the code.\n\n0:27:29\tSPEAKER_04\n It would be a very simple spectrosuppraction on the male energies, which I already tested, but without the frame dropping actually.\n\n0:27:41\tSPEAKER_04\n And I think it's important to have frame dropping.\n\n0:27:44\tSPEAKER_03\n Is it a spectrosuppraction typically done on the after the male scaling or is it done on the FFT bands?\n\n0:27:55\tSPEAKER_03\n Does it matter?\n\n0:27:58\tSPEAKER_04\n I don't know. Well, both cases.\n\n0:28:03\tSPEAKER_04\n Yeah, some of the proposes, I were doing this on the FFT bands, others on the male energies.\n\n0:28:12\tSPEAKER_04\n You can do both, but I cannot tell you which one might be better.\n\n0:28:19\tSPEAKER_02\n I guess if you want to reconstruct the speed, it may be a good idea to do it on FFT bands.\n\n0:28:25\tSPEAKER_02\n But for speech recognition, it may not be very different if you do it on male warmth or whether you do it on FFT.\n\n0:28:34\tSPEAKER_02\n So, you're going to do a linear waiting anyway after that.\n\n0:28:39\tSPEAKER_04\n Well, it gives something different, but I don't know what are the pros and cons of both.\n\n0:28:54\tSPEAKER_02\n The other thing is, when you're putting in a speech enhancement technique, is it like one stage speech enhancement?\n\n0:29:03\tSPEAKER_02\n Because everybody seems to have two stages of speech enhancement and all the proposes, which is giving them some improvement.\n\n0:29:09\tSPEAKER_02\n I mean, they just do the same thing again once more.\n\n0:29:18\tSPEAKER_02\n And so, there's something that is good about doing it, when cleaning it up once more.\n\n0:29:24\tSPEAKER_04\n Yeah, it might be. So, maybe in my implementation, I should have so tried to inspire me for this kind of thing.\n\n0:29:32\tSPEAKER_06\n Well, the other thing would be to combine what you're doing.\n\n0:29:35\tSPEAKER_06\n Maybe one or the other things that you're doing would benefit from the other happening first.\n\n0:29:39\tSPEAKER_06\n So, if he's doing a signal subspace thing, maybe it would work better if you'd already done some simple spectrosituaction or maybe the other way around.\n\n0:29:47\tSPEAKER_02\n So, the thing about combining the Venerful drink with signal subspace, just to see some such permutation combination to see whether it really helps.\n\n0:29:57\tSPEAKER_04\n Yeah.\n\n0:30:00\tSPEAKER_06\n How is, I guess I'm ignorant about this.\n\n0:30:03\tSPEAKER_06\n I mean, since Vener filter also assumes that you're adding together the two signals, how is that different from signal subspace?\n\n0:30:13\tSPEAKER_02\n Yeah. The signal subspace approach has actually an inbuilt Vener filtering in it.\n\n0:30:20\tSPEAKER_02\n Okay.\n\n0:30:22\tSPEAKER_02\n Yeah, it is like a KL transform followed by a Vener filter.\n\n0:30:24\tSPEAKER_02\n Oh, okay. So, it definitely has the K.\n\n0:30:27\tSPEAKER_02\n So, the advantage of combining two things is mainly coming from the signal subspace approach doesn't work very well if the SNR is very bad.\n\n0:30:40\tSPEAKER_02\n I see. It's very poorly with that. It's very bad for SNR conditions and in colored noise.\n\n0:30:45\tSPEAKER_06\n So, essentially you could do a simple spectral subtraction followed by a KL transform followed by a Vener filter.\n\n0:30:50\tSPEAKER_02\n It's a cascade of.\n\n0:30:52\tSPEAKER_06\n Yeah, and generally, that's right. You don't want to authorize if the things are noisy, actually.\n\n0:30:59\tSPEAKER_06\n That was something that, here Vener, we're talking about with the multi-band stuff, that if you're converting things to from bands, groups of bands into capture co-efficient, you know, local sort of local capture co-efficient, that it's not that great to do it if it's noisy.\n\n0:31:16\tSPEAKER_07\n Yeah. Okay. Yeah.\n\n0:31:18\tSPEAKER_02\n So, that's one reason maybe it would combine.\n\n0:31:23\tSPEAKER_02\n Something to improve SNR a little bit. Yeah. First stage and then do something and the second stage it should take it.\n\n0:31:33\tSPEAKER_04\n Well, if you're prompt about, about the color noise.\n\n0:31:36\tSPEAKER_02\n Oh, the colored noise. The color noise, the signal subspace approach has, I mean, it actually depends on inverting the matrix.\n\n0:31:47\tSPEAKER_02\n So, it's the co-edits matrix of the noise. So, if it is not positive definite, when it has it, it doesn't behave very well, if it is not positive definite.\n\n0:31:59\tSPEAKER_02\n It works very well with white noise because we know for sure that it has a positive.\n\n0:32:03\tSPEAKER_06\n So, the spectral subtraction had noise.\n\n0:32:06\tSPEAKER_02\n So, the way they get around is like they do an inverse filtering first of the colored noise and they make the noise white.\n\n0:32:14\tSPEAKER_02\n And then finally when you reconstruct the speech back, you do this filtering again.\n\n0:32:17\tSPEAKER_06\n I was only half-caring. You sort of do this spectral subtraction that also gets through.\n\n0:32:22\tSPEAKER_06\n And then you add a little bit of noise, noise addition. I mean, that's sort of what J-Rest it does in a way.\n\n0:32:28\tSPEAKER_06\n If you look at what J-Rest is doing, essentially it's equivalent to adding a little noise.\n\n0:32:34\tSPEAKER_06\n Or you get rid of the effects of noise.\n\n0:32:39\tSPEAKER_04\n Yeah, so there is this. And maybe we find some people also that agree to maybe work with us.\n\n0:32:52\tSPEAKER_04\n And they have implementation of VTS techniques.\n\n0:32:56\tSPEAKER_04\n So, it's a vector autolo series that are used to model the transformation between clean capstras and noisy capstras.\n\n0:33:12\tSPEAKER_04\n So, well, if you take the standard model of channel plus noise, it's a non-linear transformation in the capstras domain.\n\n0:33:23\tSPEAKER_04\n And there is a way to approximate this using first order or second order telor series.\n\n0:33:32\tSPEAKER_04\n And it can be used for getting rid of the noise and channel effect.\n\n0:33:38\tSPEAKER_04\n Who is doing the working in the capstras domain?\n\n0:33:41\tSPEAKER_04\n So, there is one guy in Granada and another in Lucent that I met at ICASP.\n\n0:33:50\tSPEAKER_06\n Who is the guy in Granada?\n\n0:33:53\tSPEAKER_01\n JosÃ© Carlos Segura.\n\n0:33:56\tSPEAKER_02\n This VTS has been proposed by CME.\n\n0:34:00\tSPEAKER_01\n Yeah, yeah, yeah. Original date was from CME.\n\n0:34:07\tSPEAKER_04\n Well, it's again a different thing that could be tried.\n\n0:34:16\tSPEAKER_06\n Yeah. Yeah, so anyway, you're looking general, standing back from it, looking at ways to combine one form or another of noise removal with these other things we have.\n\n0:34:29\tSPEAKER_06\n Looks like a worthy thing to do here.\n\n0:34:36\tSPEAKER_04\n But for sure, let's re-check everything else and re-optimize the other things.\n\n0:34:47\tSPEAKER_04\n For sure, the online normalization may be the LDA filter.\n\n0:34:53\tSPEAKER_06\n Well, it seems like one of the things to go through next week when Harry's here because Harry will have his own ideas to, I guess, not next week, week and a half.\n\n0:35:01\tSPEAKER_06\n We sort of go through these alternatives, what we've seen so far and come up with some game plans.\n\n0:35:07\tSPEAKER_06\n So, I mean, one way would...here's some alternate visions.\n\n0:35:11\tSPEAKER_06\n I mean, one would be you look at a few things very quickly.\n\n0:35:14\tSPEAKER_06\n You pick on something that looks like it's promising and everybody works really hard on the same different aspects of the same thing.\n\n0:35:19\tSPEAKER_06\n Another thing would be to pick two plausible things and you know, have two working things for a while until we figure out what's better.\n\n0:35:30\tSPEAKER_06\n But, you all have some ideas on that too.\n\n0:35:37\tSPEAKER_02\n The other thing is to most of this speech and management techniques have reported research on smaller capital rate assets.\n\n0:35:45\tSPEAKER_02\n But we're going to address this Wall Street Journal in the next stage, which is also going to be in our seat.\n\n0:35:51\tSPEAKER_02\n So, very few people have reported something on using some continuous speech at home.\n\n0:35:56\tSPEAKER_02\n So, there are some...I was looking at some literature on speech and management apply to large vocabulary.\n\n0:36:03\tSPEAKER_02\n Speical subtraction doesn't seem to be the thing to do for large vocabulary.\n\n0:36:11\tSPEAKER_02\n There are always people who have shown improvement with linear filtering and maybe subspace up whichever special subtraction you have.\n\n0:36:18\tSPEAKER_02\n But, we have to use simple spectrum to make it...how to do some optimization.\n\n0:36:22\tSPEAKER_06\n So, they're making...somebody's generating Wall Street Journal without it or artificially out of knowing or something.\n\n0:36:30\tSPEAKER_06\n Sort of like what they do with TI digits.\n\n0:36:33\tSPEAKER_02\n I guess, I guess, the inter-fascism.\n\n0:36:36\tSPEAKER_06\n And then they're generating HTK scripts.\n\n0:36:43\tSPEAKER_02\n Yeah, I know that there's no...I don't know whether they have converged on HTK or using some...\n\n0:36:52\tSPEAKER_06\n It's a Mississippi State, maybe.\n\n0:36:54\tSPEAKER_06\n Yeah, so that'll be a little task in itself.\n\n0:36:57\tSPEAKER_06\n Well, we've...yeah, it's true for the additive noise.\n\n0:37:03\tSPEAKER_06\n Artificial added noise, we've always used smoke vocabulary too.\n\n0:37:07\tSPEAKER_06\n There's been noisy speech, the style of artificial vocabulary that we've worked with in broadcast news.\n\n0:37:13\tSPEAKER_06\n So, we did broadcast news evaluation and some of the focus conditions were noisy.\n\n0:37:18\tSPEAKER_06\n But we didn't do spectrosotraction.\n\n0:37:20\tSPEAKER_06\n We were doing our funny stuff.\n\n0:37:22\tSPEAKER_06\n We were doing multi-stream and so forth.\n\n0:37:25\tSPEAKER_06\n But, you know, stuff we did helped.\n\n0:37:28\tSPEAKER_06\n I mean, it did something.\n\n0:37:31\tSPEAKER_06\n Now, we have this meeting data, the stuff we're recording right now.\n\n0:37:38\tSPEAKER_06\n And that we have for the, the quote-unquote noisy data there is just noisy and reverberant actually.\n\n0:37:46\tSPEAKER_06\n It's the far-failed mic.\n\n0:37:47\tSPEAKER_06\n And we have the digits that we do at the end of these things.\n\n0:37:52\tSPEAKER_06\n And that's what most of our work has been done with that, with connected digits.\n\n0:37:59\tSPEAKER_06\n But, we have recognition now with some of the continuous speech, like vocabulary continuous speech, using switchboard, so a switchboard recognizer.\n\n0:38:10\tSPEAKER_06\n No training from this, just plainly switched words.\n\n0:38:14\tSPEAKER_06\n But, this is the switchboard thing that's what we're doing.\n\n0:38:16\tSPEAKER_06\n Now, there's some adaptation though that Andreas has been playing with.\n\n0:38:20\tSPEAKER_06\n But, we're hoping, actually Dave and I were just talking earlier today about maybe at some point, not that distant future trying some of the techniques that we've talked about on some of the electrical vocabulary data.\n\n0:38:33\tSPEAKER_06\n I mean, I guess no one has done, yet done test one on the distant mic using the SRR recognizer.\n\n0:38:43\tSPEAKER_06\n I don't know.\n\n0:38:44\tSPEAKER_06\n How did I know of it?\n\n0:38:45\tSPEAKER_06\n Yeah.\n\n0:38:46\tSPEAKER_06\n It's a very scared.\n\n0:38:49\tSPEAKER_06\n I see a little smoke coming up from the CPU.\n\n0:38:52\tSPEAKER_06\n You were trying to do it.\n\n0:38:55\tSPEAKER_06\n But, yeah.\n\n0:38:56\tSPEAKER_06\n But, you're right.\n\n0:38:58\tSPEAKER_06\n That's a real good point, that we don't know what, if any of these, I guess that's what they're pushing that in the evaluation.\n\n0:39:09\tSPEAKER_06\n But, it's good.\n\n0:39:13\tSPEAKER_06\n Anything else going on?\n\n0:39:15\tSPEAKER_06\n From the day of the century?\n\n0:39:16\tSPEAKER_01\n I don't have good results with the, including the new parameters, I don't have good results.\n\n0:39:23\tSPEAKER_01\n Are similar or a little bit worse?\n\n0:39:27\tSPEAKER_06\n Yeah, so you probably need to back up a bit, so.\n\n0:39:31\tSPEAKER_01\n I tried to include another new parameter to the traditional parameter, the catch-strong coefficient, that like the autocorrelation, the R0, and R1 over R0, and another estimation of the variance of the difference of the spectrum of the signal, and the spectrum of time after the filter bank.\n\n0:40:10\tSPEAKER_02\n Of course, I should have.\n\n0:40:12\tSPEAKER_01\n Anyway, you have the spectrum of the signal, and the other side you have the output of the filter bank.\n\n0:40:23\tSPEAKER_01\n You can extend the coefficient of the filter bank and obtain an approximation of the spectrum of the signal.\n\n0:40:30\tSPEAKER_01\n I do the difference.\n\n0:40:32\tSPEAKER_01\n I found the difference at the variance of this difference, because we think that if the variance is high, maybe you have noise.\n\n0:40:46\tSPEAKER_01\n If the variance is small, maybe you have a speech.\n\n0:40:54\tSPEAKER_01\n The idea is to find another feature for discriminating between voice sound and voice sound.\n\n0:41:05\tSPEAKER_01\n We try to use this new feature.\n\n0:41:09\tSPEAKER_01\n I need to change the window size of the analysis window size to have more information.\n\n0:41:27\tSPEAKER_01\n This is the 2.5 milliseconds.\n\n0:41:35\tSPEAKER_01\n I did the time of experiment to include this feature directly with the other feature, and to try to use a neural network to select voice and voice silence and to concate this new feature.\n\n0:41:56\tSPEAKER_01\n The result with the neural network, I have more or less the same result.\n\n0:42:07\tSPEAKER_01\n Sometimes it's worse, sometimes it's a little bit better, but not significant.\n\n0:42:13\tSPEAKER_02\n Is it with the IDG?\n\n0:42:15\tSPEAKER_01\n No, I work with the Italian and Spanish, basically.\n\n0:42:20\tSPEAKER_01\n If I use the neural network and use directly the feature, the result are worse.\n\n0:42:32\tSPEAKER_01\n But listen, Harry.\n\n0:42:35\tSPEAKER_06\n I really wonder, though.\n\n0:42:37\tSPEAKER_06\n We've had this discussion before, and one of the things that struck me was that about this line of thought that was particularly interesting to me was that whenever you condense things in an irreversible way, you throw away some information.\n\n0:42:59\tSPEAKER_06\n That's mostly viewed as a good thing, the way we use it because we want to suppress things that will cause variability for a particular phonetic units.\n\n0:43:11\tSPEAKER_06\n But you do throw something away.\n\n0:43:14\tSPEAKER_06\n The question is, can we figure out if there's something we've thrown away that we shouldn't have?\n\n0:43:20\tSPEAKER_06\n When they were looking at the difference between the filter bank and the FFT that was going into the filter bank, I was thinking, oh, they're picking on something, they're looking on it to figure out noise or voice property, whatever, that's interesting, maybe that helps to drive the thought process of coming up with the features.\n\n0:43:41\tSPEAKER_06\n But for me, the interesting thing was, well, but is there just something in that difference, which is useful?\n\n0:43:46\tSPEAKER_06\n So another way of doing it maybe would be just to take the FFT, power spectrum, and feed it into a neural network.\n\n0:43:55\tSPEAKER_06\n And then use it in combination or alone or whatever.\n\n0:43:58\tSPEAKER_00\n With what target?\n\n0:44:00\tSPEAKER_06\n No, we need to. No, just the same way we're using the filter bank.\n\n0:44:09\tSPEAKER_06\n Exactly the same way we're using the filter bank.\n\n0:44:11\tSPEAKER_06\n I mean, the filter bank is good for all the reasons that we say it's good, but it's different.\n\n0:44:15\tSPEAKER_06\n And maybe if it's used in combination, it will get at something that we're missing.\n\n0:44:21\tSPEAKER_06\n And maybe using KLT or adding probabilities, I mean, all the different ways that we've been playing with, that we would let the essentially let the neural network determine what is it that's useful that we're missing here.\n\n0:44:41\tSPEAKER_04\n Yeah, but there's so much variability in the power spectrum.\n\n0:44:45\tSPEAKER_06\n Well, that's probably why it would be unlikely to work as well by itself, but it might help in combination.\n\n0:44:53\tSPEAKER_06\n But I have to tell you, I can't remember the conference, but I think it's about 10 years ago.\n\n0:44:58\tSPEAKER_06\n I remember going to one of the speech conferences and I saw within very short distance of one another, a couple different posters that showed about the wonders of some auditory inspired friend end or something.\n\n0:45:13\tSPEAKER_06\n And a couple posters away with somebody who compared one to just putting in the FFT and the FFT did slightly better.\n\n0:45:21\tSPEAKER_06\n So I mean, it's true there's lots of variability, but again, we have these wonderful statistical mechanisms for quantifying that variability and doing something reasonable with it.\n\n0:45:32\tSPEAKER_06\n So it's the same argument that's gone both ways about we have these data driven filters, LDA, and on the other hand, if it's data driven, it means it's driven by things that have lots of variability and that are necessarily not necessarily going to be the same in training and test.\n\n0:45:53\tSPEAKER_06\n So in some ways it's good to have data driven things in some ways it's bad to have data driven things. So part of what we're discovering is ways to combine things that are data driven and are not.\n\n0:46:04\tSPEAKER_06\n So anyways, it's just a thought that if we had that, maybe it's just a baseline, which would show us what are we really getting out of the filters, or maybe probably not by itself in combination, you know, maybe there's something to be gained from it.\n\n0:46:21\tSPEAKER_06\n And let the, what, you know, you've only worked with this for a short time, maybe in a year or two you would actually come up with the right set of things to extract from this information, but maybe the neural net and the HMMs could figure it out quicker than you.\n\n0:46:36\tSPEAKER_06\n So it's just a thought.\n\n0:46:38\tSPEAKER_02\n I will try to do that. Yeah. But one one one one thing and so like what before we started using this VAD name is earlier. What we did was like I guess most of you know about this adding this additional speech silence beat to the kept stream and training that you want that.\n\n0:46:58\tSPEAKER_02\n That is just a binary feature and that seems to be improving a lot on the speech that color is a lot of. But not much on the TIT. So adding an additional feature to this discriminated between speech and not.\n\n0:47:13\tSPEAKER_02\n I'm sorry. We actually added an additional binary feature to the kept stream just the baseline.\n\n0:47:21\tSPEAKER_02\n Yeah, but in the case of the idea that they actually he was anything because there was anything that could discriminate between speech.\n\n0:47:28\tSPEAKER_02\n But what Italian was like.\n\n0:47:31\tSPEAKER_02\n Very good. The huge improvement.\n\n0:47:33\tSPEAKER_04\n But in the question is even more is within speech can we get some features.\n\n0:47:39\tSPEAKER_04\n I was dropping information that can might be useful within speech and maybe to distinguish between voice sound and voice sounds.\n\n0:47:46\tSPEAKER_06\n And it's particularly more relevant now since we're going to be given the end points. So.\n\n0:47:53\tSPEAKER_06\n Yeah.\n\n0:47:56\tSPEAKER_06\n So.\n\n0:48:01\tSPEAKER_02\n So it was a paper in I guess this I guess about the extra adding some higher order information from the kept stream coefficient.\n\n0:48:18\tSPEAKER_02\n I'm a chemilins or something.\n\n0:48:19\tSPEAKER_02\n It was taking the.\n\n0:48:32\tSPEAKER_02\n Maybe.\n\n0:48:36\tSPEAKER_02\n I think he was showing a person something on.\n\n0:48:47\tSPEAKER_06\n Yeah, but again, you could argue that that's exactly what the neural network does.\n\n0:48:51\tSPEAKER_06\n So the neural network is in some sense equivalent to computing higher order moments.\n\n0:48:58\tSPEAKER_06\n So let's do it very specifically.\n\n0:49:09\tSPEAKER_05\n You want to talk about.\n\n0:49:19\tSPEAKER_05\n Yeah.\n\n0:49:22\tSPEAKER_05\n So.\n\n0:49:24\tSPEAKER_05\n I told you I was getting prepared to take this qualifier exam.\n\n0:49:27\tSPEAKER_05\n So basically that's just trying to propose.\n\n0:49:32\tSPEAKER_05\n You're following years of your PhD work trying to find a project to define and work on.\n\n0:49:40\tSPEAKER_05\n So I've been looking into doing something about speech recognition using acoustic events.\n\n0:49:49\tSPEAKER_05\n So the idea is you have all these these different events.\n\n0:49:53\tSPEAKER_05\n For example, voicing.\n\n0:49:55\tSPEAKER_05\n Faciality are coloring.\n\n0:50:02\tSPEAKER_05\n Building robust primary detectors for these acoustic events and using the outputs of these robust detectors to do speech recognition.\n\n0:50:15\tSPEAKER_05\n And these primary detectors will be inspired by multi band techniques doing things similar to Larry Saul's work on graphical models to detect these acoustic events.\n\n0:50:35\tSPEAKER_05\n And so I've been thinking about that and some of the issues that I've been running into are exactly what kind of acoustic events I need, what acoustic events will provide a good enough coverage to in order to do the later recognition steps.\n\n0:50:54\tSPEAKER_05\n And also once I decide a set of acoustic events, how do I get labels training data for these acoustic events.\n\n0:51:06\tSPEAKER_05\n And then later on down the line, I can start playing with the models themselves, the primary detectors.\n\n0:51:14\tSPEAKER_05\n So I kind of see like after after building the primary detectors I see myself taking the outputs and feeding them in sort of tandem style to to a Gaussian mixture of HMM back end and doing recognition.\n\n0:51:34\tSPEAKER_05\n So that's just generally what I've been getting at.\n\n0:51:39\tSPEAKER_06\n But by the way, the voice down voice version of that for instance could tie right into what Cameron was looking at.\n\n0:51:46\tSPEAKER_06\n So you know, if you if a multi band approach was helpful as I think it is, it seems to be helpful for determining voice down voice might be another.\n\n0:52:01\tSPEAKER_05\n Oh, it looks okay. Yeah, and so this this past week I've been looking a little bit into traps and doing doing traps on these events too.\n\n0:52:20\tSPEAKER_05\n I'm seeing it that's possible. Other than that, I was kicked out of my house living there for four years.\n\n0:52:33\tSPEAKER_05\n Oh, yeah. So that was cardboard box on the street now. Something like that.\n\n0:52:38\tSPEAKER_05\n Yeah.\n\n0:52:39\tSPEAKER_02\n So did you find a place? No, I ordered. Yesterday I called up a lady who will have a vacant room from May 30th and she's actually been doing to more people.\n\n0:52:59\tSPEAKER_02\n So she would get back to me on Monday. That's that's only thing I have. And Diane has a few more houses. She's going to take some pictures and send me after I go back.\n\n0:53:10\tSPEAKER_02\n Oh, so you're not down here permanently yet? No. I'm going back to a GI today.\n\n0:53:17\tSPEAKER_06\n Okay. And then you're coming back.\n\n0:53:21\tSPEAKER_02\n I mean, I planned to be here on 31st. 31st. Okay. There's a house available.\n\n0:53:26\tSPEAKER_06\n Well, I mean, if they're available and they'll be able to get you something, so worse comes to worse.\n\n0:53:31\tSPEAKER_06\n We'll put you up in the hotel for a while until you.\n\n0:53:36\tSPEAKER_00\n If you're in an investment situation, you need a place to stay. You could stay with me for a while.\n\n0:53:40\tSPEAKER_00\n I've got a spare bedroom right now.\n\n0:53:42\tSPEAKER_02\n Oh, thanks.\n\n0:53:45\tSPEAKER_02\n So maybe he needs.\n\n0:53:50\tSPEAKER_05\n My car board box is actually a bedroom.\n\n0:53:56\tSPEAKER_06\n Two bedroom car board box.\n\n0:54:01\tSPEAKER_06\n That's great.\n\n0:54:08\tSPEAKER_06\n You want to say anything about you actually been last week you were doing this stuff with Pierre.\n\n0:54:14\tSPEAKER_06\n You were mentioning is that something worth talking about here?\n\n0:54:20\tSPEAKER_00\n Well, I don't think it directly relates. Well, I was helping have speech researcher named Pierre Devenny.\n\n0:54:26\tSPEAKER_00\n And he wanted to look at how people respond to formative changes, I think.\n\n0:54:35\tSPEAKER_00\n So he created a lot of synthetic audio files of vowel to vowel transitions.\n\n0:54:40\tSPEAKER_00\n And then he wanted a psychoacoustic spectrum.\n\n0:54:46\tSPEAKER_00\n And he wanted to look at how the energy is moving over time in that spectrum.\n\n0:54:53\tSPEAKER_00\n And compare that to the listener tests.\n\n0:54:56\tSPEAKER_00\n And so I gave him a PLP spectrum.\n\n0:55:01\tSPEAKER_00\n And he wanted to track the peak.\n\n0:55:04\tSPEAKER_00\n So he could look at how they're moving.\n\n0:55:06\tSPEAKER_00\n And then he took the PLP LPC coefficients.\n\n0:55:11\tSPEAKER_00\n And I found the roots.\n\n0:55:13\tSPEAKER_00\n This was something that's defied and suggested.\n\n0:55:16\tSPEAKER_00\n I found the roots of the LPC polynomial to track the peaks and the PLP LPC spectrum.\n\n0:55:23\tSPEAKER_02\n Is that a line spectral pairs?\n\n0:55:26\tSPEAKER_06\n It's root LPC.\n\n0:55:30\tSPEAKER_02\n So instead of the log, you took the root square, you could be good or something.\n\n0:55:35\tSPEAKER_06\n So it's taking to find the roots of the LPC polynomial.\n\n0:55:38\tSPEAKER_02\n Polynomial.\n\n0:55:39\tSPEAKER_02\n Yeah, is that the line spectral?\n\n0:55:40\tSPEAKER_06\n So it's like line spectral pairs.\n\n0:55:42\tSPEAKER_06\n I think what they call line spectral pairs, they push it towards the unit circle, don't they?\n\n0:55:47\tSPEAKER_06\n But what we'd used to do, when I did synthesis at National Semican Bacter 20 years ago, the technique we were playing with initially was technique LPC polynomial and finding the roots.\n\n0:55:59\tSPEAKER_06\n And it wasn't PLP because he didn't invent it yet.\n\n0:56:01\tSPEAKER_06\n But it was just LPC and we found the roots of the polynomial.\n\n0:56:05\tSPEAKER_06\n And when you do that, sometimes, there are most people that call formats, sometimes they're not.\n\n0:56:11\tSPEAKER_06\n So it's a little, a format tracking with it could be a little tricky because you get these funny values.\n\n0:56:18\tSPEAKER_06\n So you just get a few roots, two or three.\n\n0:56:22\tSPEAKER_06\n You get these complex pairs.\n\n0:56:24\tSPEAKER_06\n It depends on the order that you're doing.\n\n0:56:26\tSPEAKER_00\n Right, so if every root that's, since it's a real signal, the LPC polynomial is going to have real coefficients.\n\n0:56:36\tSPEAKER_00\n So I think that means that every root that is not a real root is going to be a complex pair, a complex value and it's conjugate.\n\n0:56:49\tSPEAKER_00\n So for each, and if you look at that on the unit circle, one of these, one of the members of the pair will be a positive frequency.\n\n0:56:55\tSPEAKER_00\n One will be a negative frequency, I think.\n\n0:56:58\tSPEAKER_00\n So I'm using an a-thorded polynomial and I'll get three or four of these pairs.\n\n0:57:07\tSPEAKER_00\n Which gives me three or four P positions.\n\n0:57:10\tSPEAKER_06\n This is from synthetic speech?\n\n0:57:12\tSPEAKER_06\n That's right.\n\n0:57:13\tSPEAKER_06\n Yeah, so if it's from synthetic speech, then maybe it'll be cleaner.\n\n0:57:16\tSPEAKER_06\n I mean, for a real speech, then what you end up having is, I guess, a funny little things that don't exactly fit your notion of formats all that well.\n\n0:57:24\tSPEAKER_06\n But mostly they do.\n\n0:57:25\tNone\n Yeah.\n\n0:57:25\tSPEAKER_06\n And what we were doing, which is not so much looking at things, it was okay because it was just a question of quantization.\n\n0:57:34\tSPEAKER_06\n We were just, you know, a story.\n\n0:57:36\tSPEAKER_06\n It was, we were doing a stored speech quantization.\n\n0:57:39\tSPEAKER_04\n But in your case, actually you have peaks that are not at the form of positions.\n\n0:57:47\tSPEAKER_04\n But there are lower in energy when they are much lower.\n\n0:57:52\tSPEAKER_03\n If this is synthetic speech, can't you just get the formats directly?\n\n0:57:56\tSPEAKER_00\n I mean, how was the speech created?\n\n0:57:58\tSPEAKER_00\n It was created from a synthesizer.\n\n0:58:00\tSPEAKER_00\n And was an performance synthesizer.\n\n0:58:04\tSPEAKER_06\n It may have been, but maybe he didn't have control of it or something.\n\n0:58:06\tSPEAKER_00\n In fact, we could get format frequencies out of the synthesizer as well.\n\n0:58:12\tSPEAKER_00\n And one thing that the LPC approach will hopefully give me in addition is that I might be able to find the...\n\n0:58:21\tSPEAKER_00\n the bandwidth of these HOMPS as well.\n\n0:58:25\tSPEAKER_00\n I'm still fine suggested looking at each complex pair as a second order.\n\n0:58:29\tSPEAKER_00\n I are filter.\n\n0:58:31\tSPEAKER_00\n But I don't think there's a really good reason not to get the format frequencies from the synthesizer instead.\n\n0:58:37\tSPEAKER_00\n Except that you don't have the psychoacoustic modeling in that.\n\n0:58:41\tSPEAKER_00\n Yeah.\n\n0:58:42\tSPEAKER_06\n So the actual...\n\n0:58:43\tSPEAKER_06\n So you're not getting the actual formats per se.\n\n0:58:46\tSPEAKER_06\n You're getting something that is a festrongly affected by the PLP model.\n\n0:58:54\tSPEAKER_06\n And so it's more psychoacoustic.\n\n0:58:56\tSPEAKER_06\n Oh, I see.\n\n0:58:57\tSPEAKER_06\n It's sort of a different thing.\n\n0:58:58\tSPEAKER_06\n That's sort of the point.\n\n0:58:59\tSPEAKER_06\n But yeah, ordinarily, in a form of synthesizer, the bandwidths as well as the form and centers are...\n\n0:59:06\tSPEAKER_06\n I mean, that's somewhere in the synthesizer that was put in.\n\n0:59:10\tSPEAKER_06\n But yeah, you view each complex pair as essentially a second order section.\n\n0:59:14\tSPEAKER_06\n Which has a band center bandwidth.\n\n0:59:17\tSPEAKER_06\n And...\n\n0:59:23\tNone\n Okay.\n\n0:59:24\tSPEAKER_06\n So, you're going back today and then back in a week, I guess.\n\n0:59:28\tSPEAKER_06\n Yeah.\n\n0:59:29\tSPEAKER_06\n Yeah.\n\n0:59:30\tNone\n Great.\n\n0:59:30\tSPEAKER_06\n Welcome.\n\n0:59:31\tSPEAKER_03\n I guess we should do digits quickly.\n\n0:59:33\tSPEAKER_03\n Oh, yeah, digits.\n\n0:59:34\tSPEAKER_06\n I don't forget.\n\n0:59:35\tSPEAKER_06\n I don't forget our daily digits.\n\n0:59:37\tSPEAKER_06\n I'm not bad.\n\n0:59:38\tSPEAKER_06\n Sure.\n\n0:59:39\tSPEAKER_06\n Transcript.\n\n0:59:41\tSPEAKER_06\n L-142.\n\n0:59:44\tSPEAKER_06\n 1-975-336030.\n\n0:59:49\tSPEAKER_06\n 0-814-187845.\n\n0:59:54\tSPEAKER_06\n 875-54232.\n\n0:59:58\tSPEAKER_06\n 1-187-3211.\n\n1:00:01\tSPEAKER_06\n 0-841-6505-65.\n\n1:00:06\tSPEAKER_06\n 2519-2774.\n\n1:00:10\tSPEAKER_06\n 708-484.\n\n1:00:13\tSPEAKER_06\n 1-732-964-172.\n\n1:00:18\tSPEAKER_03\n Transcript.\n\n1:00:19\tSPEAKER_03\n L-143.\n\n1:00:21\tSPEAKER_03\n 897-4-9168-6219.\n\n1:00:26\tSPEAKER_03\n 489-9488-61.\n\n1:00:30\tSPEAKER_03\n 1-619-2592-6839.\n\n1:00:35\tSPEAKER_03\n 848-0-0-607.\n\n1:00:39\tSPEAKER_03\n 6-515-262178.\n\n1:00:44\tSPEAKER_03\n 754-292-5498.\n\n1:00:47\tSPEAKER_03\n 7-427-832-97232.\n\n1:00:52\tSPEAKER_03\n 1-667-5262.\n\n1:00:56\tSPEAKER_05\n Transcript.\n\n1:00:57\tSPEAKER_05\n L-144.\n\n1:00:59\tSPEAKER_05\n 9-721-75-6322.\n\n1:01:05\tSPEAKER_05\n 6-84-320-282.\n\n1:01:09\tSPEAKER_05\n 0-91864-1042.\n\n1:01:14\tSPEAKER_05\n 577-718592.\n\n1:01:18\tSPEAKER_05\n 7-695-8549-70.\n\n1:01:23\tSPEAKER_05\n 699-453-872.\n\n1:01:28\tSPEAKER_05\n 9-345-722-90342.\n\n1:01:34\tSPEAKER_05\n 210-829-717.\n\n1:01:39\tSPEAKER_00\n Reading transcript.\n\n1:01:41\tSPEAKER_00\n L-145-589-951490.\n\n1:01:47\tSPEAKER_00\n 0-71143-295.\n\n1:01:52\tSPEAKER_00\n 736-877-160.\n\n1:01:57\tSPEAKER_00\n 3-004-65779-7.\n\n1:02:03\tSPEAKER_00\n 3-127-3259.\n\n1:02:08\tSPEAKER_00\n 11715-035-1050-2175.\n\n1:02:16\tSPEAKER_00\n 1665-6228-4689.\n\n1:02:24\tSPEAKER_02\n Transcript.\n\n1:02:25\tSPEAKER_02\n L-146-913307-464.\n\n1:02:31\tSPEAKER_02\n 463-773-1244.\n\n1:02:36\tSPEAKER_02\n 636-930-2728.\n\n1:02:41\tSPEAKER_02\n 276-875-224.\n\n1:02:45\tSPEAKER_02\n 976-93896.\n\n1:02:49\tSPEAKER_02\n 11913-4812-3442.\n\n1:02:54\tSPEAKER_02\n 619-330-35.\n\n1:02:58\tSPEAKER_02\n 794-278-5652.\n\n1:03:04\tSPEAKER_01\n Transcript.\n\n1:03:05\tSPEAKER_01\n L-140-353-184012.\n\n1:03:14\tSPEAKER_01\n 456-334-0634.\n\n1:03:20\tSPEAKER_01\n 525-922775.\n\n1:03:25\tSPEAKER_01\n 718-275284.\n\n1:03:30\tSPEAKER_01\n 0-478-604049.\n\n1:03:37\tSPEAKER_01\n 9807-5516-0071.\n\n1:03:44\tSPEAKER_01\n 0-16-059-6052.\n\n1:03:50\tSPEAKER_01\n 518-457-7197.\n\n1:03:57\tSPEAKER_04\n Transcript.\n\n1:03:58\tSPEAKER_04\n L-141-622-760-042.\n\n1:04:04\tSPEAKER_04\n 9-537-89365-4.\n\n1:04:09\tSPEAKER_04\n 2589-8515-1617-3088-9492.\n\n1:04:18\tSPEAKER_04\n 977-9.\n\n1:04:20\tSPEAKER_04\n 923-929-0056-0901.\n\n1:04:27\tSPEAKER_04\n 7985-0505.\n\n1:04:31\tSPEAKER_04\n 925-4443-95.\n\n1:04:35\tSPEAKER_04\n 8984-3042-3297.\n\n", "summary": [{"summary_text": "SPEAKER and Joggy are going to meet on the 24th of July. They will talk about the agenda for the summer. They are using wireless mic with a mic number written on the back of the unit. The mic number is one less than the channel number. The digits are read at the end of the meeting."}]}