{"filename": "./data/Bro023.txt", "transcript": "0:00:00\tSPEAKER_04\n And Hans Gunter will be here with the mechanics x2's day or so.\n\n0:00:20\tSPEAKER_04\n Oh, okay.\n\n0:00:21\tSPEAKER_04\n So he's going to be here for about three weeks.\n\n0:00:23\tSPEAKER_03\n Oh, that's right.\n\n0:00:24\tSPEAKER_04\n Just for a visit.\n\n0:00:25\tSPEAKER_04\n We might end up with some longer collaboration or something.\n\n0:00:30\tSPEAKER_04\n So he's going to look in on everything we're doing and give us his thoughts.\n\n0:00:35\tSPEAKER_04\n And so be another good person looking at things.\n\n0:00:39\tSPEAKER_00\n Oh.\n\n0:00:40\tSPEAKER_00\n Yeah.\n\n0:00:41\tSPEAKER_00\n Oh, yeah.\n\n0:00:42\tSPEAKER_00\n Oh, yeah.\n\n0:00:43\tSPEAKER_00\n Yeah.\n\n0:00:44\tSPEAKER_00\n Oh, yeah.\n\n0:00:45\tSPEAKER_04\n Yeah.\n\n0:00:46\tSPEAKER_04\n Yeah.\n\n0:00:47\tSPEAKER_04\n Now, here we are after three weeks.\n\n0:00:48\tSPEAKER_04\n He's very, very easy going.\n\n0:00:51\tSPEAKER_04\n Easy to talk to.\n\n0:00:52\tSPEAKER_04\n Very interesting.\n\n0:00:53\tSPEAKER_04\n Everything.\n\n0:00:54\tSPEAKER_04\n Yeah.\n\n0:00:55\tSPEAKER_01\n Yeah, we're married and we're not sure.\n\n0:00:57\tSPEAKER_04\n Yeah.\n\n0:00:58\tSPEAKER_04\n Yeah, he's been here before.\n\n0:00:59\tSPEAKER_04\n I mean, he's been here.\n\n0:01:00\tSPEAKER_06\n He's been here.\n\n0:01:01\tSPEAKER_06\n He's been here for a year or six months, something like that.\n\n0:01:05\tSPEAKER_04\n Yeah.\n\n0:01:06\tSPEAKER_03\n Yeah.\n\n0:01:07\tSPEAKER_03\n He's done a couple of stays here.\n\n0:01:10\tSPEAKER_06\n So I guess we got lots to catch up on.\n\n0:01:15\tSPEAKER_06\n We haven't met for a couple of weeks.\n\n0:01:17\tSPEAKER_06\n We didn't meet last week morning.\n\n0:01:18\tSPEAKER_06\n I went around and walked everybody and seemed like they had some new results.\n\n0:01:22\tSPEAKER_06\n Other than them coming up and telling me I figured we should just wait a week and they can tell both, you know, all of us.\n\n0:01:29\tSPEAKER_06\n So why don't we start with you, Dave?\n\n0:01:33\tSPEAKER_06\n Oh, okay.\n\n0:01:34\tSPEAKER_06\n Then we can go on.\n\n0:01:36\tSPEAKER_00\n So since we're looking at putting this on, we need a lot of things.\n\n0:01:42\tSPEAKER_00\n I think you expect those factors to make this our conscious.\n\n0:01:47\tSPEAKER_00\n I just ask you if it would work using the path only and possibly present the pathway for me.\n\n0:01:55\tSPEAKER_00\n And so I just ask who I use 12 seconds from the path and the path and the path for me and 12 seconds.\n\n0:02:03\tSPEAKER_06\n 12 seconds from the current.\n\n0:02:07\tSPEAKER_06\n 12 seconds from the current.\n\n0:02:09\tSPEAKER_00\n 12 seconds.\n\n0:02:10\tSPEAKER_00\n 12 seconds from the end of the current frame.\n\n0:02:20\tSPEAKER_00\n So we've had to do it using a 12 seconds sandwich window.\n\n0:02:24\tSPEAKER_00\n I think it was a drop in performance, but it was slightly dropped.\n\n0:02:28\tSPEAKER_00\n Is that right?\n\n0:02:29\tSPEAKER_04\n Yeah, I mean, it was pretty tiny.\n\n0:02:33\tSPEAKER_00\n So that was encouraging.\n\n0:02:40\tSPEAKER_00\n That's encouraging for the idea of using it in hydroaccus.\n\n0:02:43\tSPEAKER_00\n It's like smart home.\n\n0:02:44\tSPEAKER_00\n And another issue I'm thinking about is in the smart home system.\n\n0:02:48\tSPEAKER_00\n So it's like 12 seconds in the early test.\n\n0:02:50\tSPEAKER_00\n It's like a good length of time.\n\n0:02:52\tSPEAKER_00\n But what happens if you have left in 12 seconds?\n\n0:02:57\tSPEAKER_00\n So I would be before back in May I did some experiments using say two seconds or four seconds or six seconds.\n\n0:03:05\tSPEAKER_00\n In those I trained the models using mean subtraction with the mean calculated over two seconds or four seconds or six seconds.\n\n0:03:12\tSPEAKER_00\n And here I was curious what if I trained the models using 12 seconds.\n\n0:03:18\tSPEAKER_00\n But I gave it a situation where the test I was subtracting using two seconds or four seconds or six seconds.\n\n0:03:24\tSPEAKER_00\n So I did that for about three different conditions.\n\n0:03:31\tSPEAKER_00\n And I think it was four seconds and six seconds and eight seconds, something like that.\n\n0:03:44\tSPEAKER_00\n And it seems like it hurts compared to if you actually trained the models using that same length of time.\n\n0:03:50\tSPEAKER_00\n But it doesn't hurt that much.\n\n0:03:54\tSPEAKER_00\n You usually left in 25% although I could see one where it was a point eight percent or so rise in word error rate.\n\n0:04:01\tSPEAKER_00\n But this is where even if I train on the model means subtractive with the same length of time as in the test, the word error rate is around 10% or 9%.\n\n0:04:15\tSPEAKER_00\n So it doesn't seem like that.\n\n0:04:16\tSPEAKER_04\n But looking at the other way, isn't it what you're saying that it didn't help you to have the longer time for training if you were going to have a short time for?\n\n0:04:26\tSPEAKER_00\n That's true.\n\n0:04:29\tSPEAKER_04\n I mean why would you do it if you knew that you were going to have short windows?\n\n0:04:33\tSPEAKER_06\n It seems like you're in normal situations you would never get 12 seconds of speech.\n\n0:04:40\tSPEAKER_01\n You need 12 seconds in the past two weeks to make it right?\n\n0:04:46\tSPEAKER_01\n Are you looking at six seconds in future and six in?\n\n0:04:49\tSPEAKER_06\n No, it's all 12 seconds in the past.\n\n0:04:52\tSPEAKER_06\n Is this 12 seconds of regardless of speech or sound?\n\n0:04:56\tSPEAKER_04\n The other thing which may be a little bit of something else we've talked about in terms of windowing and so on is that I wonder if you trained with 12 seconds.\n\n0:05:07\tSPEAKER_04\n And then when you were two seconds in, you used two seconds and when you were four seconds in, you used four seconds and you basically build up to the 12 seconds so that if you have very long utterances, you have the best.\n\n0:05:18\tSPEAKER_04\n But if you have shorter utterances, you use which you can.\n\n0:05:21\tSPEAKER_00\n Right. And that's actually what we're applying to do in small calm.\n\n0:05:25\tSPEAKER_00\n Yeah.\n\n0:05:26\tSPEAKER_00\n So the question I was trying to get out with those experiments is does it matter what models you use? Does it matter how much time you use to calculate the mean when you were doing the training data?\n\n0:05:38\tSPEAKER_04\n Right. But I mean the other thing is that that's, I mean the other way of looking at this going back to mean capital subtraction versus rasta kind of things is that you could look at mean capital subtraction, especially the way you're doing it as being kind of filter.\n\n0:05:54\tSPEAKER_04\n So the other thing is just to design a filter.\n\n0:05:57\tSPEAKER_04\n You know, basically you're doing a high pass filter or a band pass filter or some sort and just design a filter.\n\n0:06:04\tSPEAKER_04\n And then you know, filter will have certain behavior and you can look at the startup behavior.\n\n0:06:09\tSPEAKER_04\n You start up with nothing and you know, you will.\n\n0:06:12\tSPEAKER_04\n If you have an IAR filter, for instance, it will not behave in the study state way that you would like it to behave until you get along enough period.\n\n0:06:25\tSPEAKER_04\n But by just constraining yourself to have your filter be only subtraction of the mean, you're kind of tying your hands behind your back because there's filters have all sorts of temporal and spectral behaviors.\n\n0:06:38\tSPEAKER_04\n And the only thing consistent we know about is that you want to get rid of the very low frequency component.\n\n0:06:47\tSPEAKER_01\n But do you really want to calculate the mean you neglect all the silenced regions or you just use everything that's 12 seconds?\n\n0:06:56\tSPEAKER_00\n You mean in my task so far?\n\n0:06:58\tSPEAKER_00\n Yeah. Most of the silences have been cut out.\n\n0:07:01\tSPEAKER_00\n Okay.\n\n0:07:02\tSPEAKER_00\n Just just introwards silences.\n\n0:07:04\tSPEAKER_01\n And they are like pretty short.\n\n0:07:11\tSPEAKER_01\n So you really need a lot of speech to estimate the mean in it?\n\n0:07:14\tSPEAKER_00\n Well, if I only use six seconds, it still works pretty well.\n\n0:07:18\tSPEAKER_00\n I saw my task before.\n\n0:07:20\tSPEAKER_00\n I was trying 12 seconds, but that was the best.\n\n0:07:22\tSPEAKER_00\n Okay.\n\n0:07:23\tSPEAKER_00\n And increasing past 12 seconds didn't seem to help.\n\n0:07:30\tSPEAKER_00\n Yeah, I guess it's something I need to play with more of this.\n\n0:07:34\tSPEAKER_00\n I had to set that up for the smart answers that made maybe if I trained on six seconds, it would work better when I only had two seconds or four seconds.\n\n0:07:44\tSPEAKER_03\n Yeah.\n\n0:07:46\tSPEAKER_04\n And again, if you take this filtering perspective and if you essentially have it build up over time, I mean, if you computed means over two and then over four and over six, then it's literally getting into the kind of ramp up of a filter anyway.\n\n0:08:03\tSPEAKER_04\n And so you may just want to think of it as a filter.\n\n0:08:05\tSPEAKER_04\n But if you do that, then in practice, somebody using a smart-com system wouldn't think they're using it for a while.\n\n0:08:14\tSPEAKER_04\n It means that their first utterance instead of getting a 40% error rate reduction, they'll get what you get without this policy, you get 30%.\n\n0:08:28\tSPEAKER_04\n And then the second utterance that you give, they get the full benefit of it.\n\n0:08:34\tSPEAKER_06\n If it's ongoing, you catch the utterances.\n\n0:08:37\tSPEAKER_06\n That's how you get your...\n\n0:08:39\tSPEAKER_04\n Well, I'm saying in practice, yeah.\n\n0:08:41\tSPEAKER_04\n That's somebody's using a system to ask for directions or something.\n\n0:08:45\tSPEAKER_04\n Okay.\n\n0:08:46\tSPEAKER_04\n You know, they'll say something first and to begin with, if it doesn't get them quite right, maybe they'll come back and say, excuse me.\n\n0:08:52\tSPEAKER_04\n Or I mean, you should have some policy like that anyway. And in any event, they might ask a second question.\n\n0:08:59\tSPEAKER_04\n It's not like what he's doing doesn't improve things.\n\n0:09:03\tSPEAKER_04\n It does improve things just not as much as he would like.\n\n0:09:07\tSPEAKER_04\n And so there's a higher probability of making an error for a utterance.\n\n0:09:14\tSPEAKER_06\n It would be really cool if you could have...\n\n0:09:16\tSPEAKER_06\n There's probably users who would never like this, but if you had... could have a system where before they began to use it, they had to introduce themselves verbally.\n\n0:09:24\tSPEAKER_06\n Yeah.\n\n0:09:25\tSPEAKER_06\n I have my name and so on and so on.\n\n0:09:27\tSPEAKER_06\n And you could use that initial speech to do all these adaptations.\n\n0:09:30\tSPEAKER_04\n Right.\n\n0:09:31\tSPEAKER_04\n Well, the other thing, I guess, which I don't know much about... as much as I should about the rest of the system, but couldn't you...\n\n0:09:41\tSPEAKER_04\n If you sort of did a first pass, I don't know what kind of capability we have at the moment for doing second passes on some kind of little small lannister, a graph, or fusion network or something.\n\n0:09:58\tSPEAKER_04\n But if you did first pass with either without the means of subtraction or with a very short time one, and then once you actually had the whole utterance in, if you did the longer time version then based on everything that you had, and then at that point only used it to distinguish between, you know, top-end possible utterances or something.\n\n0:10:31\tSPEAKER_04\n You might... it might not take very much time. I mean, I know in the large vocabulary systems people were evaluating on the past, some people really pushed everything in to make it in one pass, but other people didn't and had multiple passes.\n\n0:10:47\tSPEAKER_04\n And the argument against multiple passes has often been, but we want this to be, you know, had nice interactive response.\n\n0:10:58\tSPEAKER_04\n And the counter argument to that, which is a BBN, I think, had was, yeah, but our second response is, second passes and third passes are really, really fast.\n\n0:11:07\tSPEAKER_04\n So if your second pass takes a millisecond, who cares?\n\n0:11:15\tSPEAKER_00\n So the idea of the second pass would be waiting until you have more recorded speech or...\n\n0:11:23\tSPEAKER_04\n If it turned out to be a problem, that you didn't have enough speech because you need longer window to do this processing, then one tactic is looking at the larger system, and not just at the front end stuff, is to take in the speech with some simpler mechanism or shorter time mechanism, do the best you can and come up with some possible alternates of what might have been said, and either in the form of an end-best list or in the form of a lattice or confusion network or whatever.\n\n0:11:57\tSPEAKER_04\n And then the decoding of that is much, much faster, or can be much, much faster if it isn't a big bushing network.\n\n0:12:05\tSPEAKER_04\n And you can decode that with speech that you've actually processed using this longer time subtraction.\n\n0:12:14\tSPEAKER_04\n So I mean, it's common that people do this sort of thing where they do more things that are more complex, a require looking over more time, whatever in some kind of second pass.\n\n0:12:24\tSPEAKER_04\n And again, if the second pass is really, really fast, another one I've heard of is in connected digit stuff, going back and through backtrace and finding regions that are considered to be a digit, but which have very low energy.\n\n0:12:42\tSPEAKER_04\n So, I mean, there's lots of things you can do in second pass, as in all sorts of levels.\n\n0:12:49\tSPEAKER_04\n Anyway, I'm throwing too many things out.\n\n0:12:52\tSPEAKER_06\n So is that...\n\n0:13:00\tSPEAKER_06\n Edit?\n\n0:13:02\tSPEAKER_06\n I got that.\n\n0:13:05\tSPEAKER_01\n Do you want to go for it?\n\n0:13:12\tSPEAKER_01\n So last two weeks, I've been working on that Vener filtering.\n\n0:13:17\tSPEAKER_01\n And I found that single, like I just do a normal Vener filtering, like the standard method of Vener filtering.\n\n0:13:25\tSPEAKER_01\n That doesn't actually give me any improvement over, like...\n\n0:13:30\tSPEAKER_01\n It actually improves over the baseline, but it doesn't need something like 50% or something.\n\n0:13:35\tSPEAKER_01\n So I've been playing with the baseline MFCC.\n\n0:13:38\tSPEAKER_06\n Yeah.\n\n0:13:39\tSPEAKER_01\n So that's the improvement is around 30% over the baseline.\n\n0:13:44\tSPEAKER_04\n Is that using contamination with something else?\n\n0:13:47\tSPEAKER_01\n No, just one stage Vener filter, which is a standard Vener filter.\n\n0:13:50\tSPEAKER_04\n No, but I mean, contamination with our non-normalization or with the...\n\n0:13:54\tSPEAKER_01\n Yeah, yeah, yeah.\n\n0:13:55\tSPEAKER_01\n So I just plug in the Vener filtering.\n\n0:13:57\tSPEAKER_01\n In our system where... Does it mean it gets worse?\n\n0:14:01\tSPEAKER_01\n No, it actually improves over the baseline of not having a Vener filter in the whole system.\n\n0:14:05\tSPEAKER_01\n Like I have an LDF plus online normalization.\n\n0:14:08\tSPEAKER_01\n And then I plug in the Vener filter in that.\n\n0:14:10\tSPEAKER_01\n So it improves over not having the Vener filter.\n\n0:14:13\tSPEAKER_01\n So it improves, but it doesn't take it like beyond like 30% over the baseline.\n\n0:14:18\tSPEAKER_01\n So...\n\n0:14:19\tSPEAKER_04\n That's when I'm confused about it, because I think I thought that our system was more like 40% without the Vener filter.\n\n0:14:25\tSPEAKER_04\n No, it's like...\n\n0:14:27\tSPEAKER_06\n What is the new VAD?\n\n0:14:30\tSPEAKER_01\n No, it's old VAD.\n\n0:14:32\tSPEAKER_01\n So my baseline was...\n\n0:14:34\tSPEAKER_01\n This is like the baseline is 95.68, 89.\n\n0:14:43\tSPEAKER_04\n So I mean, if you do all these word errors, it's a lot easier.\n\n0:14:46\tSPEAKER_04\n What is that?\n\n0:14:47\tSPEAKER_04\n If you do all these word error rates, it's a lot easier.\n\n0:14:49\tSPEAKER_01\n Oh, okay, okay, okay.\n\n0:14:50\tSPEAKER_01\n I don't have it. It's all accurate.\n\n0:14:52\tSPEAKER_02\n Yeah, the baseline is something similar to...\n\n0:14:56\tSPEAKER_02\n I mean, the baseline that you were talking about is the MFCC baseline.\n\n0:15:01\tSPEAKER_01\n Yeah, there are two baselines.\n\n0:15:03\tSPEAKER_01\n Okay, so the baseline...\n\n0:15:04\tSPEAKER_01\n One baseline is the MFCC baseline.\n\n0:15:06\tSPEAKER_01\n When I said 30% improvement is like the MFCC baseline.\n\n0:15:08\tSPEAKER_04\n So as a startup, the MFCC baseline is what?\n\n0:15:12\tSPEAKER_04\n Is it what level?\n\n0:15:14\tSPEAKER_01\n It's just the male frequency and...\n\n0:15:17\tSPEAKER_01\n That's what's the number.\n\n0:15:19\tSPEAKER_01\n So I don't have that number here.\n\n0:15:22\tSPEAKER_01\n Okay, okay, I have it here.\n\n0:15:24\tSPEAKER_01\n It's the VAD plus the baseline, actually.\n\n0:15:27\tSPEAKER_01\n I'm talking about the MFCC plus I do a frame dropping on it.\n\n0:15:30\tSPEAKER_01\n So that's like...\n\n0:15:31\tSPEAKER_01\n The word error rate is like 4.3.\n\n0:15:33\tSPEAKER_01\n 4.3.\n\n0:15:34\tSPEAKER_01\n 4.3.\n\n0:15:35\tSPEAKER_01\n And 0.7.\n\n0:15:36\tSPEAKER_01\n What's 10.7?\n\n0:15:37\tSPEAKER_01\n It's the medium mismatch.\n\n0:15:38\tSPEAKER_01\n Okay, sorry.\n\n0:15:39\tSPEAKER_01\n It's the well-match medium mismatch in the high mismatch.\n\n0:15:41\tSPEAKER_01\n So I don't have...\n\n0:15:42\tSPEAKER_01\n 4.3, 10.7.\n\n0:15:44\tSPEAKER_01\n And 40.\n\n0:15:46\tSPEAKER_01\n 40%.\n\n0:15:47\tSPEAKER_01\n It's the high mismatch.\n\n0:15:50\tSPEAKER_01\n Okay.\n\n0:15:51\tSPEAKER_01\n And it becomes like 4.3.\n\n0:15:55\tSPEAKER_04\n Not changed.\n\n0:15:57\tSPEAKER_01\n Yeah, it's like 10.1.\n\n0:15:59\tSPEAKER_01\n Still the same.\n\n0:16:01\tSPEAKER_01\n And the high mismatch is like 18.5.\n\n0:16:07\tSPEAKER_04\n 18.5.\n\n0:16:08\tSPEAKER_04\n And what were you just describing?\n\n0:16:10\tSPEAKER_01\n The one is...\n\n0:16:11\tSPEAKER_01\n This one is just the baseline plus the...\n\n0:16:14\tSPEAKER_01\n We don't filter plugged into it.\n\n0:16:17\tSPEAKER_04\n But where's the online normalization and so on?\n\n0:16:20\tSPEAKER_01\n Okay, so...\n\n0:16:21\tSPEAKER_01\n Sorry.\n\n0:16:22\tSPEAKER_01\n So with the online normalization, the performance was...\n\n0:16:27\tSPEAKER_01\n And...\n\n0:16:28\tSPEAKER_01\n Okay, so it's like 4.3.\n\n0:16:31\tSPEAKER_01\n And again, that's the 10.4 and 20.1.\n\n0:16:39\tSPEAKER_01\n That was with online normalization and LDA.\n\n0:16:43\tSPEAKER_01\n So the well matched as like literally not changed by adding online or LDA on it.\n\n0:16:49\tSPEAKER_01\n But the...\n\n0:16:51\tSPEAKER_01\n I mean, even the medium mismatch is pretty much the same.\n\n0:16:53\tSPEAKER_01\n And the high mismatch is improved by 20% absolute.\n\n0:16:57\tSPEAKER_04\n Okay.\n\n0:16:58\tSPEAKER_04\n And what kind of number...\n\n0:16:59\tSPEAKER_04\n What are we talking about here?\n\n0:17:00\tSPEAKER_04\n Is this...\n\n0:17:01\tSPEAKER_01\n It's Italian.\n\n0:17:02\tSPEAKER_01\n Italian.\n\n0:17:03\tSPEAKER_04\n Yeah.\n\n0:17:04\tSPEAKER_04\n And what...\n\n0:17:05\tSPEAKER_04\n So what was the corresponding numbers say for the Alcatel system?\n\n0:17:12\tSPEAKER_04\n Yeah, 3.3.\n\n0:17:14\tSPEAKER_02\n Yeah, 3.3.\n\n0:17:15\tSPEAKER_02\n Yeah, 3.4.\n\n0:17:18\tSPEAKER_02\n Yeah, 3.4.\n\n0:17:21\tSPEAKER_02\n 8.7.\n\n0:17:24\tSPEAKER_02\n And 13.7.\n\n0:17:28\tSPEAKER_02\n Okay.\n\n0:17:29\tSPEAKER_02\n Yeah.\n\n0:17:30\tSPEAKER_03\n Okay.\n\n0:17:31\tSPEAKER_03\n Thanks.\n\n0:17:39\tSPEAKER_05\n Okay.\n\n0:17:40\tSPEAKER_01\n So this is the single stage winner filter with the noise estimation was based on first 10 frames.\n\n0:17:49\tSPEAKER_01\n Actually, I started with using the VAD to estimate the noise.\n\n0:17:52\tSPEAKER_01\n And then I found that it works.\n\n0:17:54\tSPEAKER_01\n It doesn't work for finish and Spanish because the VAD endpoints are not good to estimate the noise.\n\n0:18:00\tSPEAKER_01\n Because it cuts into the speed sometime.\n\n0:18:02\tSPEAKER_01\n So I end up overestimating the noise and getting a worse result.\n\n0:18:05\tSPEAKER_01\n So it works only for Italian by using a VAD to estimate noise.\n\n0:18:10\tSPEAKER_01\n Work for Italian because the VAD was trained on Italian.\n\n0:18:12\tSPEAKER_01\n So this was giving...\n\n0:18:18\tSPEAKER_01\n This was not improving a lot on this baseline of not having the winner filter on it.\n\n0:18:24\tSPEAKER_01\n And so I ran this stuff with one more stage of winner filtering on it.\n\n0:18:29\tSPEAKER_01\n But the second time what I did was I estimated the new winner filter based on the cleaned up speech.\n\n0:18:36\tSPEAKER_01\n And did a smoothing in the frequency to reduce the variance.\n\n0:18:43\tSPEAKER_01\n I mean, I observed that a lot of bumps in the frequency when I do this winner filtering, which is more like a musical noise or something.\n\n0:18:51\tSPEAKER_01\n And so by adding another stage of winner filtering, the results on the speech that car was like...\n\n0:18:58\tSPEAKER_01\n So I still don't have the word error rate.\n\n0:19:01\tSPEAKER_01\n I'm sorry about it.\n\n0:19:02\tSPEAKER_01\n But the overall improvement was like 56.46.\n\n0:19:05\tSPEAKER_01\n This was again using 10 frames of noise estimate and two stage of winner filtering.\n\n0:19:10\tSPEAKER_01\n And rest is like the LDAP and online organization all remaining the same.\n\n0:19:15\tSPEAKER_01\n So this was like compared to 57 is what you got by using the French telecom system, right?\n\n0:19:23\tSPEAKER_02\n No, I don't think so. Is it on Italian?\n\n0:19:26\tSPEAKER_01\n No, this is all of the whole speech that car.\n\n0:19:29\tSPEAKER_01\n 57 point.\n\n0:19:30\tSPEAKER_01\n Right.\n\n0:19:31\tSPEAKER_01\n Yeah, so the new new winner filtering scheme has like some 56.46, which is like one person still less than what you got using the French telecom system.\n\n0:19:41\tSPEAKER_04\n But it's a pretty similar number in any event.\n\n0:19:44\tSPEAKER_04\n It's very similar.\n\n0:19:45\tSPEAKER_04\n Yeah. But again, you're more or less doing what they were doing, right?\n\n0:19:49\tSPEAKER_01\n It's different in a sense.\n\n0:19:51\tSPEAKER_01\n Like, I'm actually cleaning up the cleaned up spectrum, which they're not doing.\n\n0:19:55\tSPEAKER_01\n They're what they're doing is they have two stage stages of estimating the winner filter.\n\n0:20:00\tSPEAKER_01\n Yeah, but the final filter what they do is they take it to the time domain by doing an inverse Fourier transform.\n\n0:20:08\tSPEAKER_01\n And they filter the original signal using that filter, which is like final filter is acting on the input noise speech rather than on the clean up.\n\n0:20:17\tSPEAKER_01\n So this is more like I'm doing winner filter twice, but the only thing is that the second time I'm actually smoothing the filter and then cleaning up the cleaned up spectrum first level.\n\n0:20:29\tSPEAKER_01\n Okay.\n\n0:20:30\tSPEAKER_01\n And so that that's that's what the difference is. And actually I tried it on the original clean.\n\n0:20:35\tSPEAKER_01\n I mean, the original spectrum where like I second time estimate the filter, but actually clean up the noisy speech rather than the first output of the first stage.\n\n0:20:43\tSPEAKER_01\n And that doesn't seem to be giving me that machine improvement.\n\n0:20:48\tSPEAKER_01\n I just didn't run it for the whole case.\n\n0:20:50\tSPEAKER_01\n And what I what I tried was by using the same thing, but so we actually found that the word is very like crucial.\n\n0:21:01\tSPEAKER_01\n I mean, just by changing the word itself gives you the lot of improvement by instead of using the current word, if you just take up the bad output from the channel zero.\n\n0:21:10\tSPEAKER_01\n When instead of using channel zero and channel one, because that was the reason why I was not getting a lot of improvement for estimating the noise.\n\n0:21:18\tSPEAKER_01\n So I just use the channel zero watt to estimate the noise so that it gives me some reliable markers for this noise estimation.\n\n0:21:25\tSPEAKER_04\n What's the channel zero then?\n\n0:21:27\tSPEAKER_03\n So it's like close talking.\n\n0:21:29\tSPEAKER_01\n Yeah, the close talking.\n\n0:21:30\tSPEAKER_01\n Because the channel zero and channel one are like the same speech only when the same endpoints, but only thing that the speech is very noisy for the channel one.\n\n0:21:39\tSPEAKER_01\n So can I also use the output of the channel zero for channel one for bad?\n\n0:21:44\tSPEAKER_01\n I mean, that's like a cheating.\n\n0:21:46\tSPEAKER_04\n Right. I mean, so what are they going to do?\n\n0:21:49\tSPEAKER_04\n Do we know yet about the source what the rules are going to be?\n\n0:21:52\tSPEAKER_02\n Yeah, so actually you received a new document.\n\n0:21:54\tSPEAKER_02\n Yeah, that's describing this.\n\n0:21:57\tSPEAKER_02\n And what they did find out is to not to align the utterances, but to perform recognition only on the close talking microphone.\n\n0:22:08\tSPEAKER_02\n Did you get the recognition to get the boundaries of speech?\n\n0:22:15\tSPEAKER_04\n So it's not like that's being done in one place or one time that's just a role and we you were permitted to do that.\n\n0:22:22\tSPEAKER_02\n I think they will send files, but we don't want.\n\n0:22:28\tSPEAKER_04\n Also, they will send files so everybody will have the same boundaries to work with.\n\n0:22:31\tSPEAKER_01\n Yeah, but actually the alignment actually is not seems to be improving in like on all cases.\n\n0:22:36\tSPEAKER_02\n Yeah, so what happened here is that the overall improvement that they have with this method.\n\n0:22:44\tSPEAKER_02\n Well, to be more precise what they have is they have these alignments and then they drop the beginning silence and the end silence, but they keep 200 milliseconds before speech and 200 after speech.\n\n0:22:58\tSPEAKER_02\n And they keep the speech post is also.\n\n0:23:03\tSPEAKER_02\n And the overall improvement over the MFCC baseline.\n\n0:23:06\tSPEAKER_02\n So when they just at this friend wrapping in addition is 40% right 14% I mean, which is which is the overall improvement.\n\n0:23:22\tSPEAKER_02\n But in some cases it doesn't improve at all like.\n\n0:23:27\tSPEAKER_01\n It gives like negative in some time like some Italian and the IDGETs right.\n\n0:23:34\tSPEAKER_01\n So by using the end point that speech actually it's worse than the baseline in some instances which could be due to the.\n\n0:23:42\tSPEAKER_02\n The other thing also is that 14% is less than what you obtain using a real VAD.\n\n0:23:48\tSPEAKER_02\n Yeah, our new result cheating like this. So I think this shows that there's still work.\n\n0:23:58\tSPEAKER_02\n But working on the VAD is still still important.\n\n0:24:03\tSPEAKER_06\n Can I ask just a high level question.\n\n0:24:06\tSPEAKER_06\n Can you just say like one or two sentences about Wiener filtering and why are people doing that? What's the deal?\n\n0:24:14\tSPEAKER_01\n So the Wiener filter it's like you try to minimize.\n\n0:24:21\tSPEAKER_01\n So the basic principle of Wiener filter is like you try to minimize the difference between the noise signal and the clean signal.\n\n0:24:28\tSPEAKER_01\n If you have two channels like let's say you have a clean signal and you have an additional channel where you know what is the noise signal.\n\n0:24:35\tSPEAKER_01\n And then you try to minimize error between these two.\n\n0:24:37\tSPEAKER_01\n So that's the basic principle and you can do that. If you have only a noise signal available with you, you try to estimate the noise from the assuming that the first few frames are noise or if you have voice activity director you estimate the noise spectrum.\n\n0:24:52\tSPEAKER_01\n And then you assume the noise is same.\n\n0:24:55\tSPEAKER_01\n Yeah, after the speech starts.\n\n0:24:57\tSPEAKER_01\n But that's not the case in many of our cases but it works reasonably well. And then you what you do is you.\n\n0:25:07\tSPEAKER_01\n So again, I can try down some of this.\n\n0:25:11\tSPEAKER_01\n Yeah, and then you do this. This is the transfer function of the Wiener filter.\n\n0:25:15\tSPEAKER_01\n So SF is the clean speech spectrum, and N is the noisy, and so this is the transfer function.\n\n0:25:33\tSPEAKER_01\n And then you multiply your noisy, and you get an estimate of the clean, and so.\n\n0:25:43\tSPEAKER_01\n But the thing is that you have to estimate the SF from the noisy spectrum what you have.\n\n0:25:49\tSPEAKER_01\n So you estimate the NF from the initial noise portions and then you subtract that from the current noise spectrum to get an estimate of the SF.\n\n0:25:58\tSPEAKER_01\n So sometimes that becomes zero because you don't have a true estimate of the noise.\n\n0:26:03\tSPEAKER_01\n So the filter will have like sometimes zeros, and it because some frequency values will be zeroed out because of that. And that creates a lot of discontinuities across the spectrum with the filter.\n\n0:26:16\tSPEAKER_01\n So that's what that was just the first stage of Wiener filtering that I tried.\n\n0:26:22\tSPEAKER_06\n So is this basically similar to just regular spectrocentrum?\n\n0:26:28\tSPEAKER_04\n It's all pretty related. There's a whole class of techniques where you try in some sense to minimize the noise.\n\n0:26:37\tSPEAKER_04\n And it's typically a mean square sense in some way.\n\n0:26:42\tSPEAKER_04\n And spectral subtraction is one approach to it.\n\n0:26:49\tSPEAKER_06\n So people use the Wiener filtering in combination with the spectral subtraction typically or are they sort of non-seating techniques?\n\n0:26:58\tSPEAKER_01\n They are very similar techniques. So it's like I've been seeing Wiener filter with spectral subtraction.\n\n0:27:03\tSPEAKER_04\n I mean in the long run you're doing the same thing, but you make different approximations. In spectral subtraction for instance there's an estimation factor.\n\n0:27:12\tSPEAKER_04\n So you figure out what the noise is and you multiply that noise spectrum times some constant and subtract that rather than sometimes people even though this really should be in the power domain, sometimes people work in the magnitude to mean because it works better.\n\n0:27:30\tSPEAKER_06\n So why did you choose Wiener filtering over some other one of these other techniques?\n\n0:27:36\tSPEAKER_01\n The reason was we had this choice of using spectral subtraction Wiener filtering and there was one more thing which I'm trying to do is the subspace approach.\n\n0:27:45\tSPEAKER_01\n Stefan is working on spectral subtraction. So I picked up a few sort of trying to be...\n\n0:27:50\tSPEAKER_01\n We just wanted to have a few noise production, composition techniques and then pick some from that.\n\n0:27:56\tSPEAKER_04\n Yeah, I mean there's comments working on other than the other activity series. So they were just trying to cover a bunch of different things with this task and see what are the issues for each of them.\n\n0:28:08\tSPEAKER_01\n So one of the things that I tried, like I said, was to remove those zeros in the filter by doing some smoothing of the filter.\n\n0:28:16\tSPEAKER_01\n Like you estimate the HF square and then you do smoothing across the frequency so that those zeros get like flattened out and that doesn't seem to be improving by trying it on the first time.\n\n0:28:28\tSPEAKER_01\n So what I did was like I did this and then you applied in the one more, the same thing but with the smooth filter, second time. That seems to be working.\n\n0:28:38\tSPEAKER_01\n So that's what I got like 56.5% improvement on speech.car with that. And so the other thing what I tried was I used till the 10 frames of noise estimate but I used this channel 0 watt to drop the frames.\n\n0:28:52\tSPEAKER_01\n So I'm not still on estimating and that has taken the performance to like 67% in speech.car which is which like sort of shows that by using a proper watt you can just take it to further better levels.\n\n0:29:05\tSPEAKER_01\n So that's sort of like you know, best case performance. Yeah so far I've seen 67% and I haven't seen like 67% and using the channel 0 watt to estimate the noise also seems to be improving but I don't have the results for all the cases with that.\n\n0:29:22\tSPEAKER_01\n So I used channel 0 watt to estimate noise as a lesser drop frame which is like everywhere I use the channel 0 watt and that seems to be the best combination than using a few frames to estimate and then drop channel.\n\n0:29:35\tSPEAKER_04\n So I'm still a little confused is that channel zero information going to be accessible.\n\n0:29:42\tSPEAKER_01\n Now this is just to test whether we can really improve by using a better watt. So I mean so this is like the noise compensation is fixed but you make a better decision on the end points that's like seems to be.\n\n0:29:56\tSPEAKER_01\n So which means which means like by using this technical it just the way we can just take the performance by another 10% of better.\n\n0:30:06\tSPEAKER_01\n So that that was just the reason for doing that experiment and yeah but this all these things have to still try it on the TI digits which is like I'm just running and that seems to be not improving a lot on the TI digits.\n\n0:30:20\tSPEAKER_01\n So the other thing is like I'm doing all this stuff on the power spectrum so try this stuff on the Mel as well Mel and the magnitude and Mel magnitude and all those things but seems to be the power spectrum seems to be giving the best result.\n\n0:30:45\tSPEAKER_01\n So one of the reasons I thought like do the averaging after the filtering using the Mel filter bank that seems to be maybe helping whether than trying it on the Mel filter filter out goods.\n\n0:30:55\tSPEAKER_01\n Yeah that's the only thing is I could think of why it's giving improvement on the Mel and yeah so that's about the subspace stuff.\n\n0:31:15\tSPEAKER_01\n So it's like going parallely but not much of improvement I'm just have some skeleton ready need some work.\n\n0:31:33\tSPEAKER_02\n Yeah so I've been working still on the spectral subtraction so to remind you a little bit of what I did before is just to apply some spectral subtraction with an over estimation factor also to get an estimate of the noise spectrum and subtract this estimation of the noise spectrum from the signal spectrum but subtracting more when the SNR is low which is the technique that it's subtracting from the meaning.\n\n0:32:15\tSPEAKER_02\n So you over estimate the noise spectrum you multiplied no spectrum by a factor which depends on the SNR so above 20 dB it's one so you just subtract the noise and then it's generally what I use actually on linear function of the SNR which is bounded to like two or three when the SNR is below zero dB.\n\n0:32:42\tSPEAKER_02\n Doing just this either on the FFT bands or on the Mel bands doesn't yield any improvement.\n\n0:32:53\tSPEAKER_03\n What are you doing with negative?\n\n0:32:56\tSPEAKER_02\n There is also threshold of course because after subtraction you can have negative energies and so what I just do is to add to put a threshold first and then to add a small amount of noise which right now is speed shaped.\n\n0:33:21\tSPEAKER_02\n So it has the overall energy as the overall power spectrum of speech so with a bump around one key.\n\n0:33:31\tSPEAKER_06\n When you talk about there being something less than zero after subtracting the noise is that a particular frequency band?\n\n0:33:38\tSPEAKER_06\n Yes there can be frequency bands with zero energy. So you're adding some it has overall.\n\n0:33:51\tSPEAKER_02\n For each frequency I'm adding some noise but the amount of noise I add is not the same for all the frequency bands.\n\n0:34:02\tSPEAKER_02\n Right now I don't think if it makes sense to add something that's speed shaped because then you have silence portion but if some spectra are similar to the overall speech spectrum.\n\n0:34:14\tSPEAKER_02\n So this is something I can still work on.\n\n0:34:18\tSPEAKER_06\n What does that mean? I'm trying to understand what it means when you do the spectral subtraction and you get a negative.\n\n0:34:23\tSPEAKER_06\n That means that that means that the frequency range you subtracted more energy than there was actually.\n\n0:34:30\tSPEAKER_02\n You have an estimation of the noise spectrum but sometimes of course as the noise is not perfectly stationary.\n\n0:34:37\tSPEAKER_02\n Sometimes this estimation can be too small so you don't subtract enough but sometimes it can be too large also.\n\n0:34:45\tSPEAKER_02\n If the noise energy in this particular frequency band drops for some reason.\n\n0:34:54\tSPEAKER_06\n So in an ideal world if the noise were always the same then when you subtracted it the worst that you would get would be a zero.\n\n0:35:04\tSPEAKER_06\n I mean the lowest you would get would be a zero because if there was no other energy there you're just subtracting exactly the noise.\n\n0:35:10\tSPEAKER_04\n There's all sorts of deviations from ideal here.\n\n0:35:13\tSPEAKER_04\n For instance you're talking about the signal noise at a particular point even if something is sort of stationary and it's third terms of statistics there's no guarantee that any particular instantiation or piece of it is exactly a particular number or bounded by a particular range.\n\n0:35:32\tSPEAKER_04\n So you're figuring out from some chunk of the signal what you think the noise is then you're subtracting that from another chunk.\n\n0:35:42\tSPEAKER_04\n And there's absolutely no reason to think that you'd know that it wouldn't be negative in some places.\n\n0:35:47\tSPEAKER_04\n On the other hand that just means that some sense you've made a mistake because you certainly have subtracted a bigger number than is due to the noise.\n\n0:35:56\tSPEAKER_04\n Also we speak where all this stuff comes from is from an assumption that signal noise are uncorrelated and that certainly makes sense in statistical interpretation that over all possible realizations that they're uncorrelated.\n\n0:36:11\tSPEAKER_04\n So that's why we're talking about the signal noise that is there uncorrelated or assuming your goodicity that across time it's uncorrelated.\n\n0:36:21\tSPEAKER_04\n But if you just look at quarter second and you cross multiply the two things you could very well end up with something that sums to something that's not zero.\n\n0:36:33\tSPEAKER_04\n So if you do signals could have some relation to one another and so there's all sorts of deviations from ideal in this and given all that you can definitely end up with something that's negative.\n\n0:36:45\tSPEAKER_04\n But if down the road you're making use of something as if it is a power spectrum then it can be bad to have something negative.\n\n0:36:55\tSPEAKER_04\n The other thing I wonder about actually is what if you left it negative what happens? I mean because the log are you taking the log before you add them up to the mill?\n\n0:37:08\tSPEAKER_04\n No, after.\n\n0:37:09\tSPEAKER_04\n Right. So the thing is I wonder how if you put your thresholds after that I wonder how often you would end up with negative values.\n\n0:37:19\tSPEAKER_01\n Would you end up reducing the neighboring frequency when the average right when you add the negative to the positive value which is the true estimate?\n\n0:37:28\tSPEAKER_04\n Yeah.\n\n0:37:30\tSPEAKER_04\n But nonetheless you know these are it's another kind of smoothing right that you're doing.\n\n0:37:36\tSPEAKER_04\n So you've done your best shot at figuring out what the noise should be and then you subtract it off and then after that instead of instead of leaving it as is and adding things adding up to neighbors you artificially push it up which is you know it's there's no particular reason that that's the right thing to do either right.\n\n0:37:58\tSPEAKER_04\n So in fact what you'd be doing is saying well we're we're we're going to definitely diminish the effect of this frequency and this is a little frequency bin in the in the overall mill summation.\n\n0:38:15\tSPEAKER_04\n This is the thought.\n\n0:38:16\tSPEAKER_06\n I don't know if you're going to get a negative number you don't do the subtraction for that.\n\n0:38:22\tSPEAKER_06\n Yeah, although almost the opposite right.\n\n0:38:29\tSPEAKER_06\n Instead of living it negative you don't do it.\n\n0:38:32\tSPEAKER_06\n If you're subtracting is going to result in a negative number you you don't do subtraction.\n\n0:38:39\tSPEAKER_04\n Yeah, but that means that in a situation where you thought that the bin was almost entirely noise you left it.\n\n0:38:45\tSPEAKER_03\n I'm just saying that's like yeah.\n\n0:38:52\tSPEAKER_02\n And some people also it's a negative value they recompute it using interpolation from the adjacent.\n\n0:39:00\tSPEAKER_02\n Yeah, from frequency bin things that you can do.\n\n0:39:03\tSPEAKER_04\n People can also reflect it back up and essentially do a four-way rectification instead of a set of half-wave.\n\n0:39:10\tSPEAKER_04\n But it's just a thought that that might be something to try.\n\n0:39:15\tSPEAKER_02\n Yeah, well actually I tried something else based on this.\n\n0:39:21\tSPEAKER_02\n It's to put some smoothing because it seems to help.\n\n0:39:26\tSPEAKER_02\n It seems to help the winner filtering.\n\n0:39:31\tSPEAKER_02\n So what I did is some kind of non-linear smoothing actually have a recursion that computes.\n\n0:39:41\tSPEAKER_02\n Yeah, let me go back a little bit.\n\n0:39:43\tSPEAKER_02\n Actually when you do spectral subtraction you can find this equivalent in the spectral domain you can compute.\n\n0:39:54\tSPEAKER_02\n You can see that the spectral subtraction is a filter and the gain of this filter is the signal energy minus what you subtract divided by the signal energy.\n\n0:40:10\tSPEAKER_02\n And this is the gain that varies over time.\n\n0:40:13\tSPEAKER_02\n Of course depending on the noise spectrum and on the speech spectrum.\n\n0:40:20\tSPEAKER_02\n And what happened actually is that during low SNR values the gain is close to zero but it varies a lot.\n\n0:40:35\tSPEAKER_02\n And this is the cause of musical noise and all these.\n\n0:40:40\tSPEAKER_02\n The fact that we go below zero on one frame and then you can have an energy that's above zero.\n\n0:40:48\tSPEAKER_02\n So the smoothing is, I did a smoothing actually on this gain trajectory but the smoothing is low in error in the sense that I try to not smooth if the gain is I.\n\n0:41:02\tSPEAKER_02\n Because in this case we know that the estimate of the gain is correct because we are not close to zero.\n\n0:41:12\tSPEAKER_02\n And to do more smoothing if the gain is low.\n\n0:41:22\tSPEAKER_02\n Yeah so basically that's this idea and it seems to give pretty good results.\n\n0:41:29\tSPEAKER_02\n Although I just tested on Italian and Finnish.\n\n0:41:34\tSPEAKER_02\n And on Italian it seems my result seems to be a little bit better than the winner filtering.\n\n0:41:41\tSPEAKER_01\n Yeah the one you showed yesterday.\n\n0:41:44\tSPEAKER_02\n I don't know if you have these improvements, the 10 improvements for Italian finishes.\n\n0:41:49\tSPEAKER_01\n No I don't have any.\n\n0:41:50\tSPEAKER_01\n I just just have the final number here.\n\n0:41:52\tSPEAKER_04\n So these numbers he was given before with the 4.3 and the 10 by 1.\n\n0:41:55\tSPEAKER_04\n And so those were Italian right?\n\n0:41:58\tSPEAKER_01\n Yeah so no I actually didn't give the number which is the final one which is after two stages of winner filtering.\n\n0:42:04\tSPEAKER_01\n I mean that was I just told like the overall improvement is like 56.5.\n\n0:42:08\tSPEAKER_01\n So his number is still better than what I got in that two stages of winner filtering.\n\n0:42:13\tNone\n Right.\n\n0:42:13\tSPEAKER_02\n On Italian but on Finnish it's a little bit worse apparently.\n\n0:42:19\tSPEAKER_04\n But you have numbers in terms of water rates and...\n\n0:42:21\tSPEAKER_04\n Yeah.\n\n0:42:22\tSPEAKER_02\n That's what I just said.\n\n0:42:23\tSPEAKER_02\n You have some sensor reference.\n\n0:42:24\tSPEAKER_02\n 3.8.\n\n0:42:25\tSPEAKER_03\n Oh okay.\n\n0:42:28\tSPEAKER_02\n And then 9.1.\n\n0:42:34\tSPEAKER_02\n And finally 16.5.\n\n0:42:39\tSPEAKER_04\n And this is spectrosotraction plus what?\n\n0:42:43\tSPEAKER_02\n Blood, plus non-linear smooth thing.\n\n0:42:45\tSPEAKER_02\n Well it's the system.\n\n0:42:47\tSPEAKER_02\n It's exactly the same system.\n\n0:42:49\tSPEAKER_02\n Oh my normalization.\n\n0:42:50\tSPEAKER_02\n But LDA.\n\n0:42:51\tSPEAKER_02\n Yeah.\n\n0:42:52\tSPEAKER_02\n But instead of the both stage winner filtering it's this smooth spectrosotraction.\n\n0:43:00\tSPEAKER_06\n Right. What is it? The France telecom system is it?\n\n0:43:04\tSPEAKER_06\n Did they use spectrosotraction or when you're filtering?\n\n0:43:07\tSPEAKER_02\n They use spectrosotraction right?\n\n0:43:09\tSPEAKER_02\n Forward?\n\n0:43:10\tSPEAKER_02\n French relic.\n\n0:43:11\tSPEAKER_02\n It's a winner filtering.\n\n0:43:12\tSPEAKER_01\n Oh it's a winner filtering.\n\n0:43:13\tSPEAKER_02\n Well it's some kind of winner filtering.\n\n0:43:15\tSPEAKER_01\n It's not exactly winner filtering but some variant of winner filtering.\n\n0:43:19\tSPEAKER_04\n Yeah.\n\n0:43:20\tSPEAKER_04\n Plus I guess they have some sort of capstone normalization.\n\n0:43:23\tSPEAKER_04\n They have like...\n\n0:43:24\tSPEAKER_01\n Yeah.\n\n0:43:25\tSPEAKER_01\n They're just noise compensation technique is a variant of winner filtering.\n\n0:43:28\tSPEAKER_01\n Because they do some smoothing techniques on the final filter.\n\n0:43:33\tSPEAKER_01\n They actually do the filtering in the time domain.\n\n0:43:36\tSPEAKER_01\n So they take this HF square back taking an inverse Fourier transform.\n\n0:43:40\tSPEAKER_01\n And they convolve that time domain signal with that.\n\n0:43:43\tSPEAKER_01\n And they do some smoothing on that final filter in pulse response.\n\n0:43:48\tSPEAKER_02\n But they also have to do different smoothing.\n\n0:43:51\tSPEAKER_02\n One in the time domain and one in the frequency domain by just taking the first.\n\n0:43:57\tSPEAKER_02\n Coefficient of the impulse response.\n\n0:44:00\tSPEAKER_02\n So basically similar...\n\n0:44:03\tSPEAKER_02\n I mean what you did it's...\n\n0:44:05\tSPEAKER_02\n It's similar in the smoothing.\n\n0:44:06\tSPEAKER_02\n They also have to kind of smoothing.\n\n0:44:07\tSPEAKER_02\n One in the time domain and...\n\n0:44:09\tSPEAKER_02\n Yeah.\n\n0:44:10\tSPEAKER_02\n One in the frequency domain.\n\n0:44:12\tSPEAKER_06\n Does the smoothing in the time domain help?\n\n0:44:14\tSPEAKER_06\n Well do you get this musical noise stuff with winner filtering?\n\n0:44:17\tSPEAKER_06\n Or is that only with the spectrosotraction?\n\n0:44:19\tSPEAKER_06\n Oh you get it with...\n\n0:44:20\tSPEAKER_01\n Yeah.\n\n0:44:21\tSPEAKER_06\n Winner filtering also?\n\n0:44:22\tSPEAKER_06\n Is the smoothing in the time domain help with that?\n\n0:44:25\tSPEAKER_01\n No, you still end up with zeros in the spectrum sometimes.\n\n0:44:30\tSPEAKER_04\n I mean it's not clear that these musical noises hurt us in recognition.\n\n0:44:33\tSPEAKER_04\n We don't know if they sound bad.\n\n0:44:36\tSPEAKER_03\n Yeah.\n\n0:44:37\tSPEAKER_03\n We're not listening to it usually.\n\n0:44:39\tSPEAKER_02\n Actually the smoothing that I did, the air reduced the music and noise.\n\n0:44:46\tSPEAKER_02\n Well I cannot...\n\n0:44:48\tSPEAKER_02\n You cannot hear...\n\n0:44:49\tSPEAKER_02\n Well actually what I did not say is that this is not in the FFT bands.\n\n0:44:53\tSPEAKER_02\n This is in the male frequency bands.\n\n0:44:58\tSPEAKER_02\n So it could be seen as a smoothing in the frequency domain because I use the male bands in addition.\n\n0:45:05\tSPEAKER_02\n And then the other phase of smoothing in the time domain.\n\n0:45:10\tSPEAKER_02\n But when you look at the spectrum, if you don't have any smoothing, you clearly see like in silence portions and at the beginning and end of speech, you see spots of high energy randomly distributed over the spectrum.\n\n0:45:27\tSPEAKER_02\n That's the musical.\n\n0:45:29\tSPEAKER_02\n Which is musical noisy.\n\n0:45:31\tSPEAKER_02\n If you listen to it, if you do this in the FFT bands, then you have spots of energy randomly distributed.\n\n0:45:38\tSPEAKER_02\n And if you recentize, this spot sounds as like sounds.\n\n0:45:45\tSPEAKER_04\n None of these systems, by the way, you both are working with our system that does not have the neural net.\n\n0:45:56\tSPEAKER_04\n Right?\n\n0:45:57\tSPEAKER_05\n Yeah.\n\n0:45:58\tSPEAKER_03\n So one would hope.\n\n0:46:00\tSPEAKER_03\n I assume we have the neural net part of it with improved things further as they did before.\n\n0:46:06\tSPEAKER_02\n Yeah.\n\n0:46:09\tSPEAKER_02\n Although if we look at the result from the proposals, one of the reasons the system with the neural net was more than well, around 5% better, is that it was much better on highly mismatched condition.\n\n0:46:28\tSPEAKER_02\n I'm thinking, for instance, on the TIDGITs trained on clean speech and tested noisy speech.\n\n0:46:35\tSPEAKER_02\n For this case, the system with the neural net was much better.\n\n0:46:39\tSPEAKER_02\n But not much on the other cases.\n\n0:46:42\tSPEAKER_02\n And if we have no spectral subtraction or winner filtering, the system is, we thought neural net work is much better than before, even in these cases of mismatch.\n\n0:46:58\tSPEAKER_02\n So maybe the neural net will help less.\n\n0:47:02\tSPEAKER_02\n Maybe.\n\n0:47:03\tSPEAKER_06\n Could you do any neural net with spectral subtraction?\n\n0:47:07\tSPEAKER_04\n Yeah, could do nonlinear spectral subtraction.\n\n0:47:09\tSPEAKER_04\n But I don't know if it, I mean, just figure out what your targets are.\n\n0:47:14\tSPEAKER_06\n Yeah, I was thinking if you had a clean version of the signal one.\n\n0:47:18\tSPEAKER_06\n A noisy version.\n\n0:47:20\tSPEAKER_06\n Right.\n\n0:47:21\tSPEAKER_06\n And targets for the, you know, whatever frequency.\n\n0:47:24\tSPEAKER_04\n Yeah, well, that's not so much spectral subtraction then.\n\n0:47:27\tSPEAKER_04\n But anyway, yeah, people, people do that.\n\n0:47:30\tSPEAKER_04\n Yeah, in fact, we had visitors here who did that, I think, when you were, a little bit way back when people had been lots of experimentation over the years with training neural nets.\n\n0:47:41\tSPEAKER_04\n It's not a bad thing to do.\n\n0:47:42\tSPEAKER_04\n It's another approach.\n\n0:47:43\tSPEAKER_04\n I mean, it's, it, the objection everyone always raises, which has some truth to it, is that it's good for mapping from a particular noise to clean, then you get a different noise.\n\n0:47:54\tSPEAKER_04\n And the experiments we saw that visitors did here showed that there was at least some gentleness to the degradation when you switched to different noises.\n\n0:48:08\tSPEAKER_04\n It did seem to help.\n\n0:48:09\tSPEAKER_04\n So that, you're right, that's another way to go.\n\n0:48:11\tSPEAKER_06\n You did care on, I mean, for good cases where it, it, it, it, stuff that it was trained on.\n\n0:48:17\tSPEAKER_06\n Did it do pretty well?\n\n0:48:18\tSPEAKER_06\n Oh, yeah, it did very well.\n\n0:48:20\tSPEAKER_04\n Yeah.\n\n0:48:21\tSPEAKER_04\n But to some extent, that's kind of what we're doing.\n\n0:48:28\tSPEAKER_04\n I mean, we're not doing exactly that.\n\n0:48:30\tSPEAKER_04\n We're not trying to generate good examples.\n\n0:48:33\tSPEAKER_04\n But by trying to do the best classifier you possibly can for these little fanatic categories.\n\n0:48:39\tSPEAKER_04\n It's sort of built in.\n\n0:48:40\tSPEAKER_04\n It's, yeah, it's kind of built into that.\n\n0:48:42\tSPEAKER_04\n And that's why we have found that it, it does help.\n\n0:48:46\tSPEAKER_04\n So, yeah, I mean, we'll just have to try it.\n\n0:48:49\tSPEAKER_04\n But I would, I would, I would imagine that it will help some.\n\n0:48:52\tSPEAKER_04\n I mean, it, this have to see whether it helps more or less the same.\n\n0:48:57\tSPEAKER_04\n But I would imagine it would help some.\n\n0:48:59\tSPEAKER_04\n So I didn't even, all of this, I was just confirming that all of this was with the simplices.\n\n0:49:02\tSPEAKER_04\n Yeah.\n\n0:49:03\tSPEAKER_04\n Yeah.\n\n0:49:04\tSPEAKER_02\n So this is the, well, actually this was kind of the first try with this spectral subtraction plus smoothing.\n\n0:49:15\tSPEAKER_02\n And I was kind of excited by the result.\n\n0:49:19\tSPEAKER_02\n Then I started to optimize the different parameters.\n\n0:49:24\tSPEAKER_02\n And the first thing I tried to optimize is the time constant of the smoothing.\n\n0:49:32\tSPEAKER_02\n And it seems that the one that I choose for the first experiment was the optimal one.\n\n0:49:40\tSPEAKER_02\n It's amazing how often I have.\n\n0:49:45\tSPEAKER_02\n This is the first thing.\n\n0:49:48\tSPEAKER_02\n Yeah, another thing that I, it's important to mention is that this as this as some additional latency, because when I do the smoothing, it's a recursion that estimates the means of the gain curve.\n\n0:50:10\tSPEAKER_02\n And this is a filter that has some latency.\n\n0:50:15\tSPEAKER_02\n And I noticed that it's better if we take into account this latency.\n\n0:50:19\tSPEAKER_02\n So instead of using the current estimated mean to subtract the current frame, it's better to use an estimate that's somewhere in the future.\n\n0:50:32\tSPEAKER_06\n And that's what causes the latency.\n\n0:50:35\tSPEAKER_01\n Yeah.\n\n0:50:36\tSPEAKER_01\n I mean, the mean is computed based on some frames in the future also.\n\n0:50:40\tSPEAKER_02\n No.\n\n0:50:41\tSPEAKER_02\n It's the recursion.\n\n0:50:42\tSPEAKER_02\n So it's the standard recursion, right?\n\n0:50:46\tSPEAKER_02\n And the latency of this recursion is around 50 milliseconds.\n\n0:50:50\tSPEAKER_03\n One five.\n\n0:50:51\tSPEAKER_03\n It's the one five five zero five zero.\n\n0:50:53\tSPEAKER_03\n Five zero.\n\n0:50:54\tSPEAKER_03\n Yeah.\n\n0:50:55\tSPEAKER_01\n Sorry, why is that delay coming like you estimate the mean?\n\n0:51:01\tSPEAKER_02\n Yeah, the mean estimation has some delay, right?\n\n0:51:05\tSPEAKER_02\n I mean, the filter has that estimated the mean as a distance.\n\n0:51:08\tSPEAKER_01\n Okay, so it's like it looks into the future also.\n\n0:51:10\tSPEAKER_04\n Yeah, okay.\n\n0:51:11\tSPEAKER_04\n What if you just look into the past?\n\n0:51:13\tSPEAKER_02\n It's not as good.\n\n0:51:15\tSPEAKER_02\n It's not bad.\n\n0:51:16\tSPEAKER_02\n How much?\n\n0:51:17\tSPEAKER_02\n It helps a lot of the baseline, but how much?\n\n0:51:21\tSPEAKER_02\n It's around 3% relative.\n\n0:51:26\tSPEAKER_02\n Where's?\n\n0:51:29\tSPEAKER_02\n Yeah.\n\n0:51:30\tSPEAKER_04\n So depending on all this stuff comes out, we may or may not be able to add any latency.\n\n0:51:43\tSPEAKER_02\n Yeah, but yeah.\n\n0:51:46\tSPEAKER_02\n Sorry, it's a different way.\n\n0:51:47\tSPEAKER_02\n Yeah, it's three percent.\n\n0:51:54\tSPEAKER_02\n Yeah, but I don't think we have to worry too much on that right now.\n\n0:52:02\tSPEAKER_04\n Yeah, I mean, I think the only thing is that I would worry about little, because if we completely ignore latency, then we discover that we really have to do something about it.\n\n0:52:14\tSPEAKER_04\n We're going to be finding ourselves in the bind.\n\n0:52:17\tSPEAKER_04\n So, you know, maybe you could make it 25.\n\n0:52:21\tSPEAKER_04\n Yeah, you know what I mean?\n\n0:52:23\tSPEAKER_04\n Yeah, just be a little conservative, because we may end up with this crunch where we have to cut the latency in half or something.\n\n0:52:31\tSPEAKER_02\n So, yeah, there are other things in the algorithm that I didn't play a lot yet,\n\n0:52:39\tSPEAKER_06\n which, sorry, quick question just about the latency thing. If there's another part of the system that causes the latency of 100 milliseconds, is this an additive thing or is yours hidden in that?\n\n0:52:50\tSPEAKER_06\n No, it's added.\n\n0:52:52\tSPEAKER_06\n It's added.\n\n0:52:54\tSPEAKER_01\n We can do something in parallel also.\n\n0:52:57\tSPEAKER_01\n In some cases, like if you wanted to do a voice activity detection, and you can do that in parallel with some other filtering you can do.\n\n0:53:06\tSPEAKER_01\n So, you can make a decision on that voice activity detection, and then you decide whether you want to filter or not.\n\n0:53:11\tSPEAKER_01\n But by then, you already have sufficient samples to do the filtering.\n\n0:53:15\tSPEAKER_06\n So, sometimes you can do it in.\n\n0:53:18\tSPEAKER_06\n I mean, couldn't you just also, I mean, if you know that the largest latency in the system is 200 milliseconds, couldn't you just buffer up that number of frames, and then everything uses that buffer in that way.\n\n0:53:30\tSPEAKER_06\n It's not additive.\n\n0:53:32\tSPEAKER_04\n One fact, everything is sent over and buffers kisses.\n\n0:53:36\tSPEAKER_04\n That TCP buffer, something.\n\n0:53:39\tSPEAKER_01\n I mean, the data, the superframe or something?\n\n0:53:42\tSPEAKER_01\n Yeah.\n\n0:53:43\tSPEAKER_01\n Yeah, but that has a variable latency, because the last frame doesn't have any latency, and the first frame has a 20 frame latency.\n\n0:53:49\tSPEAKER_01\n So, can't rely on that latency all the time.\n\n0:53:52\tSPEAKER_05\n Yeah.\n\n0:53:54\tSPEAKER_01\n Because, I mean, the transmission over the air interface is like a buffer, 20 frames.\n\n0:53:59\tSPEAKER_01\n Yeah.\n\n0:54:00\tSPEAKER_01\n So, but only thing is that the first frame in that 24 frame buffer has a 24 frame latency, and the last frame doesn't have any latency, because it just goes as...\n\n0:54:09\tSPEAKER_06\n Yeah, I wasn't thinking of that one in particular, but more of, you know, if there is some part of your system that has the buffer 20 frames, can't be other parts of the system draw out of that buffer and therefore not add to the latency.\n\n0:54:21\tSPEAKER_04\n Yeah, and that's sort of one of the, all of that sort of stuff is things they're debating in their standards committee.\n\n0:54:29\tSPEAKER_05\n Yeah, so, there is...\n\n0:54:33\tSPEAKER_02\n These parameters that I still have to look at, like, I played a little bit with this overestimation factor, but I still have to look more at this.\n\n0:54:46\tSPEAKER_02\n At the level of noise I add after, I know that adding noise at the system just using spellcrime subtraction without smoothing, but I don't know right now if it's still important or not, and if the level I choose before is still the right one, same thing for the shape of the noise.\n\n0:55:11\tSPEAKER_02\n And, you know, the level I choose before is still the right one, same thing for the shape of the noise.\n\n0:55:20\tSPEAKER_02\n Maybe it would be better to add just white noise instead of speech-shaped noise.\n\n0:55:24\tSPEAKER_04\n That'd be more like the aroust, I think, in a sense.\n\n0:55:28\tSPEAKER_02\n Yeah.\n\n0:55:31\tSPEAKER_02\n And another thing is to...\n\n0:55:34\tSPEAKER_02\n Yeah, for this I just use as noise estimates, the mean spectrum of the first 20 frames of each utterance.\n\n0:55:43\tSPEAKER_02\n I don't remember for this experiment, but did you use 10 frames?\n\n0:55:46\tSPEAKER_01\n I used 10 frames.\n\n0:55:48\tSPEAKER_01\n Yeah, because...\n\n0:55:49\tSPEAKER_01\n I mean, the reason was, like, in TI, did you say, I don't have a lot of 10 frames most of the time?\n\n0:55:54\tSPEAKER_02\n But so, what's this result you told me about the fact that if you use more than 10 frames, you can...\n\n0:55:59\tSPEAKER_01\n Oh, that's using the channel 0.\n\n0:56:02\tSPEAKER_01\n I use the channel 0 to estimate the noise.\n\n0:56:05\tSPEAKER_02\n But this is 10 frames plus...\n\n0:56:07\tSPEAKER_02\n channel 0.\n\n0:56:09\tSPEAKER_02\n Channel...\n\n0:56:10\tSPEAKER_02\n I know, these results...\n\n0:56:12\tSPEAKER_02\n Oh, two stage, winner filtering is 10 frames, but possibly more.\n\n0:56:16\tSPEAKER_02\n I mean, if channel 1, VAD gives you...\n\n0:56:20\tSPEAKER_02\n Yeah.\n\n0:56:21\tSPEAKER_02\n Okay.\n\n0:56:22\tSPEAKER_02\n Yeah, but in this experiment, I didn't use any VAD.\n\n0:56:25\tSPEAKER_02\n I just used the 21st frame to estimate the noise.\n\n0:56:28\tSPEAKER_02\n So I expected it to be a little bit better if I use more frames.\n\n0:56:34\tSPEAKER_02\n Okay, that's it for spectroscopy.\n\n0:56:39\tSPEAKER_02\n The second thing I was working on is to try to look at noise estimation and using some technique that doesn't need voice activity detection.\n\n0:56:52\tSPEAKER_02\n And for this, I simply used some code that I add from...\n\n0:57:02\tSPEAKER_02\n I add from Belgium, which is technique that takes a bunch of frames.\n\n0:57:10\tSPEAKER_02\n And for each frequency bands of this frame takes a look at the minima of the energy.\n\n0:57:21\tSPEAKER_02\n And then average this minima and take this as an energy estimate of the noise for this particular frequency band.\n\n0:57:29\tSPEAKER_02\n And there is something more to this, actually, what is done is that these minima are computed based on high-resolution spectra.\n\n0:57:47\tSPEAKER_02\n So I compute a FFT based on the long single frame, which is 64 milliseconds.\n\n0:57:55\tSPEAKER_06\n So you have one minimum per each frequency.\n\n0:57:59\tSPEAKER_02\n What I do actually is to take a bunch of...\n\n0:58:03\tSPEAKER_02\n to take a tile on the spectrogram and this tile is 500 milliseconds long and 200 hertz wide.\n\n0:58:12\tSPEAKER_02\n And this tile...\n\n0:58:16\tSPEAKER_02\n In this tile appears like the harmonics if you have a voice sound, because it's the FFT bands.\n\n0:58:22\tSPEAKER_02\n And when you take the minima of this tile, when you don't have speech, this minima will give you some noise level estimate.\n\n0:58:33\tSPEAKER_02\n If you have voiced speech, this minima will still give you some noise estimate because the minima are between the harmonics.\n\n0:58:41\tSPEAKER_02\n And if you have an or kind of speech sound, then it's not the case.\n\n0:58:45\tSPEAKER_02\n But if the time frame is long enough, like 500 milliseconds seems to be long enough, you still have portions which are very close...\n\n0:58:56\tSPEAKER_02\n which minima are very close to the noise energy.\n\n0:58:59\tSPEAKER_04\n I'm confused. You said 500 milliseconds, but you said 64 milliseconds.\n\n0:59:03\tSPEAKER_04\n What is that?\n\n0:59:04\tSPEAKER_02\n 64 milliseconds is to compute the FFT bands, the FFT.\n\n0:59:10\tSPEAKER_02\n Actually, it's better to use 64 milliseconds because if you use 30 milliseconds, then because of this shortwindowing and at low pitch sounds, the harmonics are not correctly separated.\n\n0:59:29\tSPEAKER_02\n So if you take this minima, they will overestimate the noise a lot.\n\n0:59:36\tSPEAKER_04\n So you take 64 milliseconds and then you average them over 500 or what do you do over 500?\n\n0:59:43\tSPEAKER_02\n I take a bunch of these 64 milliseconds frame to cover 500 milliseconds.\n\n0:59:50\tSPEAKER_02\n And then I look for the minima on a bunch of 50 frames.\n\n0:59:58\tSPEAKER_02\n So the interest of this is that with this technique, you can estimate some reasonable noise spectra with only 500 milliseconds of signal.\n\n1:00:10\tSPEAKER_02\n So if the noise varies a lot, you can track better track the noise, which is not the case if you rely on a voice activity detector.\n\n1:00:21\tSPEAKER_02\n So even if there are no speech poses, you can track the noise level.\n\n1:00:26\tSPEAKER_02\n The only requirement is that you must have in this 500 milliseconds segment, you must have voiced sound at least.\n\n1:00:33\tSPEAKER_02\n Because this will add you to track the noise level.\n\n1:00:42\tSPEAKER_02\n So what I did is just to simply replace the VAD based noise estimate by this estimate.\n\n1:00:52\tSPEAKER_02\n First on speech.car. Well, only on speech.car actually.\n\n1:00:56\tSPEAKER_02\n And it's slightly worse, like one percent relative compared to the VAD based estimates.\n\n1:01:10\tSPEAKER_02\n I think the reason why it's not better is that speech.car. noise is our stationary.\n\n1:01:19\tSPEAKER_02\n There is no need to have something that's active. Well, there are mainly stationary.\n\n1:01:27\tSPEAKER_02\n But I expect maybe some improvement on TI digits because in this case the noises are sometimes very variable.\n\n1:01:35\tSPEAKER_02\n So I have to test it.\n\n1:01:39\tSPEAKER_04\n But are you comparing with something a little confused again?\n\n1:01:45\tSPEAKER_02\n When you compare it with the VAD based. It's the French Silicon based spectra winner filtering and VAD.\n\n1:01:55\tSPEAKER_02\n So it's their system, but just a replace. There are noise estimate by this one.\n\n1:02:03\tSPEAKER_02\n Oh, you're not doing this with our system. I'm not. No.\n\n1:02:09\tSPEAKER_02\n Yeah, it's our system, but we're just the winner filtering from their system.\n\n1:02:19\tSPEAKER_02\n Actually, the best system that we still have is our system, but with their noise compensation scheme.\n\n1:02:28\tSPEAKER_02\n So I'm trying to improve on this and by replacing their noise estimate by something that might be better.\n\n1:02:37\tSPEAKER_04\n Okay, but the spectra subtraction scheme that you reported on also requires a noise estimate.\n\n1:02:45\tSPEAKER_02\n But could I try this for that?\n\n1:02:49\tSPEAKER_02\n No, because I did this in parallel. I say what's working on it.\n\n1:02:55\tSPEAKER_02\n For sure, I can try it also.\n\n1:02:59\tSPEAKER_01\n I think that new noise estimate technique on this winner filtering what I'm trying. I have some experiments running around other results.\n\n1:03:07\tSPEAKER_01\n So I don't estimate the noise from the time France, but you see a system.\n\n1:03:17\tSPEAKER_02\n Yeah, I am also implemented spectral widening idea, which is in the Ericsson proposal.\n\n1:03:29\tSPEAKER_02\n The idea is just to flatten the log spectrum.\n\n1:03:41\tSPEAKER_02\n And to flatten it more if the probability of silence is higher.\n\n1:03:49\tSPEAKER_02\n So in this way, you can also reduce so much reduce the musical noise.\n\n1:03:53\tSPEAKER_02\n And you reduce the variability if you have different noise shapes.\n\n1:03:59\tSPEAKER_02\n Because the spectrum becomes more flat in the silence portions.\n\n1:04:07\tSPEAKER_02\n Yeah, with this no improvement, but there are a lot of parameters that we can play with.\n\n1:04:17\tSPEAKER_02\n And actually, this could be seen as a soft version of the frame dropping.\n\n1:04:23\tSPEAKER_02\n Because you could just put a threshold and say that below the threshold, I will flat on completely flat on the spectrum.\n\n1:04:33\tSPEAKER_02\n And above this threshold, give the same spectrum.\n\n1:04:38\tSPEAKER_02\n So it would be like frame dropping because during the silence portions, which are below the threshold of voice activity, probability, you would have some kind of dummy frame, which is perfectly flat spectrum.\n\n1:04:53\tSPEAKER_02\n And this widening is something that's more soft because you widen, you just have a function.\n\n1:05:04\tSPEAKER_02\n The widening is a function of the speech probability, so it's not a hard decision.\n\n1:05:12\tSPEAKER_02\n So I think maybe it can be used together with frame dropping and we are not sure about the speech of silence.\n\n1:05:23\tSPEAKER_04\n I mean, in J. Rasta, we were essentially adding in white noise, depending on our estimate of the noise, when the over-awesome in the noise.\n\n1:05:37\tSPEAKER_04\n I think it never occurred to us to use a probability in there.\n\n1:05:43\tSPEAKER_04\n You can imagine that that made use of where the amount that you added in was a function of the probability of it being speech or noise.\n\n1:05:59\tSPEAKER_02\n Yeah, we're at noise a constant that just depending on the noise spectrum.\n\n1:06:14\tSPEAKER_04\n Because that brings in sort of powers of classifiers that we don't really have in the other estimates, so it could be interesting.\n\n1:06:26\tSPEAKER_04\n What point does the system stop recording?\n\n1:06:30\tSPEAKER_04\n How much?\n\n1:06:32\tSPEAKER_06\n It'll be a little long.\n\n1:06:35\tSPEAKER_06\n I just ran out of this space.\n\n1:06:40\tSPEAKER_06\n I think we're okay.\n\n1:06:46\tSPEAKER_02\n Yeah, so with this technique, there are some... I just did something exactly the same as the direction proposal, but the probability of speech is not computed the same way.\n\n1:07:03\tSPEAKER_02\n I think for a lot of things, actually, a good speech probability is important. For frame-dropping, you can improve from 10%.\n\n1:07:17\tSPEAKER_02\n As a news show, if you use the channel zero speech probabilities, for this, it might add.\n\n1:07:30\tSPEAKER_02\n So, yeah, the next thing I started to do is to try to develop a better voice activity detector.\n\n1:07:44\tSPEAKER_02\n For this, I think we can maybe try to train the neural network for voice activity detection on all the data that we have, including all these speech data.\n\n1:08:00\tSPEAKER_02\n So, I'm starting to obtain alignment on these databases. The way I do that is that I just use the SDK system, but I train only on the closed-talking microphone, and then I obtain the Viterbi alignment of the training utterances.\n\n1:08:21\tSPEAKER_02\n It seems to be... Actually, what I observe is that for Italian, it doesn't seem... No, it doesn't seem to be a problem.\n\n1:08:31\tSPEAKER_01\n No, it doesn't seem to be a problem.\n\n1:08:34\tSPEAKER_02\n When you enter the frame-dropping, right? Yeah, but actually, the VAD was trained on Italians. The current VAD that we have was trained on the spine-right, the attitudes with noise and length.\n\n1:08:55\tSPEAKER_02\n It seems to work on Italian, but not on the Finnish and Spanish data. So, maybe one reason is that Finnish and Spanish noise are different.\n\n1:09:07\tSPEAKER_02\n Actually, we listen to some of the utterances, and sometimes for Finnish, there is music in the recordings and strange things.\n\n1:09:18\tSPEAKER_02\n Yeah, so the idea was to train on all the databases and obtain an alignment to train on these databases.\n\n1:09:27\tSPEAKER_02\n Also, to try different kinds of features, as input to the VAD network, we came up with a bunch of features that we want to try.\n\n1:09:40\tSPEAKER_02\n Like the spec-roslow, the degree of voicing with the features that we started to develop with Kermann, with the correlation between bands, and then different kinds of features.\n\n1:10:01\tSPEAKER_02\n Energy, of course.\n\n1:10:13\tSPEAKER_04\n Okay, well, Hans Kuntel will be here next week, so I think he'll be interested in all of these things.\n\n1:10:31\tSPEAKER_04\n Transcript L-209, 4-6-28-893020, 4-22-08-0952, 5-075-121056, 9-37105-2768, 316-727-5311, 7-329-7204-2, 7-646-7011, 5-8152-268.\n\n1:11:08\tSPEAKER_06\n Transcript L-294, 6-02459-228, 05827-34, scratch that, 3746, 7991-6007-1418, 6-6-717-449, 094019-6213, 6-059-78-2606, 8-613-296973, 8-556-71576, 6.\n\n1:11:48\tSPEAKER_00\n Transcript L-281-364-827-3611, 5-364-549408, 1-369-5408, 4-232-35773-8, 1-996-6488-2402, 153-393-89, 9-365-78060, 6-8915-07935.\n\n1:12:26\tSPEAKER_01\n Transcript L-285, 7269-4416, 07604-5454, 1-884-385-387-09, 0535-393-266, 4-909-909109, 6-713-05271-236, 7-832-96, 3-385, 4-757-1276-4975.\n\n1:13:02\tSPEAKER_02\n Transcript L-286, 3-7545146-9, 3-5453-5309, 6-85-2, 5-8-2143-44, 8-265-5808-1, 5-396-1055338, 5-01-195-910, 5-343-117-859, 6-050-1187-391.\n\n", "summary": [{"summary_text": "Hans Gunter will be here for about three weeks. He's going to look in on everything they're doing and give them his thoughts. Dave has been here for a year or six months. Speaker and Dave haven't met for a couple of weeks. They didn't meet last week morning, but they had some new results after walking everybody."}]}