{"filename": "./data/Bro012.txt", "transcript": "0:00:00\tSPEAKER_07\n Hello. Hey, we're on.\n\n0:00:03\tSPEAKER_07\n Okay, so I had some interesting mail from Dan Ellis. Actually, I think he redirected everybody also. So the PD-A mics have a big bunch of energy at five hertz. Where this came up was that I was showing off these waveforms that we have on the web and I just sort of had noticed this, but the major component in the wave in the second waveform, in the pair of waveforms, is actually the air conditioner.\n\n0:00:34\tSPEAKER_07\n So I have to be more careful about using that as a good illustration. In fact, it's not of effects of rumor or vibration. It isn't a bad illustration of the effects of room noise on some mics.\n\n0:00:59\tSPEAKER_07\n And then we had this other discussion about whether this affects the dynamic range, because I know, although you start off with 32 bits, you end up with 16 bits and, you know, are we getting hurt there, but Dan's pretty confident that we're not that the quantization error is still not a significant factor there.\n\n0:01:21\tSPEAKER_07\n So there was a question of whether we should change things here, whether we should change a capacitor on the put box for that or whether we should. Yeah, he suggested a smaller capacitor, right?\n\n0:01:32\tSPEAKER_07\n Right. He then I had some other thing discussed with him and the feeling was once we start munching with that, and many other problems could happen. And additionally, we already have a lot of data that's collected with that.\n\n0:01:46\tSPEAKER_07\n Yeah. The simple thing to do is he has a, I forget if this wasn't that mayor in the following mail, but he has a simple filter, a digital filter that he suggested. We just run over the data, where we deal with it.\n\n0:02:00\tSPEAKER_07\n The other thing, I don't know the answer to, but when people are using Fickalk here, whether they're using it with the high pass filter option or not. And I don't know if anybody knows.\n\n0:02:14\tSPEAKER_07\n You can go check. Yeah. So when we're doing all these things using our software, there is, if it's based on the RASTA PLP program, which does both PLP and RASTA PLP, then there is an option there, which then comes up through to Fickalk, which allows you to do a high pass filter.\n\n0:02:38\tSPEAKER_07\n And in general, we like to do that because of things like this. And it's pretty, it's not a very severe filter, doesn't affect speech frequencies, even pretty low speech frequencies at all.\n\n0:02:50\tSPEAKER_04\n What's the cutoff frequency that you use?\n\n0:02:54\tSPEAKER_07\n Oh, I don't know why I wrote this a while ago. Is it like 20? Something like that.\n\n0:02:59\tSPEAKER_07\n I mean, I think there's some effect above 20, but it's mild.\n\n0:03:05\tSPEAKER_07\n So, I mean, it's probably, there's probably some effect up to 100 hertz or something, but it's pretty mild.\n\n0:03:11\tSPEAKER_07\n I don't know, in the strut implementation of this stuff, is there a high pass filter or pre-impicist or something?\n\n0:03:18\tSPEAKER_05\n I think we use a pre-impic basis.\n\n0:03:23\tSPEAKER_07\n So, we want to go and check that for anything that we're going to use the PDA mic for.\n\n0:03:30\tSPEAKER_07\n He says that there's a pretty good roll-off in the PCM mics.\n\n0:03:35\tSPEAKER_07\n So, we don't need to worry about them, I'm aware of the other, but if we do make use of the cheap mics, we want to be sure to do that that filtering before we process them.\n\n0:03:47\tSPEAKER_07\n And again, if it's depending on the option that our software is being runway, it's quite possible that's already being taken care of.\n\n0:03:58\tSPEAKER_07\n But I also have to pick a different picture to show the effects of reverberation.\n\n0:04:04\tSPEAKER_04\n Did somebody notice it during your talk?\n\n0:04:06\tSPEAKER_07\n No. Well, they may have, but they were...\n\n0:04:11\tSPEAKER_07\n They were nice. But, I mean, the thing is, since I was talking about reverberation and showing this thing that was noise, it wasn't a good match, but it certainly was still an indication of the fact that you get noise with distant mics.\n\n0:04:28\tSPEAKER_07\n It's just not a great example because not only isn't a reverberation, but it's a noise that we definitely know what to do.\n\n0:04:33\tSPEAKER_07\n It doesn't take deep, new bold new methods to get rid of the fiber-hearts noise.\n\n0:04:42\tSPEAKER_07\n But so, it was a bad example in that way, but it's still a real thing that we did get out of the microphone in a distance, so it wasn't wrong in the scene appropriate.\n\n0:04:56\tSPEAKER_07\n But someone noticed it later, right out to me, and they went, oh, man, why didn't I notice that?\n\n0:05:06\tSPEAKER_07\n So I think we'll change our picture around the web when we go that way.\n\n0:05:13\tSPEAKER_07\n One of the things I was trying to think about, what's the best way to show the difference?\n\n0:05:17\tSPEAKER_07\n I had a couple thoughts. One was that spectrogram that we show is okay, but the thing is, the eyes, and the brain behind them, so good at picking out patterns from noise, that in first glance, you look at them, it doesn't seem like it's that bad, because there's many features that are still preserved.\n\n0:05:41\tSPEAKER_07\n So one thing to do might be to just take a piece of the spectrogram where you can see that something looks different, and blow it up, and have that be the part, just to show as well.\n\n0:05:54\tSPEAKER_07\n Some things are going to be hurt.\n\n0:05:57\tSPEAKER_07\n Another I was thinking of was taking some spectral slices, like we look at with the recognizer, look at the spectrum or capstrom that you get out of there, and the reverberation does change that, so maybe that would be more obvious.\n\n0:06:18\tSPEAKER_03\n Spectral slices?\n\n0:06:21\tSPEAKER_07\n What do you mean?\n\n0:06:23\tSPEAKER_07\n I mean, all the recognizers look at frames, so that one instant time.\n\n0:06:29\tSPEAKER_07\n So it's one point in time, or over 20 milliseconds, or something, you have a spectrum or a capstrom, that's why I meant slice.\n\n0:06:40\tSPEAKER_04\n You could just throw up the MFCC feature vectors, one from one, one from the other, and then you can look and see how different the numbers are.\n\n0:06:50\tSPEAKER_04\n Right, what else are I saying either?\n\n0:07:01\tSPEAKER_04\n See how different these sequences are numbers.\n\n0:07:08\tSPEAKER_07\n Or I could just add them up and get a different total. It's not the square.\n\n0:07:21\tNone\n What else is going on?\n\n0:07:27\tSPEAKER_05\n Yeah, at first I had to remark, why, I am wondering why the PDA is so far. We were always meeting at the beginning of the table.\n\n0:07:38\tSPEAKER_07\n I guess because we had one of the moves. We could move us.\n\n0:07:51\tSPEAKER_05\n Yeah, so since the last meeting, we've tried to put together the clean, the OPS, the new filter that's replacing the Filters, and also the delay issues, so that we can consider the delay issue for the online organization.\n\n0:08:24\tSPEAKER_05\n So we've put together all this, and we have results that are not very impressive, but there is no real improvement.\n\n0:08:37\tSPEAKER_07\n But it's not worse, and it's better latency, right?\n\n0:08:45\tSPEAKER_05\n Actually, it's better. It seems better when we look at the mismatch case, but I think we are like cheated here by this problem that in some cases when you modify a slight, slightly modified initial condition, you end up completely somewhere error, somewhere else in the space.\n\n0:09:06\tSPEAKER_05\n Yeah.\n\n0:09:09\tSPEAKER_05\n Well, the other system, for instance, for Italian, is at 78% recognition rate on the mismatch.\n\n0:09:16\tSPEAKER_05\n This new system has 89%, but I don't think it indicates something really.\n\n0:09:23\tSPEAKER_05\n I don't think it means that the system is more robust, it's simply affected.\n\n0:09:32\tSPEAKER_07\n Well, the test would be if you then tried it on one of the other tests.\n\n0:09:38\tSPEAKER_07\n So this was Italian, right?\n\n0:09:41\tSPEAKER_07\n So then if you take your changes, then...\n\n0:09:44\tSPEAKER_05\n From the 78% recognition rate system, I could change the transition probabilities for the first HMM between the NWC and the MWC.\n\n0:09:57\tSPEAKER_05\n By using 0.5 instead of 0.6, 0.4, I think the HMMC is great.\n\n0:10:06\tSPEAKER_04\n Yeah, I looked at the results when Stefan did that, and it really happens.\n\n0:10:14\tSPEAKER_04\n I mean, the only difference is you change the self-loop transition probability by a tenth of a percent, and it causes 10% difference in the word of a percent.\n\n0:10:24\tSPEAKER_04\n Yeah, from point...\n\n0:10:27\tSPEAKER_04\n I'm sorry, you change a point one.\n\n0:10:29\tSPEAKER_04\n And then not a tenth of a percent, one tenth.\n\n0:10:32\tSPEAKER_04\n So from 0.6 to 0.5, and you get 10% better.\n\n0:10:39\tSPEAKER_04\n And I think it's what you basically hypothesized in the last meeting about just being very...\n\n0:10:47\tSPEAKER_04\n And I think you've mentioned this in your email too. It's just very... you know, you get stuck in some local minimum and this thing throws you out of it, I guess.\n\n0:10:56\tSPEAKER_07\n Well, what are... according to the rules, what are we supposed to do about the transition probability? Are they supposed to be 0.5 or 0.6?\n\n0:11:02\tSPEAKER_04\n I think you're not allowed to... yeah, it's supposed to be 0.6.\n\n0:11:05\tSPEAKER_07\n 0.6. It's supposed to be 0.6.\n\n0:11:07\tSPEAKER_04\n Yeah, but changing into 0.5, I think, is... which gives you much better results, but that's not allowed.\n\n0:11:14\tSPEAKER_05\n Yeah, but even if you miss 0.5, I'm not sure if we'll always give you the better results.\n\n0:11:20\tSPEAKER_04\n Yeah.\n\n0:11:21\tSPEAKER_04\n That's sad.\n\n0:11:22\tSPEAKER_04\n Right, we only tested it on the medium mismatch, right?\n\n0:11:25\tSPEAKER_04\n You said on the other cases you didn't notice.\n\n0:11:27\tSPEAKER_05\n I think the reason is... yeah, I...\n\n0:11:30\tSPEAKER_05\n So I see my name, I think.\n\n0:11:33\tSPEAKER_05\n So it's the fact that the mismatch is trained only on the far microphone.\n\n0:11:41\tSPEAKER_05\n Well, for the mismatch case, everything is... using the far microphone training testing.\n\n0:11:48\tSPEAKER_05\n Whereas for the I-N-Mismatch training is done on the close microphone, so it's clean speech-based.\n\n0:11:55\tSPEAKER_05\n So you don't have this program of looking at the microphone.\n\n0:11:58\tSPEAKER_05\n And for the well-match, it's a mix of close microphone and distant microphone.\n\n0:12:05\tSPEAKER_04\n I did notice something...\n\n0:12:07\tSPEAKER_04\n So it's not just the whole difficult training.\n\n0:12:11\tSPEAKER_04\n Somebody, I think, was Morgan suggested at the last meeting that I actually count to see how many parameters and how many frames.\n\n0:12:18\tSPEAKER_04\n And there are almost 1.8 million frames of training data and less than 40,000 parameters in the baseline system.\n\n0:12:30\tSPEAKER_04\n So it's very, very few parameters compared to how much training data.\n\n0:12:35\tSPEAKER_07\n Yeah, so that says that we could have lots more parameters.\n\n0:12:39\tSPEAKER_04\n Yeah, I did one quick experiment just to make sure I had everything worked out.\n\n0:12:44\tSPEAKER_04\n And I just... for most of the... for all of the digit models, they end up at three mixtures per state.\n\n0:12:54\tSPEAKER_04\n And so I just did a quick experiment, or I changed it so that it went to four.\n\n0:12:58\tSPEAKER_04\n And it didn't have any significant effect at the medium mismatch and high mismatch cases.\n\n0:13:06\tSPEAKER_04\n And it was just barely significant for the well-match better.\n\n0:13:09\tSPEAKER_04\n So I'm going to run that again, but with many more mixtures per state.\n\n0:13:15\tSPEAKER_07\n Yeah, because at 40, you could have... yeah, easily four times as many parameters.\n\n0:13:23\tSPEAKER_04\n And I think also, just seeing what we saw in terms of the expected duration of the silence model when we did this tweaking of the self-loop, the silence model expected duration was really different.\n\n0:13:36\tSPEAKER_04\n And so in the case where it had a better score, the silence model expected duration was much longer.\n\n0:13:43\tSPEAKER_04\n So it was like, it was a better match.\n\n0:13:45\tSPEAKER_04\n I think, you know, if we make a better silence model, I think that will help a lot too for a lot of these cases.\n\n0:13:52\tSPEAKER_04\n So, but one thing I wanted to check out before I increased the number of mixtures per state was in their default training script, they do an initial set of three re-estimations.\n\n0:14:08\tSPEAKER_04\n And then they build the silence model.\n\n0:14:11\tSPEAKER_04\n And then they do seven iterations.\n\n0:14:13\tSPEAKER_04\n Then they add mixtures. And then they do another seven. Then they add mixtures.\n\n0:14:17\tSPEAKER_04\n Then they do a final set of seven. And they quit.\n\n0:14:19\tSPEAKER_04\n Seven seems like a lot to me. And it also makes the experiments go take a really long time.\n\n0:14:24\tSPEAKER_04\n I mean, to do one turn around of the well-matched case takes like a day.\n\n0:14:29\tSPEAKER_04\n And so, you know, in trying to run these experiments, I noticed, you know, it's difficult to find machines, you know, compute to run on.\n\n0:14:36\tSPEAKER_04\n And so one of the things I did was I compiled HTK for the Linux machines.\n\n0:14:40\tSPEAKER_04\n Because we have this one from IBM that's got like five processors in it.\n\n0:14:44\tSPEAKER_04\n Right.\n\n0:14:45\tSPEAKER_04\n And so now you can run stuff on that. And that really helps a lot.\n\n0:14:49\tSPEAKER_04\n Because now we've got, you know, extra machines that we can use for compute.\n\n0:14:54\tSPEAKER_04\n And if I'm doing running an experiment right now where I'm changing the number of iterations from seven to three, to see how it affects the baseline system.\n\n0:15:03\tSPEAKER_04\n And so if we can get away with just doing three, we can do many more experiments more quickly.\n\n0:15:09\tSPEAKER_04\n And if it's not a huge difference from running with seven iterations, you know, we should be able to get a lot more experiments done.\n\n0:15:17\tSPEAKER_04\n And so I'll let you know what happens with that.\n\n0:15:21\tSPEAKER_04\n But if we can, you know, run all of these back ends with many fewer iterations.\n\n0:15:26\tSPEAKER_04\n And on Linux boxes, we should be able to get a lot more experimenting done.\n\n0:15:30\tSPEAKER_04\n So I wanted to experiment with cutting down the number of iterations before I increased the number of Gaussian.\n\n0:15:38\tSPEAKER_07\n So how is it going on the?\n\n0:15:45\tSPEAKER_07\n So you did some things.\n\n0:15:47\tSPEAKER_07\n They didn't improve things in a way that convinced you you'd substantially improved anything.\n\n0:15:52\tSPEAKER_07\n But they're not making things worse and we have reduced latency, right?\n\n0:15:56\tSPEAKER_05\n Yeah, but actually, actually it seems to do a little bit worse for the one-match case.\n\n0:16:05\tSPEAKER_05\n And we just noticed that actually the way the final score is computed is quite funny.\n\n0:16:12\tSPEAKER_05\n It's not a mean of word error rate.\n\n0:16:15\tSPEAKER_05\n It's not a weighted mean of error rate.\n\n0:16:17\tSPEAKER_05\n It's a weighted mean of improvements.\n\n0:16:21\tSPEAKER_05\n So which means that actually the weight on the well-match is...\n\n0:16:27\tSPEAKER_05\n Well, what happened is that if you have a small improvement or a small bit on the well-match case, it will have a huge influence on the improvement compared to the reference because the reference system is quite good for well-match case also.\n\n0:16:48\tSPEAKER_04\n So it weights the improvement on the well-match case really heavily compared to the improvement on the other cases?\n\n0:16:53\tSPEAKER_05\n It's a weighting of the improvement, not of the error rate.\n\n0:16:57\tSPEAKER_04\n Yeah, and it's hard to improve on the best case because it's already so good, right?\n\n0:17:02\tSPEAKER_05\n Yeah, but what I mean is that you can have a huge improvement on the HM case, like 5% absolute.\n\n0:17:13\tSPEAKER_05\n And this will not affect the final score, or most... this will not affect the final score because the improvement relative to the baseline is small.\n\n0:17:27\tSPEAKER_07\n So they do improvement in terms of accuracy rather than word error rate?\n\n0:17:34\tSPEAKER_05\n Improvements.\n\n0:17:36\tSPEAKER_05\n It's compared to the word error rate.\n\n0:17:39\tSPEAKER_07\n Okay, so if you have 10% error and you get 5% absolute improvement, then that's 50%.\n\n0:17:51\tSPEAKER_07\n Okay, so what you're saying then is that if it's something that has a small word error rate, then even a relatively small improvement on it, and absolute terms will show up is quite large in this. Is that what you're saying? Yes. Okay, but yeah, that's the notion of relative improvement.\n\n0:18:12\tSPEAKER_07\n Yeah.\n\n0:18:13\tSPEAKER_07\n Word error rate.\n\n0:18:15\tSPEAKER_05\n Sure, but when we think about the weighting, which is 0.5, 0.3, 0.2, it's an absolute... on relative figures.\n\n0:18:24\tSPEAKER_05\n Yeah.\n\n0:18:25\tSPEAKER_05\n So we look at this error rate?\n\n0:18:27\tSPEAKER_07\n That's why I've been saying we should be looking at word error rate and not at accuracy.\n\n0:18:34\tSPEAKER_07\n I mean, we probably should have standardized the 9 all the way through.\n\n0:18:38\tSPEAKER_04\n Well, I mean, it's not that different, right? I mean, just subtract the accuracy.\n\n0:18:46\tSPEAKER_07\n Yeah, but when you look at the numbers, your sense of the relative is quite different.\n\n0:18:51\tSPEAKER_07\n If you had 90% correct and 5% 5 over 90, it doesn't look like it's a big difference, but 5 over 10 is big.\n\n0:19:00\tSPEAKER_07\n So just when you're looking at a lot of numbers, getting a sense of what was important.\n\n0:19:04\tSPEAKER_04\n That makes sense.\n\n0:19:06\tSPEAKER_05\n Well, anyway, so yeah, so it hurts a little bit on the well match.\n\n0:19:13\tSPEAKER_07\n What's a little bit like?\n\n0:19:19\tSPEAKER_05\n Like, it's difficult to say because again, I'm not sure I have to...\n\n0:19:26\tSPEAKER_04\n Hey Morgan, do you remember that signif program that we used to use for testing signif?\n\n0:19:34\tSPEAKER_04\n Is that still valid? I've been using that.\n\n0:19:37\tSPEAKER_07\n Yeah, it was actually updated.\n\n0:19:39\tSPEAKER_07\n It was updated some years ago and cleaned it up, made some things better.\n\n0:19:44\tSPEAKER_04\n Okay, I should find that new one. I just used my old one from 92 or whatever.\n\n0:19:49\tSPEAKER_07\n Yeah, I'm sure it's not that different, but...\n\n0:19:52\tSPEAKER_07\n He was a little more rigorous as I recall.\n\n0:19:56\tSPEAKER_05\n So it's around like 0.5...\n\n0:20:01\tSPEAKER_05\n 0.6% absolute on the Daniel.\n\n0:20:07\tSPEAKER_07\n Worst?\n\n0:20:08\tSPEAKER_07\n Worst, yeah.\n\n0:20:09\tSPEAKER_07\n Out of what?\n\n0:20:11\tSPEAKER_05\n We start from 94.64, and we go to 94.04.\n\n0:20:16\tSPEAKER_07\n So that's 6...\n\n0:20:18\tSPEAKER_04\n 93.64, right?\n\n0:20:21\tSPEAKER_04\n Is the baseline.\n\n0:20:29\tSPEAKER_05\n Oh, the baseline.\n\n0:20:31\tSPEAKER_05\n Yeah.\n\n0:20:32\tSPEAKER_05\n But I'm not talking about the baseline.\n\n0:20:34\tSPEAKER_04\n Oh, oh, I'm sorry.\n\n0:20:35\tSPEAKER_05\n My baseline is the submitted system.\n\n0:20:38\tSPEAKER_04\n Oh, okay.\n\n0:20:41\tSPEAKER_05\n For finish, we start 93.84, and we go to 93.74.\n\n0:20:48\tSPEAKER_05\n And for Spanish, we were at 95.05, and we go to 93.61.\n\n0:20:55\tSPEAKER_07\n Okay, so we are getting hurt somewhat.\n\n0:20:57\tSPEAKER_07\n And is that what, you know what piece?\n\n0:20:59\tSPEAKER_07\n You've done several changes here.\n\n0:21:01\tSPEAKER_07\n Do you know what piece?\n\n0:21:02\tSPEAKER_05\n I guess it's the filter.\n\n0:21:04\tSPEAKER_05\n Because, well, we don't have complete result, but the filter...\n\n0:21:11\tSPEAKER_05\n So the filter with a shorter delay, earns on the Italian and the light.\n\n0:21:17\tSPEAKER_05\n And the other things like...\n\n0:21:21\tSPEAKER_05\n Don't sampling something from simple words.\n\n0:21:26\tSPEAKER_05\n I'm...\n\n0:21:27\tSPEAKER_05\n You're like normalization either.\n\n0:21:29\tSPEAKER_04\n So...\n\n0:21:30\tSPEAKER_04\n I'm really confused about something.\n\n0:21:31\tSPEAKER_04\n If we saw that making a small change, like, you know, a tenth to the self-loop had a huge effect, can we really make any conclusions about...\n\n0:21:43\tSPEAKER_04\n Yeah, that's differences in the stuff.\n\n0:21:45\tSPEAKER_04\n I mean, especially when they're this small.\n\n0:21:47\tSPEAKER_05\n I think we can be completely fooled by this thing.\n\n0:21:50\tNone\n But...\n\n0:21:52\tSPEAKER_05\n Well, yeah...\n\n0:21:54\tSPEAKER_05\n There is first this thing, and then...\n\n0:21:57\tSPEAKER_05\n I computed the confidence level on the different test sets.\n\n0:22:03\tSPEAKER_05\n And for the well-matched, they are around 0.6 percent.\n\n0:22:12\tSPEAKER_05\n For the mismatched, they are around...\n\n0:22:15\tSPEAKER_05\n I see 1.5 percent.\n\n0:22:17\tSPEAKER_05\n For the well-m, HM, they are also around 1.5.\n\n0:22:21\tSPEAKER_07\n But, okay, so these degradations you were talking about, were on the well-matched case.\n\n0:22:26\tSPEAKER_07\n Yeah.\n\n0:22:27\tSPEAKER_07\n Does the new filter make things better or worse for the other cases?\n\n0:22:34\tSPEAKER_05\n About the same, it doesn't hurt.\n\n0:22:36\tSPEAKER_07\n Doesn't hurt, but it doesn't get a little better or something.\n\n0:22:39\tSPEAKER_07\n No.\n\n0:22:40\tSPEAKER_07\n Okay, so...\n\n0:22:41\tSPEAKER_07\n I guess the argument one might make is that, yeah, if you look at one of these cases, and you jiggle something and it changes, then, you know, I'm quite sure what to make of it.\n\n0:22:53\tSPEAKER_07\n You look across a bunch of these, and there's some pattern.\n\n0:22:58\tSPEAKER_07\n I mean, so, here's all the...\n\n0:23:00\tSPEAKER_07\n If in all these different cases, it never gets better, and there's significant number of cases where it gets worse, then you're probably...\n\n0:23:09\tSPEAKER_07\n For any things.\n\n0:23:10\tSPEAKER_07\n That would say.\n\n0:23:12\tSPEAKER_07\n So, I mean, at the very least, that would be a reasonable prediction of what would happen with a different test set that you're not jiggling things with.\n\n0:23:22\tSPEAKER_07\n So, I guess the question is, if you can do better than this.\n\n0:23:26\tSPEAKER_07\n If we can approximate the old numbers while still keeping the latency down.\n\n0:23:34\tSPEAKER_07\n So...\n\n0:23:37\tSPEAKER_07\n So, what I was asking though is, what's the level of communication with the OGI gang now about this?\n\n0:23:48\tSPEAKER_05\n Yeah. When we are exchanging data, so, as we see, we have significant results.\n\n0:24:00\tSPEAKER_05\n For the moment, they are working on integrating the spectrosuppraction from Eric's.\n\n0:24:12\tSPEAKER_05\n Yeah. And so, yeah. We are working northside on other things, also trying to set spectrosuppraction, but...\n\n0:24:24\tSPEAKER_05\n...the spectrosuppraction.\n\n0:24:29\tSPEAKER_05\n Yeah, so I think it seems okay.\n\n0:24:32\tSPEAKER_07\n It's depending further discussion about this idea of having some sort of source code control.\n\n0:24:39\tSPEAKER_05\n Yeah. Well, for the moment, everybody is quite...\n\n0:24:46\tSPEAKER_05\n There is this Eurospeg deadline.\n\n0:24:49\tSPEAKER_05\n I see.\n\n0:24:54\tSPEAKER_05\n Yeah. But, yeah. As soon as we have something that's significant, that's better than what was submitted, we will fix this.\n\n0:25:06\tSPEAKER_04\n Okay, so, what is your answer to this?\n\n0:25:11\tSPEAKER_07\n Do you want me to take this on?\n\n0:25:15\tSPEAKER_07\n Yeah. Sounds like a good idea, but I think that that keeps saying people are scrambling for your Eurospeg deadline.\n\n0:25:23\tSPEAKER_04\n But that will be done in a week, so maybe after.\n\n0:25:27\tSPEAKER_04\n Wow, already a week, man.\n\n0:25:31\tSPEAKER_07\n You're right. It's amazing.\n\n0:25:35\tSPEAKER_07\n I think anything for your speech or...\n\n0:25:40\tSPEAKER_05\n We are trying to do something with the meeting recorded digits.\n\n0:25:47\tSPEAKER_05\n And the good thing is that there is this first deadline.\n\n0:25:53\tSPEAKER_05\n Yeah.\n\n0:25:55\tSPEAKER_05\n Well, some people from OGI are working on paper for this, but there is also the special session about Aurora, which is an extended deadline.\n\n0:26:09\tSPEAKER_07\n Oh, for your speech?\n\n0:26:12\tSPEAKER_05\n Yeah. So far.\n\n0:26:15\tSPEAKER_07\n Oh, special dispensation. That's great.\n\n0:26:18\tSPEAKER_04\n Where is your Eurospeg this year?\n\n0:26:21\tSPEAKER_07\n Alborg. Alborg.\n\n0:26:25\tSPEAKER_07\n So the deadline, once a deadline.\n\n0:26:28\tSPEAKER_05\n Once a deadline?\n\n0:26:31\tSPEAKER_07\n That's great.\n\n0:26:36\tSPEAKER_07\n So we should definitely get something after that.\n\n0:26:42\tSPEAKER_07\n But on meeting digits, maybe.\n\n0:26:46\tSPEAKER_05\n Yeah.\n\n0:26:49\tSPEAKER_07\n So I think that you could certainly start looking at the issue, but I think it's probably on...\n\n0:26:58\tSPEAKER_07\n It's from what Stefan is saying. It's unlikely to get sort of active participation\n\n0:27:03\tSPEAKER_04\n from the two sides until after they've... Well, I could at least...\n\n0:27:10\tSPEAKER_04\n Well, I'm going to be out next week, but I could try to look into like this CVS over the web. That seems to be a very popular way of people distributing changes and over, you know, multiple sites and things.\n\n0:27:23\tSPEAKER_04\n So maybe if I can figure out how to do that easily and then pass the information on to everybody that's easy to do is possible and people won't interfere with their regular work, then maybe that would be good.\n\n0:27:36\tSPEAKER_04\n And I think we could use it for other things around here too.\n\n0:27:41\tSPEAKER_06\n Good. That's cool.\n\n0:27:43\tSPEAKER_03\n And if you're interested in using CVS, I've set it up here.\n\n0:27:46\tSPEAKER_03\n Oh, great. Okay.\n\n0:27:48\tSPEAKER_04\n I used it a long time ago, but it's been a while, so maybe I can ask you some questions.\n\n0:27:52\tSPEAKER_03\n So I'll be away tomorrow and Monday, but I'll be back on Tuesday or Wednesday.\n\n0:27:57\tNone\n Okay.\n\n0:27:58\tSPEAKER_07\n You do the other thing, actually, is business about this waveform.\n\n0:28:01\tSPEAKER_07\n Maybe you and I can talk a little bit at some point about coming up with a better demonstration of the effects of reverberation for our web page.\n\n0:28:10\tSPEAKER_07\n So the...\n\n0:28:13\tSPEAKER_07\n Actually, the...\n\n0:28:16\tSPEAKER_07\n It made a good audio demonstration because when you play that clip, the really obvious difference is that you can hear two voices in the second one.\n\n0:28:28\tSPEAKER_04\n You can just...\n\n0:28:29\tSPEAKER_06\n Like, talk into a pet.\n\n0:28:31\tSPEAKER_06\n Yeah.\n\n0:28:32\tSPEAKER_04\n It's not good reverb.\n\n0:28:34\tSPEAKER_07\n No, I mean, it sounds pretty reverber, but I mean, when you play back in a room with a big room, nobody can hear that difference, really.\n\n0:28:41\tSPEAKER_07\n They hear that it's lower amplitude and they hear this second voice.\n\n0:28:44\tSPEAKER_07\n But that...\n\n0:28:45\tSPEAKER_07\n Actually, that makes for a perfectly good demo because that's real obvious thing.\n\n0:28:48\tSPEAKER_07\n Not a good two voices.\n\n0:28:50\tSPEAKER_07\n Well, that's okay, but for the visual, just, you know, like to have the spectrogram again because your visual abilities as a human being are so good, you can pick out...\n\n0:29:03\tSPEAKER_07\n You look at the good one, you look at the screwed up one, and you can see the features in it.\n\n0:29:08\tSPEAKER_04\n I noticed that in the pictures I thought, my initial thought was, this is not too bad.\n\n0:29:12\tSPEAKER_04\n Right.\n\n0:29:13\tSPEAKER_07\n If you look at it closely, you see, well, here's a place where this one has a big format.\n\n0:29:17\tSPEAKER_07\n The major formats here are moving quite a bit, and then you look in the other one, and they look practically flat.\n\n0:29:25\tSPEAKER_07\n So, I mean, that's why I was thinking in a section like that, you could take a look at just that part of the spectrogram, and you could say, oh, yeah, this really distorted it quite a bit.\n\n0:29:34\tSPEAKER_04\n The main thing that struck me in looking at those two spectrograms was the difference in the high frequencies.\n\n0:29:37\tSPEAKER_04\n It looked like, for the one that was far the way, you know, everything was tenuated.\n\n0:29:42\tSPEAKER_04\n Right.\n\n0:29:43\tSPEAKER_04\n I mean, that was the main visual thing that I noticed.\n\n0:29:46\tSPEAKER_07\n Right.\n\n0:29:47\tSPEAKER_07\n But it's, so, yeah, so there are clearly spectral effects.\n\n0:29:50\tSPEAKER_07\n Since you're getting all this indirect energy, then a lot of it does have reduced high frequencies.\n\n0:29:56\tSPEAKER_07\n But the other thing is the temporal courses, the things really are changed, and we want to show that in some obvious way.\n\n0:30:04\tSPEAKER_07\n The reason I put the waveforms in there was because they do look quite different.\n\n0:30:09\tSPEAKER_07\n And so I thought, oh, this is good, but I just, after you put in there, I didn't really look at them anymore.\n\n0:30:17\tSPEAKER_07\n So I just, they're different.\n\n0:30:19\tSPEAKER_07\n So, what's something that has a more interesting explanation for why they're different?\n\n0:30:26\tSPEAKER_03\n So maybe we can just substitute one of these waveforms, and then do some kind of zoom in on this spectrogram on an interesting area.\n\n0:30:34\tSPEAKER_07\n Something like that.\n\n0:30:35\tSPEAKER_07\n Yeah. The other thing that we had in there that I didn't like was that the most obvious characteristic of the difference when you listen to it is that there's a second voice.\n\n0:30:45\tSPEAKER_07\n And the cuts that we have there actually don't correspond to the full waveform.\n\n0:30:51\tSPEAKER_07\n It's just the first, I think there was something where he was having some trouble getting so much in, or I forget the reason behind it, but it's the first six seconds or something of it, and it's in the seventh or eighth second or something where the second voice comes in.\n\n0:31:07\tSPEAKER_07\n So we would like to actually see the voice coming in too, I think.\n\n0:31:11\tSPEAKER_07\n Since that's the most obvious thing when you listen to it.\n\n0:31:14\tSPEAKER_06\n So.\n\n0:31:21\tSPEAKER_05\n Yeah.\n\n0:31:30\tSPEAKER_05\n Yeah.\n\n0:31:32\tSPEAKER_05\n So.\n\n0:31:35\tSPEAKER_05\n Figures here. Well, we started to work on spectrograms of traction.\n\n0:31:38\tSPEAKER_05\n And the preliminary results were very bad.\n\n0:31:44\tSPEAKER_05\n So the thing that we did is just to add spectrograms of traction before this, the whole process which contains a monomine vision.\n\n0:31:55\tSPEAKER_05\n And it hurts a lot.\n\n0:31:59\tSPEAKER_05\n And so we started to look at things like this, which is, well, it's.\n\n0:32:12\tSPEAKER_05\n So you have the C0 bar meters for one Italian utterance, and I plotted this for two channels.\n\n0:32:23\tSPEAKER_05\n Channel zero is the closed-wave microphone, which is like just a microphone.\n\n0:32:28\tSPEAKER_05\n And it's perfectly synchronized.\n\n0:32:31\tSPEAKER_05\n And the sentence contains only one word, which is doing.\n\n0:32:38\tSPEAKER_04\n This is, this is a lot of C0, the energy.\n\n0:32:42\tSPEAKER_05\n There is a lot of C0 when we don't use spectrograms of traction.\n\n0:32:49\tSPEAKER_05\n And when there is no online normalization.\n\n0:32:53\tSPEAKER_05\n So there is just some filtering with the LDA.\n\n0:32:58\tSPEAKER_05\n So that's an example.\n\n0:33:01\tSPEAKER_04\n C0 is the closed-talking, the closed channel.\n\n0:33:04\tSPEAKER_05\n And channel one is the.\n\n0:33:07\tSPEAKER_05\n So C0 is very key.\n\n0:33:10\tSPEAKER_05\n Yeah.\n\n0:33:12\tSPEAKER_05\n Then when we apply normalization, it looks like the second figure.\n\n0:33:18\tSPEAKER_05\n Which is good, well, the noise part is around zero.\n\n0:33:25\tSPEAKER_05\n The third figure is what happens when we apply mineralization and variance.\n\n0:33:32\tSPEAKER_05\n So what we can clearly see is that on the speech portion, the two channels become very close.\n\n0:33:39\tSPEAKER_05\n But also what happens on the noisy portion is that the variance of the analysis.\n\n0:33:44\tSPEAKER_04\n This is still being a plot of C0.\n\n0:33:48\tSPEAKER_04\n Can I ask, what does variance normalization do?\n\n0:33:52\tSPEAKER_04\n What is the effect of that?\n\n0:33:54\tSPEAKER_07\n Normalization is the variance.\n\n0:33:57\tSPEAKER_05\n What does that mean?\n\n0:34:00\tSPEAKER_05\n No, I understand that.\n\n0:34:03\tSPEAKER_04\n No, I understand what it is.\n\n0:34:06\tSPEAKER_04\n What is it?\n\n0:34:08\tSPEAKER_04\n What's the rationale?\n\n0:34:10\tSPEAKER_04\n Yeah.\n\n0:34:11\tSPEAKER_07\n Why do it?\n\n0:34:12\tSPEAKER_07\n Well, I mean, because everything, if you have a system based on Gaussian, everything is based on means and variances.\n\n0:34:20\tSPEAKER_07\n So if there's an overall reason, you know, it's like if you're doing image processing.\n\n0:34:27\tSPEAKER_07\n And some of the pictures you were looking at, there was a lot of light.\n\n0:34:32\tSPEAKER_07\n And some there was low light.\n\n0:34:34\tSPEAKER_07\n You'd want to adjust for that in order to compare things.\n\n0:34:37\tSPEAKER_07\n And the variance is just sort of like the next moment.\n\n0:34:40\tSPEAKER_07\n So what if one set of pictures was taken so that throughout the course, it was one through daylight and night.\n\n0:34:51\tSPEAKER_07\n Ten times, another time.\n\n0:34:53\tSPEAKER_07\n I mean, it's, you know, how much, how much very, or, no, I guess a better example would be, how much of the light was coming in from outside rather than artificial light.\n\n0:35:02\tSPEAKER_07\n So if it was a lot, if more was coming in from outside, then it would be the bigger effect of the change.\n\n0:35:08\tSPEAKER_07\n So every mean, every, all of the parameters that you have, especially the variances, are going to be affected by the overall variance.\n\n0:35:17\tSPEAKER_07\n And so it's a bit, okay.\n\n0:35:19\tSPEAKER_07\n If you remove that source, then, you know, you can...\n\n0:35:21\tSPEAKER_04\n So the major effect is that you're going to get is by normalizing the means.\n\n0:35:26\tSPEAKER_04\n But it may first order, but first order, thank you.\n\n0:35:28\tSPEAKER_07\n But then the second order is the variances.\n\n0:35:31\tSPEAKER_07\n Because again, if you, if you're trying to distinguish between E and B, if it just so happens that the E's were more, you know, recorded when the energy was large.\n\n0:35:42\tSPEAKER_07\n It was, was, was larger or something, or the variation in it was larger.\n\n0:35:46\tSPEAKER_07\n Uh-huh.\n\n0:35:47\tSPEAKER_07\n Then the B's, then this will give you some, some bias.\n\n0:35:50\tSPEAKER_07\n So it's removing these sources of variability in the data that have nothing to do with the linguistic component.\n\n0:35:56\tSPEAKER_07\n Gotcha.\n\n0:35:57\tSPEAKER_07\n Okay. Sorry, dinner.\n\n0:35:58\tSPEAKER_07\n But the, let me, I just ask you something.\n\n0:36:01\tSPEAKER_07\n Is, if, if you have a good voice activity, a checker, isn't, isn't it going to pull that out?\n\n0:36:07\tSPEAKER_05\n Yes. Sure.\n\n0:36:08\tSPEAKER_05\n Sure. If you have a good, yeah. Well, what it shows is that, yeah, perhaps a good voice activity detector is, is good before magnumization.\n\n0:36:16\tSPEAKER_05\n And that's what we already observed.\n\n0:36:20\tSPEAKER_05\n But, yeah, voice activity detection is not...\n\n0:36:25\tSPEAKER_04\n But after you do this, after you do the variance normalization, I mean, I don't know, it seems like this would be a lot easier than this signal.\n\n0:36:34\tSPEAKER_05\n So, to work with... Well, I prefer to look at the second bigger than the third one, because you clearly see where a speech is.\n\n0:36:42\tSPEAKER_05\n Yeah. Yeah.\n\n0:36:43\tSPEAKER_05\n But the problem is that on the speech portion, channel zero and channel one are more different than when you use variance on the evaluation, where channel zero and channel one become closer.\n\n0:36:54\tSPEAKER_04\n But for the purposes of finding this speech, you're more interested in the difference between the speech and the non-speech, right?\n\n0:37:01\tSPEAKER_05\n So, I think, yeah, for... I think that perhaps it shows that the parameters that the voice activity detector should use, after use should be different than the parameters that have to be used for speech recognition.\n\n0:37:16\tSPEAKER_07\n Yeah. So, basically, you want to reduce this effect. So, you can do that by doing the voice activity detection. You also could do it by special spectral subtraction before the variance normalization, right?\n\n0:37:27\tSPEAKER_05\n Yeah, but it's not clear, man.\n\n0:37:29\tSPEAKER_05\n So... Well, it's just to... Yeah.\n\n0:37:33\tSPEAKER_05\n The number that are here are recognition experiments on the Italian, HM and M, with these two kinds of parameters.\n\n0:37:41\tSPEAKER_05\n But it's better with variance normalization.\n\n0:37:45\tSPEAKER_07\n Yeah. Yeah, so, that's good, better even out of luck, sogley.\n\n0:37:49\tSPEAKER_07\n But does this have the voice activity detection in it? Yeah.\n\n0:37:53\tSPEAKER_05\n Okay. So, the fact is that the voice activity detector doesn't work on the channel one, so... Yeah, channel one.\n\n0:38:03\tSPEAKER_04\n Yeah.\n\n0:38:05\tSPEAKER_04\n What stage is the voice activity detector applied? Is it applied here or after the variance normalization?\n\n0:38:13\tSPEAKER_05\n It's applied before variance normalization, so it's a good thing. Because I guess we're setting the detection on this. Yeah. Is it applied all the way back here?\n\n0:38:25\tSPEAKER_05\n It's applied... Yeah, something like this.\n\n0:38:31\tSPEAKER_04\n Maybe that's why it doesn't work for channel one.\n\n0:38:35\tSPEAKER_05\n It could perhaps do just mean normalization before... Nice guy.\n\n0:38:43\tSPEAKER_07\n Sort of a couple of other questions, which is if most of what the OGI folk are working with is trying to integrate this other spectrum subtraction, where are we working about it?\n\n0:38:57\tSPEAKER_05\n Speckless subtraction. Yeah. It's just... Well, it's another... They are trying to use the...\n\n0:39:05\tSPEAKER_05\n Ericsson, and we're trying to use something, nothing else. Yeah, and also to understand what happened, because...\n\n0:39:13\tSPEAKER_05\n Okay.\n\n0:39:15\tSPEAKER_05\n Well, when we do spectrum subtraction, actually, I think this is the two last figures.\n\n0:39:21\tSPEAKER_05\n It seems that after spectrum subtraction, speech is more emerging than...\n\n0:39:27\tSPEAKER_06\n Mm-hmm. Speech is more what?\n\n0:39:29\tSPEAKER_05\n Well, the difference between the energy of the speech and the energy of the spectrum subtracted no expression is larger.\n\n0:39:39\tSPEAKER_05\n Well, if you compare the first figure with this one, I'm trying to just get it's not the same, but if you look at the numbers, you clearly see that the difference between the zero of the speech and the zero of the nice portion is larger.\n\n0:39:57\tSPEAKER_05\n But when it advances that after spectrum subtraction, you also increase the variance of the zero.\n\n0:40:05\tSPEAKER_05\n So if you apply variance or my addition of this, it completely is...\n\n0:40:09\tSPEAKER_05\n Ericsson, everything. Yeah. So yeah.\n\n0:40:19\tSPEAKER_05\n And what they did at RGI is just...\n\n0:40:23\tSPEAKER_05\n They don't use online on my addition for the moment of spectrum subtraction, I think.\n\n0:40:27\tSPEAKER_05\n Yeah. I think as soon as they were trying to do an online addition, it would be a problem.\n\n0:40:33\tSPEAKER_05\n So yeah, we're working on the same thing, but I think...\n\n0:40:41\tSPEAKER_05\n With different systems.\n\n0:40:47\tSPEAKER_07\n Right. I mean, the...\n\n0:40:51\tSPEAKER_07\n In election, it's interesting to work on things one way or the other, but I'm just wondering if...\n\n0:40:57\tSPEAKER_07\n The list of things that there are to do, if there are things that we won't do because we got two groups doing the same thing.\n\n0:41:07\tSPEAKER_07\n That's...\n\n0:41:13\tSPEAKER_07\n Just asking.\n\n0:41:17\tSPEAKER_04\n There also could be... I mean, I can maybe see a reason for both working on it too, if...\n\n0:41:25\tSPEAKER_04\n You know, if you work on something else and you're waiting for them to give you spectral subtraction, I mean, it's hard to know whether the effects that you get from the other experiments you do will carry over once you've then bring in their spectral subtraction module.\n\n0:41:45\tSPEAKER_04\n So it's almost like everything's held up waiting for this one thing.\n\n0:41:49\tSPEAKER_04\n I don't know if that's true or not, but I could see how. Maybe that's what you were thinking.\n\n0:41:53\tSPEAKER_07\n I mean, we still evidently have a latency reduction plan, which isn't quite what you'd like it to be.\n\n0:41:59\tSPEAKER_07\n That seems like one prominent thing.\n\n0:42:03\tSPEAKER_07\n And then what there are issues of having a second stream or something, that was...\n\n0:42:09\tSPEAKER_07\n There was this business that we could use up at 4,800 bits.\n\n0:42:15\tSPEAKER_05\n Yeah, but I think we want to work on this day, also want to work on this.\n\n0:42:21\tSPEAKER_05\n Yeah, we will try MSG.\n\n0:42:25\tSPEAKER_05\n But...\n\n0:42:27\tSPEAKER_05\n I think they want to work on this second stream or something.\n\n0:42:33\tSPEAKER_05\n Some kind of...\n\n0:42:35\tSPEAKER_05\n Not get that one.\n\n0:42:37\tSPEAKER_05\n And they call it crap.\n\n0:42:39\tSPEAKER_06\n You know, it's crap.\n\n0:42:41\tSPEAKER_07\n Okay.\n\n0:42:43\tSPEAKER_07\n Do you remember when the next meeting is supposed to be?\n\n0:42:47\tSPEAKER_07\n In June.\n\n0:42:49\tSPEAKER_07\n Yeah.\n\n0:42:51\tSPEAKER_07\n Yeah, the other thing is that you saw that mail about the VAD.\n\n0:42:55\tSPEAKER_07\n VAD is performing quite differently.\n\n0:42:59\tSPEAKER_07\n So there was this experiment of what if you just take the bass line, a feature, just Melcapster, and you incorporate the different VADs.\n\n0:43:11\tSPEAKER_07\n And it looks like the French VAD is actually better.\n\n0:43:15\tSPEAKER_07\n It improves the bass line.\n\n0:43:17\tSPEAKER_04\n Yeah.\n\n0:43:19\tSPEAKER_05\n I don't know which VAD they use.\n\n0:43:21\tSPEAKER_05\n If they use the small VAD, I think it's easy to do better because it doesn't work at all.\n\n0:43:33\tSPEAKER_05\n So...\n\n0:43:35\tSPEAKER_05\n Which one is pretty better than the bass as well?\n\n0:43:39\tSPEAKER_00\n Yeah.\n\n0:43:41\tSPEAKER_05\n We should ask which VAD.\n\n0:43:43\tSPEAKER_00\n I think that he said with the good VAD of Prongoji with the Arcade VAD.\n\n0:43:53\tSPEAKER_00\n And the experiment was sometimes better, sometimes worse.\n\n0:43:57\tSPEAKER_05\n Yeah, but I think you're talking about the other way that you use VAD on the reference features.\n\n0:44:03\tSPEAKER_05\n Yes.\n\n0:44:05\tSPEAKER_07\n And on that one, the French one was better.\n\n0:44:09\tSPEAKER_07\n I mean, it was enough better that it would account for a fair amount of the difference between a performance, actually.\n\n0:44:21\tSPEAKER_07\n So if they have a better one, we should use it.\n\n0:44:27\tSPEAKER_07\n You know, it's...\n\n0:44:29\tSPEAKER_07\n You can't work on everything.\n\n0:44:33\tSPEAKER_05\n Yeah, so we should find out if it's really better, if it's...\n\n0:44:39\tSPEAKER_05\n Yeah.\n\n0:44:41\tSPEAKER_05\n Compared to the small, on a big band.\n\n0:44:43\tSPEAKER_05\n Yeah.\n\n0:44:45\tSPEAKER_05\n And perhaps we can easily prove if we put, like, the normalization before...\n\n0:44:49\tSPEAKER_06\n Yeah.\n\n0:44:51\tSPEAKER_07\n He can't go back in town the week after next, back in the country.\n\n0:44:59\tSPEAKER_07\n So start organizing more visits and connections and so forth.\n\n0:45:09\tSPEAKER_07\n Working towards students.\n\n0:45:15\tSPEAKER_00\n Also, Stefan was thinking that maybe it was useful to sing about voice and voice to work here in voice and voice detection.\n\n0:45:28\tSPEAKER_00\n And we are looking at the singing.\n\n0:45:34\tSPEAKER_05\n Actually, when we look at all the proposals, everybody is still using some kind of spectrum hand look.\n\n0:45:44\tNone\n Right?\n\n0:45:46\tSPEAKER_07\n No use of pitch, basically.\n\n0:45:48\tSPEAKER_05\n Yeah, well, the pitch, but to look at the...\n\n0:45:52\tSPEAKER_05\n Fine.\n\n0:45:54\tSPEAKER_05\n Well, that's just everyone to find the pitch and the sound.\n\n0:46:00\tSPEAKER_05\n It's another feeling that when we look at the...\n\n0:46:04\tSPEAKER_05\n Yeah, well, there is no way you can tell if it's for it and then for it.\n\n0:46:08\tSPEAKER_05\n If there is some...\n\n0:46:10\tSPEAKER_05\n It's easy in clean speech because voice sound, I'm all over it, I'll see.\n\n0:46:14\tSPEAKER_05\n So there will be more.\n\n0:46:16\tSPEAKER_05\n Yeah.\n\n0:46:18\tSPEAKER_05\n There is the first problem, just the larger.\n\n0:46:20\tSPEAKER_05\n And then voice sound or more eye frequencies because it's vacation.\n\n0:46:26\tSPEAKER_05\n Right.\n\n0:46:28\tSPEAKER_05\n But, yeah.\n\n0:46:30\tSPEAKER_05\n When you have noise, you have a low frequency, you know, you could be even for voice speech.\n\n0:46:36\tSPEAKER_07\n Yeah, you can make these mistakes, but...\n\n0:46:38\tSPEAKER_04\n Isn't there some other...\n\n0:46:40\tSPEAKER_04\n I think it would be good.\n\n0:46:44\tSPEAKER_04\n I'm not going to say, isn't there... aren't there lots of ideas for doing voice activity or speech non-speech rather by looking at, you know, I guess, harmonics or looking across time?\n\n0:47:00\tSPEAKER_07\n I think you sound about the voice non-voiced though.\n\n0:47:04\tSPEAKER_04\n Yeah.\n\n0:47:06\tSPEAKER_04\n Or that, you know, even with voice non-voiced and voiced, I thought that you were...\n\n0:47:14\tSPEAKER_07\n I'm really was talking about...\n\n0:47:16\tSPEAKER_07\n Well, yeah, we should have finished with it.\n\n0:47:18\tSPEAKER_05\n Okay.\n\n0:47:20\tSPEAKER_05\n It's good.\n\n0:47:22\tSPEAKER_05\n Yeah, so yeah, I think if we try to develop a second stream...\n\n0:47:26\tSPEAKER_05\n Well, there would be one stream that is the envelope and the second, it would be interesting to have something that's more related to the fact structure of the spectrum.\n\n0:47:34\tSPEAKER_05\n Yeah, so I don't know. We were thinking about like using ideas from Larry Sohn.\n\n0:47:42\tSPEAKER_05\n Have a good voice detector or...\n\n0:47:44\tSPEAKER_05\n Have a good voice speech detector.\n\n0:47:48\tSPEAKER_05\n Let's work in...\n\n0:47:50\tSPEAKER_05\n Larry Sohn could be an idea.\n\n0:47:54\tSPEAKER_05\n We were thinking about just kind of taking this background and computing the variance.\n\n0:48:03\tSPEAKER_05\n I have a resolution spectrum.\n\n0:48:07\tSPEAKER_07\n Okay, so today's something about that.\n\n0:48:11\tSPEAKER_07\n We had a guy here some years ago who did some work on making use of voicing information to help in reducing the noise.\n\n0:48:24\tSPEAKER_07\n So what he was doing is basically you do estimate the pitch.\n\n0:48:33\tSPEAKER_07\n Or you estimate fine harmonic structure, which are either way, it's more of the same.\n\n0:48:40\tSPEAKER_07\n The thing is that you then can get rid of things that are not...\n\n0:48:47\tSPEAKER_07\n If there is strong harmonic structure, you can throw away stuff that's not a harmonic.\n\n0:48:54\tSPEAKER_07\n And that is another way of getting rid of part of the noise.\n\n0:48:59\tSPEAKER_07\n So that's something that is sort of finer, brings in a little more information than just spectrum of subtraction.\n\n0:49:09\tSPEAKER_07\n And he did that sort of in combination with Rostovs, kind of like Rostovs, taking care of convolutional stuff.\n\n0:49:17\tSPEAKER_07\n And that's some decent results doing that.\n\n0:49:21\tSPEAKER_07\n But yeah, there's all these cues.\n\n0:49:24\tSPEAKER_07\n Actually, back when Chuck was here, we did some voice-to-voice classification using a bunch of these.\n\n0:49:30\tSPEAKER_07\n And works okay, obviously it's not perfect.\n\n0:49:34\tSPEAKER_07\n But the thing is that you can't, given the constraints of this task, we can't, in a very nice way, feed forward to the recognizer, the information, the probabilistic information that you might get about, whether it's voice-to-own voice, we can't affect the distributions or anything.\n\n0:49:56\tSPEAKER_07\n But what we, I guess we could.\n\n0:50:07\tSPEAKER_04\n Didn't the head dude send around that message?\n\n0:50:10\tSPEAKER_04\n I think you sent us all a copy of the message where he was saying that I'm not sure exactly what he was saying, but something having to do with the voice activity detector and that people shouldn't put their own in or something was going to be...\n\n0:50:25\tSPEAKER_07\n Okay, so that's voice activity detector as opposed to voicing detector.\n\n0:50:28\tSPEAKER_07\n So we're talking about something a little different.\n\n0:50:30\tSPEAKER_07\n I'm sorry.\n\n0:50:31\tSPEAKER_07\n I'm sorry.\n\n0:50:32\tSPEAKER_07\n I guess what you could do, maybe this would be.\n\n0:50:34\tSPEAKER_07\n So if you have, if you view this second stream, before you do KLTs and so forth, if you do view it as probabilities.\n\n0:50:45\tSPEAKER_07\n And if it's an independent, so if it's not so much envelope based, but fine structure based, looking at harm and acidity or something like that.\n\n0:50:55\tSPEAKER_07\n If you get a probability from that information and then multiply it by, you know, multiply it by all the voiced outputs and all the unvoiced outputs, you know.\n\n0:51:05\tSPEAKER_07\n Then use that as the take the log of that or pre-nonlinearity.\n\n0:51:14\tSPEAKER_07\n And do the KLT on that.\n\n0:51:18\tSPEAKER_07\n Then that would, I guess, be a reasonable use of independent information.\n\n0:51:25\tSPEAKER_07\n So maybe that's what you meant.\n\n0:51:27\tSPEAKER_07\n That would be...\n\n0:51:29\tSPEAKER_05\n Yeah, well, that would be...\n\n0:51:32\tSPEAKER_05\n Yeah.\n\n0:51:34\tSPEAKER_05\n So you'll mean that some kind of probability from the voice thing and that...\n\n0:51:39\tSPEAKER_07\n Right, so you have a second neural net, it could be pretty small.\n\n0:51:44\tSPEAKER_07\n Yeah, if you have a tandem system, you have some kind of, it could be pretty small, net.\n\n0:51:48\tSPEAKER_07\n We did some of this stuff.\n\n0:51:50\tSPEAKER_07\n I did some use go and you use...\n\n0:51:54\tSPEAKER_07\n The thing is to use information primarily that's different, as you say, it's more fine structure based than envelope based.\n\n0:52:00\tSPEAKER_07\n So then you can pretty much guarantee it's stuff that you're not looking at very well with the other one.\n\n0:52:06\tSPEAKER_07\n And then you only use it for this one distinction.\n\n0:52:10\tSPEAKER_07\n And so now you've got a probability of the two cases and you've got the probability of the finer categories on the other side, you multiply them more appropriate.\n\n0:52:21\tSPEAKER_07\n And if they really are from independent information sources, then they should have different kinds of errors and roughly independent errors.\n\n0:52:32\tSPEAKER_07\n That's a good choice for...\n\n0:52:39\tSPEAKER_07\n Yeah, that's a good idea.\n\n0:52:45\tSPEAKER_05\n Because yeah, well, spectrosuffraction is good and we could use the finer structure to let the finer scheme of the null.\n\n0:52:53\tSPEAKER_05\n But still, the very...\n\n0:52:57\tSPEAKER_05\n This issue with spectrosuffraction that seems to increase the variance of...\n\n0:53:02\tSPEAKER_05\n Yeah.\n\n0:53:05\tSPEAKER_05\n Well, this is a couple of...\n\n0:53:07\tSPEAKER_05\n Right.\n\n0:53:08\tSPEAKER_05\n I know in a few of you do some kind of a leg-on-eye addition at the end of the...\n\n0:53:19\tSPEAKER_05\n Well, spectrosuffraction has a leg-on-eye addition to...\n\n0:53:24\tSPEAKER_07\n What if you do the spectrosuffraction, do some spectrosuffraction first, then do some online normalization, then do some more spectrosuffraction?\n\n0:53:32\tSPEAKER_07\n I mean, maybe you can do it in layers or something, so it doesn't hurt too much or something.\n\n0:53:37\tSPEAKER_07\n But anyway, I think I was sort of arguing against myself there by giving that example.\n\n0:53:42\tSPEAKER_07\n I mean, because I was already sort of suggesting that we should be careful about not spending too much time on exactly what they're doing.\n\n0:53:48\tSPEAKER_07\n In fact, if you go into a harmonics-related thing, it's definitely going to be different than what they're doing and should have some interesting properties and noise.\n\n0:54:01\tSPEAKER_07\n I know that when people have done sort of the obvious thing of taking your feature vector and adding in some variables which are pitch-related or that it hasn't...\n\n0:54:17\tSPEAKER_07\n My impression is it hasn't particularly helped. It has not.\n\n0:54:23\tSPEAKER_07\n Yeah, but I think that's a question for this...\n\n0:54:30\tSPEAKER_07\n Extending the feature vector versus having different streams.\n\n0:54:35\tSPEAKER_07\n Was it nice and nice and conditioned for the example?\n\n0:54:38\tSPEAKER_07\n And it may not have been noisy conditions.\n\n0:54:41\tSPEAKER_07\n I don't remember the example, but it was on some DARPA data some years ago, so it probably wasn't, actually.\n\n0:54:50\tSPEAKER_05\n But we are thinking we're discussing very...\n\n0:54:54\tSPEAKER_05\n Perhaps...\n\n0:54:58\tSPEAKER_05\n I was thinking about some kind of cheating experiment. It's voicing bit.\n\n0:55:13\tSPEAKER_07\n Why don't you just do it with a rure?\n\n0:55:17\tSPEAKER_07\n Just in each frame...\n\n0:55:21\tSPEAKER_05\n We don't have a free-telling brush. We don't have a labeling...\n\n0:55:30\tSPEAKER_05\n We just have a labeling word model.\n\n0:55:34\tSPEAKER_02\n You have frame, frame, level.\n\n0:55:41\tSPEAKER_07\n But you can align so that it's not perfect, but if you know what was said...\n\n0:55:47\tSPEAKER_04\n The problem is that their models are all word-level models. There's no phone models that you get alignable.\n\n0:55:54\tSPEAKER_04\n You see, you can find out where the word boundaries are, but that's about it.\n\n0:55:58\tSPEAKER_07\n Yeah. I see.\n\n0:56:03\tSPEAKER_02\n But we could use the noisy version of Timit, which is similar to the noises found in the TI digits.\n\n0:56:12\tSPEAKER_02\n The portion of our aura.\n\n0:56:20\tSPEAKER_05\n I guess we can see nothing to be out.\n\n0:56:26\tSPEAKER_05\n If this voicing bit doesn't help...\n\n0:56:29\tSPEAKER_05\n I think we don't have to...\n\n0:56:31\tSPEAKER_07\n We want more about this.\n\n0:56:36\tSPEAKER_07\n Right.\n\n0:56:43\tSPEAKER_07\n In experiments, we did a long time ago, and it was probably a resource management or something.\n\n0:56:51\tSPEAKER_07\n I think you were getting something like still 8% or 9% error on the voicing as I recall.\n\n0:57:00\tSPEAKER_07\n So what that said is that sort of love to its own devices, like without a strong language model and so forth, that you would make significant number of errors just with your probabilistic machinery.\n\n0:57:19\tSPEAKER_04\n It also... I think there was one problem with that in that we used canonical mapping. So our truth may not have really been true to the acoustics.\n\n0:57:34\tSPEAKER_07\n Yeah. Well, back 20 years ago when I did this voiced-on-voiced stuff, we were getting more like 97% or 98% correct in voicing, but that was speaker-dependent.\n\n0:57:49\tSPEAKER_07\n Actually, we were doing training on a particular announcer and getting a very good handle on the features.\n\n0:57:54\tSPEAKER_07\n We did this complex feature selection thing where we looked at all the different possible features one could have for voicing and exhaustively searched all-size subsets.\n\n0:58:06\tSPEAKER_07\n For that particular speaker, you'd find the five or six features which really did well.\n\n0:58:11\tSPEAKER_07\n Doing all of that, we get down to 23% error, but that, again, the speaker-dependent with lots of feature selection and very complex sort of thing.\n\n0:58:20\tSPEAKER_07\n So I would believe that it was quite likely that looking at envelope-only that would be significantly worse than that.\n\n0:58:37\tSPEAKER_05\n And the speech-cordes?\n\n0:58:41\tSPEAKER_05\n Yeah, I do. What do they even have to detect first? The modern ones don't do a simple switch. They work on the code book, excitation.\n\n0:58:53\tSPEAKER_07\n Yeah, they do analysis by synthesis. They try every possible excitation they have in their code book and find the one that matches best.\n\n0:59:01\tSPEAKER_05\n Yeah.\n\n0:59:04\tSPEAKER_04\n Okay. Can I just mention one other interesting thing? One of the ideas that we had come up with last week for things to try to improve the system.\n\n0:59:23\tSPEAKER_04\n I guess I wrote this in after the meeting, but the thought I had was looking at the language model that's used in the HTK recognizer, which is basically just a big loop.\n\n0:59:38\tSPEAKER_04\n So it goes digit, and then that can either go to silence or go to another digit, which that model will allow for the production of infinitely long sequences of digits.\n\n0:59:51\tSPEAKER_04\n So I thought, well, I'm going to just look at the what actual digit strings do occur in the training data. And the interesting thing was it turns out that there are no sequences of two long or three long digit strings in any of their training data. So it's either one, four, five, six, up to 11, and then it skips, and then there's some at 16.\n\n1:00:15\tSPEAKER_07\n But what about the testing data?\n\n1:00:17\tSPEAKER_07\n I don't know. I didn't look at the test data yet. So if there's some testing data that has, has two or three.\n\n1:00:23\tSPEAKER_04\n Yeah, but I just thought that was a little odd that there were no two or three long.\n\n1:00:29\tSPEAKER_04\n So I just, for the heck of it, I made a little grammar, which had its separate path for each length digit string you could get.\n\n1:00:39\tSPEAKER_04\n So there was a one long path, and there was a four long and a five long. And I tried that and it got way worse. There were lots of deletions. So it was, you know, I didn't have any weights on these paths, or I didn't have anything like that.\n\n1:00:51\tSPEAKER_04\n And I played with tweaking the word transition penalties a bunch, but I couldn't go anywhere. But I thought, well, if I only allow, I guess I should have looked at to see how often there was a mistake where a two long or three long path was actually put out as a hypothesis.\n\n1:01:08\tSPEAKER_04\n So to do that right, you'd probably want to have a lot for them all, but then have weightings and things. So I just thought that was an interesting thing about the data.\n\n1:01:20\tSPEAKER_07\n Okay, so we're going to read some more just strings, I guess.\n\n1:01:24\tSPEAKER_04\n Yeah.\n\n1:01:31\tSPEAKER_07\n I'm going to go ahead and read it.\n\n1:01:38\tSPEAKER_07\n 5, 5, 4, 0, 1, 8, 8, 7, 2, 2, 4, 6, 3, 8, 5, 3, 9, 5, 6, 1, 6, 1, 4, 0, 2, 9, 4.\n\n1:02:02\tSPEAKER_07\n 737-339.\n\n1:02:04\tSPEAKER_07\n 3126-114850.\n\n1:02:08\tSPEAKER_07\n 685-3-741-3923.\n\n1:02:14\tSPEAKER_07\n 917-839-7546.\n\n1:02:21\tSPEAKER_05\n Transcript L-19.\n\n1:02:25\tSPEAKER_05\n 874-30-928.\n\n1:02:29\tSPEAKER_05\n 859-43471.\n\n1:02:33\tSPEAKER_05\n 020-975-009.\n\n1:02:37\tSPEAKER_05\n 677-601-5254.\n\n1:02:42\tSPEAKER_05\n 423-575-426.\n\n1:02:46\tSPEAKER_05\n 903-4-6231.\n\n1:02:50\tSPEAKER_05\n 380-08007-8351.\n\n1:02:57\tSPEAKER_05\n 471-929-180.\n\n1:03:03\tSPEAKER_04\n Transcript L-16.\n\n1:03:06\tSPEAKER_04\n 5608-425566.\n\n1:03:11\tSPEAKER_04\n 735-475-477.\n\n1:03:16\tSPEAKER_04\n 037-715-505.\n\n1:03:20\tSPEAKER_04\n 3255-8169-34.\n\n1:03:25\tSPEAKER_04\n 393-057-019.\n\n1:03:29\tSPEAKER_04\n 588-625-7698.\n\n1:03:34\tSPEAKER_04\n 850-33434.\n\n1:03:38\tSPEAKER_04\n 230-46550.\n\n1:03:44\tSPEAKER_03\n Transcript L-17.\n\n1:03:50\tSPEAKER_03\n 946-470139.\n\n1:03:56\tSPEAKER_03\n 671-268-209.\n\n1:04:02\tSPEAKER_03\n 7500-462280.\n\n1:04:09\tSPEAKER_03\n 527-1-7133-5202.\n\n1:04:17\tSPEAKER_03\n 616-1120-8959.\n\n1:04:24\tSPEAKER_03\n 031-522-71.\n\n1:04:30\tSPEAKER_03\n 388-420-8457.\n\n1:04:38\tSPEAKER_03\n 680-4835-00.\n\n1:04:44\tSPEAKER_00\n Transcript L-18.\n\n1:04:47\tSPEAKER_00\n 585-771-443.\n\n1:04:53\tSPEAKER_00\n 9241-91-301-1.\n\n1:05:00\tSPEAKER_00\n 784-528-3698.\n\n1:05:06\tSPEAKER_00\n 739-724-523-96.\n\n1:05:14\tSPEAKER_00\n 572-921-08.\n\n1:05:18\tSPEAKER_00\n 698-2.\n\n1:05:21\tSPEAKER_00\n 288-541.\n\n1:05:25\tSPEAKER_00\n 794-9.\n\n1:05:28\tSPEAKER_00\n 792-420-563.\n\n1:05:34\tSPEAKER_00\n 567-978-558-1.\n\n1:05:41\tSPEAKER_01\n Transcript L-21.\n\n1:05:44\tSPEAKER_01\n 010-453366.\n\n1:05:49\tSPEAKER_01\n 125-545-434.\n\n1:05:54\tSPEAKER_01\n 410-6960-7230.\n\n1:06:01\tSPEAKER_01\n 793-1-4150.\n\n1:06:06\tSPEAKER_01\n 417-083-532-4.\n\n1:06:12\tSPEAKER_01\n 165-687-594.\n\n1:06:17\tSPEAKER_01\n 377-5030-568.\n\n1:06:23\tSPEAKER_01\n 747-999-119.\n\n", "summary": [{"summary_text": "SPEAKER_07 had some interesting mail from Dan Ellis. The PD-A mics have a lot of energy at five hertz. Dan suggested a small capacitor on the put box and a digital filter. There is some effect above 20 hertz, but it's mild. "}]}