{"filename": "./data/Bro017.txt", "transcript": "0:00:00\tSPEAKER_03\n is it starting now?\n\n0:00:01\tSPEAKER_03\n Yeah.\n\n0:00:02\tSPEAKER_03\n So from what whatever we say from now on, it can be heard against us, right?\n\n0:00:07\tSPEAKER_03\n That's right.\n\n0:00:08\tSPEAKER_06\n And you're right to remain silent.\n\n0:00:12\tSPEAKER_03\n So the problem is that I actually don't know how these heard mean things are heard.\n\n0:00:17\tSPEAKER_03\n They are very informal.\n\n0:00:18\tSPEAKER_03\n So there's just people that say what's going on and that's usually what we do.\n\n0:00:21\tSPEAKER_04\n We just sort of go around and people say what's going on.\n\n0:00:24\tSPEAKER_03\n What's going on?\n\n0:00:25\tSPEAKER_03\n Okay.\n\n0:00:26\tSPEAKER_03\n The reason it is if I make a report on what's happening in Aurora in general, at least from my perspective.\n\n0:00:33\tSPEAKER_03\n That would be great.\n\n0:00:34\tSPEAKER_03\n And so I think that Carmen and Stefan reported on Amsterdam meeting, which was kind of interesting because for the first time we realized we are not friends really, but we are competitors.\n\n0:00:46\tSPEAKER_03\n Until then it was sort of like everything was like wonderful.\n\n0:00:50\tSPEAKER_03\n Yeah.\n\n0:00:51\tSPEAKER_04\n It seemed like there were still some issues that they were trying to decide.\n\n0:00:53\tSPEAKER_03\n There's plenty of issues.\n\n0:00:54\tSPEAKER_03\n Well, what happened was that they realized that two leading proposals, which was French Telecom, Alcatel and us, both had voice activity that extra.\n\n0:01:05\tSPEAKER_03\n Right.\n\n0:01:06\tSPEAKER_03\n And I saw a big surprise.\n\n0:01:07\tSPEAKER_03\n I mean, we could have told you that four months ago, except we didn't because nobody else was bringing it up.\n\n0:01:12\tSPEAKER_03\n Obviously, French Telecom didn't volunteer this information either.\n\n0:01:15\tSPEAKER_03\n Because we were working mainly on voice activity that extra four past several months because that's why he got the most thing.\n\n0:01:23\tSPEAKER_03\n And everybody said, well, this is not fair.\n\n0:01:25\tSPEAKER_03\n We didn't know that.\n\n0:01:27\tSPEAKER_03\n And of course, it's not working on features, really.\n\n0:01:30\tSPEAKER_03\n And I agreed.\n\n0:01:31\tSPEAKER_03\n I said, well, yeah, you are absolutely right.\n\n0:01:33\tSPEAKER_03\n I mean, if you wish that you provided a better and pointed speech because, or at least that if you could modify the recognizer to account for these long silences, because otherwise, that wasn't the correct thing.\n\n0:01:47\tSPEAKER_03\n And so then everybody asked us, well, we need to do a new evaluation.\n\n0:01:53\tSPEAKER_03\n We don't want to have to do that.\n\n0:01:54\tSPEAKER_03\n Or we have to do something about it.\n\n0:01:56\tSPEAKER_03\n And in principle, we agreed.\n\n0:01:58\tSPEAKER_03\n We said, yeah, because about in that case, we would like to change the algorithm because if we are working on different data, we probably will use a different set of tricks.\n\n0:02:12\tSPEAKER_03\n That unfortunately, nobody ever officially can somehow acknowledge that this can be done.\n\n0:02:17\tSPEAKER_03\n Because French Telecom was saying, no, no, no, no.\n\n0:02:19\tSPEAKER_03\n Now everybody has access to our code.\n\n0:02:22\tSPEAKER_03\n So everybody is going to copy what we did.\n\n0:02:25\tSPEAKER_03\n Well, our argument was everybody has access to our code.\n\n0:02:28\tSPEAKER_03\n And everybody always had access to our code.\n\n0:02:30\tSPEAKER_03\n We never deny that we saw that people are honest that if you copy something and if it is protected by a patent, then you negotiate or something, right?\n\n0:02:41\tSPEAKER_03\n I mean, if you find our technique useful, we are very happy.\n\n0:02:45\tSPEAKER_03\n But French Telecom was saying, no, no, no, there is a lot of little tricks which sort of I cannot be protected and you guys will take them.\n\n0:02:53\tSPEAKER_03\n Which probably is also true.\n\n0:02:54\tSPEAKER_03\n I mean, it might be that people will take the algorithms apart and use the blocks from that.\n\n0:03:02\tSPEAKER_03\n But I somehow think that it wouldn't be so bad as long as people are happy about it.\n\n0:03:06\tSPEAKER_03\n Honest about it.\n\n0:03:07\tSPEAKER_03\n And I think they have to be honest in the long run because winning the proposal again, what will be available will be a code.\n\n0:03:15\tSPEAKER_03\n So the people can go to code and say, well, listen, this is what you stole from me.\n\n0:03:19\tSPEAKER_03\n Right.\n\n0:03:20\tSPEAKER_03\n So let's deal with that.\n\n0:03:21\tSPEAKER_03\n So I don't see the problem.\n\n0:03:22\tSPEAKER_03\n The biggest problem, of course, is that our country, the French Telecom claims what we fulfilled the conditions we are the best, the standard.\n\n0:03:33\tSPEAKER_03\n And other people don't feel that because they now decide that the whole thing will be done on a well-appointed data.\n\n0:03:42\tSPEAKER_03\n Maybe that somebody will point the data based on clean speech because most of this speech that car has also closed-picking in Mike and points will be provided.\n\n0:03:53\tSPEAKER_03\n And we will run again.\n\n0:03:55\tSPEAKER_03\n Still not clear if we are going to run, if we are allowed to run new algorithms, but I assume so because we would fight for that really.\n\n0:04:04\tSPEAKER_03\n But since at least our experience is that only end-pointing Melkeps Room gets you 21 percent improvement overall and 27 improvement on speech.car.\n\n0:04:17\tSPEAKER_03\n Then obviously database, that means the baseline will go up.\n\n0:04:22\tSPEAKER_03\n And nobody can achieve 50 percent improvement.\n\n0:04:25\tSPEAKER_03\n So they agreed that there will be a 25 percent improvement required on the bad-limit message.\n\n0:04:35\tSPEAKER_04\n I thought the end-pointing really only helped in the noisy cases.\n\n0:04:39\tSPEAKER_04\n But you still have that with the MFCC, okay?\n\n0:04:42\tSPEAKER_03\n Yeah, but you have the same problem.\n\n0:04:44\tSPEAKER_03\n MFCC basically has an enormous number of insertions.\n\n0:04:48\tSPEAKER_03\n So now they want to say we will require 50 percent improvement only for well-matched condition and only 25 percent for the severe cases.\n\n0:04:59\tSPEAKER_03\n And they almost agreed on that except that it wasn't 100 percent agreed.\n\n0:05:03\tSPEAKER_03\n And so last time during the meeting I just brought up the issue.\n\n0:05:07\tSPEAKER_03\n So well, you know, quite frankly I've surprised how likely you are making these decisions because this is a major decision.\n\n0:05:15\tSPEAKER_03\n For two years we are fighting for 50 percent improvement.\n\n0:05:19\tSPEAKER_03\n And suddenly you are saying, oh no, we will do something.\n\n0:05:22\tSPEAKER_03\n Maybe we should discuss that.\n\n0:05:23\tSPEAKER_03\n And everybody's all be discussed that and you were not there.\n\n0:05:26\tSPEAKER_03\n And I saw a lot of other people there because not everybody participates at this teleconferencing thing.\n\n0:05:33\tSPEAKER_03\n Then they said, oh no, no, no, because everybody is invited.\n\n0:05:36\tSPEAKER_03\n However, there is only 10 or 15 lines.\n\n0:05:38\tSPEAKER_03\n So people can't even participate.\n\n0:05:41\tSPEAKER_03\n So they agreed.\n\n0:05:42\tSPEAKER_03\n And I saw they said, okay, we will discuss that.\n\n0:05:45\tSPEAKER_03\n Immediately Nokia raised the question.\n\n0:05:47\tSPEAKER_03\n I said, oh yeah, we agreed.\n\n0:05:48\tSPEAKER_03\n This is not good to dissolve the criteria.\n\n0:05:56\tSPEAKER_03\n So now officially Nokia is complaining and said they are looking for support.\n\n0:06:03\tSPEAKER_03\n I think Qualcomm is saying too, we shouldn't abandon the 50 percent yet.\n\n0:06:08\tSPEAKER_03\n We should at least try once again, one more round.\n\n0:06:11\tSPEAKER_03\n So this is where we are.\n\n0:06:13\tSPEAKER_03\n I hope that this is going to be adopted next Wednesday.\n\n0:06:17\tSPEAKER_03\n We are going to have another teleconferencing call.\n\n0:06:20\tSPEAKER_03\n So we will see where it goes.\n\n0:06:23\tSPEAKER_04\n So what about the issue of the weights for the different systems?\n\n0:06:27\tSPEAKER_04\n The well matched and medium ones?\n\n0:06:29\tSPEAKER_03\n Yeah, that's a very good point.\n\n0:06:32\tSPEAKER_03\n David says, well, we can manipulate this number by choosing the right weights anyways.\n\n0:06:37\tSPEAKER_03\n So you are right.\n\n0:06:39\tSPEAKER_03\n But of course, if you put a weight zero on the mismatch condition, highly mismatch, then you are done.\n\n0:06:49\tSPEAKER_03\n Advates were also already decided half a year ago.\n\n0:06:54\tSPEAKER_03\n And they are saying the same.\n\n0:06:56\tSPEAKER_03\n Of course people will not like it.\n\n0:06:58\tSPEAKER_03\n What is happening now is that I think that people try to match the criterion to solution.\n\n0:07:04\tSPEAKER_03\n They have solution.\n\n0:07:05\tSPEAKER_03\n Now they want to make sure the criterion is.\n\n0:07:08\tSPEAKER_03\n And I think that this is not the right way.\n\n0:07:10\tSPEAKER_03\n It may be that eventually it may have to happen.\n\n0:07:16\tSPEAKER_03\n But it should happen at the point where everybody feels comfortable that we did all of what we could.\n\n0:07:21\tSPEAKER_03\n And I don't think we did it, basically.\n\n0:07:22\tSPEAKER_03\n I think that this test was a little bit bogus because of the data.\n\n0:07:29\tSPEAKER_03\n And essentially there were some arbitrary decisions made in everything.\n\n0:07:38\tSPEAKER_03\n So this is where it is.\n\n0:07:40\tSPEAKER_03\n So what we are doing at OGI now is working basically on the parts which we, I think, a little bit neglected.\n\n0:07:51\tSPEAKER_03\n Like a noise separation.\n\n0:07:55\tSPEAKER_03\n So we are looking in a way which we can provide the better initial estimate of the male spectrum, basically, which would be more robust to noise.\n\n0:08:08\tSPEAKER_03\n And so far not much success.\n\n0:08:10\tSPEAKER_03\n We tried things which long time ago Bill Burns suggested instead of using Fourier spectrum from Fourier transform, used the spectrum from LPC model.\n\n0:08:22\tSPEAKER_03\n The argument there was, the LPC model feels the peaks of the spectrum.\n\n0:08:26\tSPEAKER_03\n So it may be naturally more robust in noise.\n\n0:08:29\tSPEAKER_03\n And I saw that, that makes sense.\n\n0:08:31\tSPEAKER_03\n But so far we can't get much out of it.\n\n0:08:36\tSPEAKER_03\n We may try some standard techniques like spectral subtraction.\n\n0:08:40\tSPEAKER_03\n You haven't tried that.\n\n0:08:41\tSPEAKER_03\n No, not much.\n\n0:08:43\tSPEAKER_03\n Or even I was thinking about looking back into this totally ad hoc techniques.\n\n0:08:48\tSPEAKER_03\n For instance, Dennis Scott was suggesting the one way to deal with noise speeches, add noise to everything.\n\n0:08:59\tSPEAKER_03\n So I mean, add more than amount of noise to all data.\n\n0:09:04\tSPEAKER_03\n So that makes any additive noise less effective, right?\n\n0:09:10\tSPEAKER_03\n Because you already had the noise and it was working at the time.\n\n0:09:15\tSPEAKER_03\n It was kind of like one of these things.\n\n0:09:16\tSPEAKER_03\n But if you think about it, it's actually pretty ingenious.\n\n0:09:19\tSPEAKER_03\n So one, you know, just take a spectrum and add to constant C to every value.\n\n0:09:26\tSPEAKER_03\n Yeah.\n\n0:09:27\tSPEAKER_04\n So you're making all your training data more uniform.\n\n0:09:29\tSPEAKER_03\n Exactly.\n\n0:09:30\tSPEAKER_03\n And if the new test data becomes noisy, it becomes effective because less noisy, basically.\n\n0:09:38\tSPEAKER_03\n But of course you cannot add too much noise because then your green recognition goes down.\n\n0:09:44\tSPEAKER_03\n But I mean, it's yet to be seen how much it's very simple technique.\n\n0:09:47\tSPEAKER_03\n It's indeed.\n\n0:09:48\tSPEAKER_03\n It's very simple technique.\n\n0:09:49\tSPEAKER_03\n You just take your spectrum and use whatever is coming from FFT at constant, you know, to power spectrum.\n\n0:10:01\tSPEAKER_03\n Or the other thing is of course, if you have a spectrum where you can start doing, you can start leaving out the parts which are law in energy.\n\n0:10:12\tSPEAKER_03\n And then perhaps one could try to find a whole model to such a spectrum because our whole model will still try to put the continuation basically of the model into these parts where which you said to zero.\n\n0:10:30\tSPEAKER_03\n So that's what we want to try.\n\n0:10:32\tSPEAKER_03\n I have visited from Bernou, kind of like young faculty, really hardworking.\n\n0:10:40\tSPEAKER_03\n So he's looking into that.\n\n0:10:43\tSPEAKER_03\n And then most of the effort is now also aimed at this trap recognition.\n\n0:10:51\tSPEAKER_03\n This is this recognition from temporal patterns.\n\n0:10:54\tSPEAKER_03\n What is that?\n\n0:10:55\tSPEAKER_03\n Ah, you don't know about traps.\n\n0:10:57\tSPEAKER_04\n The traps sound familiar, right?\n\n0:10:59\tSPEAKER_03\n Yeah, I mean, this is familiar, because we gave it a name.\n\n0:11:03\tSPEAKER_03\n But what it is is that normally what you do is that you recognize speech based on short spectrum.\n\n0:11:11\tSPEAKER_03\n Essentially, LPC, Melcappes' room, everything starts with spectral slice.\n\n0:11:19\tSPEAKER_03\n So if you're given the spectrogram, you're essentially sliding the spectrogram along the frequency axis and you keep shifting the thing.\n\n0:11:28\tSPEAKER_03\n But you have a spectrogram.\n\n0:11:29\tSPEAKER_03\n So you can say, well, you can also take the time trajectory of the energy at a given frequency.\n\n0:11:35\tSPEAKER_03\n And what you get is then you get a vector.\n\n0:11:39\tSPEAKER_03\n And this vector can be assigned to some phoneme.\n\n0:11:44\tSPEAKER_03\n Namely, you can say, I will say that this vector will describe the phoneme which is in the center of the vector.\n\n0:11:53\tSPEAKER_03\n And you can try to classify based on that.\n\n0:11:57\tSPEAKER_03\n So you can say, I'm sorry, it's a very different vector, very different properties.\n\n0:12:00\tSPEAKER_03\n We don't know much about it.\n\n0:12:03\tSPEAKER_03\n But the truth is you have many of those vectors.\n\n0:12:05\tSPEAKER_03\n Wow.\n\n0:12:06\tSPEAKER_03\n So you get many decisions.\n\n0:12:07\tSPEAKER_03\n And then you can start thinking about how to combine these decisions.\n\n0:12:11\tSPEAKER_03\n So exactly that's what it is.\n\n0:12:14\tSPEAKER_03\n Because if you run this recognition, you still get about 20% error.\n\n0:12:19\tSPEAKER_03\n That's 20% correct.\n\n0:12:20\tSPEAKER_03\n You know, on like frame by frame basis.\n\n0:12:26\tSPEAKER_03\n So it's much better than chance.\n\n0:12:28\tSPEAKER_03\n How wide are the frequency?\n\n0:12:30\tSPEAKER_03\n That's another thing.\n\n0:12:31\tSPEAKER_03\n Well, currently we start always with critical vent spectrum for various reasons.\n\n0:12:37\tSPEAKER_03\n But the latest observation is that you can get quite a big advantage of using two critical vents at the same time.\n\n0:12:47\tSPEAKER_06\n Are they adjacent?\n\n0:12:49\tSPEAKER_03\n Adjacent.\n\n0:12:50\tSPEAKER_03\n Adjacent.\n\n0:12:51\tSPEAKER_03\n And there are some reasons for that.\n\n0:12:54\tSPEAKER_03\n Because there are some reasons I could talk about.\n\n0:12:56\tSPEAKER_03\n We have to tell you about things like masking experiments, which yield critical vents, and also experiments with the release of masking, which actually tell you that something is happening across critical vents, across bands.\n\n0:13:12\tSPEAKER_04\n And how do you convert this energy over time in a particular frequency band into a vector of numbers?\n\n0:13:21\tSPEAKER_03\n I mean, a time T0 is one number.\n\n0:13:26\tSPEAKER_03\n Yeah, but what time number is it just to see a spectacular energy?\n\n0:13:29\tSPEAKER_03\n A logarithmic spectrum of energy in that band.\n\n0:13:32\tSPEAKER_03\n Yes, in that time interval.\n\n0:13:34\tSPEAKER_03\n Yes.\n\n0:13:35\tSPEAKER_03\n And that's what I'm saying then.\n\n0:13:38\tSPEAKER_03\n This is a starting vector.\n\n0:13:39\tSPEAKER_03\n It's just like short-term spectrum or something.\n\n0:13:43\tSPEAKER_03\n But now we are trying to understand what this vector actually represents.\n\n0:13:47\tSPEAKER_03\n For instance, question is like how correlated are the elements of this vector?\n\n0:13:52\tSPEAKER_03\n And so they are quite correlated, because I mean, especially the neighboring ones, right?\n\n0:13:56\tSPEAKER_03\n They represent the same, almost the same configuration of the vocal tract.\n\n0:14:00\tSPEAKER_03\n So there is a very high correlation.\n\n0:14:03\tSPEAKER_03\n So the classifiers which use the diagonal covariance matrix don't like it.\n\n0:14:08\tSPEAKER_03\n So we think they are decorulating them.\n\n0:14:11\tSPEAKER_03\n And the question is, can you describe elements of this vector by Gaussian distributions?\n\n0:14:17\tSPEAKER_03\n To what extent?\n\n0:14:18\tSPEAKER_03\n Because and so on and so on.\n\n0:14:23\tSPEAKER_03\n So we are learning quite a lot about that.\n\n0:14:26\tSPEAKER_03\n And then another issue is how many vectors we should be using.\n\n0:14:29\tSPEAKER_03\n I mean, the minimum is one.\n\n0:14:32\tSPEAKER_03\n But I mean, it's the critical band, the right dimension.\n\n0:14:36\tSPEAKER_03\n So we somehow made arbitrary decision, yes.\n\n0:14:40\tSPEAKER_03\n And then now we are thinking a lot how to use at least a neighboring band, because that seems to be happening.\n\n0:14:48\tSPEAKER_03\n This I somehow start to believe that's what's happening in a cognition.\n\n0:14:53\tSPEAKER_03\n So a lot of experiments point to the fact that people can split the signal into critical bands.\n\n0:15:00\tSPEAKER_03\n But then so you can, you are quite capable of processing a signal independently in individual critical bands.\n\n0:15:10\tSPEAKER_03\n And the question is, what is the question?\n\n0:15:11\tSPEAKER_03\n What is the most important thing that you are making in a particular massaging experiment tell you?\n\n0:15:13\tSPEAKER_03\n But at the same time, you most likely pay attention to at least neighboring bands when you are making any decisions.\n\n0:15:18\tSPEAKER_03\n You compare what's happening in this band to what's happening to the band to the neighboring bands.\n\n0:15:26\tSPEAKER_03\n And that's how you make a decision.\n\n0:15:29\tSPEAKER_03\n That's why the articulatory bands which have pleasure talks about, they are about two critical bands.\n\n0:15:35\tSPEAKER_03\n You need at least two, basically.\n\n0:15:36\tSPEAKER_03\n You need some relative relation.\n\n0:15:41\tSPEAKER_03\n Absolute number doesn't tell you the right thing.\n\n0:15:43\tSPEAKER_03\n You need to compare it to something else.\n\n0:15:46\tSPEAKER_03\n But it's what's happening in a closed neighborhood.\n\n0:15:49\tSPEAKER_03\n So if you are making a decision what's happening at one kilohertz, you want to know what's happening at 900 hertz.\n\n0:15:55\tSPEAKER_03\n And maybe at 1100 hertz.\n\n0:15:57\tSPEAKER_03\n But you don't much care what's happening at three kilohertz.\n\n0:16:00\tSPEAKER_04\n So it's really, it's sort of like saying that what's happening at one kilohertz depends on what's happening around it.\n\n0:16:07\tSPEAKER_04\n It's sort of relative.\n\n0:16:08\tSPEAKER_03\n To some extent it's also true.\n\n0:16:11\tSPEAKER_03\n But for instance, what humans are very much capable of doing is that if they are exactly the same thing happening in two neighboring critical bands, the cognition can discard it.\n\n0:16:27\tSPEAKER_03\n This what's happening.\n\n0:16:28\tSPEAKER_03\n Hey, okay, we need another voice here.\n\n0:16:33\tSPEAKER_03\n Yeah, I think so.\n\n0:16:35\tSPEAKER_03\n So, so for instance, if you if you if you add the noise, then normally masks the signal.\n\n0:16:48\tSPEAKER_03\n And you can show that if you add the noise outside the critical band that doesn't affect the decisions you making about the signal within a critical band.\n\n0:16:59\tSPEAKER_03\n Unless this noise is modulated.\n\n0:17:01\tSPEAKER_03\n But the noise is modulated with the same modulation frequency as the noise in a critical band.\n\n0:17:07\tSPEAKER_03\n The amount of masking is less.\n\n0:17:09\tSPEAKER_03\n The moment you moment you provide the noise in neighboring critical bands.\n\n0:17:14\tSPEAKER_03\n So the masking can normally it looks like sort of I start from from here.\n\n0:17:19\tSPEAKER_03\n So you have no noise.\n\n0:17:21\tSPEAKER_03\n Then you you are expanding the critical band.\n\n0:17:24\tSPEAKER_03\n So the amount of marking is increasing.\n\n0:17:27\tSPEAKER_03\n And when you hit certain point which is critical band, then the amount of masking is the same.\n\n0:17:33\tSPEAKER_03\n So that's the famous experiment of lecture a long time ago.\n\n0:17:37\tSPEAKER_03\n That's where people start thinking, wow, this is interesting.\n\n0:17:40\tSPEAKER_03\n So but if you if you if you modulate the noise, the masking goes up and the moment you start hitting the another critical band, the masking goes down.\n\n0:17:51\tSPEAKER_03\n So essentially that's a very clear indication that that that cognition can take into consideration was happening in the neighboring bands.\n\n0:18:03\tSPEAKER_03\n But if you go too far, you know, if you if the noise is very broad, you are not increasing much more.\n\n0:18:10\tSPEAKER_03\n So if you if you are far away from the signal, the frequency which the signal is, then even when the noise is commodulated, it's not helping you much.\n\n0:18:22\tSPEAKER_03\n So so things like this we are kind of playing with and with with the hope that perhaps we could eventually use this in a in a real recognizer.\n\n0:18:35\tSPEAKER_03\n Like partially, of course, we promise to do this on the the roar.\n\n0:18:41\tSPEAKER_04\n Probably won't have anything before the next time we have to evaluate.\n\n0:18:46\tSPEAKER_03\n Probably not.\n\n0:18:47\tSPEAKER_03\n And the most likely we will not have anything which which would comply with the rules.\n\n0:18:52\tSPEAKER_03\n Like because latency currently traps require significant latency.\n\n0:19:00\tSPEAKER_03\n A amount of processing because we don't know any better yet than to use the neural and classifiers in the traps.\n\n0:19:09\tSPEAKER_03\n Though the work which by is looking at now aims at trying to find out what to do with this vector so that a simple Gaussian classifier would be happier with it.\n\n0:19:22\tSPEAKER_03\n Or to what extent the Gaussian classifier should be unhappy and how to gocheneize the vector center.\n\n0:19:30\tSPEAKER_03\n So this is so what's happening.\n\n0:19:32\tSPEAKER_03\n And Sunil asked me for one month's vacation and since he didn't take any vacation for two years I had no I didn't have a heart to tell him no.\n\n0:19:43\tSPEAKER_03\n So he is in India.\n\n0:19:45\tSPEAKER_03\n Wow.\n\n0:19:46\tSPEAKER_03\n And getting married or something.\n\n0:19:48\tSPEAKER_03\n Well, he may be looking for a guy.\n\n0:19:51\tSPEAKER_03\n I don't I don't ask.\n\n0:19:54\tSPEAKER_03\n I know that when last time Narend did that he came back engaged.\n\n0:19:58\tSPEAKER_03\n Right.\n\n0:19:59\tSPEAKER_03\n I mean I've known other friends who I know.\n\n0:20:01\tSPEAKER_04\n They go back home in India for a month to come back married.\n\n0:20:04\tSPEAKER_03\n I know.\n\n0:20:05\tSPEAKER_03\n I know.\n\n0:20:06\tSPEAKER_03\n And then of course then what happened with Narend was that he started pushing me that he needs to get a PhD because they wouldn't give him his wife.\n\n0:20:12\tSPEAKER_03\n And she's very pretty and he loves her.\n\n0:20:16\tSPEAKER_04\n So we had to really finally had some incentive.\n\n0:20:18\tSPEAKER_03\n Oh yeah.\n\n0:20:19\tSPEAKER_03\n Well I had an incentive because he always had this plan except he never told me.\n\n0:20:24\tSPEAKER_03\n Sort of figured that he told me the day when we did very well at this evaluation of speaker recognition technology and he was involved there.\n\n0:20:35\tSPEAKER_03\n We were after presentation, we were driving home and he told me.\n\n0:20:39\tSPEAKER_03\n When did you were happy?\n\n0:20:41\tSPEAKER_03\n Yeah so I said well okay so he took another three quarter of the year but he was out.\n\n0:20:47\tSPEAKER_03\n So I wouldn't surprise me if he has a plan like that though though probably but still needs to get out first.\n\n0:20:55\tSPEAKER_03\n Good advice there a year earlier and such he needs to get out very first because he already has a four years served.\n\n0:21:05\tSPEAKER_03\n One year he was getting masters.\n\n0:21:09\tSPEAKER_04\n So when is the next evaluation?\n\n0:21:12\tSPEAKER_04\n June or something?\n\n0:21:13\tSPEAKER_03\n Which speaker recognition?\n\n0:21:15\tSPEAKER_03\n No for Aurora.\n\n0:21:16\tSPEAKER_03\n There have been no evaluation.\n\n0:21:19\tSPEAKER_03\n Next meeting is in June.\n\n0:21:21\tSPEAKER_03\n But like getting together are people supposed to rerun their system?\n\n0:21:28\tSPEAKER_03\n Nobody said that yet I assume so but nobody even said up yet the date for delivering and pointed data.\n\n0:21:37\tSPEAKER_03\n Wow.\n\n0:21:38\tSPEAKER_03\n That sort of stuff.\n\n0:21:39\tSPEAKER_03\n But what I think would be of course extremely useful if we can come to an next meeting and say well you know we did get 50% improvement.\n\n0:21:51\tSPEAKER_03\n If you are interested we eventually can tell you how but we can get 50% improvement because people will be saying it's impossible.\n\n0:22:01\tSPEAKER_04\n Do you know what the new baseline is?\n\n0:22:03\tSPEAKER_03\n I guess 22% better than old baseline.\n\n0:22:08\tSPEAKER_04\n Using your voice acting?\n\n0:22:10\tSPEAKER_03\n Yes.\n\n0:22:11\tSPEAKER_03\n But I assume that it will be similar.\n\n0:22:13\tSPEAKER_03\n I don't see the reason why it shouldn't be.\n\n0:22:15\tSPEAKER_03\n I don't see reason why it should be worse.\n\n0:22:18\tSPEAKER_03\n If it is worse then we will raise the objection and say well you know how come because we just use our voice activity detector which we don't claim even that it's wonderful.\n\n0:22:27\tSPEAKER_03\n It's just like one of them.\n\n0:22:29\tSPEAKER_03\n We get this sort of improvement how come that we don't see it on the other end pointed.\n\n0:22:35\tSPEAKER_02\n I guess it could be even better because the voice activity detector that they choose is something that cheating.\n\n0:22:44\tSPEAKER_02\n It's using the alignment of the spiritual cognition system.\n\n0:22:46\tSPEAKER_02\n Only the alignment from the King channel.\n\n0:22:49\tSPEAKER_03\n David told me yesterday or Harry, he told Harry from Qualcomm and Harry brought up his suggestion we should still go for 50%.\n\n0:22:59\tSPEAKER_03\n He says are you aware that your system does only 30% comparing to the baseline.\n\n0:23:07\tSPEAKER_03\n So they must have run already something.\n\n0:23:09\tSPEAKER_03\n So and Harry said yeah but I mean we think that we didn't say the last word yet that we have other things which we can try.\n\n0:23:22\tSPEAKER_03\n So there's a lot of discussion now about this new criterion because Nokia was objecting with Qualcomm's we basically supported that.\n\n0:23:32\tSPEAKER_03\n He said yes.\n\n0:23:33\tSPEAKER_03\n Now everybody else is saying well you guys must be out of your mind.\n\n0:23:37\tSPEAKER_03\n The Ginta here who doesn't speak for Ericsson anymore because he is not with Ericsson and Ericsson may not maybe draw from horror activity because they have so many troubles now.\n\n0:23:48\tSPEAKER_03\n Ericsson is laying off 20% of people.\n\n0:23:51\tSPEAKER_03\n Where's Ginta?\n\n0:23:53\tSPEAKER_03\n Ginta is already he got the job or he was working only for past two years or three years.\n\n0:23:58\tSPEAKER_03\n He got the job some factual.\n\n0:24:02\tSPEAKER_03\n Technical college not too far from Archen.\n\n0:24:05\tSPEAKER_03\n So it's like university professor and not quite a university not quite a sort of Archen university but it's a good school and he's happy.\n\n0:24:17\tSPEAKER_03\n And he was hoping to work with Ericsson like on a consulting basis but right now he doesn't look like that.\n\n0:24:27\tSPEAKER_03\n Anybody is even thinking about speech recognition.\n\n0:24:30\tSPEAKER_03\n He's thinking about survival.\n\n0:24:34\tSPEAKER_03\n So this is being discussed right now and it's possible that it may get through that we will still stick to 50%.\n\n0:24:47\tSPEAKER_03\n That means that nobody will probably get this improvement with the current system.\n\n0:24:53\tSPEAKER_03\n Which essentially I think we should be happy with because they would mean that at least people may be forced to look into alternative solutions.\n\n0:25:04\tSPEAKER_02\n But maybe we're not too far from 50% from the new deadline.\n\n0:25:10\tSPEAKER_02\n But not 60% over the current baseline.\n\n0:25:15\tSPEAKER_03\n We're getting there.\n\n0:25:18\tSPEAKER_05\n We are on 50, 55.\n\n0:25:23\tSPEAKER_03\n Is it like how did you come up with this number if you improved by 20% of all the deadlines?\n\n0:25:30\tSPEAKER_03\n It's just a kind of quick competition.\n\n0:25:32\tSPEAKER_02\n I don't know exactly if it depends on the weightings.\n\n0:25:39\tSPEAKER_04\n How's your documentation or what was you guys working on last week?\n\n0:25:55\tSPEAKER_02\n Finally we've not finished with this.\n\n0:26:02\tSPEAKER_01\n Yes, I do read another more time to improve the English and maybe to finish something in a small detail.\n\n0:26:10\tSPEAKER_01\n Something like that but it's more or less ready.\n\n0:26:13\tSPEAKER_02\n Yes.\n\n0:26:14\tSPEAKER_02\n What do we have to do to explain?\n\n0:26:17\tSPEAKER_02\n To include the experiments.\n\n0:26:28\tSPEAKER_04\n Have you been running some new experiments?\n\n0:26:30\tSPEAKER_04\n I thought I saw some jobs of yours running on it.\n\n0:26:32\tSPEAKER_02\n Yes, right.\n\n0:26:33\tSPEAKER_02\n We've done some strange things like removing C0 or C1 from the factor of parameters.\n\n0:26:44\tSPEAKER_02\n We noticed that C1 is almost not useful at all.\n\n0:26:48\tSPEAKER_02\n You can remove it from the factor.\n\n0:26:50\tSPEAKER_02\n It doesn't hurt.\n\n0:26:51\tSPEAKER_02\n Is this in the baseline?\n\n0:26:55\tSPEAKER_02\n In the nozzle.\n\n0:27:00\tSPEAKER_03\n So we were just discussing, since you mentioned that, driving in the car with Morgan this morning, we were discussing a good experiment for beginning graduate student who wants to get a lot of numbers from something.\n\n0:27:16\tSPEAKER_03\n Which is, imagine that you will start putting any coefficient which you are using in your vector in some general power.\n\n0:27:28\tSPEAKER_03\n General power.\n\n0:27:29\tSPEAKER_03\n Sort of you take a square root of something.\n\n0:27:34\tSPEAKER_03\n So suppose that you are working with C1.\n\n0:27:39\tSPEAKER_03\n So if you put it in a square root that effectively makes your model half as efficient.\n\n0:27:47\tSPEAKER_03\n Because a Gaussian mixture model, right, computes the mean.\n\n0:27:54\tSPEAKER_03\n But the mean is an exponent of the, whatever, your compression range.\n\n0:28:02\tSPEAKER_03\n So you compress in the range of this coefficient.\n\n0:28:05\tSPEAKER_03\n So it's becoming less efficient.\n\n0:28:08\tSPEAKER_03\n So Morgan was initially saying, well, this might be the alternative way how to play with a fetch factor.\n\n0:28:18\tSPEAKER_03\n You know, just compress the whole vector.\n\n0:28:20\tSPEAKER_03\n And I said, well, in that case, why don't we just start compressing individual elements like when, because in all days, we were doing, when people still were doing template matching and, you know, the distances, we were doing this liftering of parameters, right?\n\n0:28:34\tSPEAKER_03\n Because we observed that higher parameters were more important than lower for recognition.\n\n0:28:39\tSPEAKER_03\n Right.\n\n0:28:40\tSPEAKER_03\n Basically, that C1 contributes mainly slope and it's highly affected by frequency response of the recording equipment and that sort of thing.\n\n0:28:51\tSPEAKER_03\n So we were coming with all these various lifters.\n\n0:28:55\tSPEAKER_03\n Bell ups had this raised cosine lifter which still I think is built into a HTK.\n\n0:29:02\tSPEAKER_03\n All of the reasons unknown to everybody, but we had exponentially if there are triangle or if there is a number of lifters.\n\n0:29:13\tSPEAKER_03\n And so they may be a way to, to fill it with the insertion, insertion, as well as the deletions or giving a relative, physically modifying, rather important of various parameters.\n\n0:29:26\tSPEAKER_03\n The only, of course, problem is that there is infinite number of combinations.\n\n0:29:30\tSPEAKER_03\n You need a lot of graduate students and a lot of computing power.\n\n0:29:37\tSPEAKER_04\n Genetic algorithm basically tries to write them.\n\n0:29:40\tSPEAKER_03\n Exactly.\n\n0:29:41\tSPEAKER_03\n Oh.\n\n0:29:42\tSPEAKER_03\n If you were Bell ups or I shouldn't be saying this on a mic, right?\n\n0:29:48\tSPEAKER_03\n Or I'd be, that's what maybe is for somebody who would be doing.\n\n0:29:53\tSPEAKER_03\n I mean, the places which have a lot of computing power.\n\n0:29:57\tSPEAKER_03\n Because it is really, it's, it will be reasonable search.\n\n0:30:03\tSPEAKER_03\n But I wonder if there is in some way of doing this.\n\n0:30:08\tSPEAKER_03\n Search, like when we are searching, say for best discriminants.\n\n0:30:13\tSPEAKER_04\n You know, actually, I don't know that this wouldn't be all that bad.\n\n0:30:15\tSPEAKER_04\n I mean, you compute the features once, right?\n\n0:30:18\tSPEAKER_04\n And then, these exponents are just applied.\n\n0:30:21\tSPEAKER_03\n And everything is fixed.\n\n0:30:23\tSPEAKER_03\n Everything is fixed.\n\n0:30:24\tSPEAKER_04\n Is something that you would adjust for training or only recognition?\n\n0:30:27\tSPEAKER_04\n For both.\n\n0:30:28\tSPEAKER_04\n You would have to do it on both.\n\n0:30:29\tSPEAKER_03\n Yes.\n\n0:30:30\tSPEAKER_03\n You have to do both, both.\n\n0:30:31\tSPEAKER_03\n Because essentially you are saying this feature is not important.\n\n0:30:35\tSPEAKER_03\n Or less important.\n\n0:30:36\tSPEAKER_03\n So that's a painful one, yeah.\n\n0:30:39\tSPEAKER_04\n So for each set of exponents that you would try to repair a training.\n\n0:30:44\tSPEAKER_03\n But wait a minute.\n\n0:30:45\tSPEAKER_03\n You may not need to retrain the model.\n\n0:30:48\tSPEAKER_03\n You just may need to give less weight to a component of the model, which represents this particular feature.\n\n0:30:59\tSPEAKER_03\n You don't have to retrain it.\n\n0:31:00\tSPEAKER_04\n So if you, instead of altering the feature vectors.\n\n0:31:02\tSPEAKER_03\n You just multiply.\n\n0:31:04\tSPEAKER_04\n You modify the Gaussian.\n\n0:31:07\tSPEAKER_03\n You modify the Gaussian in a model.\n\n0:31:09\tSPEAKER_03\n But in a test data, you would have to put it in the power.\n\n0:31:11\tSPEAKER_03\n But in a training, in a training model, all you would have to do is to multiply.\n\n0:31:18\tSPEAKER_03\n And I, a model, I appropriate a constant.\n\n0:31:21\tSPEAKER_04\n But why, if you're altering the model, why would, in the test data, why would you have to mark with the capture footage?\n\n0:31:27\tSPEAKER_03\n Because in the test data, you can't, don't have a model.\n\n0:31:30\tSPEAKER_03\n You have only data.\n\n0:31:31\tSPEAKER_04\n I think you're running your data through that same model.\n\n0:31:35\tSPEAKER_03\n That is true.\n\n0:31:36\tSPEAKER_03\n I mean, so what do you want to do?\n\n0:31:37\tSPEAKER_03\n You want to say if, if you observe something like Stefan observes, that C1 is not important.\n\n0:31:43\tSPEAKER_03\n You can do two things.\n\n0:31:45\tSPEAKER_03\n If you have a trained recognizer in the model, you know the component, which, I mean, the dimension.\n\n0:31:53\tSPEAKER_04\n All of the mean and variances that correspond to Stefan's.\n\n0:31:56\tSPEAKER_03\n You know it.\n\n0:31:57\tSPEAKER_03\n But what I'm proposing now, if it is important, but not as important, you multiply it by 0.1 in a model.\n\n0:32:04\tSPEAKER_03\n But what do you multiply?\n\n0:32:06\tSPEAKER_04\n Because those are means, right?\n\n0:32:08\tSPEAKER_06\n You multiply in a standard deviation.\n\n0:32:10\tSPEAKER_03\n I think that you multiplied, I would have to look in the math.\n\n0:32:13\tSPEAKER_03\n I mean, how does the, yeah.\n\n0:32:15\tSPEAKER_04\n I think you'd have to modify the standard deviation or something.\n\n0:32:18\tSPEAKER_03\n Yeah.\n\n0:32:19\tSPEAKER_03\n Effectively, that's what you do.\n\n0:32:23\tSPEAKER_03\n That's what you do.\n\n0:32:24\tSPEAKER_03\n You modify the standard deviation as it was trained.\n\n0:32:29\tSPEAKER_03\n Effectively, you know, in front of the model, you put a constant.\n\n0:32:35\tSPEAKER_03\n Yeah, effectively what you do is you are modifying the deviation.\n\n0:32:39\tSPEAKER_03\n Right?\n\n0:32:40\tSPEAKER_03\n Spread, right?\n\n0:32:41\tSPEAKER_03\n Yeah, spread.\n\n0:32:42\tSPEAKER_06\n So same, same mean.\n\n0:32:43\tSPEAKER_04\n And, and, and, and, so by making the standard deviation narrower, your scores get worse for, unless it's exactly right on the mean.\n\n0:32:53\tSPEAKER_03\n Yes, no, by making it narrower, you're allowing all as variance.\n\n0:32:58\tSPEAKER_03\n Yes, so you're making this particular dimension less important.\n\n0:33:02\tSPEAKER_03\n Because what you have to do, fitting is the multi-dimensional machine, right?\n\n0:33:06\tSPEAKER_03\n It's a, it has a set in nine dimensions.\n\n0:33:09\tSPEAKER_03\n Or, set in dimensions, if you ignore delts, doesn't double delts.\n\n0:33:13\tSPEAKER_03\n So in order, if you, in order to make dimension which, which step and sees less important, I mean, not useful, less important, what you do is that this particular component in a model, you can multiply by, you can, you can basically, deweight it in a model.\n\n0:33:31\tSPEAKER_03\n But you can't do it in a, in a test data, because you don't have a model for, I mean, the test comes, but what you can do is that you put this particular component in, in, you, you compress it, that becomes a, it gets less variance, subsequently becomes less important.\n\n0:33:50\tSPEAKER_04\n You just do that to the test data and not do anything with your training.\n\n0:33:54\tSPEAKER_03\n That would be very bad, because your model was trained expecting, that wouldn't work.\n\n0:34:01\tSPEAKER_03\n Because your model was trained expecting the certain variance, variance on C1.\n\n0:34:06\tSPEAKER_03\n And because some other things, C1 is important.\n\n0:34:09\tSPEAKER_03\n After you trained the model, you sort of, you could do, you could do still what I was proposing initially, that during the training, you, you compress C1.\n\n0:34:22\tSPEAKER_03\n That becomes, then it becomes less important in a training.\n\n0:34:27\tSPEAKER_03\n And if you have, if you want to run an extensive experiment without retraining the model, you don't have to retrain the model.\n\n0:34:34\tSPEAKER_03\n You train it on the original vector.\n\n0:34:37\tSPEAKER_03\n But after you, when you are doing this parametric study of importance of C1, you will deweight C1 component in the model, and you will put in, it will compress the, this component in a test data.\n\n0:34:53\tSPEAKER_04\n Could you also, if you wanted to, by the same amount?\n\n0:34:56\tSPEAKER_04\n If you wanted to try an experiment, by leaving out, say, C1, couldn't you, in your test data, modify the, all of the C1 values to be, um, way outside of the normal range of the Gaussian, or C1 that was trained in the model, so that effectively, the C1 never really contributes to the score.\n\n0:35:23\tSPEAKER_03\n No, that would be C1 mismatch, right?\n\n0:35:26\tSPEAKER_03\n What do you have?\n\n0:35:27\tSPEAKER_03\n Yeah.\n\n0:35:28\tSPEAKER_03\n No, you don't do one that, because that would, that your model would be unlikely, your likelihood would be low, right?\n\n0:35:34\tSPEAKER_03\n Because you would be providing C1 mismatch.\n\n0:35:36\tSPEAKER_04\n But what if you set it to the mean of the model then?\n\n0:35:41\tSPEAKER_04\n And it was a, you set all C1s coming in through your test data, you, you change whatever value was there to the mean that your model had.\n\n0:35:50\tSPEAKER_03\n No, that would be very good match, right?\n\n0:35:52\tSPEAKER_03\n Yeah.\n\n0:35:53\tSPEAKER_03\n But you have several means, so.\n\n0:35:55\tSPEAKER_03\n I see what you are saying, but, no, no, I don't think that it would be the same, let me, you set it to a mean that would, no, you can't do that.\n\n0:36:05\tSPEAKER_03\n That's true, right?\n\n0:36:06\tSPEAKER_03\n You can't, you can't, Chuck, you can't do that.\n\n0:36:08\tSPEAKER_03\n Yeah.\n\n0:36:09\tSPEAKER_03\n Because that would be a really, fiddling with the data, you can't do that.\n\n0:36:13\tSPEAKER_03\n But what you can do, I'm confident, well, I'm reasonably confident and I'm putting in on the record, right?\n\n0:36:19\tSPEAKER_03\n I mean, people will listen to it for centuries now.\n\n0:36:22\tSPEAKER_03\n Yes, what you can do is you train the model with the, with the original data.\n\n0:36:30\tSPEAKER_03\n Then you decide that you want to see how important C, C1 is.\n\n0:36:35\tSPEAKER_03\n So what you will do is that the component in the model for C1, you will divide it by two and you will compare your test data by square root.\n\n0:36:49\tSPEAKER_03\n Then you will still have a perfect match except that this component of C1 will be half as important in an overall score.\n\n0:36:57\tSPEAKER_03\n Then you divide it by four and you take a square root.\n\n0:37:02\tSPEAKER_03\n Then if you think that some component is more important than it is based on training, then you multiply this particular component in the model by, by, yeah.\n\n0:37:18\tSPEAKER_03\n You multiply this component by number larger than one and you put your data in the power higher than one.\n\n0:37:27\tSPEAKER_03\n Then it becomes more important in the overall score, I believe.\n\n0:37:30\tSPEAKER_03\n But you have to do something to the mean also?\n\n0:37:33\tSPEAKER_02\n No, no.\n\n0:37:34\tSPEAKER_02\n But I think it's the variance is on the denominator in the Gaussian equation.\n\n0:37:41\tSPEAKER_02\n So I think it's maybe it's the contrary.\n\n0:37:44\tSPEAKER_02\n If you want to decrease the importance of parameters, you have to increase its variance.\n\n0:37:51\tSPEAKER_03\n Exactly.\n\n0:37:52\tSPEAKER_03\n So you may want to do it the other way around.\n\n0:37:56\tSPEAKER_04\n But if your original data for C1 had a mean of two and now you're changing that by squaring it, now your mean of your C1 original data has is four.\n\n0:38:16\tSPEAKER_04\n But your model still has a mean of two.\n\n0:38:19\tSPEAKER_04\n So even though you've expanded the range, your mean doesn't match anymore.\n\n0:38:23\tSPEAKER_02\n You're going to see.\n\n0:38:27\tSPEAKER_02\n I think what I see, what could be done is you don't change your features, which are computed once for all.\n\n0:38:34\tSPEAKER_02\n But you just tune the model.\n\n0:38:36\tSPEAKER_02\n So you have your features, you train your model on these features.\n\n0:38:41\tSPEAKER_02\n And then if you want to decrease the importance of C1, you just take the variance of the C1 component in the model and increase it if you want to decrease the importance of C1 or\n\n0:38:53\tSPEAKER_03\n increase it. You would have to modify the mean in the model.\n\n0:38:57\tSPEAKER_03\n I agree with you.\n\n0:38:59\tSPEAKER_03\n But it's doable, right?\n\n0:39:02\tSPEAKER_03\n It's predictable.\n\n0:39:03\tSPEAKER_03\n It's predictable.\n\n0:39:04\tSPEAKER_03\n Yeah, yeah, yeah, it's predictable.\n\n0:39:05\tSPEAKER_04\n But there's a simple thing, you could just just adjust the variance to get the effect I think that you're talking about.\n\n0:39:14\tSPEAKER_04\n It might be.\n\n0:39:15\tSPEAKER_04\n Could increase the variance to decrease the importance?\n\n0:39:18\tSPEAKER_04\n Yeah, because if you had a huge variance, it becomes a large number of you in a very small contribution.\n\n0:39:25\tSPEAKER_04\n Yeah.\n\n0:39:26\tSPEAKER_06\n The sharper the variance, the more important.\n\n0:39:31\tSPEAKER_04\n Yeah, you know, actually this reminds me of something that happened.\n\n0:39:35\tSPEAKER_04\n When I was at VBN, we were playing with putting pitch into the Mandarin recognizer.\n\n0:39:41\tSPEAKER_04\n And this particular pitch algorithm, when it didn't think there was any voicing, was spitting out zeros.\n\n0:39:47\tSPEAKER_04\n So we were getting, when we did clustering, we were getting groups of new OLA, with the mean of zero and basically zero variance.\n\n0:40:00\tSPEAKER_04\n So when any time any one of those vectors came in the head of zero and we got a great score, I mean it was just, you know, incredibly high score.\n\n0:40:09\tSPEAKER_04\n And so that was thrown everything off.\n\n0:40:11\tSPEAKER_04\n So if you have very small variance, you get really good scores when you get something that matches.\n\n0:40:18\tSPEAKER_04\n So that's a way, yeah.\n\n0:40:19\tSPEAKER_04\n Yeah, that's a way to increase the variance.\n\n0:40:22\tSPEAKER_04\n Yeah, that's interesting.\n\n0:40:23\tSPEAKER_04\n So in fact, that would be, that doesn't require any retraining.\n\n0:40:27\tSPEAKER_04\n Yeah, that's right.\n\n0:40:29\tSPEAKER_02\n So that means it's just, it's using the mother's and this thing.\n\n0:40:32\tSPEAKER_04\n Yeah.\n\n0:40:33\tSPEAKER_04\n So that would be, you modify the models, you could copy of your models with whatever variance modifications you make and rerun.\n\n0:40:41\tSPEAKER_04\n And then do a whole bunch of those.\n\n0:40:44\tSPEAKER_04\n That could be set up fairly easily, I think.\n\n0:40:46\tSPEAKER_04\n And you have a whole bunch of, you know, Chuck is getting his head in trouble.\n\n0:40:51\tSPEAKER_04\n That's an interesting idea, actually.\n\n0:40:57\tSPEAKER_04\n For testing me.\n\n0:40:58\tSPEAKER_04\n Yeah.\n\n0:40:59\tSPEAKER_06\n Did you say you got these HTKs set up on the new Linux box?\n\n0:41:05\tSPEAKER_04\n That's right.\n\n0:41:06\tSPEAKER_04\n In fact, and they're just, right now they're installing, increasing the memory on that.\n\n0:41:10\tSPEAKER_03\n And Chuck is sort of really fishing for how to keep his computer busy.\n\n0:41:14\tSPEAKER_03\n Yeah.\n\n0:41:15\tSPEAKER_03\n Absent.\n\n0:41:16\tSPEAKER_03\n You know, that's five processors on that.\n\n0:41:18\tSPEAKER_03\n Yeah, that's a good thing because then you just write the do loops and you pretend like you are working while you are sort of, you can go fishing.\n\n0:41:26\tSPEAKER_03\n Yeah.\n\n0:41:27\tSPEAKER_03\n You have an encyclopedia?\n\n0:41:29\tSPEAKER_03\n Yeah.\n\n0:41:30\tSPEAKER_03\n You are sort of in this mode like all of the DARPA people.\n\n0:41:35\tSPEAKER_03\n I've seen cities on the record.\n\n0:41:36\tSPEAKER_03\n I can say which company it was.\n\n0:41:39\tSPEAKER_03\n But it was reported to me that somebody visited a company and doing a discussion.\n\n0:41:46\tSPEAKER_03\n There was this guy who was always hitting the college returns on the computer.\n\n0:41:52\tSPEAKER_03\n So after two hours, the visitors were, why are you hitting this college again?\n\n0:41:57\tSPEAKER_03\n So well, you know, we have been paid by a computer.\n\n0:42:00\tSPEAKER_03\n I mean, we have a government contract and they pay us by by amount of computer time of use.\n\n0:42:06\tSPEAKER_03\n It was in all days when the PDP8 and it sort of think.\n\n0:42:10\tSPEAKER_03\n So we had to make it look like.\n\n0:42:15\tSPEAKER_03\n Because so they had, they literally had a monitor at the time, at the time, on a computer.\n\n0:42:20\tSPEAKER_03\n How much time is being spent?\n\n0:42:22\tSPEAKER_03\n Or on this particular project.\n\n0:42:25\tSPEAKER_03\n Nobody was looking, you know, what was coming up?\n\n0:42:28\tSPEAKER_04\n Have you ever seen those little, it's this thing that's a shape of a bird and has a red ball and it's big dips into the water?\n\n0:42:36\tSPEAKER_04\n So if you can hook that up so that it hit the keyboard.\n\n0:42:40\tSPEAKER_04\n Yeah.\n\n0:42:41\tSPEAKER_04\n That's an interesting thing.\n\n0:42:45\tSPEAKER_03\n It would be similar to a new, some people who were, they were seen in old communities, the Czechoslovakia, right?\n\n0:42:52\tSPEAKER_03\n So we were watching for American airplanes coming to spy on us at the time.\n\n0:42:57\tSPEAKER_03\n So there were three guys stationed in the middle of the woods on the van, lonely, watching the hour, pretty much spending even a half there because they were the service, right?\n\n0:43:08\tSPEAKER_03\n And so they very quickly, they made a difference with local guys and local people in the village and here.\n\n0:43:13\tSPEAKER_03\n And so, but they, there was one plane flying over, always above.\n\n0:43:18\tSPEAKER_03\n And so they was the only work they had.\n\n0:43:20\tSPEAKER_03\n They like, for in the afternoon they had to report, they was a plane from Prague to Bernal, basically, flying there.\n\n0:43:26\tSPEAKER_03\n So the very first thing was that they would always run back and, and for a clock and quickly make a call that plane is passing.\n\n0:43:36\tSPEAKER_03\n Then the second thing was that they, they took the line from this post to a local pub.\n\n0:43:41\tSPEAKER_03\n And they were calling from the pub.\n\n0:43:45\tSPEAKER_03\n But third thing, which they made, when they screwed up, finally they had to pass.\n\n0:43:48\tSPEAKER_03\n The pub owner to make this phone call.\n\n0:43:51\tSPEAKER_03\n They didn't even bother to be there anymore.\n\n0:43:54\tSPEAKER_03\n And one day there was, there was no plane.\n\n0:43:56\tSPEAKER_03\n At least they were sort of smart enough that they looked if the plane is flying there, right?\n\n0:44:01\tSPEAKER_03\n And the pub owner just, oh my, four o'clock, okay, quickly pick up the phone call and it is a plane flying.\n\n0:44:05\tSPEAKER_03\n There was no plane for some reason.\n\n0:44:07\tSPEAKER_03\n It was downed.\n\n0:44:08\tSPEAKER_03\n So they got in trouble.\n\n0:44:11\tSPEAKER_03\n But, but, that's a lot.\n\n0:44:18\tSPEAKER_04\n Maybe I could set that up.\n\n0:44:21\tSPEAKER_03\n Well, at least go test the assumption about C1, I mean, to begin with.\n\n0:44:26\tSPEAKER_03\n But then of course, one can then think about some predictable ways how to change all of them here.\n\n0:44:30\tSPEAKER_03\n They just like be used to do this, this dance measures.\n\n0:44:36\tSPEAKER_03\n It might be this.\n\n0:44:37\tSPEAKER_04\n So the first set of variants, waiting vectors would be just, you know, one modifying, one leaving the others the same.\n\n0:44:45\tSPEAKER_03\n Yeah.\n\n0:44:46\tSPEAKER_03\n And you do that for each one.\n\n0:44:48\tSPEAKER_03\n Because you see, I mean, what is happening here in the, in the, in the such a model is that it's, tell us you, yeah, what has a low variance is, is, is, is more reliable, right?\n\n0:44:58\tNone\n Yeah.\n\n0:44:59\tSPEAKER_05\n When the data matches that.\n\n0:45:01\tSPEAKER_04\n Yeah.\n\n0:45:02\tSPEAKER_04\n Yeah.\n\n0:45:03\tSPEAKER_04\n Yeah.\n\n0:45:04\tSPEAKER_03\n Yeah.\n\n0:45:05\tSPEAKER_03\n How do we know, especially when it comes to noise?\n\n0:45:08\tSPEAKER_04\n But there could just naturally be low variance.\n\n0:45:11\tSPEAKER_04\n Because I, I've noticed in the higher, capster coefficients, the numbers seem to get smaller, right?\n\n0:45:18\tSPEAKER_04\n So they just naturally, yeah.\n\n0:45:22\tSPEAKER_04\n Yeah.\n\n0:45:23\tSPEAKER_02\n They have smaller means also.\n\n0:45:24\tSPEAKER_04\n Yeah.\n\n0:45:25\tSPEAKER_04\n Exactly.\n\n0:45:26\tSPEAKER_04\n And so it seems like they're already sort of compressed.\n\n0:45:30\tSPEAKER_04\n The range.\n\n0:45:31\tSPEAKER_03\n Yeah.\n\n0:45:32\tSPEAKER_03\n That's why people use these lifters, so inverse variance waiting lifters basically, that makes, you can do in distance more like a, man, all this distance with a diagonal covariance and you use all the variances, where, over the all data, what they would do is that they would wait each coefficient by inverse of the variance.\n\n0:45:52\tSPEAKER_03\n Turns out that the variance decreases at least as fast, I believe, as an index of the capster coefficient.\n\n0:45:58\tSPEAKER_03\n I think you can show that analytically.\n\n0:46:01\tSPEAKER_03\n So typically what happens is that you need to wait the higher coefficient smaller than the lower coefficients.\n\n0:46:20\tSPEAKER_03\n So when we talked about Aurora still, I wanted to make a plea for, encourage for more communication between, between a different parts of the distributed center.\n\n0:46:40\tSPEAKER_03\n Even when there is absolutely nothing to say about it, whether it's good in work, in work, I'm sure that is being appreciated in Oregon and maybe it will generate a similar response here.\n\n0:46:51\tSPEAKER_02\n Can't set up a webcam maybe.\n\n0:46:55\tSPEAKER_02\n Yeah.\n\n0:46:56\tSPEAKER_03\n Well, you know, nowadays, yeah, it's up actually do ever almost.\n\n0:47:07\tSPEAKER_04\n Is the, if we mail to Aurora in house, does that go up to you guys also?\n\n0:47:13\tSPEAKER_04\n I don't think so.\n\n0:47:14\tSPEAKER_04\n No.\n\n0:47:15\tSPEAKER_04\n Okay.\n\n0:47:16\tSPEAKER_04\n So we should do that.\n\n0:47:17\tSPEAKER_04\n Do we have a mailing list that includes the OJIP?\n\n0:47:19\tSPEAKER_02\n No.\n\n0:47:20\tSPEAKER_04\n We don't do.\n\n0:47:21\tSPEAKER_04\n Oh.\n\n0:47:22\tSPEAKER_04\n Maybe we should set that up.\n\n0:47:23\tSPEAKER_03\n That would make it easier.\n\n0:47:24\tSPEAKER_03\n Yeah.\n\n0:47:25\tSPEAKER_04\n Yeah.\n\n0:47:26\tSPEAKER_03\n And then we also can send it to the same address, right?\n\n0:47:32\tSPEAKER_03\n And it goes to everybody.\n\n0:47:33\tNone\n Okay.\n\n0:47:34\tSPEAKER_03\n Because what's happening naturally in research, I know is that people essentially start working on something.\n\n0:47:43\tSPEAKER_03\n They don't want to be much bothered, right?\n\n0:47:44\tSPEAKER_03\n But what the, the, the, the danger is in a group like this is that two people are working on the same thing.\n\n0:47:50\tSPEAKER_03\n And of course, both of them come with a very good solution, but it could have been done somehow on a half of the effort.\n\n0:47:57\tSPEAKER_03\n Oh, that's another thing which I wanted to report.\n\n0:48:01\tSPEAKER_03\n Look-hash, I think, wrote a software for the Aurora 2 system.\n\n0:48:07\tSPEAKER_03\n Reasonably, the good one because he's doing it for Intel.\n\n0:48:11\tSPEAKER_03\n But I trust that we have a rights to use it or distribute it and everything.\n\n0:48:17\tSPEAKER_03\n Because Intel's intention originally was to distribute it free of charge anyways.\n\n0:48:22\tSPEAKER_03\n And so, so we make sure that at least you can see the software.\n\n0:48:28\tSPEAKER_03\n And if it is so-and-use, just that there might be a reasonable point for perhaps to start converging.\n\n0:48:37\tSPEAKER_03\n Because Morgan's point is that he's an experienced guy.\n\n0:48:40\tSPEAKER_03\n He says, well, you know, it's very difficult to collaborate if you are working with, supposedly, the same thing in quotes.\n\n0:48:46\tSPEAKER_03\n Except which is not the same, which one is using that set of filters and the other one is using another set of filters.\n\n0:48:56\tSPEAKER_03\n And then it's difficult to compare.\n\n0:49:02\tSPEAKER_02\n What about Harry?\n\n0:49:03\tSPEAKER_02\n We received a mid-nice tweak and he was starting to turn this on.\n\n0:49:07\tSPEAKER_02\n He got some experiments.\n\n0:49:09\tSPEAKER_02\n Yeah, they sent me.\n\n0:49:10\tSPEAKER_02\n And use this Intel.\n\n0:49:11\tSPEAKER_02\n Yeah, yeah.\n\n0:49:12\tSPEAKER_05\n Russian.\n\n0:49:13\tNone\n Yeah.\n\n0:49:14\tSPEAKER_03\n Because Intel paid us, should I say, on a microphone, some amount of money, not much.\n\n0:49:21\tSPEAKER_03\n Not much, I can say, on a microphone.\n\n0:49:23\tSPEAKER_03\n Much less than we should have gotten.\n\n0:49:24\tSPEAKER_03\n But it's a matter of work.\n\n0:49:28\tSPEAKER_03\n And they wanted to have a software so that they can also play with it.\n\n0:49:32\tSPEAKER_03\n Which means that it has to be in certain environment.\n\n0:49:34\tSPEAKER_03\n They use actually some Intel libraries.\n\n0:49:39\tSPEAKER_03\n But in the process, look at just re-road the whole thing.\n\n0:49:42\tSPEAKER_03\n Because he figured rather than trying to make sense of an including axis of the wear.\n\n0:49:50\tSPEAKER_03\n Not for training of the nets, but I think he re-roads the, or maybe somehow reused over the parts of the thing.\n\n0:49:58\tSPEAKER_03\n So that the whole thing, including MLP, trained MLP, is one piece of software.\n\n0:50:05\tSPEAKER_03\n Wow.\n\n0:50:06\tSPEAKER_03\n Is it useful?\n\n0:50:09\tSPEAKER_03\n Yeah.\n\n0:50:10\tSPEAKER_06\n I mean, I remember when we were trying to put together all the axis software for the submit.\n\n0:50:16\tSPEAKER_03\n That's what he was saying, right?\n\n0:50:17\tSPEAKER_03\n He said that it was like, it was like just so many libraries.\n\n0:50:20\tSPEAKER_03\n I'm not going to knew what was used when.\n\n0:50:24\tSPEAKER_03\n So that's where he started.\n\n0:50:25\tSPEAKER_03\n And that's where he realized that it needs to be.\n\n0:50:27\tSPEAKER_03\n It needs to be at least cleaned up.\n\n0:50:30\tSPEAKER_03\n And so I think it is available.\n\n0:50:33\tSPEAKER_02\n The only thing I would check is, does he use Intel?\n\n0:50:39\tSPEAKER_02\n That's the library.\n\n0:50:41\tSPEAKER_03\n If it's the case, maybe not in the first approximation.\n\n0:50:46\tSPEAKER_03\n Maybe not in the first approximation.\n\n0:50:47\tSPEAKER_03\n Because I think he started first with the plain C or C++ or something.\n\n0:50:53\tSPEAKER_03\n I can check on that.\n\n0:50:57\tSPEAKER_03\n And otherwise, Intel libraries, I think they are available freely.\n\n0:51:04\tSPEAKER_03\n They may be running only on Windows or on the Intel architecture.\n\n0:51:10\tSPEAKER_03\n Yeah, on Intel architecture, main or unknown sound.\n\n0:51:13\tSPEAKER_03\n That is possible.\n\n0:51:14\tSPEAKER_03\n That's why Intel, of course, is distributing.\n\n0:51:19\tSPEAKER_02\n Well, at least there are optimized versions for the architecture.\n\n0:51:25\tSPEAKER_02\n I don't know.\n\n0:51:26\tSPEAKER_02\n I never checked carefully this.\n\n0:51:29\tSPEAKER_03\n I know there were some issues that initially, of course, we do all the development on Linux.\n\n0:51:33\tSPEAKER_03\n But we have only three sounds.\n\n0:51:39\tSPEAKER_03\n And we have them only because they have a spare board.\n\n0:51:42\tSPEAKER_03\n Otherwise, almost exclusively, working with PCs now with Intel.\n\n0:51:49\tSPEAKER_03\n In that way, Intel succeeded in us because they gave us too many good machines for very little money or nothing.\n\n0:51:58\tSPEAKER_03\n So we run everything on Intel.\n\n0:52:02\tSPEAKER_04\n Does anybody have anything else?\n\n0:52:09\tSPEAKER_04\n So we read some digits?\n\n0:52:11\tSPEAKER_04\n Yeah.\n\n0:52:12\tSPEAKER_04\n Yes.\n\n0:52:13\tSPEAKER_04\n So, you never know.\n\n0:52:14\tSPEAKER_04\n We've ever done this way that it works is each person goes around in turn.\n\n0:52:18\tSPEAKER_04\n And you say the transcript number.\n\n0:52:21\tSPEAKER_04\n And then you read the digits, the strings of numbers as individual digits.\n\n0:52:26\tSPEAKER_04\n So you don't say 850, say 850.\n\n0:52:27\tSPEAKER_03\n OK.\n\n0:52:28\tSPEAKER_03\n OK.\n\n0:52:29\tSPEAKER_03\n So can I try maybe start there?\n\n0:52:31\tSPEAKER_03\n Sure.\n\n0:52:32\tSPEAKER_03\n This transcript L101, 850720538, 118, 528759, 961, 459500, 882758720, 9348, 36396545820, 8248, 36396545, 8248, 8208441810, 002586186551, 4374402890.\n\n0:53:19\tSPEAKER_04\n Transcript L102, 29564526, 768484913, 489025645223, 292901317, 80929366600, 567421337, 66833321, 032669137991.\n\n0:53:56\tSPEAKER_06\n Transcript L-103, 76377732, 21923460, 6314, 940853, 6862, 009187681809, 009434532, 711150319, 08323095, 4922986786.\n\n0:54:44\tSPEAKER_00\n Transcript L-104, 695007490.\n\n0:54:53\tSPEAKER_00\n 915005169, 9299151207, 853890321541, 2041138553775399817105082722691869352.\n\n0:55:38\tSPEAKER_02\n Transcript L-100014953649643373138811481203611078862765, 627114991, 6223682766914236458283, 09231750.\n\n", "summary": [{"summary_text": "French Telecom, Alcatel and Speaker are competitors. Speaker will make a report on what's happening in Aurora in general. French Telecom, Speaker and Alcatel both had voice activity that extra, so Speaker was working on voice activity extra for the past 4 months."}]}