{"filename": "./data/Bro005.txt", "transcript": "0:00:00\tSPEAKER_07\n Hey, Mike, Mike one.\n\n0:00:12\tNone\n Uh?\n\n0:00:14\tNone\n Yes, please.\n\n0:00:18\tSPEAKER_03\n I mean, we're testing oyster busting, but listen, you get to wait.\n\n0:00:28\tSPEAKER_02\n Okay, so, uh, we've got some, uh, Zerax things to pass out.\n\n0:00:34\tSPEAKER_07\n Yeah.\n\n0:00:42\tSPEAKER_07\n I'm sorry for the table, but...\n\n0:00:44\tNone\n There's a bruise.\n\n0:00:46\tSPEAKER_03\n This one's nice though.\n\n0:00:48\tSPEAKER_03\n This is the last column we use for imagination.\n\n0:00:52\tNone\n Okay.\n\n0:00:54\tSPEAKER_03\n Uh, this one's nice though.\n\n0:00:58\tSPEAKER_03\n This has nice big font.\n\n0:01:00\tSPEAKER_09\n Yeah.\n\n0:01:02\tSPEAKER_09\n Yeah.\n\n0:01:06\tSPEAKER_03\n Yeah.\n\n0:01:08\tSPEAKER_03\n You get older, you have these different perspectives.\n\n0:01:10\tSPEAKER_03\n I mean, lowering the word area to spine, but having big font.\n\n0:01:14\tSPEAKER_07\n Extending the width.\n\n0:01:16\tSPEAKER_07\n Put the cut off for some.\n\n0:01:20\tSPEAKER_04\n Yeah, it's a nice little big line.\n\n0:01:28\tSPEAKER_07\n Okay.\n\n0:01:30\tSPEAKER_07\n Okay.\n\n0:01:32\tSPEAKER_07\n So there is kind of summary of what has been done.\n\n0:01:36\tSPEAKER_07\n Oh, summary of experiments since, well, since last week and also since the...\n\n0:01:40\tSPEAKER_07\n We've started working this.\n\n0:01:44\tSPEAKER_07\n So since last week, we've started to fill the column with, uh, features with net strain on PLP with our nine normalization, but with delta also, because the column must not completely, what?\n\n0:02:00\tSPEAKER_07\n It's still not completely filled, but we have more results to compare with network using without BLP. And finally, delta seems very important.\n\n0:02:14\tSPEAKER_07\n I don't know if you take, um, let's say, anyway, or a 2B.\n\n0:02:22\tSPEAKER_07\n So the next, the second part of the table, uh, when we use the large training set using French Spanish and English, you have 106 without delta and 89 with the delta.\n\n0:02:36\tSPEAKER_03\n And again, all of these numbers are with 100% being the baseline performance, but with the no cap straw system going straight into the edge.\n\n0:02:48\tSPEAKER_07\n So now we see that the gap between the different training set is much, uh, much smaller.\n\n0:03:02\tSPEAKER_07\n But actually, for English training on timid is still better than the other languages.\n\n0:03:12\tSPEAKER_07\n And, yeah.\n\n0:03:18\tSPEAKER_07\n And also for Italian, actually. If you take the second set of experiment for Italian, so the mismatched condition, um, when we use the training on timid, so it's multi-english, we have 91 number, and training with other languages is a little bit worse.\n\n0:03:38\tSPEAKER_03\n Oh, I see it down near the bottom of this sheet.\n\n0:03:42\tSPEAKER_07\n So, yeah. And, yeah. And here, the gap is still more important between using delta and not using delta.\n\n0:03:52\tSPEAKER_07\n If I take the, the large training set, it's, we have 172, and 104 when we use delta.\n\n0:04:00\tSPEAKER_07\n Even if the context is quite the same because without delta, we use 17 frames.\n\n0:04:08\tSPEAKER_07\n Yeah. So, the second point is that we have no single cross-language experiments that we did not have last week.\n\n0:04:20\tSPEAKER_07\n So, this is training the net on French only, or on English only, and testing on Italian.\n\n0:04:28\tSPEAKER_07\n And training the net on French only, and Spanish only, and testing on the attitudes.\n\n0:04:36\tSPEAKER_07\n And, yeah. What we see is that these nets are not as good, except for the multi-english, which is always one of the best.\n\n0:04:48\tSPEAKER_07\n Yeah. Then, we've started to work on a large data base containing sentences from the French, from the Spanish, from the Tibet, from Spain, from English digits, and from Italian digits.\n\n0:05:14\tSPEAKER_07\n So, this is another line, another set of lines in the table, and left to the same as what it's fine.\n\n0:05:22\tSPEAKER_07\n And, actually, we did this before knowing the result about the delta. So, we have to redo the experiment training the net with PLP, but with delta.\n\n0:05:34\tSPEAKER_07\n But, this net performed quite well. It's better than the net using French, Spanish, and English.\n\n0:05:44\tSPEAKER_07\n So, we have also started feature combination experiments, mainly experiments using features and net outputs together.\n\n0:06:08\tSPEAKER_07\n And, this is the results on the other document.\n\n0:06:16\tSPEAKER_07\n We can discuss this after a problem, just to know if we need to.\n\n0:06:20\tSPEAKER_07\n Yeah. So, basically, there are four kind of systems. The first one is combine two feature streams using each feature stream as its own MLP, so it's similar to the tandem that was proposed for the first multi-stream tandem for the first proposal.\n\n0:06:42\tSPEAKER_07\n The second is using features and PLT transform MLP outputs, and the third one is to use a single PLT transform features as well as MLP outputs.\n\n0:06:58\tSPEAKER_07\n Yeah. You can command this result.\n\n0:07:06\tSPEAKER_08\n Yes, I would like to say that, for example, if we doesn't use the delta delta, we have an improve when we use some combination.\n\n0:07:24\tSPEAKER_07\n But, we... Just to clear the numbers here are recognition accuracy. So, it's another one.\n\n0:07:32\tSPEAKER_08\n Again, we switch to another one.\n\n0:07:34\tSPEAKER_08\n Yes, and the base line is 82.\n\n0:07:38\tSPEAKER_02\n The base line is 82.\n\n0:07:40\tSPEAKER_02\n Yeah.\n\n0:07:41\tSPEAKER_07\n So, it's experiment only on the Italian mismatched for the moment for this.\n\n0:07:46\tSPEAKER_08\n This is Italian mismatched. Okay, I move.\n\n0:07:56\tSPEAKER_08\n This is MLP, and it's obviously that the English MLP is dependent. For the rest of the experiment, I use multi-English, only multi-English.\n\n0:08:16\tSPEAKER_08\n The result is that the MSG-3 feature doesn't work for the Italian database, because it never helps to increase the algorithms.\n\n0:08:30\tSPEAKER_07\n Actually, if we look at the table, the huge table, we see that for TI digits, MLG performs as well as the PLP. But this is not a case for Italian.\n\n0:08:44\tSPEAKER_07\n Where the error rate is almost twice the error rate of PLP.\n\n0:08:50\tSPEAKER_07\n So, I don't think this is a bug, but this is something in probably the MLG process that...\n\n0:09:03\tSPEAKER_07\n I don't know what exactly perhaps the fact that there's no low pass filter, well, or low-prim phase filter, and that there is some VC offset in the Italian.\n\n0:09:15\tSPEAKER_07\n Well, something simple like that, but that we need to sort out if we want to get improvement by combining PLP and MSG, because on the moment the MSG doesn't bring much information.\n\n0:09:29\tSPEAKER_07\n And as Karman said, if we combine the two, we have the result basically of PLP.\n\n0:09:35\tSPEAKER_03\n The baseline system, when you said the baseline system was 82%, that was trained on what and tested on what.\n\n0:09:45\tSPEAKER_03\n That was Italian mismatched digits, is the testing, and the training is Italian digits.\n\n0:09:55\tSPEAKER_03\n So, the mismatch just refers to the noise and microphone, so forth. So, would that then correspond to the first line here of where the training is?\n\n0:10:13\tSPEAKER_03\n Is the Italian digits...\n\n0:10:15\tSPEAKER_08\n The training of the HTG?\n\n0:10:19\tSPEAKER_08\n Yes.\n\n0:10:20\tSPEAKER_03\n Training of the net, yeah. So, what that says is that in a matched condition, we end up with a fair amount worse putting in the PLP.\n\n0:10:32\tSPEAKER_03\n Now, do we have a number I suppose for the matched? I don't mean matched, but use of Italian training on Italian digits for PLP only.\n\n0:10:43\tSPEAKER_07\n So, basically this is in the table. So, the number is 52%.\n\n0:10:55\tSPEAKER_07\n 52% of 82% of 18%. So, it's error rate.\n\n0:11:03\tSPEAKER_07\n So, this is accuracy. So, we have 90%.\n\n0:11:13\tSPEAKER_07\n Which is what we have also if we use PLP and MSG together, 89.7%.\n\n0:11:22\tSPEAKER_03\n Okay, so, even just PLP, it is not in the matched condition. I wonder if it's the difference between PLP and Mellkebstra or whether it's that the net of some reason is...\n\n0:11:42\tSPEAKER_07\n...it's not PLP and Mellkebstra give the same result. Well, we have this result. It's not...\n\n0:11:52\tSPEAKER_07\n So, PLP is a result with PLP alone feeling HTK. That's what you mean. Just PLP.\n\n0:11:59\tSPEAKER_03\n So, PLP. So, adding MSG, well, but that's without the neural net, right?\n\n0:12:15\tSPEAKER_07\n Yeah, that's without the neural net. And that's the result, basically, that OGI as well. So, with the MFCC with online normalization.\n\n0:12:22\tSPEAKER_03\n But, she had said 82%.\n\n0:12:25\tSPEAKER_07\n But, this is without online normalization.\n\n0:12:29\tSPEAKER_07\n Oh, this is the 82.\n\n0:12:31\tSPEAKER_07\n 82 is the Aurora baseline. So, MFCC, then we can use...\n\n0:12:35\tSPEAKER_07\n Well, OGI, they use MFCC, the baseline MFCC plus online normalization.\n\n0:12:40\tSPEAKER_03\n I keep getting confused because this is accuracy.\n\n0:12:44\tSPEAKER_03\n Alright, alright. So, this is... I was thinking, this was worse. Okay, so, this is all better because...\n\n0:12:49\tSPEAKER_03\n I'm bigger than 82. Okay, I'm all better now. Okay.\n\n0:12:55\tSPEAKER_07\n So, what happens is that when we apply online normalization, we jump to almost 90%.\n\n0:13:04\tSPEAKER_07\n When we apply a neural network is the same. We jump to 90%.\n\n0:13:10\tSPEAKER_07\n And whatever the normalization actually, if we use a neural network, even if the features are not correctly normalized, we jump to 90%.\n\n0:13:21\tSPEAKER_03\n So, we go from 88.6 to 290.\n\n0:13:25\tSPEAKER_07\n No, I mean 90, it's around 89.\n\n0:13:28\tSPEAKER_07\n 89.\n\n0:13:29\tSPEAKER_03\n And then, adding MFCC does nothing, basically.\n\n0:13:33\tSPEAKER_07\n No.\n\n0:13:34\tSPEAKER_07\n Okay.\n\n0:13:36\tSPEAKER_07\n For Italian.\n\n0:13:38\tSPEAKER_07\n For this case, right?\n\n0:13:41\tSPEAKER_03\n Alright. So, actually, the answer for experiments with one is that adding MSG, if you does not help in that case...\n\n0:13:59\tSPEAKER_06\n But don't, it's really good.\n\n0:14:05\tSPEAKER_03\n And the multi-English does...\n\n0:14:11\tSPEAKER_03\n So, if we think of this as an error rate, we start off with 18% error rate, roughly.\n\n0:14:19\tSPEAKER_03\n And we almost cut that in half by putting in the online normalization and the neural net.\n\n0:14:32\tSPEAKER_03\n And the MSG doesn't, however, particularly affect things.\n\n0:14:37\tSPEAKER_03\n And we cut off, I guess, about 25% of the error.\n\n0:14:44\tSPEAKER_03\n No, not quite that. Is it 2.6?\n\n0:14:48\tSPEAKER_03\n Not 18, but 16% or something of the error.\n\n0:14:55\tSPEAKER_03\n If we use multi-English instead of the magic condition.\n\n0:14:59\tSPEAKER_03\n But the Italian track.\n\n0:15:02\tSPEAKER_03\n Yeah.\n\n0:15:03\tSPEAKER_03\n Okay.\n\n0:15:04\tSPEAKER_08\n We select these stats because it's the more difficult.\n\n0:15:10\tSPEAKER_03\n Yes. Good.\n\n0:15:13\tSPEAKER_03\n Okay. So, then, you're assuming multi-English is closer to the kind of thing that you could use, since you're not going to have magic data for the other languages and so forth.\n\n0:15:28\tSPEAKER_03\n One thing is that, I think I asked you this before, but I want to double check.\n\n0:15:33\tSPEAKER_03\n When you say ME in these other tests, that's the multi-English.\n\n0:15:39\tSPEAKER_03\n But it is not all of the multi-English, right?\n\n0:15:42\tSPEAKER_03\n It's a part of it.\n\n0:15:43\tSPEAKER_07\n It's a part of it.\n\n0:15:44\tSPEAKER_07\n Or one million frames.\n\n0:15:46\tSPEAKER_07\n And the multi-English is how much?\n\n0:15:49\tSPEAKER_07\n It's one million and the half.\n\n0:15:53\tSPEAKER_03\n Yeah.\n\n0:15:54\tSPEAKER_03\n Oh, so you use almost all these two thirds of it.\n\n0:15:57\tSPEAKER_03\n So, it still, it hurts you.\n\n0:16:00\tSPEAKER_03\n It seems to hurt you a fair amount to add in this French and Spanish.\n\n0:16:03\tSPEAKER_03\n Yep.\n\n0:16:04\tSPEAKER_02\n That's why it's too wide.\n\n0:16:07\tSPEAKER_01\n Well, Stefan was saying that they weren't hand-label.\n\n0:16:12\tSPEAKER_01\n Yeah.\n\n0:16:13\tSPEAKER_01\n Yeah, he's French and Spanish.\n\n0:16:15\tSPEAKER_01\n It's a bit...\n\n0:16:16\tSPEAKER_08\n Maybe for that.\n\n0:16:23\tSPEAKER_03\n Still.\n\n0:16:24\tSPEAKER_03\n Okay.\n\n0:16:25\tSPEAKER_03\n All right, go ahead.\n\n0:16:28\tSPEAKER_08\n And then...\n\n0:16:31\tSPEAKER_08\n With the experiment type 2, I first tried to combine some feature from the MLP and other feature.\n\n0:16:43\tSPEAKER_08\n Another feature.\n\n0:16:46\tSPEAKER_08\n And we can...\n\n0:16:49\tSPEAKER_08\n First, the feature are without Delta Delta Delta and we can see that in this situation, the MSG3, the same help, nothing.\n\n0:17:00\tSPEAKER_08\n And then I do the same, but with the Delta Delta Delta, PLP Delta Delta Delta.\n\n0:17:07\tSPEAKER_08\n And the output of the MLP is without Delta Delta Delta.\n\n0:17:13\tSPEAKER_08\n And we have a little bit less result than the...\n\n0:17:20\tSPEAKER_08\n The baseline PLP with Delta Delta Delta.\n\n0:17:26\tSPEAKER_08\n Maybe when we have the new...\n\n0:17:30\tSPEAKER_08\n The new neural network, China with PLP Delta Delta Delta, maybe the final result must be better.\n\n0:17:38\tSPEAKER_08\n I don't know.\n\n0:17:39\tSPEAKER_07\n Actually, it's just to be so more...\n\n0:17:42\tSPEAKER_07\n This number, this 87.1 number has to be compared with...\n\n0:17:50\tSPEAKER_03\n Yes, yeah, I mean, you can't compare with the other because this is a with multi-English training.\n\n0:17:54\tSPEAKER_03\n She has to compare it with the one over that you've got in a box, which is that 84.6.\n\n0:18:02\tSPEAKER_07\n So...\n\n0:18:03\tSPEAKER_07\n Yeah, but I mean, in this case, for the 87.1, we use MLP outputs for the PLP net and straight features with Delta Delta.\n\n0:18:11\tSPEAKER_07\n And straight features with Delta Delta gives you what's on the first G, 88.6.\n\n0:18:18\tSPEAKER_03\n No, no, no, no, not trained with multi-English.\n\n0:18:21\tSPEAKER_07\n Yeah, but this is the second configuration.\n\n0:18:24\tSPEAKER_07\n So we use feature or net outputs together with features.\n\n0:18:29\tSPEAKER_07\n So, yeah, this is not perhaps not clear in, but in this table, the first column is for MLP and the second is for the features.\n\n0:18:37\tSPEAKER_07\n So, you're saying, so, so, in the question, what, what has adding the MLP down?\n\n0:18:41\tSPEAKER_07\n Yeah, so, actually, it, it decrease the accuracy because we have 88.6 and even the MLP alone, what gives the MLP alone?\n\n0:18:52\tSPEAKER_07\n Multi-English PLP, oh no, it gives 83.6.\n\n0:18:58\tSPEAKER_07\n So, we have 83.6 and 88.6 that gives 87.1.\n\n0:19:05\tSPEAKER_03\n I thought it was 80.\n\n0:19:07\tSPEAKER_03\n Okay, 83.6 and 88.6.\n\n0:19:11\tSPEAKER_05\n Okay, is that right?\n\n0:19:13\tSPEAKER_08\n Yeah.\n\n0:19:14\tSPEAKER_08\n But, you don't know, but maybe if we have the neural network, it will be the PLP delta Delta Delta, maybe.\n\n0:19:24\tSPEAKER_08\n Perhaps, yeah.\n\n0:19:26\tSPEAKER_03\n But that's one thing. But see, the other thing is that, I mean, it's good to take the difficult case, but let's consider what that means.\n\n0:19:33\tSPEAKER_03\n What, what we're saying is that, one of the things that, I mean, my interpretation of your, your, your, your suggestion is something like this, as motivation.\n\n0:19:42\tSPEAKER_03\n When we train on data, that is in one sense or another similar to the testing data, then we get a wind by having a instrument in training.\n\n0:19:55\tSPEAKER_03\n When we train on something that's quite different, we have a potential to have some problems.\n\n0:20:00\tSPEAKER_03\n And, if we get something that helps us when it's somewhat similar and doesn't hurt us too much, when it, when it's quite different, that's maybe not so bad.\n\n0:20:12\tSPEAKER_03\n So, the question is, if you took the same combination and you tried it out on, on, on, on, say digits, you know, was that experiment done?\n\n0:20:22\tSPEAKER_03\n No, okay.\n\n0:20:23\tSPEAKER_03\n Then, does that, you know, maybe with similar noise conditions and so forth, does it, does it then look much better?\n\n0:20:30\tSPEAKER_03\n And so, what is the range over these different kinds of tests? So, anyway, okay.\n\n0:20:36\tSPEAKER_03\n Yes.\n\n0:20:37\tSPEAKER_08\n And, with this type of configuration, what I do, I experiment using the new neural net with, named BloodClath 27, and I have found more let the same result.\n\n0:20:55\tSPEAKER_07\n So, it's slightly better.\n\n0:20:58\tSPEAKER_07\n It's slightly better.\n\n0:20:59\tSPEAKER_08\n Yeah, it's better, yes, it's better.\n\n0:21:01\tSPEAKER_03\n And, and, you know, again, maybe if you use the delta there.\n\n0:21:06\tSPEAKER_03\n Yeah, maybe.\n\n0:21:07\tSPEAKER_03\n You bring it up to where it was, you know, at least about the same, for a difficult case.\n\n0:21:12\tSPEAKER_07\n Yeah, so, well, so perhaps let's, let's jump at the last experiment.\n\n0:21:16\tSPEAKER_07\n Yes.\n\n0:21:17\tSPEAKER_07\n It's either less information from the neural network, if we use only the silence output, it's again better.\n\n0:21:23\tSPEAKER_07\n So, it's 89.\n\n0:21:24\tSPEAKER_08\n 40, 40, 40, 40, because in the situation, we prefer one kind of answer.\n\n0:21:31\tSPEAKER_08\n Yeah.\n\n0:21:36\tSPEAKER_08\n And then, with the first configuration, I am found that work, that's not work, work, work, but it's better the second configuration.\n\n0:21:54\tSPEAKER_08\n Because, for the, in the PLP delta and delta delta, we have 85.3 agglance, and with the second configuration, we have 87.1.\n\n0:22:09\tSPEAKER_03\n And, by the way, there was another suggestion that would apply to the second configuration, which was made by, and that was that if you have a feed two streams into HTK, and you change the variances, you scale the variances associated with these streams, you can effectively scale the streams.\n\n0:22:51\tSPEAKER_03\n Right, so, you know, without changing the scripts, for HTK, which is the rule here, you can still change the variances, which would effectively change the scale of these two streams that come in.\n\n0:23:11\tSPEAKER_03\n And so, if you do that, for instance, it may be the case that the MLP should not be considered as strongly.\n\n0:23:28\tSPEAKER_03\n And so, this is just setting them to be equal weight. Maybe it shouldn't be equal weight. I'm sorry to say that gives more experiments if we want to look at that.\n\n0:23:42\tSPEAKER_03\n Yeah, on the other hand, it's just experiments at the level of the HTK recognition. It's not even HTK. Well, I guess you have to do the HTK training also. Do you?\n\n0:23:59\tSPEAKER_03\n Yeah, you have to change the... No, you can just do it. Once you've done the training, the training is just coming up with variances, so I guess you can scale them all.\n\n0:24:14\tSPEAKER_03\n Scaled variances. But, is it... I mean, HTK models are diagonal variances, so... That's exactly the point I think that if you change what they are, it's diagonal variance matrices, but you say what those variances are.\n\n0:24:40\tSPEAKER_03\n So, that, you know, it's diagonal means that then you're going to... It's going to generally multiply it.\n\n0:24:52\tSPEAKER_03\n It's implicitly expenetuated to get probabilities, and so it's going to affect a range of things if you change the variances of some of the features. So, it's precisely given that model, you can very simply affect the strength of the two by the features.\n\n0:25:14\tSPEAKER_03\n So, that was... I already suggested. Yeah. So... So, it could just be that repeating them equally, treating two streams equally is just not the right thing to do.\n\n0:25:36\tSPEAKER_03\n Of course, it's potentially opening a can of worms because maybe it should be a different number of free queries. That's it.\n\n0:25:46\tSPEAKER_03\n Okay. So, I guess the other thing is to take... Yeah, if you want more to take a couple of the most successful of these.\n\n0:25:59\tSPEAKER_07\n Yeah, test, press everything. Yeah, try out these different tests.\n\n0:26:12\tSPEAKER_07\n So, the next point here, we've had some discussion with Steven Chauen about the artillery stuff. So, we'll perhaps start something next week.\n\n0:26:33\tSPEAKER_07\n The discussion with Inek, Sunil and Pratyba for trying to plug in our networks within their block diagram, where to plug in the network after the feature before or as a plug-in or as another path.\n\n0:26:58\tSPEAKER_07\n The discussion about multi-bound traps actually in Inek would like to see, perhaps if you remember the block diagram, there is a temporal LDA followed by a spectral LDA for each critical bound.\n\n0:27:18\tSPEAKER_07\n And it would like to replace these by a network which would make the system look like a trap. Well, basically it would be a trap system.\n\n0:27:30\tSPEAKER_07\n Basically, this is a trap system, kind of trap system, I mean, but where the neural network are replaced by LDA.\n\n0:27:42\tSPEAKER_07\n Yeah, and about multi-bound. I started multi-bound MLP training. Actually, I prefer to do exactly what I did when I was in Belgium.\n\n0:27:58\tSPEAKER_07\n So, I take exactly the same configuration, seven bands with nine frames of context, which is trained on the T-MIT and on the large database. So, with Spine and everything.\n\n0:28:12\tSPEAKER_07\n I started to train all the networks with larger contexts. So, this would be something between traps and multi-bound because we still have quite large bands, but with a lot of context also.\n\n0:28:32\tSPEAKER_07\n Yeah, we still have to work on finish. Basically, to make a decision on which MLP can be the best across the different languages for the moment, it's the T-MIT network and perhaps the network trained on everything.\n\n0:28:50\tSPEAKER_07\n So, we can test these two networks with delta and large networks. Test them also on finish and see which one is the best.\n\n0:29:04\tSPEAKER_07\n Well, the next part of the document is basically a kind of summary of everything that has been done. So, we have 79 MLPs trained on 1, 2, 3, 4, 5, 10 on 10 different databases.\n\n0:29:27\tSPEAKER_07\n The number of frames is also, so we have 1 million and half for some, 3 million for other and 6 million for the last one.\n\n0:29:38\tSPEAKER_07\n Yeah, as we mentioned, T-MIT is the only that's unlabeled. And perhaps this is what makes the difference. Yeah, the other are just Viter B-Lite.\n\n0:29:52\tSPEAKER_07\n So, these 79 MLPs differ on different things. First, with respect to the online normalization, there are that use bad online normalization and other good online normalization.\n\n0:30:07\tSPEAKER_07\n With respect to the features, with respect to the use of delta or no, with respect to the hidden layer size and to the targets. But of course, we don't have all the combination of these different parameters.\n\n0:30:25\tSPEAKER_07\n What's this? We only have 288 trained tests, not 2000. I was impressed by 2000.\n\n0:30:40\tSPEAKER_07\n Yeah, basically the observation is what we discussed already, the MLG problem. The fact that the MLP trained on target task decreased the error rate.\n\n0:31:00\tSPEAKER_07\n But when the MLP trained on the target task increased the error rate compared to using straight features. Except if the features are bad, actually except if the feature are not correctly online normalized.\n\n0:31:20\tSPEAKER_07\n In this case, the T-M is still better even if it's trained on not on the target digits. Yeah, so it sounds like the net corrects some of the problems with some poor normalization. But if you can do good normalization, it's...\n\n0:31:37\tSPEAKER_07\n So the fourth point is, yeah, the T-Mit plus noise seems to be the training set that gives the best network.\n\n0:31:47\tSPEAKER_03\n Before you go on to the possible issue, so on the MSG problem, I think that in the short time solution, that is trying to figure out what we can proceed forward with to make the greatest progress.\n\n0:32:12\tSPEAKER_03\n As I said with J-Rasta, I really like J-Rasta and I really like MSG. I think it's kind of in the category that it may be complicated.\n\n0:32:22\tSPEAKER_03\n And it might be if someone's interested in it, certain encourage anybody to look into it in a longer term.\n\n0:32:29\tSPEAKER_07\n So we get out of this particular rush for results, but in the short term, unless you have some strong idea of what's wrong.\n\n0:32:45\tSPEAKER_07\n No bypass filter. Yeah, there's supposed to be an MSG. Supposed to have an online normalization now. There is an edge kind of a GC.\n\n0:32:59\tSPEAKER_03\n Yeah, but also there's an online norm. Besides the a GC, there's an online normalization that you're supposed to be.\n\n0:33:05\tSPEAKER_03\n Yeah, taking out means and variances and so forth. In fact, the online normalization that we're using came from the MSG design.\n\n0:33:17\tSPEAKER_07\n Yeah, but this was the bad online normalization. Actually.\n\n0:33:23\tSPEAKER_08\n Are you a result of still with the bad online two?\n\n0:33:35\tSPEAKER_07\n Online two is good.\n\n0:33:39\tSPEAKER_03\n Yeah, so yeah, I agree. It's probably something simple. If someone, you know, let's play with it for a little bit. I mean, you're going to do what you're going to do, but my guess would be that it's something that is a simple thing that could take a while to find.\n\n0:33:59\tSPEAKER_03\n Yeah, and the other results observations two and three is, yeah, it's pretty much what we've seen that what we were concerned about is that if it's not on the target task, if it's on the target task, then it helps to have the MLP transforming it.\n\n0:34:23\tSPEAKER_03\n If it's not on the target task, then depending on how different it is, you can get a reduction in performance.\n\n0:34:31\tSPEAKER_03\n And the question is now how to get one and not the other or how to ameliorate the problems.\n\n0:34:39\tSPEAKER_03\n Because it certainly does is nice to have in there when there is something like that.\n\n0:34:51\tSPEAKER_07\n Yeah, so that's what you say.\n\n0:34:53\tSPEAKER_07\n The reason is that perhaps the target, the task dependency, the language dependency, and the noise dependency.\n\n0:35:01\tSPEAKER_07\n Well, but this is still not clear because I don't think we have enough result to talk about the language dependency.\n\n0:35:14\tSPEAKER_07\n Well, the team network is still the best, but there is also the other difference, the fact that it's unlabeled.\n\n0:35:22\tSPEAKER_04\n Hey.\n\n0:35:24\tSPEAKER_04\n I don't have a link.\n\n0:35:26\tSPEAKER_03\n I'm just sitting here.\n\n0:35:30\tSPEAKER_03\n I don't think we want to mess with the microphones, but just have a seat.\n\n0:35:38\tSPEAKER_03\n The summary of the first 45 minutes is that some stuff works and some stuff doesn't.\n\n0:35:48\tSPEAKER_07\n Okay.\n\n0:35:50\tSPEAKER_07\n We still have one of these.\n\n0:35:53\tSPEAKER_03\n Yeah, I guess we can do a little better than that.\n\n0:35:58\tSPEAKER_03\n I think if you start off with the other one, it sort of has it in words, and that has the associated result.\n\n0:36:06\tNone\n Okay.\n\n0:36:08\tSPEAKER_03\n So you're saying that although we see, yes, there's what you would expect in terms of a language dependency and a noise dependency.\n\n0:36:16\tSPEAKER_03\n That is when the neural net is trained on one of those and tested on something different.\n\n0:36:22\tSPEAKER_03\n You don't do as well as in the target thing, but you're saying that it is, although that general thing is observable so far, there's something you're not completely convinced about.\n\n0:36:32\tSPEAKER_03\n And what is that?\n\n0:36:36\tSPEAKER_07\n When you say not clear yet, what do you mean?\n\n0:36:38\tSPEAKER_07\n I mean, the fact that for the IDGITs, the timet net is the best, which is the English net, but the other has likely worse.\n\n0:36:50\tSPEAKER_07\n But you have to do affect the effect of changing language and the effect of training on something that's bitterly aligned instead of end and level.\n\n0:37:00\tSPEAKER_07\n Yeah.\n\n0:37:06\tSPEAKER_03\n Do you think the alignments are bad?\n\n0:37:08\tSPEAKER_03\n I mean, have you looked at the alignments at all? What do the terribly alignments do?\n\n0:37:14\tSPEAKER_07\n I don't know.\n\n0:37:16\tSPEAKER_07\n Did you look at the Spanish alignments, Carmen?\n\n0:37:20\tSPEAKER_03\n No.\n\n0:37:22\tSPEAKER_03\n It's interesting to look at it, because I mean, that is just looking, but it's not clearly necessarily what you do so badly from a terribly aligned net.\n\n0:37:34\tSPEAKER_03\n Depends on whether the ranking measure is that the engine is doing the alignment.\n\n0:37:40\tSPEAKER_05\n Yeah.\n\n0:37:42\tSPEAKER_07\n But perhaps it's not really the alignment that's bad, but just the phoneme string that's used for the alignment.\n\n0:37:54\tSPEAKER_07\n The pronunciation.\n\n0:37:56\tSPEAKER_07\n I mean, it's single pronunciation.\n\n0:38:00\tSPEAKER_07\n French phoneme strings were corrected manually, so we ask people to listen to the sentence, and we give the phoneme string and they kind of correct them.\n\n0:38:11\tSPEAKER_07\n But still, there might be errors just in the string of phonemes.\n\n0:38:23\tSPEAKER_07\n Yeah, so this is not really the real deal, I mean.\n\n0:38:31\tSPEAKER_07\n The third issue is the noise dependency, perhaps, but this is not clear yet, because all the nets are trained on the same noises.\n\n0:38:43\tSPEAKER_03\n I thought some of the nets were trained with the spine and so forth, so they're not that nice.\n\n0:38:49\tSPEAKER_07\n But the results are only coming for the nets.\n\n0:38:56\tSPEAKER_03\n Okay, yeah, just don't need more results there with that.\n\n0:39:04\tSPEAKER_07\n So, from these results, we have some questions with answers.\n\n0:39:08\tSPEAKER_07\n What should be the network input?\n\n0:39:11\tSPEAKER_07\n PLP work as well as MFCC, I mean.\n\n0:39:17\tSPEAKER_07\n But it seems important to use the delta.\n\n0:39:21\tSPEAKER_07\n We respect to the network size. There's one experiment that's still running, and we should have the result today, comparing networks with 500 and 1000 units.\n\n0:39:35\tSPEAKER_07\n Still no answer actually.\n\n0:39:38\tSPEAKER_07\n The training set, well, some kind of answer.\n\n0:39:41\tSPEAKER_07\n We can tell which training set gives the best result, but we don't know exactly why.\n\n0:39:49\tSPEAKER_03\n Right, I mean, the multi-English so far is the best.\n\n0:39:53\tSPEAKER_03\n Multi-English just means Tim.\n\n0:39:57\tSPEAKER_03\n So, yeah, so when you add other things into broad nets, it gets worse.\n\n0:40:09\tSPEAKER_07\n So, some questions with answers. Training set.\n\n0:40:19\tSPEAKER_07\n Training targets.\n\n0:40:21\tSPEAKER_03\n I like that the training set is both questions with answers and without answers.\n\n0:40:25\tSPEAKER_03\n It's multi-purpose.\n\n0:40:29\tSPEAKER_07\n Training, so yeah, the training targets actually.\n\n0:40:33\tSPEAKER_07\n The two of the main issues perhaps are still the language dependency and the noise dependency.\n\n0:40:39\tSPEAKER_07\n And perhaps to try to reduce the language dependency, we should focus on finding some other kind of training targets.\n\n0:40:47\tSPEAKER_07\n And labeling seems important because of the limit results.\n\n0:40:54\tSPEAKER_07\n For a moment, we use phonetic targets, but we could also use articulatory targets, soft targets, perhaps even use networks that doesn't do classification, but just regression.\n\n0:41:06\tSPEAKER_07\n So, trying to have neural networks that...\n\n0:41:14\tSPEAKER_07\n There's a regression and, well, basically, compute features without noise.\n\n0:41:24\tSPEAKER_07\n I mean, transform the noisy features in other features that are not noisy, but continuous features, not art targets.\n\n0:41:34\tSPEAKER_03\n Yeah, that seems like a good thing to do, probably not again a short term sort of thing.\n\n0:41:42\tSPEAKER_03\n I mean, one of the things about that is that...\n\n0:41:48\tSPEAKER_03\n I guess the major risk you have there being is being dependent on the kind of noise.\n\n0:41:56\tSPEAKER_07\n Yeah, but yeah, so this is...\n\n0:42:00\tSPEAKER_07\n Well, this one thing could help perhaps to reduce language dependency and for the noise part, we could combine this with other approaches like, the clenchmit approach, so the idea of putting all the noise that we can find inside the database, I think clenchmit works using more than 50 different noises to train this network.\n\n0:42:23\tSPEAKER_07\n So, this is one approach, and the other is multi-band.\n\n0:42:29\tSPEAKER_07\n I think it's more robust to noise changes, so perhaps doing something like multi-band, train on a lot of noises with feature space targets.\n\n0:42:41\tSPEAKER_03\n Yeah, if you could...\n\n0:42:43\tSPEAKER_03\n It's interesting though, maybe if you just trained up, I mean, one fancy would be you have something like articulate-right targets, and you have some reasonable database, which is copied over many times with a range of different noises.\n\n0:43:01\tSPEAKER_03\n And because what you're trying to do is come up with a core reasonable feature set, which is then going to be used by the HMF system.\n\n0:43:13\tSPEAKER_07\n So, yeah, the future work is... well, try to connect to the... to plug in the system to the OGI system.\n\n0:43:31\tSPEAKER_07\n There are still open questions there, where to put the MLB, basically.\n\n0:43:39\tSPEAKER_03\n And I guess, you know, the real open question, I mean, there's lots of open questions, but one of the core core open questions for that is...\n\n0:43:49\tSPEAKER_03\n If we take the best ones here, maybe not just the best ones, but the best few, or something, the most promising group from these other experiments, how well do they do over a range of these different tests, not just the Italian?\n\n0:44:06\tSPEAKER_03\n And then, then, then, see, again, how we know that there's a loss of performance from the neural net is trained on conditions that are different than we're going to test on.\n\n0:44:22\tSPEAKER_03\n But if you look over a range of these different tests, how well do these different ways combining the straight features with the MLB features stand out over that range?\n\n0:44:34\tSPEAKER_03\n That seems like the real question, if you know that.\n\n0:44:38\tSPEAKER_03\n So, if you just take PLP with double deltons, assume that's the feature.\n\n0:44:44\tSPEAKER_03\n Look at these different ways of combining it, and take... let's say, just take multi-English, because that works pretty well for the training.\n\n0:44:52\tSPEAKER_03\n Just look, take that case, and then look over all the different things. How does that compare between these?\n\n0:44:58\tSPEAKER_03\n All the tests set. All different test sets, and for the couple different ways that you have of combining them.\n\n0:45:08\tSPEAKER_03\n How well do they stand out over that?\n\n0:45:11\tSPEAKER_07\n And perhaps doing this for changing the variance of the streams, and so on.\n\n0:45:16\tSPEAKER_07\n That's another possibility.\n\n0:45:18\tSPEAKER_07\n Different times.\n\n0:45:20\tSPEAKER_07\n Yeah, so this would be more working on the MLP as an additional path instead of an insert to their diagram.\n\n0:45:32\tSPEAKER_07\n Perhaps the insert idea is kind of strange because they make an LDA, and then we will, again, add a network that is discriminant and that...\n\n0:45:44\tSPEAKER_03\n Yeah, this is a little strange, but on the other hand, they did before.\n\n0:45:50\tSPEAKER_07\n And because of so perhaps we know that when we have very good features, the MLP doesn't help.\n\n0:45:58\tSPEAKER_03\n So, I don't know.\n\n0:46:00\tSPEAKER_03\n The other thing though is that...\n\n0:46:04\tSPEAKER_03\n So, we want to get their path running here, right?\n\n0:46:08\tSPEAKER_03\n So we can add this other stuff as an additional path, right?\n\n0:46:13\tSPEAKER_07\n Yeah, the way we...\n\n0:46:15\tSPEAKER_03\n Because what are doing LDA Rasta?\n\n0:46:17\tSPEAKER_03\n What?\n\n0:46:19\tSPEAKER_03\n They're doing LDA Rasta.\n\n0:46:21\tSPEAKER_07\n Yeah, the way we want to do it, perhaps, is just to get the VAD labels and the final features.\n\n0:46:27\tSPEAKER_07\n So they will send us the...\n\n0:46:30\tSPEAKER_07\n Well, I see.\n\n0:46:31\tSPEAKER_07\n So, the feature files and with the VAD binary labels so that we can get our MLP features and filter them with the VAD and then combine them with their feature stream.\n\n0:46:51\tSPEAKER_03\n So, the first thing we're going to do there is to make sure that when we get those labels to the final features that we get the same result system without putting in a second path.\n\n0:47:00\tSPEAKER_07\n Yeah.\n\n0:47:02\tSPEAKER_07\n You mean...\n\n0:47:04\tSPEAKER_07\n Yeah, just retraining...\n\n0:47:06\tSPEAKER_03\n Yeah, just to make sure that we have...\n\n0:47:08\tSPEAKER_03\n We understand properly what things are.\n\n0:47:10\tSPEAKER_03\n The very first thing to do is to double check that we get the exact same results as the MLP and the K.\n\n0:47:16\tSPEAKER_03\n I mean, I don't know that we need to...\n\n0:47:20\tNone\n...training?\n\n0:47:22\tSPEAKER_03\n I mean, we can just take their training files also, but just for the testing, just to make sure that we get the same results.\n\n0:47:31\tSPEAKER_03\n We can duplicate it before we add in another...\n\n0:47:33\tSPEAKER_03\n...because otherwise, yeah, we won't be able to do anything.\n\n0:47:36\tSPEAKER_07\n Yeah, so LDA Rasta, I don't know if we want to...\n\n0:47:46\tSPEAKER_07\n We can try networks with LDA Rasta, filter with features.\n\n0:47:50\tNone\n I'm sorry.\n\n0:47:52\tNone\n Yeah, well...\n\n0:47:56\tNone\n Yeah.\n\n0:47:58\tNone\n Oh, you know, the other thing is when you say...\n\n0:48:01\tSPEAKER_05\n I'm sorry, I'm sorry, I'm sorry, I'm sorry, I'm sorry.\n\n0:48:04\tSPEAKER_03\n When you're talking about combining MLP features, so, suppose we said, okay, we've got these different features and so forth, but the PLP seems pretty good.\n\n0:48:20\tSPEAKER_03\n If we take the approach that Mike did, and have...\n\n0:48:24\tSPEAKER_03\n I mean, one of the situations we have is we have these different conditions, different languages, we have different noises.\n\n0:48:31\tSPEAKER_03\n If we have some drastically different conditions, then we're just trying to have different MLPs.\n\n0:48:38\tSPEAKER_03\n And put them together. What Mike found for the reverberation case, at least, I mean, who knows if we'll work for these other ones, that you did have nice, interpretative effects.\n\n0:48:48\tSPEAKER_03\n That is that, yes, if you knew what the reverberation condition was going to be, and you trained for that, then you got the best results.\n\n0:48:56\tSPEAKER_03\n But if you had, say, a heavily reverberation case, and I know reverberation case, and then you fed the thing, something that was modest on a reverberation, then you get some results in between the two, so sort of behaviorism.\n\n0:49:11\tSPEAKER_03\n That affair?\n\n0:49:13\tSPEAKER_04\n Yeah, that's fair.\n\n0:49:14\tSPEAKER_04\n It also seems like if you try to train a little bit, so much noise, you'll just like to put a little help in the right case,\n\n0:49:24\tNone\n and you have space, so it's better. Yeah, so you think it's better to have several MLPs?\n\n0:49:32\tSPEAKER_05\n Of course, it's easier.\n\n0:49:34\tSPEAKER_04\n I don't know how you interpret this on.\n\n0:49:38\tSPEAKER_04\n Yeah, I think I won't feel much for the work, but it's a lot of making it happen, which is a lot of pictures.\n\n0:49:49\tSPEAKER_03\n It works better if what?\n\n0:49:54\tSPEAKER_04\n Well, you were doing something that was, so maybe the analogy isn't quite right, you were doing something that was in a way a little better behaved.\n\n0:50:17\tSPEAKER_03\n But, you know, it's a very simple variable, which is reverberation.\n\n0:50:24\tSPEAKER_03\n Here the problem seems to be is that we don't have a really huge net with a really huge amount of training data, but we have, for this kind of task, I would think, sort of a modest amount, many million frames actually isn't that much.\n\n0:50:38\tSPEAKER_03\n A modest amount of training data from a couple different conditions.\n\n0:50:44\tSPEAKER_03\n So, the, that we anticipate in the test set in terms of language, and noise type, and channel characteristic, sort of all of them at a bunch of different dimensions.\n\n0:50:57\tSPEAKER_03\n And so, I'm just concerned that we don't really have the data to train up.\n\n0:51:05\tSPEAKER_03\n I mean, one of the things that we were seeing is that when we added in, we don't have a good explanation for this, we are seeing that we're adding in a few different databases, and the performance is getting worse.\n\n0:51:21\tSPEAKER_03\n And we just take one of those databases, a pretty good one. It actually is better.\n\n0:51:29\tSPEAKER_03\n And that says to me, yes, there might be some problems with the pronunciation models, some of the databases writing in or something like that, but one way or another, we don't have, seemingly, the ability to represent in the neural net of the size that we have, all of the variability that we're going to be covering.\n\n0:51:49\tSPEAKER_03\n So, I'm hoping that this is another take on the efficiency arc we're making, which I'm hoping it would moderate size neural nets, that if we look at more constrained conditions, then we'll have enough parameters to really represent them.\n\n0:52:30\tSPEAKER_04\n That also has a huge, and it's very online.\n\n0:52:35\tSPEAKER_04\n I feel that I feel that the online conversation that we've over-bad, online conversation, has to do some extrusion.\n\n0:52:47\tSPEAKER_04\n And take away the online conversation, online conversation, so that we can talk about that.\n\n0:52:53\tSPEAKER_06\n So doing both is not right.\n\n0:53:00\tSPEAKER_04\n That's not right, but if you fill in online conversation, then it might not be necessary to use the word that's going to be.\n\n0:53:07\tSPEAKER_03\n I just sort of have a feeling, but yeah. I mean, I think it's true that the OGI-folk found that using LDA Rasta, which is a kind of log-rasta, it's just that they have, I mean, it's done the log domain as Eric Allen, and it's just that they've just trained up, right?\n\n0:53:29\tSPEAKER_03\n That that benefited from online normalization.\n\n0:53:38\tSPEAKER_03\n So they did, at least in their case, it did seem to be somewhat complimentary.\n\n0:53:44\tSPEAKER_03\n So will it be in our case where we're using the neural net? I mean, they were not using the neural net.\n\n0:53:51\tSPEAKER_03\n I don't know.\n\n0:53:55\tSPEAKER_03\n Okay, so the other things you have here are trying to improve results from a single, yeah, make stuff better.\n\n0:54:07\tSPEAKER_03\n Basically, yeah, and CPU memory issues, yeah, we've just sort of ignoring that.\n\n0:54:12\tSPEAKER_07\n Yeah, so I don't know.\n\n0:54:14\tSPEAKER_07\n Yeah, but I have to address this problem of CPU memory?\n\n0:54:18\tSPEAKER_03\n Well, I think my impression, you folks have been looking at this more than me, but my impression was that there was a strict constraint on the delay.\n\n0:54:31\tSPEAKER_03\n But beyond that, it was kind of that using less memory was better, using less CPU was better, something like that.\n\n0:54:41\tSPEAKER_05\n Yeah, but yeah.\n\n0:54:45\tSPEAKER_07\n So yeah, but we don't know. We have to get some reference point to where we, what's a reasonable number?\n\n0:54:56\tSPEAKER_07\n Perhaps because it's too late or large.\n\n0:55:01\tSPEAKER_03\n Well, I don't think we're completely off the wall. I mean, I think that if we have, I mean, the ultimate fallback that we could do, if we find, I mean, we find that we're not really going to worry about the MLP.\n\n0:55:24\tSPEAKER_03\n Yeah, if the MLP ultimately, if they're all said and done, doesn't it really help? And we have it in. If the MLP does, we find help us enough in some conditions.\n\n0:55:34\tSPEAKER_03\n We might even have more than one MLP. We could simply say that that is done on the server.\n\n0:55:41\tSPEAKER_03\n And it's, we do the other manipulations that we're doing before that.\n\n0:55:47\tSPEAKER_03\n So I think that's, that's okay.\n\n0:55:54\tSPEAKER_03\n So I think the key thing was this plug-in doji.\n\n0:56:01\tSPEAKER_03\n What are they, what are they going to be working on? We know what they're going to be working on while we take their features.\n\n0:56:10\tSPEAKER_07\n They're starting to work on some kind of multiband. So that was pretty bad. Sunil, what was he doing?\n\n0:56:21\tSPEAKER_07\n Sunil?\n\n0:56:22\tSPEAKER_07\n Yeah. He was doing something new.\n\n0:56:25\tSPEAKER_08\n I don't think so.\n\n0:56:28\tSPEAKER_08\n I'm trying to tune.\n\n0:56:31\tSPEAKER_05\n What? Networks?\n\n0:56:33\tSPEAKER_07\n I think they were also mainly, well, working a little bit of new things like network and multiband, but mainly trying to tune their system as it is now.\n\n0:56:47\tSPEAKER_07\n Just trying to get the best from this architecture.\n\n0:56:50\tSPEAKER_03\n Okay, so I guess the way it would work is that you get, there be some point where you say, okay, this is their version one or whatever.\n\n0:56:58\tSPEAKER_03\n And we get these VAD labels and features and so forth for all these test sets from them.\n\n0:57:03\tSPEAKER_03\n And then that's what we work with.\n\n0:57:07\tSPEAKER_03\n We have a certain level, we try to improve it with this other path.\n\n0:57:10\tSPEAKER_03\n And then when it gets to be January, at some point, we say, okay, we have shown that we can improve this in this way.\n\n0:57:22\tSPEAKER_03\n So now, what's your newest version?\n\n0:57:28\tSPEAKER_03\n Maybe they'll have something that's better and then we combine it.\n\n0:57:30\tSPEAKER_03\n This is always hard.\n\n0:57:31\tSPEAKER_03\n I mean, I used to work with folks who were trying to improve a good HMEM system with the neural net system.\n\n0:57:40\tSPEAKER_03\n And it was a common problem that you, oh, and this is actually a true not just for neural nets, but just for the general people working with rescoring and best lists or lattice systems.\n\n0:57:51\tSPEAKER_03\n And then you get something from the other side at one point and you work really hard on making it better with rescoring.\n\n0:58:02\tSPEAKER_03\n But they're working really hard too.\n\n0:58:04\tSPEAKER_03\n So by the time you have improved their score, they have also improved their score.\n\n0:58:11\tSPEAKER_03\n And now there isn't any difference because the other.\n\n0:58:14\tSPEAKER_03\n So I guess at some point we'll have to, I don't know, I think we're integrated a little more tightly than happens.\n\n0:58:22\tSPEAKER_03\n A lot of those cases, I think, at the moment they say that they have a better thing.\n\n0:58:28\tSPEAKER_03\n What takes all the time here is that we're trying so many things, presumably, in a day we could turn around taking a new set of things from them and rescoring.\n\n0:58:42\tSPEAKER_03\n Well, OK, I think this is good. I think that the most wide open thing is the issues about the different trainings, training targets and devices and so forth.\n\n0:58:57\tSPEAKER_07\n So we can forget combining multiple features and MSG perhaps or focus more on the targets and on the training data.\n\n0:59:07\tSPEAKER_03\n Yeah, I think for right now, I really like MSG. I think that one of the things I like about it is it has such different temporal properties.\n\n0:59:16\tSPEAKER_03\n And I think that there is ultimately a really good potential for bringing in things with different temporal properties.\n\n0:59:27\tSPEAKER_03\n But we only have limited time and there's a lot of other things we have to look at. It seems like much more core questions are issues about the training set and the training targets and fitting in what we're doing with what they're doing.\n\n0:59:46\tSPEAKER_03\n But with limited time, yeah, I think we have to start cutting down. So I think so. And then, you know, once we have been going through this process and trying many different things, I would imagine certain things come up that you are curious about that you're not getting to.\n\n1:00:10\tSPEAKER_03\n So when that does settles from the evaluation, I think that would be time to go back and take whatever intrigued you most, you know, got your most interested and work with it for the next round.\n\n1:00:25\tSPEAKER_03\n As you can tell from these numbers, nothing that any of us are going to do is actually completely solve the problems.\n\n1:00:33\tSPEAKER_03\n That's still exciting to do. Very, very quiet. Well, I figured that out.\n\n1:00:44\tSPEAKER_03\n What were you involved in in this primarily?\n\n1:00:47\tSPEAKER_01\n Helping out preparing, well, they've been kind of running all the experiments and stuff. I've been doing some work on the preparing all the data for them to train and to test out.\n\n1:01:07\tSPEAKER_01\n Yeah, right now I'm focusing mainly on this final project I'm working on Jordan's class. What's that?\n\n1:01:18\tSPEAKER_01\n I'm trying to, so there was a paper in ICSLP about this multi-band belief in that structure. This guy did basically use two HMMs with a dependency arrow between the two HMMs.\n\n1:01:36\tSPEAKER_01\n I'm going to try coupling them instead of having the arrow that flows from one subband to another subband, trying having the arrows go both ways.\n\n1:01:48\tSPEAKER_01\n I'm just going to see if that better models AC-creening in any way or... No? Yeah. That sounds interesting.\n\n1:02:06\tSPEAKER_03\n Anything to do? No. Okay. Sound partner in the meeting. We got laughed out of them. Okay, everyone must contribute to our sound files here.\n\n1:02:21\tSPEAKER_03\n Okay, so speaking of which, if we don't have anything else, we're happy with where we are. No, no, no, no, we're going. I think so. Yeah. Yeah. Do you happy? Yeah. Okay. Everyone, should be happy.\n\n1:02:36\tSPEAKER_03\n You only have to be happy, you're almost done. Yeah. Okay.\n\n1:02:42\tSPEAKER_00\n Actually, I should mention about the Linux machine in Sweden. Yeah. So it looks like the neural net tools are installed there. And Dan Ellis, I believe, knows something about using that machine.\n\n1:02:54\tSPEAKER_07\n So if people are interested in getting jobs running on that, maybe I could help with that. Yeah, but I don't know if we really need a lot of machines.\n\n1:03:06\tSPEAKER_03\n But we could start computing another niche table. Well, yeah, I think we want a different table, please. Yeah, sure.\n\n1:03:17\tSPEAKER_03\n There's some different things that we're going to get at now. But yeah. So as far as you can tell, you're actually okay on CPU for training and so on.\n\n1:03:32\tSPEAKER_07\n Yeah, I think so. Well, more is always better. But I don't think we have to train a lot of networks. You know, we just select what works fine.\n\n1:03:48\tSPEAKER_03\n I'm okay. I'm okay. I'm okay. I'm disc.\n\n1:03:52\tSPEAKER_07\n Okay. Yeah. Well, sometimes we have some problems. But they're correct. Yeah. We're starting to script busy. Yeah. Yeah.\n\n1:04:03\tSPEAKER_03\n That's okay. Alright. So, we didn't give a channel out for you. You don't have to read the digits, but rest of it.\n\n1:04:14\tSPEAKER_03\n Is it not? Well, I think I won't touch anything because I'm afraid of making the driver crash.\n\n1:04:25\tSPEAKER_03\n It seems to do. Okay. So, I'll start off the connect my battery slow. Let's hope it works. Maybe you should go first.\n\n1:04:42\tSPEAKER_07\n I'm reading transcript. 2571 to 590. 1943. 263.\n\n1:04:56\tSPEAKER_07\n 24. 5. 7. 1. 8. 3067. 4. 4. 9. 3048. 4. 9. 9. 8. 4. 0. 1. 2. 0. 2. 8. 6. 9. 1. 4. 1. 5. 6. 9. 0. 7. 5. 4. 6. 6. 7. 8.\n\n1:05:25\tSPEAKER_07\n 9. 00. 1. 2. 7. 3. 0. 7. 3.\n\n1:05:32\tSPEAKER_03\n Transcript. 2. It's battery. Going down too. Oh, okay. I want you to go next.\n\n1:05:39\tSPEAKER_08\n Transcript number 2511-2530. 1905. 004. 7. 1307. 2637. 2554.\n\n1:05:59\tSPEAKER_08\n 3314. 354. 3314. 7. 0. 5. 6. 7. 0. 7. 9. 1. 0. 4. 0. 4. 7. 1. 7. 5. 2. 0. 4. 0.\n\n1:06:21\tSPEAKER_08\n 234. 0. 5. 5. 2. 6. 8. 6. 8. 9. 0. 9. 0. 7. 6. 4. 7. 8. 6. 1. 9.\n\n1:06:41\tSPEAKER_03\n Transcript. 2531-2550. 0. 0. 0. 0. 1035217. 311-0656. 4336-463.\n\n1:07:01\tSPEAKER_03\n 5811-244. 699-7801. 8. 00. 9. 0. 1. 6. 0. 1. 2. 3. 8. 1. 2. 6. 0. 4. 3. 9. 4. 9. 5. 6. 0. 4. 8. 3. 8. 2. 4. 2. 9. 3. 3. 3. 0. 5.\n\n1:07:30\tSPEAKER_00\n I'm reading transcript 2551-2570. 0. 0. 6. 6. 9. 5. 4. 7. 1. 2. 3. 0. 0. 5. 1. 6. 2. 5. 7. 7. 7. 7. 8. 9. 0. 0. 0. 5. 0. 8. 9. 0. 0. 8. 9. 0. 0. 0. 5. 0. 8. 9. 0. 0. 8. 9. 0. 0. 0. 8. 9. 9. 0. 0. 8. 9. 0. 0. 0. 8. 9. 0. 0. 0.\n\n1:08:00\tSPEAKER_00\n 6 2 1 3 0 5 3 5 7 2 3 6 0 4 3 5 6 9 9 6 7 7 0 6 8 0 6 5 0 0 3 8 5 4 0 2\n\n1:08:25\tSPEAKER_01\n I'm reading transcript 2491-2510 on Channel 2 8 9 0 7 9 0 2 1 4 0 6 2 6 3 1 3 8 2 205 8 4 4 5 6 0 8 8 1 2 0 6 9 6 2 0 4 4 3 0 7 3 0 7 1 2 0 5 4 1 5 1 5 6 6 9 7 5 9 1 3 8 7 2 9 7 2 6\n\n1:09:42\tSPEAKER_03\n I guess we can turn off our microphones.\n\n1:10:12\tNone\n I am always well gathered\n\n", "summary": [{"summary_text": "SPEAKER_07 is passing out some Zerax things to pass out. Speaker's been working on the table since last week and since the last week. The gap between the different training sets is much smaller. English on timid is still better than the other languages. "}]}