{"filename": "./data/Btr002.txt", "transcript": "0:00:00\tSPEAKER_04\n We have little or head, so.\n\n0:00:05\tSPEAKER_04\n Okay, so the microphone adjustments we should check.\n\n0:00:07\tSPEAKER_04\n Would you check the microphone adjustments please?\n\n0:00:09\tSPEAKER_04\n Is this, is this, is this is this is close enough?\n\n0:00:12\tSPEAKER_04\n Can we look at, can we look at, can we also get the, you, what you said about it? Is it close enough?\n\n0:00:16\tSPEAKER_06\n Okay, all right.\n\n0:00:17\tSPEAKER_06\n Hello?\n\n0:00:18\tSPEAKER_06\n I can change it.\n\n0:00:19\tSPEAKER_04\n But you know, he's like the expert and I don't know exactly.\n\n0:00:22\tSPEAKER_00\n So about a thumb and a half, maybe two thumb.\n\n0:00:24\tSPEAKER_00\n Yeah.\n\n0:00:25\tSPEAKER_00\n It's the weight from your mouth, so that's a little far.\n\n0:00:27\tSPEAKER_00\n Oh.\n\n0:00:28\tNone\n So, I'll show you the corner.\n\n0:00:30\tNone\n Thumb as in this way.\n\n0:00:31\tSPEAKER_00\n Just, just, so it should be very, very, very good.\n\n0:00:33\tSPEAKER_00\n Okay.\n\n0:00:34\tSPEAKER_00\n And then you can look on screen and if you see, right, right, right, right, right, in other words, when you're free, then if you see it going up and down a lot, then move it a little further away from the front of the nose.\n\n0:00:48\tSPEAKER_04\n It's interesting.\n\n0:00:49\tSPEAKER_04\n That's good.\n\n0:00:50\tSPEAKER_04\n Hello?\n\n0:00:51\tSPEAKER_04\n Yeah.\n\n0:00:52\tSPEAKER_04\n Your voice is so, so it's like, you can see across all the channels when you talk.\n\n0:00:56\tSPEAKER_04\n It's great.\n\n0:00:58\tSPEAKER_04\n Thanks very much.\n\n0:00:59\tSPEAKER_04\n Thanks very much.\n\n0:01:00\tSPEAKER_04\n All right.\n\n0:01:01\tSPEAKER_04\n So, welcome back.\n\n0:01:02\tSPEAKER_04\n Thank you for coming.\n\n0:01:03\tSPEAKER_04\n So, what I thought we'd do today is pick up where we were last time and maybe go over some ideas about, well, the return to the conventions, but I also wanted to share with you a couple of the things that I picked up in terms of checking.\n\n0:01:21\tSPEAKER_04\n And these are things that came up with the tiger fish transcus.\n\n0:01:24\tSPEAKER_04\n I'm just doing this because I think it's interesting.\n\n0:01:27\tNone\n Okay.\n\n0:01:28\tSPEAKER_04\n So, an example.\n\n0:01:30\tSPEAKER_04\n Oh, shit.\n\n0:01:33\tSPEAKER_04\n Thank you.\n\n0:01:34\tSPEAKER_04\n So, there are a couple of examples.\n\n0:01:37\tSPEAKER_04\n I have one in front of you, which is the one where, Leah noticed this one where I said something and the transcribe or interpreted it as two-some gruesome different sizes, different this.\n\n0:01:52\tSPEAKER_04\n And actually what I meant to say was, so you're saying groups of different sizes, different size groups.\n\n0:02:03\tSPEAKER_04\n It's really enormously far away.\n\n0:02:06\tSPEAKER_04\n Now, this could be one of those cases where the auditory was just really bad.\n\n0:02:10\tSPEAKER_01\n That's what I was just thinking.\n\n0:02:11\tSPEAKER_01\n Maybe it was really quiet or something.\n\n0:02:13\tSPEAKER_04\n Maybe very soft.\n\n0:02:15\tSPEAKER_04\n Maybe with the microphone noise or something from someone else or an overlap or, but they're not usually that bad, I don't think.\n\n0:02:22\tSPEAKER_04\n Then I have a couple of others.\n\n0:02:24\tSPEAKER_04\n So, there's one.\n\n0:02:25\tSPEAKER_04\n So, the person said interesting idea, but tiger fish thought it was just an idea.\n\n0:02:31\tSPEAKER_04\n Now, that changes the meaning.\n\n0:02:33\tSPEAKER_04\n It's interesting.\n\n0:02:34\tSPEAKER_04\n Right.\n\n0:02:35\tSPEAKER_04\n And then there are various ones like, Ish-Dk instead of H-Dk.\n\n0:02:40\tSPEAKER_04\n Oh, yeah.\n\n0:02:41\tSPEAKER_04\n And then this one.\n\n0:02:42\tSPEAKER_03\n Ish-Dk.\n\n0:02:43\tSPEAKER_04\n Ish-Dk.\n\n0:02:44\tSPEAKER_04\n Now, Ish was in parentheses.\n\n0:02:46\tSPEAKER_04\n What's the Ish?\n\n0:02:47\tSPEAKER_04\n They were suspicious that wasn't right, but that was the closest they could come.\n\n0:02:50\tSPEAKER_04\n And you know, when you're dealing with acronyms, that shows one of the problems with acronyms.\n\n0:02:53\tSPEAKER_04\n It's clear if you know it.\n\n0:02:54\tSPEAKER_01\n I wonder if someone who had an accent, maybe.\n\n0:02:58\tSPEAKER_01\n Oh, it's conceivable.\n\n0:02:59\tSPEAKER_04\n I don't remember offhand.\n\n0:03:00\tSPEAKER_04\n I did check the example.\n\n0:03:01\tSPEAKER_04\n And, well, and this is to be consistent.\n\n0:03:05\tSPEAKER_04\n So, it was transcribed as with H, but it was really with age.\n\n0:03:10\tSPEAKER_04\n Yeah.\n\n0:03:11\tSPEAKER_04\n And then there are some where actually punctuation changes the meaning.\n\n0:03:15\tSPEAKER_04\n So, these are things that Barber showed.\n\n0:03:18\tSPEAKER_04\n Spurts wouldn't be right, was what it looked like.\n\n0:03:21\tSPEAKER_04\n But actually, when he listened to it, they would be.\n\n0:03:23\tSPEAKER_04\n Spurts wouldn't be right.\n\n0:03:25\tSPEAKER_04\n Oh.\n\n0:03:26\tSPEAKER_04\n No.\n\n0:03:27\tSPEAKER_01\n That's very subtle.\n\n0:03:29\tSPEAKER_01\n It is subtle.\n\n0:03:30\tSPEAKER_04\n And instead of, and it's, they put Annets.\n\n0:03:36\tSPEAKER_04\n And this is interesting because it's like, you know, we know that there's no Annette on any of the meanings we've ever dealt with.\n\n0:03:42\tSPEAKER_04\n But it's conceivable.\n\n0:03:45\tSPEAKER_04\n And then, let's see, there's one other here that was interesting.\n\n0:03:52\tSPEAKER_04\n Well, this was, okay, so it should have been the calls, the calls slides will be fine.\n\n0:03:58\tSPEAKER_04\n This is Jerry Feldman.\n\n0:04:00\tSPEAKER_04\n And instead it was transcribed with the, and then an uncertain syllable, the, the.\n\n0:04:05\tSPEAKER_04\n And then all the slides will be fine.\n\n0:04:08\tSPEAKER_04\n Which is interesting.\n\n0:04:09\tSPEAKER_04\n And, you know, this was a case where the time been was off.\n\n0:04:12\tSPEAKER_04\n I wanted to bring an example where the, yeah.\n\n0:04:14\tSPEAKER_04\n So all the slides, it was started too late.\n\n0:04:16\tSPEAKER_04\n It's another case of de-voicing at the initial.\n\n0:04:18\tSPEAKER_04\n Yeah.\n\n0:04:19\tSPEAKER_04\n So, I hope that was very interesting.\n\n0:04:21\tSPEAKER_04\n And I think that it shows, these sorts of things, I was thinking of being interesting to do an analysis of these things.\n\n0:04:27\tSPEAKER_04\n Because I think that, first of all, there's this overall point that it shows the degree to which, when you listen to speech and when you're just in general listening, probably.\n\n0:04:37\tSPEAKER_04\n It shows specifically to this task that it's very constructive.\n\n0:04:41\tSPEAKER_04\n You're not going on simply the auditory.\n\n0:04:43\tSPEAKER_04\n There's a huge contribution from the top down processing.\n\n0:04:46\tSPEAKER_04\n And, you know, at different types, you've got the contextual information.\n\n0:04:49\tSPEAKER_04\n You have syntax, you have your mastery of English and these various things.\n\n0:04:53\tSPEAKER_04\n But I think these kinds of errors, it just shows the degree which is not strictly an acoustic task.\n\n0:04:57\tSPEAKER_04\n And the other thing I think that's interesting is the types of, the types of confusions that happen, do preserve certain aspects of the stimulus.\n\n0:05:09\tSPEAKER_04\n So, the stress tends to be preserved.\n\n0:05:12\tSPEAKER_04\n The content word will be substituted for another content word.\n\n0:05:16\tSPEAKER_04\n And it's not surprising that they would hear this.\n\n0:05:19\tSPEAKER_04\n I'm often surprised by how plausible something can be without it being correct.\n\n0:05:26\tSPEAKER_04\n Because it really seems like it's, and then often, you know, there's, the parentheses are used, so the person knew it wasn't really a perfect match.\n\n0:05:37\tSPEAKER_04\n Okay, now having said that, I'm impressed by how, how infrequent these kinds of extreme cases are.\n\n0:05:46\tSPEAKER_04\n Most of the types of things that I find in checking are much, much more mild.\n\n0:05:51\tSPEAKER_02\n So, actually, that comes back to a point.\n\n0:05:53\tSPEAKER_02\n We had talked about this last week.\n\n0:05:55\tSPEAKER_02\n You were interested in so, saying so at the end of something.\n\n0:05:58\tSPEAKER_02\n And sometimes it would get transcribed as, okay, so let me just think of an example.\n\n0:06:04\tSPEAKER_02\n Okay, let's say I say, well, that would be hard to do so.\n\n0:06:08\tSPEAKER_02\n Okay, right?\n\n0:06:09\tSPEAKER_02\n And the way I would transcribe it, I would put that, so that would be hard, comma, so.\n\n0:06:15\tSPEAKER_02\n And yeah, it's kind of just the end of it.\n\n0:06:17\tSPEAKER_05\n Would you put a period after so?\n\n0:06:19\tSPEAKER_02\n Right.\n\n0:06:20\tSPEAKER_02\n You would or you wouldn't.\n\n0:06:21\tSPEAKER_02\n So, yeah, yeah, I was just sort of end it.\n\n0:06:23\tSPEAKER_02\n But then sometimes they transcribe it like, so that would be a problem, period, new word, like capitalized.\n\n0:06:29\tSPEAKER_01\n Right.\n\n0:06:30\tSPEAKER_01\n Like it's a whole new utterance, like it's not connected.\n\n0:06:32\tSPEAKER_02\n Right, and it just seems to sort of like totally, that's not the meaning.\n\n0:06:35\tSPEAKER_02\n And it changes the meaning, I think.\n\n0:06:38\tSPEAKER_04\n And, so, let me be sure I understand.\n\n0:06:41\tSPEAKER_04\n So, you're saying, that's boys hard to ignore that word.\n\n0:06:47\tSPEAKER_04\n So, the example is, that would be hard.\n\n0:06:50\tSPEAKER_02\n Or whatever, yeah, that would be a problem, whatever.\n\n0:06:53\tSPEAKER_04\n So.\n\n0:06:56\tSPEAKER_04\n And how does it change the meaning?\n\n0:06:57\tSPEAKER_02\n What are the two different meanings there?\n\n0:06:59\tSPEAKER_02\n It seems like, because if I was just reading that thing, I would say, so that would be a problem.\n\n0:07:05\tSPEAKER_02\n So.\n\n0:07:06\tSPEAKER_04\n Okay.\n\n0:07:07\tSPEAKER_02\n You know, I mean, if it was done like period capitalized.\n\n0:07:11\tSPEAKER_02\n I'm just saying as opposed to, that would be a problem.\n\n0:07:15\tSPEAKER_02\n So, that would be a problem.\n\n0:07:17\tSPEAKER_05\n I think the second one where this so is all by itself, it's like, so that would be a problem.\n\n0:07:21\tSPEAKER_05\n So.\n\n0:07:23\tSPEAKER_05\n Yeah, the first one is like, the so is connected to the sentence.\n\n0:07:27\tSPEAKER_05\n And that would be a problem.\n\n0:07:30\tSPEAKER_05\n But the next one is like, not connected to that would be a problem.\n\n0:07:33\tSPEAKER_05\n It's like introducing.\n\n0:07:35\tSPEAKER_05\n Yeah, let's.\n\n0:07:36\tSPEAKER_02\n Right, yeah.\n\n0:07:37\tSPEAKER_01\n The first one too is more like, to me, I don't necessarily put a period after that.\n\n0:07:43\tSPEAKER_01\n So, I might actually either put a dash after it, depending on whether or not they got interrupted or something.\n\n0:07:49\tSPEAKER_01\n Or I would maybe even act as though they were just trailing off.\n\n0:07:53\tSPEAKER_01\n So, put those two dots after it.\n\n0:07:55\tSPEAKER_01\n I do that too.\n\n0:07:57\tSPEAKER_01\n Which depending on what's going on, like I'll do that.\n\n0:08:00\tSPEAKER_01\n Because to me, it sounds more like they're trailing off.\n\n0:08:02\tSPEAKER_05\n Sometimes though, it does sound like they ended a sentence.\n\n0:08:05\tSPEAKER_05\n Yeah, yeah.\n\n0:08:06\tSPEAKER_05\n Like sometimes it's just like, that'd be hard, so.\n\n0:08:08\tSPEAKER_05\n Right now.\n\n0:08:09\tSPEAKER_05\n And then often it sounds like they were trying to think of something else to say, but they couldn't really, you know.\n\n0:08:14\tSPEAKER_05\n And then they get interrupted and then I put a dash.\n\n0:08:16\tSPEAKER_05\n Yeah.\n\n0:08:19\tSPEAKER_05\n But I never usually put a period and then new words so unless it's like end of the sentence and then.\n\n0:08:23\tSPEAKER_01\n So.\n\n0:08:24\tSPEAKER_01\n What are we going to do now, but they don't say that.\n\n0:08:26\tSPEAKER_04\n Yeah.\n\n0:08:27\tSPEAKER_04\n It's interesting that there are so many cases and I agree.\n\n0:08:29\tSPEAKER_04\n I think those are very good conventions.\n\n0:08:31\tSPEAKER_04\n Also, this whole point about how the fact that you're raising this, I like this example, that we have several things that are being queued by intonation.\n\n0:08:42\tSPEAKER_04\n Right. Because if that's a nice, far-following intonational contour on, that's a problem.\n\n0:08:47\tSPEAKER_04\n And that'll be a problem.\n\n0:08:49\tSPEAKER_04\n Then I would think that this should be a period there.\n\n0:08:51\tSPEAKER_04\n And then especially if you've got a pause following it, but you don't always see these things are correlated, but they're not.\n\n0:08:57\tSPEAKER_01\n That's another thing is if you're not a native speaker of English, you might not pick up because, you know, every language has different intonation methods.\n\n0:09:05\tSPEAKER_01\n Yeah.\n\n0:09:06\tSPEAKER_05\n That's always one of the hardest part about the native speakers.\n\n0:09:08\tSPEAKER_05\n As you don't know exactly how to do the punctuation because their intonation is totally different.\n\n0:09:14\tSPEAKER_05\n You mean non-native.\n\n0:09:15\tSPEAKER_04\n I mean, non-native speakers is learning it.\n\n0:09:17\tSPEAKER_01\n Yeah.\n\n0:09:18\tSPEAKER_01\n Absolutely.\n\n0:09:19\tSPEAKER_01\n And also if you're a non-native speaker transcribing it, you wouldn't necessarily understand the conventions of English intonation.\n\n0:09:27\tSPEAKER_01\n Right.\n\n0:09:28\tSPEAKER_01\n You know, intimately, as a native speaker, might have native speaker transcribers.\n\n0:09:31\tSPEAKER_04\n I do. I wouldn't have to be something.\n\n0:09:33\tSPEAKER_04\n I do it would be nice to have a spaniard transcribing it.\n\n0:09:37\tSPEAKER_04\n Oh, you mean?\n\n0:09:38\tSPEAKER_01\n Yeah, that's not what I meant, but that would be cool.\n\n0:09:40\tSPEAKER_01\n What I meant was that I would hope that for meetings in English, you would have native speakers transcribing it because you would have more intuitions about what should be there.\n\n0:09:50\tSPEAKER_01\n Even if you can't fully understand the word, you can make a guess you can do.\n\n0:09:54\tSPEAKER_01\n Right.\n\n0:09:55\tSPEAKER_01\n That isn't completely off like some of these are, but they're pretty rare.\n\n0:09:58\tSPEAKER_01\n Those things, the really bad mistakes that they make are pretty rare.\n\n0:10:03\tSPEAKER_04\n So in terms of when you're going through the tigerfish transcribers, you don't find a lot of these kinds of extreme cases.\n\n0:10:09\tSPEAKER_01\n Not this much.\n\n0:10:10\tSPEAKER_01\n Not too some gruesome.\n\n0:10:12\tSPEAKER_01\n Not too some gruesome.\n\n0:10:13\tSPEAKER_01\n Sometimes, but they tend to be pretty good about parentheses.\n\n0:10:20\tSPEAKER_01\n Yeah.\n\n0:10:21\tSPEAKER_05\n Yeah, sometimes they usually put them in parentheses that they cheer yourself.\n\n0:10:24\tSPEAKER_05\n You were way off, but at least you do it your way off.\n\n0:10:27\tSPEAKER_02\n Yeah.\n\n0:10:28\tSPEAKER_02\n I just wonder what influences something to think of to some gruesome, maybe this person just saw horror movie or something.\n\n0:10:35\tSPEAKER_02\n This is the interpretation that came to mind or something.\n\n0:10:38\tSPEAKER_02\n Yeah.\n\n0:10:39\tSPEAKER_02\n You know what I mean?\n\n0:10:40\tSPEAKER_02\n Where would you get the word gruesome?\n\n0:10:42\tSPEAKER_02\n I don't know.\n\n0:10:43\tSPEAKER_01\n You just sort of pull it out of the air.\n\n0:10:45\tSPEAKER_01\n Well, I mean, you get the GR from groups, I guess.\n\n0:10:48\tSPEAKER_01\n Yeah.\n\n0:10:49\tSPEAKER_01\n I don't know where the rest of it came from.\n\n0:10:51\tSPEAKER_05\n Groups have gruesome.\n\n0:10:53\tSPEAKER_02\n Okay.\n\n0:10:54\tSPEAKER_01\n If for some reason they didn't hear the F, if they didn't hear the F, it might just sound like, yeah, gruesome.\n\n0:11:05\tSPEAKER_01\n Yeah.\n\n0:11:06\tSPEAKER_01\n Yeah, it's both.\n\n0:11:08\tSPEAKER_01\n You know, and then you would kind of have to come up with some sort of consonant and maybe it's an M to you.\n\n0:11:13\tSPEAKER_01\n Well, also, because also, I mean, F is, is, um, I don't know where the P went, though.\n\n0:11:24\tSPEAKER_01\n Maybe the P wasn't pronounced right?\n\n0:11:25\tSPEAKER_01\n Yeah.\n\n0:11:26\tSPEAKER_01\n Well, like groups of.\n\n0:11:27\tSPEAKER_01\n Yeah, because it's, um, by label, too, you know, you'll, uh, or interdental, if, you know, it's close enough, I guess, to, um, you know, getting the closure of the lips.\n\n0:11:34\tSPEAKER_01\n So maybe that's what they were getting.\n\n0:11:39\tSPEAKER_01\n I don't know.\n\n0:11:40\tSPEAKER_01\n It's possible.\n\n0:11:41\tSPEAKER_04\n Well, you know, it's also this problem that they didn't have context to constrain the interpretation.\n\n0:11:47\tSPEAKER_04\n Yeah.\n\n0:11:48\tSPEAKER_04\n Yeah.\n\n0:11:49\tSPEAKER_05\n Yeah.\n\n0:11:50\tSPEAKER_05\n Yeah, that's really hard to not be able to go and listen to the other channels and figure out the context of what's occurring in.\n\n0:11:57\tSPEAKER_04\n Yeah.\n\n0:11:58\tSPEAKER_04\n When I'm clearing the parentheses, I find that very useful.\n\n0:12:01\tSPEAKER_04\n Yeah.\n\n0:12:02\tSPEAKER_04\n Sometimes I try to just go through and pick up the parentheses, see if I can do it just by itself.\n\n0:12:06\tSPEAKER_04\n But it's remarkable how sometimes something can be so totally opaque and then you go back to, you know, the person's previous utterance, you go to the mixed channel or you, uh, check on the other things and suddenly becomes perfectly clear.\n\n0:12:18\tSPEAKER_04\n It's very, very surprising.\n\n0:12:20\tSPEAKER_04\n Very surprising.\n\n0:12:21\tSPEAKER_04\n Yeah.\n\n0:12:22\tSPEAKER_02\n But this other business, um, that you have at the bottom with people getting transcribed on another channel.\n\n0:12:31\tSPEAKER_02\n Yes.\n\n0:12:32\tSPEAKER_02\n Is that what it's about?\n\n0:12:33\tSPEAKER_01\n It's much more common.\n\n0:12:34\tSPEAKER_01\n I wasn't, I couldn't, I don't know, for some reason that didn't make sense to me, but that's about when things are transcribed on other channels.\n\n0:12:39\tSPEAKER_01\n Right.\n\n0:12:40\tSPEAKER_02\n What's always funny to me is when it's, you know, they miss the gender completely like, you know, more going to be on Jane's channel or just something bizarre like that.\n\n0:12:47\tSPEAKER_02\n Yeah.\n\n0:12:48\tSPEAKER_01\n Um, so maybe it's because they don't realize that you're supposed to do, I mean, maybe they don't really realize that you're supposed to split it up or say like, maybe they think, well, I hear it just as clearly.\n\n0:12:59\tSPEAKER_01\n I hear this other person's voice just as clearly and I realize it's not Jane and I realize it's not a female even.\n\n0:13:04\tSPEAKER_01\n But, um, because it's so clear on this channel, I'm supposed to do it.\n\n0:13:08\tSPEAKER_01\n I'm supposed to transcribe it.\n\n0:13:10\tSPEAKER_01\n Yeah.\n\n0:13:11\tSPEAKER_01\n I imagine that that might be what that is.\n\n0:13:12\tSPEAKER_01\n And if you don't even know how many people are at the meeting or anything.\n\n0:13:15\tSPEAKER_04\n Yeah, it's really an odd task in a way because they have no clues at all about how dominant the speaker is on the channel of transcribing.\n\n0:13:23\tSPEAKER_04\n And the presigment doesn't give them any information either.\n\n0:13:26\tSPEAKER_04\n I'm sure that it's because of the, wow.\n\n0:13:29\tSPEAKER_01\n Yeah.\n\n0:13:30\tSPEAKER_01\n We're really spoiled then with that interface.\n\n0:13:32\tSPEAKER_01\n Fancy, yeah.\n\n0:13:33\tSPEAKER_01\n Fancy.\n\n0:13:34\tSPEAKER_02\n Yeah, it's very useful.\n\n0:13:38\tSPEAKER_02\n If I was going to make just a guess, though, my experience, it would seem like the men get missed.\n\n0:13:42\tSPEAKER_02\n The men get moved on to other channels maybe more frequently and it's just probably because they have deeper voices and they're getting picked up on more channels.\n\n0:13:49\tSPEAKER_04\n That would make that would make some sense.\n\n0:13:51\tSPEAKER_01\n That would make some sense.\n\n0:13:52\tSPEAKER_01\n Yeah.\n\n0:13:53\tSPEAKER_01\n Or they just tend to.\n\n0:13:54\tSPEAKER_01\n It's an acoustic thing.\n\n0:13:55\tSPEAKER_01\n That's true. That's the louder, man.\n\n0:13:56\tSPEAKER_01\n They do say that men's voices carry better.\n\n0:13:59\tSPEAKER_01\n I mean, that's why they use, like, I think, who's talking about Ian Madison was talking about this, that they use male voices.\n\n0:14:03\tSPEAKER_01\n And male voices in airports.\n\n0:14:07\tSPEAKER_01\n Oh.\n\n0:14:08\tSPEAKER_01\n Because the acoustics of it just fits into the hearers' minds.\n\n0:14:13\tSPEAKER_01\n Right.\n\n0:14:14\tSPEAKER_01\n And that's what I'm saying.\n\n0:14:15\tSPEAKER_01\n Yeah, it fits into a hearers' range of perception better than a lot of female voices.\n\n0:14:21\tSPEAKER_01\n And so that's why they use male voices.\n\n0:14:23\tSPEAKER_01\n We're just talking about that.\n\n0:14:24\tSPEAKER_01\n We're just talking about that.\n\n0:14:25\tSPEAKER_01\n Because it's hard to hear.\n\n0:14:27\tSPEAKER_01\n I have those strange computerized voices.\n\n0:14:29\tSPEAKER_01\n Yeah, those are actually probably just the computer problem, not the gender problem.\n\n0:14:35\tSPEAKER_04\n So this means that people with hearing problems would hear one of these announcements better if they're male voices.\n\n0:14:40\tSPEAKER_01\n Yeah, depending on their auditory capabilities.\n\n0:14:43\tSPEAKER_01\n I mean, if their auditory capabilities have been, you know, squished down in a certain place where it would be easier for a person with normal hearing to hear a male's voice.\n\n0:14:58\tSPEAKER_01\n Like I'm saying, if they had some sort of, you know, damage to part of their brain that processes auditory information, then if that part of the brain normally codes for, you know, male voices in a normal hearer, then they might not be able to, you know, does that make sense?\n\n0:15:22\tSPEAKER_01\n Like if that part is damaged. But yeah, I guess from most hearers, it's just easier.\n\n0:15:28\tSPEAKER_01\n And it's like a certain kind of rough male voice to kind of grass-beer, or raspian.\n\n0:15:36\tSPEAKER_01\n It's better.\n\n0:15:37\tSPEAKER_04\n It's better.\n\n0:15:38\tSPEAKER_04\n That's wider ban, then.\n\n0:15:39\tSPEAKER_04\n Yeah, it might be from the...\n\n0:15:41\tSPEAKER_04\n She asked this question last time, which was whether our system here, the recording system, may have some of the same channel restrictions.\n\n0:15:51\tSPEAKER_04\n Such as they ran across when they were looking at telephone transmissions, certain point.\n\n0:15:58\tSPEAKER_04\n Because, you know, telephone transmissions, there's some filtering going on. You don't hear the full band of frequencies.\n\n0:16:05\tSPEAKER_04\n And I asked a couple of people, and the answer came back that it was interesting.\n\n0:16:11\tSPEAKER_04\n It's reminded me because of the comment about noise. Noise being...\n\n0:16:15\tSPEAKER_04\n Really spreading frequencies across... using frequencies across a broader spectrum. So in a way, bandwidth can increase with some of these cases of distortion that we have.\n\n0:16:24\tSPEAKER_04\n But it's not a useful kind of increase.\n\n0:16:27\tSPEAKER_04\n Right.\n\n0:16:28\tSPEAKER_01\n Because there are...\n\n0:16:29\tSPEAKER_01\n I was just saying it, you know, sometimes, if you remember, I was saying, like, if there's a discrepancy between fricatives, you know, like, sure, or so, we'll show up in a certain part of the spectrum.\n\n0:16:39\tSPEAKER_01\n Yeah. And oftentimes, foo is, like, knocked out of the spectrum by filtering, or something.\n\n0:16:46\tSPEAKER_01\n By filtering some of the older phones.\n\n0:16:49\tSPEAKER_01\n So what was the answer here?\n\n0:16:51\tSPEAKER_01\n It's not the case.\n\n0:16:52\tSPEAKER_04\n That they don't have a reduction in that direction.\n\n0:16:57\tSPEAKER_04\n You know, one could have if one had cheaper microphones than we have, but we've got good microphones.\n\n0:17:02\tSPEAKER_04\n Now, there is sort of an upper limit set on our bandwidth by the sampling rate. But then it becomes... so Adam says, that then it becomes a matter of, is that something that would be relevant to perceptual range?\n\n0:17:15\tSPEAKER_04\n And I didn't really have the sense that it would.\n\n0:17:17\tSPEAKER_01\n I didn't get that from him, actually.\n\n0:17:19\tSPEAKER_01\n I felt like he was basically saying that for all intents and purposes with this, it's covering whatever sounds are necessary to be covered, like everything.\n\n0:17:30\tSPEAKER_01\n Good.\n\n0:17:31\tSPEAKER_04\n That was my impression also. So we don't have that kind of reduction, like you have in telephone.\n\n0:17:35\tSPEAKER_04\n And actually, in the work that they were doing with the telephone corpura, they did run into limitations in certain times that they...\n\n0:17:42\tSPEAKER_04\n what their speech recognition approach is because of the filtering.\n\n0:17:46\tSPEAKER_04\n I mean, it does seem like when I hear these things, except for the distortion parts, where the volume's too high, or of course, when the volume's too low, but that's a different problem.\n\n0:17:54\tSPEAKER_04\n Except for those cases, it seems to me that it really is as if the person we're speaking in my ear, I don't feel it is being reduced in any way.\n\n0:18:01\tSPEAKER_04\n Yeah, I do too.\n\n0:18:03\tSPEAKER_04\n Yeah.\n\n0:18:04\tSPEAKER_04\n And he was saying in the areas where you have clipping where it's recorded too high and it starts to saturate and you have trouble.\n\n0:18:13\tSPEAKER_04\n I thought that was very interesting. So bandwidth then gets actually wider instead of narrower because you have...\n\n0:18:21\tSPEAKER_04\n Oh. Yeah. These... you still have...\n\n0:18:25\tSPEAKER_04\n Inferno frequencies are represented, but the energy distributions are thrown off.\n\n0:18:29\tSPEAKER_04\n And in fact, you have also some additional frequencies. So you end up with a wider bandwidth functionally.\n\n0:18:35\tSPEAKER_04\n Yeah.\n\n0:18:36\tSPEAKER_01\n So like you're saying...\n\n0:18:37\tSPEAKER_01\n Not awful for speech.\n\n0:18:38\tSPEAKER_01\n In the case of something with clipping, were you saying that it increases to...\n\n0:18:43\tSPEAKER_01\n or expands to accommodate that?\n\n0:18:45\tSPEAKER_04\n No, technically the bandwidth is wider.\n\n0:18:47\tSPEAKER_04\n So it's actually paradoxical in a way, so usually think bandwidth... better bandwidth is better.\n\n0:18:52\tSPEAKER_04\n But in the case of distortion, then you can end up with...\n\n0:18:55\tSPEAKER_01\n Right, okay.\n\n0:18:56\tSPEAKER_04\n A wider bandwidth, which isn't useful in terms of understanding speech.\n\n0:19:01\tSPEAKER_04\n So...\n\n0:19:03\tSPEAKER_01\n I have a question.\n\n0:19:04\tSPEAKER_01\n Yes.\n\n0:19:05\tSPEAKER_01\n In some of the earlier meetings, I guess, there was a lot of spikes or what I called spikes.\n\n0:19:10\tSPEAKER_01\n Yes.\n\n0:19:11\tSPEAKER_01\n I was wondering what that is.\n\n0:19:14\tSPEAKER_01\n I don't even know if it's relevant or useful to know.\n\n0:19:16\tSPEAKER_04\n One source was there was a problem with a connection where the microphone went into a box.\n\n0:19:21\tSPEAKER_04\n I was trying to think if this is prior to... yes, it's prior to the wireless.\n\n0:19:25\tSPEAKER_04\n There was a particular connection, which wasn't wireless, which was mechanically bad in some sense.\n\n0:19:31\tSPEAKER_04\n And if it got touched, it would send an impulse.\n\n0:19:35\tSPEAKER_04\n In a relevant, non-wanted...\n\n0:19:38\tSPEAKER_01\n Sometimes where...\n\n0:19:39\tSPEAKER_01\n Artifact.\n\n0:19:40\tSPEAKER_01\n Extraordinary, bad, and painful.\n\n0:19:42\tSPEAKER_01\n Yeah, absolutely painful.\n\n0:19:43\tSPEAKER_04\n Exactly, I agree.\n\n0:19:44\tSPEAKER_04\n And that's... you know, I would watch the visual system...\n\n0:19:47\tNone\n...and I would say...\n\n0:19:49\tSPEAKER_01\n...it's like...\n\n0:19:50\tSPEAKER_01\n...coming to the volume.\n\n0:19:51\tSPEAKER_01\n Yeah, I remember I had one with that, and it was just all... all the time.\n\n0:19:55\tSPEAKER_01\n Yeah, yeah.\n\n0:19:56\tSPEAKER_01\n Especially if they also got louder too.\n\n0:19:59\tSPEAKER_01\n And they... it was just like...\n\n0:20:01\tSPEAKER_04\n...oh, fuck.\n\n0:20:02\tSPEAKER_04\n Yeah, that's really awful.\n\n0:20:04\tSPEAKER_04\n You've noticed that those have gotten better over the years.\n\n0:20:06\tSPEAKER_02\n Absolutely.\n\n0:20:07\tSPEAKER_02\n Sometimes you'll see like something coming up like...\n\n0:20:10\tSPEAKER_02\n...oh, someone's gonna cough really loudly.\n\n0:20:12\tSPEAKER_02\n And I... it's like... it's like...\n\n0:20:14\tSPEAKER_02\n Yeah.\n\n0:20:15\tSPEAKER_02\n Or someone's about to laugh really loudly.\n\n0:20:17\tSPEAKER_01\n And so you turn it down.\n\n0:20:18\tSPEAKER_02\n Yeah, and then you're just sort... you've got like...\n\n0:20:20\tSPEAKER_01\n You know?\n\n0:20:21\tSPEAKER_01\n Take one off or something.\n\n0:20:22\tSPEAKER_02\n Yeah.\n\n0:20:23\tSPEAKER_02\n So, I think...\n\n0:20:24\tSPEAKER_02\n...there's gonna be some speech in there.\n\n0:20:25\tSPEAKER_01\n I think that's really important.\n\n0:20:26\tSPEAKER_01\n I think that's really important.\n\n0:20:27\tSPEAKER_01\n Yeah, I think that's really important.\n\n0:20:28\tSPEAKER_01\n Because I generally have the volume turned up...\n\n0:20:30\tSPEAKER_01\n...to above normal volume, just so I can hear more clearly.\n\n0:20:33\tSPEAKER_01\n And if it's like that for someone...\n\n0:20:35\tSPEAKER_01\n...screaching into the microphone...\n\n0:20:37\tSPEAKER_02\n...you could really hurt your ears.\n\n0:20:38\tSPEAKER_02\n I think you could.\n\n0:20:39\tSPEAKER_04\n Oh, yeah.\n\n0:20:40\tSPEAKER_04\n I think so too, yeah.\n\n0:20:41\tSPEAKER_04\n I realize...\n\n0:20:42\tSPEAKER_04\n I realize... I... I meant to tell everyone to watch that visual signal...\n\n0:20:45\tSPEAKER_04\n...because that's... that saved me a bunch of times.\n\n0:20:48\tSPEAKER_01\n It's a good clues.\n\n0:20:49\tSPEAKER_01\n Yeah, it means very useful and like all senses.\n\n0:20:51\tSPEAKER_01\n Oh, yeah.\n\n0:20:52\tSPEAKER_01\n Oh, yeah.\n\n0:20:53\tSPEAKER_02\n Yeah.\n\n0:20:54\tSPEAKER_02\n That's very good.\n\n0:20:55\tSPEAKER_02\n Sometimes it doesn't pick up back channeling though.\n\n0:20:57\tSPEAKER_02\n And so sometimes you have to try to listen to your visual.\n\n0:21:01\tSPEAKER_02\n To your visual, but...\n\n0:21:02\tSPEAKER_02\n Yeah, you have to... the resolution.\n\n0:21:04\tSPEAKER_02\n Yeah.\n\n0:21:05\tSPEAKER_04\n But it's very useful to talk about the interface for... for a bit...\n\n0:21:08\tSPEAKER_04\n...terms of what it is that you like, particularly what you don't.\n\n0:21:11\tSPEAKER_04\n And kind of thing.\n\n0:21:13\tSPEAKER_05\n You know what, I would think would be a really neat feature for the interface.\n\n0:21:16\tSPEAKER_05\n Some sort of backwards tab where it could go backwards without you having to...\n\n0:21:20\tSPEAKER_05\n...go up and do it manually.\n\n0:21:22\tSPEAKER_05\n Yeah.\n\n0:21:23\tSPEAKER_05\n And you press the button and...\n\n0:21:25\tSPEAKER_05\n...because if you miss something and you want to go back to it, it's such a...\n\n0:21:28\tSPEAKER_05\n...such a hassle.\n\n0:21:29\tSPEAKER_05\n It'd be so nice if there was just some sort of like, you know...\n\n0:21:32\tSPEAKER_05\n...oppositive tab that you could hit that it would just sort of move backwards.\n\n0:21:35\tSPEAKER_05\n There wouldn't even have to be any...\n\n0:21:38\tSPEAKER_00\n...would play it backwards.\n\n0:21:39\tSPEAKER_05\n You know, you wouldn't even have to have the audio.\n\n0:21:41\tSPEAKER_05\n That's not... I wouldn't... I mean...\n\n0:21:42\tSPEAKER_01\n But just to move back, but not necessarily a whole time been.\n\n0:21:45\tSPEAKER_04\n Yeah.\n\n0:21:46\tSPEAKER_04\n Interesting.\n\n0:21:47\tSPEAKER_02\n Right, because sometimes you'll hear it'll be in the middle of the time been...\n\n0:21:50\tSPEAKER_02\n...and you'll listen to the whole thing again.\n\n0:21:52\tSPEAKER_00\n Because you already got in the first...\n\n0:21:53\tSPEAKER_02\n Oh, yeah.\n\n0:21:54\tSPEAKER_02\n So you just want it to go back.\n\n0:21:55\tSPEAKER_02\n I don't know why you have to drag it.\n\n0:21:57\tSPEAKER_01\n You have to drag it.\n\n0:21:58\tSPEAKER_05\n Or you can drag it or like...\n\n0:21:59\tSPEAKER_05\n If you miss it, you know, you've got to go back and find it and...\n\n0:22:02\tSPEAKER_05\n...dragging it and looking for it.\n\n0:22:03\tSPEAKER_05\n Or you may not be able to see it even, you know.\n\n0:22:05\tSPEAKER_01\n That's true.\n\n0:22:06\tSPEAKER_01\n I think that would be useful.\n\n0:22:07\tSPEAKER_04\n Yeah.\n\n0:22:08\tSPEAKER_04\n Interesting idea, Al.\n\n0:22:09\tSPEAKER_04\n I'll suggest that to the...\n\n0:22:10\tSPEAKER_02\n Yeah, the less you have to click on the mouse, I think the faster you have to click.\n\n0:22:13\tSPEAKER_01\n Yeah, because I noticed I started feeling like I was getting some sort of...\n\n0:22:16\tSPEAKER_01\n...couple-tone wrist problems and stuff.\n\n0:22:18\tSPEAKER_01\n Much better now that I have the keyboard tray, but it was...\n\n0:22:20\tSPEAKER_01\n Yeah.\n\n0:22:21\tSPEAKER_01\n I think because I had my hand in one position using it all the time...\n\n0:22:24\tSPEAKER_01\n...that I would... it would crack a lot.\n\n0:22:27\tSPEAKER_04\n It's very weird.\n\n0:22:28\tSPEAKER_04\n And it's good to be careful about the mouse.\n\n0:22:30\tSPEAKER_04\n You're gonna see it.\n\n0:22:31\tSPEAKER_01\n Oh yeah, something... maybe I just don't know how to do this.\n\n0:22:34\tSPEAKER_01\n But when I want to expand a time bin back, or even forward, I'll use the mouse.\n\n0:22:38\tSPEAKER_01\n The middle...\n\n0:22:39\tSPEAKER_04\n How do you mean expand?\n\n0:22:41\tSPEAKER_01\n Oh, in terms of...\n\n0:22:43\tSPEAKER_01\n...if it's cut off like the beginning of a nut or something.\n\n0:22:47\tSPEAKER_01\n I'm not serious.\n\n0:22:48\tSPEAKER_01\n...to keep the line back.\n\n0:22:49\tSPEAKER_01\n And I usually just use the mouse.\n\n0:22:50\tSPEAKER_01\n How do you do that with the keyboard?\n\n0:22:51\tSPEAKER_05\n Oh, I do that with the keyboard.\n\n0:22:53\tSPEAKER_01\n Well, I would press the mouse here.\n\n0:22:54\tSPEAKER_01\n Tab and listen to where I wanted it to stop.\n\n0:22:56\tSPEAKER_01\n And then press return.\n\n0:22:57\tSPEAKER_01\n And create a new time bin.\n\n0:22:58\tSPEAKER_01\n Or then shift.\n\n0:22:59\tSPEAKER_01\n And then shift.\n\n0:23:00\tSPEAKER_01\n What do you see just with that one?\n\n0:23:02\tSPEAKER_05\n I do it all on the keyboard.\n\n0:23:04\tSPEAKER_01\n To me, that takes longer than to do it with the mouse.\n\n0:23:07\tSPEAKER_01\n Oh, really?\n\n0:23:08\tSPEAKER_01\n Because you can just drag.\n\n0:23:09\tSPEAKER_01\n You just drag the...\n\n0:23:10\tSPEAKER_01\n I never do that for some reason.\n\n0:23:12\tSPEAKER_01\n I really do.\n\n0:23:13\tSPEAKER_04\n It depends on how much I want to go back and how certain the boundary is.\n\n0:23:16\tSPEAKER_04\n If I can see this thing's coming up, and it's just so clear, is that mountain right there?\n\n0:23:21\tSPEAKER_04\n Yeah.\n\n0:23:22\tSPEAKER_04\n That all dry...\n\n0:23:23\tSPEAKER_04\n Yeah, dragging is really efficient.\n\n0:23:24\tSPEAKER_04\n But if it's like a mess in there, then it helps me to be able to locate it with the actual clicking.\n\n0:23:29\tSPEAKER_04\n Right.\n\n0:23:30\tSPEAKER_04\n And then do this, whether you were just describing.\n\n0:23:32\tSPEAKER_01\n Yeah.\n\n0:23:33\tSPEAKER_01\n One thing that's gotten me into problems a little bit is having the shift back space as the collapseer.\n\n0:23:40\tSPEAKER_01\n Ah, yeah.\n\n0:23:41\tSPEAKER_01\n Because I'll tend to delete things or go too far or something.\n\n0:23:45\tSPEAKER_01\n Or I'll be holding down shift because I want to type something as a capital.\n\n0:23:48\tSPEAKER_01\n And then I'll end up collapsing.\n\n0:23:50\tSPEAKER_01\n The collapseer, I just want to...\n\n0:23:52\tSPEAKER_04\n If I need to add an option, it might be to have an undo for that.\n\n0:23:57\tSPEAKER_04\n Yeah.\n\n0:23:58\tSPEAKER_01\n Yeah.\n\n0:23:59\tSPEAKER_01\n I've never used an entire utterances before.\n\n0:24:02\tSPEAKER_01\n Or just to change the keys used for that option.\n\n0:24:05\tSPEAKER_01\n I'm rather used to it now.\n\n0:24:06\tSPEAKER_01\n I'm used to it too but...\n\n0:24:08\tSPEAKER_01\n But then when you go to type on your keyboard at home...\n\n0:24:11\tSPEAKER_01\n Do do do...\n\n0:24:13\tNone\n...So scared!\n\n0:24:15\tSPEAKER_03\n Do you type a capital in there?\n\n0:24:22\tNone\n I'm going to teach you.\n\n0:24:27\tNone\n There's the camera, dude.\n\n0:24:30\tSPEAKER_05\n I'm going to do that.\n\n0:24:31\tSPEAKER_05\n I think of that.\n\n0:24:36\tSPEAKER_02\n Oh yeah, I do find that the keyboard is different here than it is even for my school computer.\n\n0:24:41\tSPEAKER_02\n And so I'll just be, if I was just at school and I come here, it's just, or vice versa.\n\n0:24:47\tSPEAKER_02\n Or vice versa, yeah.\n\n0:24:48\tSPEAKER_02\n I'll reach for one key and it'll do something completely different.\n\n0:24:51\tSPEAKER_02\n That backspace and those little...\n\n0:24:53\tSPEAKER_05\n Yeah, the backspace is a little...\n\n0:24:54\tSPEAKER_05\n And the little evil apostrophe that keeps showing up.\n\n0:24:58\tSPEAKER_02\n Oh, you're just keeping on the box locking.\n\n0:25:01\tSPEAKER_02\n Oh, too, because caps lock is in a different spot.\n\n0:25:03\tSPEAKER_02\n Oh, yeah.\n\n0:25:04\tSPEAKER_04\n So how do you get...\n\n0:25:05\tSPEAKER_04\n I don't know the evil apostrophe.\n\n0:25:07\tSPEAKER_04\n It's right above the front.\n\n0:25:09\tSPEAKER_05\n Yeah, it's what the space is on the keyboards that most of us are probably used to.\n\n0:25:12\tSPEAKER_05\n So you're going to pass through your apostrophe.\n\n0:25:15\tSPEAKER_05\n Yeah.\n\n0:25:16\tSPEAKER_04\n Oh, I see it.\n\n0:25:18\tSPEAKER_04\n Okay, so this is the difference between the PC keyboard and the sun keyboard.\n\n0:25:21\tSPEAKER_04\n So we're probably going to have one versus two of the others.\n\n0:25:24\tSPEAKER_04\n Right, so I'm not really used to it now too.\n\n0:25:26\tSPEAKER_01\n I'm not really used to it now too.\n\n0:25:27\tSPEAKER_01\n I'm used to the sun one, I guess now.\n\n0:25:29\tSPEAKER_01\n But then, I think there's a different keyboard on...\n\n0:25:32\tSPEAKER_01\n I always forget...\n\n0:25:33\tSPEAKER_01\n Oh, a winged...\n\n0:25:34\tSPEAKER_01\n...then on...\n\n0:25:35\tSPEAKER_01\n Best money?\n\n0:25:37\tSPEAKER_01\n No, the other one.\n\n0:25:38\tSPEAKER_01\n I'm righto.\n\n0:25:39\tSPEAKER_01\n I'm righto.\n\n0:25:40\tSPEAKER_01\n Okay.\n\n0:25:41\tSPEAKER_01\n I'm righto has a different one.\n\n0:25:42\tSPEAKER_01\n Linguini is Buzz's money.\n\n0:25:43\tSPEAKER_01\n I always use a tend to use linguini the last couple times, like you've stolen linguini before I can...\n\n0:25:47\tSPEAKER_01\n Oh, I'm righto.\n\n0:25:49\tSPEAKER_01\n Which is fun.\n\n0:25:50\tSPEAKER_01\n But then, like, it takes me a good 10 minutes to get reused to that keyboard.\n\n0:25:54\tSPEAKER_01\n Yeah.\n\n0:25:55\tSPEAKER_02\n And so I can...\n\n0:25:56\tSPEAKER_02\n I don't know, you seem very upset about it.\n\n0:25:57\tSPEAKER_02\n Oh, you're okay.\n\n0:26:00\tSPEAKER_01\n Oh, yeah, I have noticed it.\n\n0:26:03\tSPEAKER_01\n I'll screw some stuff up, like, when I'm trying to use it.\n\n0:26:06\tSPEAKER_01\n So which...\n\n0:26:07\tSPEAKER_04\n I forgot which one is which.\n\n0:26:08\tSPEAKER_04\n So which one do you prefer?\n\n0:26:10\tSPEAKER_04\n So if we had a show of hands, how many people would vote for this?\n\n0:26:12\tSPEAKER_04\n How many people would vote for the Sun keyboard versus the...\n\n0:26:15\tSPEAKER_04\n So let's put it the other way.\n\n0:26:16\tSPEAKER_04\n How many people would not vote for the Sun keyboard?\n\n0:26:18\tSPEAKER_04\n Would vote for the other one.\n\n0:26:19\tSPEAKER_04\n The PC...\n\n0:26:20\tSPEAKER_01\n PC one?\n\n0:26:21\tSPEAKER_01\n I would...\n\n0:26:22\tSPEAKER_01\n PC one is Amarado one, right?\n\n0:26:23\tSPEAKER_04\n I don't know.\n\n0:26:24\tSPEAKER_04\n I'm not sure it's...\n\n0:26:25\tSPEAKER_05\n Yeah.\n\n0:26:26\tSPEAKER_05\n I'm not sure which one is which.\n\n0:26:27\tSPEAKER_02\n I think it used to it.\n\n0:26:28\tSPEAKER_02\n So...\n\n0:26:29\tSPEAKER_02\n Yeah.\n\n0:26:30\tSPEAKER_05\n When I first asked for one, I would have definitely wanted the PC keyboard, but now I'm...\n\n0:26:34\tSPEAKER_05\n I'm just used to it.\n\n0:26:35\tSPEAKER_01\n I prefer the one on linguini Buzz's money.\n\n0:26:39\tSPEAKER_01\n I don't know what it's got.\n\n0:26:40\tSPEAKER_04\n Okay, let's do it that way.\n\n0:26:41\tSPEAKER_04\n So if we have a map of the room, the one when you first walk in...\n\n0:26:44\tSPEAKER_04\n Is Buzz's money.\n\n0:26:45\tSPEAKER_02\n Well, the one on the left is the Buzz's money.\n\n0:26:47\tSPEAKER_02\n Yeah, that's correct.\n\n0:26:48\tSPEAKER_02\n Linguini must be the one...\n\n0:26:50\tSPEAKER_02\n Linguini is the one on the corner.\n\n0:26:51\tNone\n Right, that...\n\n0:26:52\tNone\n Yeah, the one on the right...\n\n0:26:53\tSPEAKER_05\n The right corner is the PC.\n\n0:26:54\tSPEAKER_05\n Yeah, that one's got the PC keyboard, and then the two on those sides have the...\n\n0:27:01\tSPEAKER_01\n Yeah, so basically right as you walk in the door, the one straight ahead of you...\n\n0:27:04\tSPEAKER_01\n Right.\n\n0:27:05\tSPEAKER_01\n...is Amarado.\n\n0:27:06\tSPEAKER_01\n And the one to the left of that against the far corner...\n\n0:27:10\tSPEAKER_01\n Good.\n\n0:27:11\tSPEAKER_01\n...is Linguini.\n\n0:27:12\tSPEAKER_04\n Okay.\n\n0:27:13\tSPEAKER_04\n And the one close to you is Buzz's money.\n\n0:27:14\tSPEAKER_04\n Right.\n\n0:27:15\tSPEAKER_04\n So now, who would...\n\n0:27:16\tSPEAKER_04\n So if you have a strong...\n\n0:27:17\tSPEAKER_04\n Now, you're by keyboard also.\n\n0:27:19\tSPEAKER_04\n Ah, you're...\n\n0:27:20\tSPEAKER_04\n...but now...\n\n0:27:22\tSPEAKER_04\n Who would prefer the keyboard on Linguini?\n\n0:27:27\tSPEAKER_04\n Okay, we got two votes for Linguini.\n\n0:27:30\tSPEAKER_04\n And who would prefer Amarado?\n\n0:27:33\tSPEAKER_04\n Amarado?\n\n0:27:34\tSPEAKER_04\n So we got more multi-keyboardal people.\n\n0:27:36\tSPEAKER_02\n I just have no preference.\n\n0:27:37\tSPEAKER_02\n That's lovely.\n\n0:27:38\tSPEAKER_02\n So, you can sit here.\n\n0:27:40\tSPEAKER_02\n Next line.\n\n0:27:41\tSPEAKER_02\n Okay, so it proves me up for like maybe a minute and then I sort of get used to it.\n\n0:27:44\tSPEAKER_01\n Yeah, I could get used to it too.\n\n0:27:45\tSPEAKER_01\n Yeah, I could get used to it too.\n\n0:27:46\tSPEAKER_01\n Okay, I just am very used to.\n\n0:27:47\tSPEAKER_04\n Right.\n\n0:27:48\tSPEAKER_04\n I see...\n\n0:27:49\tSPEAKER_04\n I have experienced this keyboard conflict, and with me the things that are confusing are where the control key is.\n\n0:27:54\tSPEAKER_04\n So I end up pressing shifts and control keys whenever I want the other one, whichever it is.\n\n0:28:00\tSPEAKER_04\n I can easily put a PC keyboard in there if anyone had...\n\n0:28:03\tSPEAKER_04\n We already have one.\n\n0:28:04\tSPEAKER_04\n I could add another one.\n\n0:28:05\tSPEAKER_04\n Right.\n\n0:28:06\tSPEAKER_04\n So maybe let me know if you want it to have it shifted.\n\n0:28:10\tSPEAKER_04\n But, um...\n\n0:28:12\tSPEAKER_04\n Okay.\n\n0:28:13\tSPEAKER_04\n That's good.\n\n0:28:15\tSPEAKER_04\n Oh, let me see.\n\n0:28:16\tSPEAKER_04\n So, um...\n\n0:28:17\tSPEAKER_04\n I wanted to maybe comment a little more on the interface in terms of what aspects of it are helpful in this.\n\n0:28:24\tSPEAKER_04\n And one thing that I've really been surprised by is how unique the shapes of some of these things are.\n\n0:28:31\tSPEAKER_04\n I know we had this interface for time when people were doing marking of the numbers.\n\n0:28:36\tSPEAKER_04\n And, um...\n\n0:28:38\tSPEAKER_04\n Forgotten, someone said that they could recognize a 7 when they saw it.\n\n0:28:42\tSPEAKER_04\n They could see the way of forming the 7.\n\n0:28:44\tSPEAKER_01\n I remember recognizing certain numbers.\n\n0:28:47\tSPEAKER_01\n I don't remember which ones.\n\n0:28:50\tSPEAKER_01\n I think it was maybe...\n\n0:28:52\tSPEAKER_01\n Well, I could recognize when there was a fricative at the beginning of a number.\n\n0:28:56\tSPEAKER_01\n For some reason it was like a little bit of energy or something, whatever you call it, and then it grew really big.\n\n0:29:01\tSPEAKER_01\n So like 4 and 5 and 3, I'll have the same characteristic.\n\n0:29:05\tSPEAKER_01\n And 6 and 7, I'll both have the same characteristics of the beginnings.\n\n0:29:09\tSPEAKER_01\n But 6 and 8...\n\n0:29:12\tSPEAKER_01\n 8...\n\n0:29:14\tSPEAKER_01\n Um, I remember that people tended to not pronounce the last T.\n\n0:29:20\tSPEAKER_01\n Oh.\n\n0:29:21\tSPEAKER_01\n And when they did it was slightly farther away from the rest of the word than you would have expected.\n\n0:29:26\tSPEAKER_01\n Same with 6.\n\n0:29:28\tSPEAKER_01\n Well, the cast or the other.\n\n0:29:31\tSPEAKER_01\n Yeah.\n\n0:29:33\tSPEAKER_01\n That was really interesting to notice that.\n\n0:29:36\tSPEAKER_01\n It was a very different interface though.\n\n0:29:39\tSPEAKER_01\n It is different.\n\n0:29:40\tSPEAKER_04\n Well, it would have had the benefit of...\n\n0:29:43\tSPEAKER_04\n So this was to handle the digits only, which is what you figure.\n\n0:29:47\tSPEAKER_04\n And did you... I thought you might have done that, Joy. Did you? So two people did that, I thought...\n\n0:29:53\tSPEAKER_04\n Did you do it?\n\n0:29:54\tSPEAKER_04\n I thought so good.\n\n0:29:55\tSPEAKER_02\n Just a little bit.\n\n0:29:56\tSPEAKER_02\n Yeah, I only did a little bit.\n\n0:29:57\tSPEAKER_02\n What happened to that? You just stopped doing it?\n\n0:29:59\tSPEAKER_04\n Well, I think that we'll bring it back.\n\n0:30:00\tSPEAKER_04\n Oh, okay.\n\n0:30:01\tSPEAKER_05\n This was a different interface entirely?\n\n0:30:03\tSPEAKER_04\n Yeah.\n\n0:30:04\tSPEAKER_04\n Adam wrote this using the same computer language as Channel Trans is written in.\n\n0:30:09\tSPEAKER_04\n And what it would do is present you with the digit string that the person was supposed to have said.\n\n0:30:14\tSPEAKER_04\n And then you would listen to it.\n\n0:30:17\tSPEAKER_04\n And there were two parts of the task one of them was to see if that's what they actually said and to indicate, you know, transcribe errors of it.\n\n0:30:24\tSPEAKER_04\n And then the other aspect was to tighten the time bins.\n\n0:30:27\tSPEAKER_04\n And those data were actually used in some analyses, which showed very, very good results.\n\n0:30:32\tSPEAKER_04\n Good, wow.\n\n0:30:33\tSPEAKER_04\n And so it shows... I mean, it's useful.\n\n0:30:35\tSPEAKER_04\n This is why we do these digits.\n\n0:30:37\tSPEAKER_04\n It's a nice standard task.\n\n0:30:38\tSPEAKER_04\n And you have lots of different voices.\n\n0:30:40\tSPEAKER_04\n And it's very clear.\n\n0:30:42\tSPEAKER_04\n You know what the canonical answer is when a person says a number, at least most of the time, you know what number it was they said.\n\n0:30:50\tSPEAKER_04\n So it's ground truth as they call it, it's very clear.\n\n0:30:53\tSPEAKER_04\n But it was really rather minimal.\n\n0:30:57\tSPEAKER_04\n I mean, I like that interface very efficient.\n\n0:30:59\tSPEAKER_04\n And really, I think that we'll probably use it for getting the digits refined in terms of their time bins.\n\n0:31:05\tSPEAKER_01\n If I remember correctly, it seemed to be very efficient in the key strokes that you used to do certain things.\n\n0:31:11\tSPEAKER_01\n So I can't remember what they were now, but I just remember that it was once you learned them, it was very neat and concise and...\n\n0:31:19\tSPEAKER_01\n Excellent.\n\n0:31:20\tSPEAKER_02\n A couple of keys that you'd be finding them.\n\n0:31:22\tSPEAKER_02\n I would get the whole... I get the whole transfer meeting.\n\n0:31:25\tSPEAKER_02\n That's right.\n\n0:31:26\tSPEAKER_00\n You had to find them.\n\n0:31:27\tSPEAKER_00\n You had to find them.\n\n0:31:28\tSPEAKER_02\n And they'd usually be at the end somewhere, but you had to figure out where the heck and the end to look for them.\n\n0:31:33\tSPEAKER_04\n I also think that it wasn't in this stage where some of these meetings had been transcribed.\n\n0:31:37\tSPEAKER_04\n I don't think you could use a string search, right? I'm just trying to remember how that worked.\n\n0:31:41\tSPEAKER_04\n But it was difficult finding them for some reason.\n\n0:31:44\tSPEAKER_02\n Well, it was also...\n\n0:31:46\tSPEAKER_02\n Yeah, the interface was different.\n\n0:31:48\tSPEAKER_02\n Yeah, it was more complicated than any way than what it would be now.\n\n0:31:53\tSPEAKER_04\n Actually, you also did a different type of transcription with respect to our sister project, the SMARTCOM project, which involved listening to people who were supposed to be wandering through Germany.\n\n0:32:05\tSPEAKER_04\n And this is supposed to be something that would be useful and developing an interface to help them find their way.\n\n0:32:11\tSPEAKER_04\n So, someone else did that too.\n\n0:32:13\tSPEAKER_04\n I've forgotten who else did that.\n\n0:32:15\tSPEAKER_04\n Anybody else here do that?\n\n0:32:17\tSPEAKER_01\n Okay.\n\n0:32:18\tSPEAKER_01\n I feel like I did a little checking or something on that.\n\n0:32:21\tSPEAKER_04\n Actually, I think you might have done this also.\n\n0:32:23\tSPEAKER_01\n Yeah, I don't know.\n\n0:32:24\tSPEAKER_01\n I don't remember actually transcribing it, but I remember listening to.\n\n0:32:27\tSPEAKER_04\n So, actually, we started with the words, and it was a matter then of trying to find the most efficient way to match the words up with the actual sounds.\n\n0:32:33\tSPEAKER_04\n Because they were reading from a script.\n\n0:32:35\tSPEAKER_04\n And then there was some conversation and addition that needed to be transcribed.\n\n0:32:40\tSPEAKER_04\n But, yeah.\n\n0:32:43\tSPEAKER_04\n One thing that you learn with this interface right away is that if you have really, really, really long utterances, it's extremely inefficient to do anything.\n\n0:32:53\tSPEAKER_04\n Because you end up, if you try to go up in the transcript, you end up with this huge, expensive time and things covering several screens and it's just horribly inefficient.\n\n0:33:06\tSPEAKER_01\n So, one thing that I still can't figure out with the interface.\n\n0:33:11\tSPEAKER_01\n It does this sometimes, but other times it doesn't.\n\n0:33:13\tSPEAKER_01\n And when you click on, you know, there's a bar above where this sound wave is that has a little bar of where the meeting is.\n\n0:33:24\tSPEAKER_01\n Yes.\n\n0:33:25\tSPEAKER_01\n And it goes along as you're listening to the meeting and it ends up the end.\n\n0:33:27\tSPEAKER_01\n And if you click on that bar to the right of that little marker, then it moves forward if you click on the left and it moves back.\n\n0:33:34\tSPEAKER_01\n But sometimes it moves two frames or two screens.\n\n0:33:38\tSPEAKER_01\n Oh, yes.\n\n0:33:39\tSPEAKER_01\n Sometimes it doesn't.\n\n0:33:40\tSPEAKER_04\n I think that's totally dependent on how you have the resolution set so that it's a tiny thing.\n\n0:33:44\tSPEAKER_04\n And if I increase the resolution so it's spread out a bit more, then I seem to have more control over it.\n\n0:33:50\tSPEAKER_01\n Okay.\n\n0:33:51\tSPEAKER_01\n But I don't know.\n\n0:33:52\tSPEAKER_01\n I noticed that a few times it would do it, it would move twice.\n\n0:33:54\tSPEAKER_01\n That kind of makes sense.\n\n0:33:55\tSPEAKER_01\n Yes.\n\n0:33:56\tSPEAKER_01\n And because, yeah, sometimes it wouldn't.\n\n0:33:58\tSPEAKER_01\n And maybe it maybe I had resolutions at different length.\n\n0:34:00\tSPEAKER_01\n Because yeah, if the resolution, if it's moving too slowly, then like if you were to click on some place, then it makes sense that it would get kind of confused.\n\n0:34:08\tSPEAKER_01\n But if it's moving quickly, it seems that it's covering more ground, faster.\n\n0:34:13\tSPEAKER_01\n So I don't know.\n\n0:34:14\tSPEAKER_04\n I'm going to report that to him because I know that's one of the reasons why when I suggested to visual scan the record that I suggested doing it by clicking on the right of that navigation bar you're mentioning.\n\n0:34:25\tSPEAKER_04\n Or actually clicking on the right of the sound wave and then letting it run past the boundary.\n\n0:34:29\tSPEAKER_01\n Because I had the same problem.\n\n0:34:30\tSPEAKER_01\n Yeah. That's what I tend to do is I use a sound wave.\n\n0:34:32\tSPEAKER_01\n But if I'm trying to scan through a long period of what appears to be silence.\n\n0:34:36\tSPEAKER_01\n Yes.\n\n0:34:37\tSPEAKER_01\n Yeah.\n\n0:34:38\tSPEAKER_01\n It's a much more...\n\n0:34:39\tSPEAKER_01\n Try to scan it, but I can't because...\n\n0:34:42\tSPEAKER_04\n Because you end up missing entire frames.\n\n0:34:44\tSPEAKER_04\n So then I end up trying to make an arrow.\n\n0:34:46\tSPEAKER_01\n They have the arrow, the far right.\n\n0:34:47\tSPEAKER_01\n Yes, okay.\n\n0:34:48\tSPEAKER_01\n So I use that sometimes.\n\n0:34:50\tSPEAKER_04\n So on that chart, on that bar you were described.\n\n0:34:52\tSPEAKER_01\n Yeah.\n\n0:34:53\tSPEAKER_01\n At the far right and far left, there's a little arrow that allows you to go like second by second or something.\n\n0:34:57\tSPEAKER_01\n I don't know.\n\n0:34:58\tSPEAKER_01\n Not second by second, but a little bit, bit by bit.\n\n0:35:00\tSPEAKER_04\n So is this the arrow on the right would be underneath that resolution bar?\n\n0:35:03\tSPEAKER_04\n I mean, it's like a little cluster up there.\n\n0:35:05\tSPEAKER_01\n It's not on the resolution part.\n\n0:35:07\tSPEAKER_01\n It's where you have...\n\n0:35:09\tSPEAKER_01\n It's where you have the marker of where you are in the meaning.\n\n0:35:11\tSPEAKER_01\n So you have this bar and you have a time marker that moves along.\n\n0:35:16\tSPEAKER_01\n Say you're halfway through the meaning.\n\n0:35:18\tSPEAKER_01\n It's going to be halfway along the line.\n\n0:35:20\tSPEAKER_04\n I have to do something visually.\n\n0:35:22\tSPEAKER_04\n So I would say you have the transcript screen.\n\n0:35:28\tSPEAKER_04\n And then you have a bar.\n\n0:35:29\tSPEAKER_04\n I think you're referring to this bar, aren't you?\n\n0:35:31\tSPEAKER_04\n Yeah.\n\n0:35:32\tSPEAKER_04\n And then there's like this little resolution change.\n\n0:35:33\tSPEAKER_03\n Yeah.\n\n0:35:34\tSPEAKER_04\n And then you have the sound wave.\n\n0:35:35\tSPEAKER_04\n Exactly.\n\n0:35:36\tSPEAKER_04\n Something down here.\n\n0:35:37\tSPEAKER_04\n And then you got the different channels.\n\n0:35:38\tSPEAKER_01\n So right at the right and left of the...\n\n0:35:40\tSPEAKER_04\n So right in here, you have this bar that you move.\n\n0:35:42\tSPEAKER_04\n And as you go along, it...\n\n0:35:43\tSPEAKER_04\n Yeah.\n\n0:35:44\tSPEAKER_04\n Okay, so...\n\n0:35:45\tSPEAKER_04\n You're saying that there's an arrow right here?\n\n0:35:46\tSPEAKER_04\n Yeah.\n\n0:35:47\tSPEAKER_04\n Okay.\n\n0:35:48\tSPEAKER_04\n And then there's an arrow right here.\n\n0:35:49\tSPEAKER_04\n Yeah.\n\n0:35:50\tSPEAKER_05\n Okay.\n\n0:35:51\tSPEAKER_05\n So we're talking there.\n\n0:35:52\tSPEAKER_05\n Oh, that doesn't...\n\n0:35:54\tSPEAKER_05\n I usually use that.\n\n0:35:55\tSPEAKER_05\n I was just hanging about it.\n\n0:35:56\tSPEAKER_05\n If you use that.\n\n0:35:57\tSPEAKER_05\n I've never been able to use that because I feel like it's skipped such a huge...\n\n0:36:00\tSPEAKER_05\n Maybe we have resolution set totally different.\n\n0:36:02\tSPEAKER_01\n Orchans.\n\n0:36:03\tSPEAKER_01\n Maybe we do.\n\n0:36:04\tSPEAKER_01\n Jen and I have totally different resolutions because hers...\n\n0:36:06\tSPEAKER_01\n I tend to make it so fast.\n\n0:36:07\tSPEAKER_01\n We'll make it so fast.\n\n0:36:08\tSPEAKER_01\n Yeah, it means it's more stretched.\n\n0:36:09\tSPEAKER_01\n I wouldn't use that much.\n\n0:36:10\tSPEAKER_01\n I was trying to get to a whole different part of it.\n\n0:36:12\tSPEAKER_01\n I usually have it set to where it has...\n\n0:36:13\tSPEAKER_01\n I don't use it too.\n\n0:36:14\tSPEAKER_01\n Yeah.\n\n0:36:15\tSPEAKER_01\n 0.5 second intervals on the numbers.\n\n0:36:18\tSPEAKER_01\n Oh, that's interesting.\n\n0:36:19\tSPEAKER_04\n I haven't paid attention to the numbers.\n\n0:36:20\tSPEAKER_04\n I sort of like visually...\n\n0:36:21\tSPEAKER_04\n It helps me to have it be separated enough that I should find a new breaking point.\n\n0:36:24\tSPEAKER_04\n I find it even better.\n\n0:36:25\tSPEAKER_04\n Yeah, that's the reason I separated it out.\n\n0:36:27\tSPEAKER_01\n I do too.\n\n0:36:28\tSPEAKER_01\n But sometimes if it gets too...\n\n0:36:30\tSPEAKER_01\n For me to stretch it out, I'll tend to think that there's a break in between a pause inside of a word or something.\n\n0:36:39\tSPEAKER_01\n Oh, yes.\n\n0:36:40\tSPEAKER_01\n Because the waveform becomes too stretched out.\n\n0:36:42\tSPEAKER_01\n Yeah, right.\n\n0:36:43\tSPEAKER_01\n Because it's meant to be a little bit...\n\n0:36:44\tSPEAKER_01\n It's meant to be a little bit...\n\n0:36:45\tSPEAKER_01\n I said, right.\n\n0:36:46\tSPEAKER_01\n I'll stretch it in a particular place.\n\n0:36:47\tSPEAKER_01\n Sort of like how it can be medium so you can make sure that the waveform has its shape.\n\n0:36:52\tSPEAKER_01\n Yeah.\n\n0:36:53\tSPEAKER_01\n No, I know you're talking about it.\n\n0:36:54\tSPEAKER_01\n Yeah.\n\n0:36:55\tSPEAKER_01\n It's kind of interesting.\n\n0:36:56\tSPEAKER_01\n Yeah.\n\n0:36:57\tSPEAKER_04\n Well, we're coming kind of close to the end of our timing.\n\n0:37:03\tSPEAKER_04\n I did ask about dessert and they told me it was ice cream and it doesn't say well.\n\n0:37:06\tSPEAKER_04\n Well, there's any left.\n\n0:37:07\tSPEAKER_02\n It was too high again.\n\n0:37:08\tSPEAKER_02\n There were those tarts again.\n\n0:37:09\tSPEAKER_02\n I'd be like, set us some aside.\n\n0:37:12\tSPEAKER_02\n Yeah, there's some.\n\n0:37:13\tSPEAKER_02\n That's a nice, really.\n\n0:37:17\tSPEAKER_04\n But I was thinking, you know, it is interesting to me to think about how each of us have sampled different meetings and get...\n\n0:37:28\tSPEAKER_04\n It's...\n\n0:37:29\tSPEAKER_04\n It's making to me to think that if I were to describe someone's characteristics in terms of their speech patterns, I bet you...\n\n0:37:35\tSPEAKER_04\n We would all agree on who it was.\n\n0:37:37\tSPEAKER_04\n I think that's so interesting.\n\n0:37:39\tSPEAKER_04\n Yeah.\n\n0:37:40\tSPEAKER_04\n It's a statement of speaker style, of course.\n\n0:37:42\tSPEAKER_01\n And also that we can...\n\n0:37:45\tSPEAKER_01\n I don't know, that we have this shared realm of knowledge kind of and can laugh about things that other people would not understand whatsoever.\n\n0:37:54\tSPEAKER_01\n Or, you know, little intricacies and idiosyncrasies of people's...\n\n0:37:59\tSPEAKER_01\n I think it's really post-ism.\n\n0:38:01\tSPEAKER_01\n Yeah, or even just about what we're talking about with the technical part in the interface.\n\n0:38:05\tSPEAKER_01\n Yeah.\n\n0:38:06\tSPEAKER_06\n Right.\n\n0:38:07\tSPEAKER_04\n Do you have any favorite parts of these meetings?\n\n0:38:09\tSPEAKER_04\n Things that you...\n\n0:38:10\tSPEAKER_04\n I mean, we talked briefly about this last time.\n\n0:38:12\tSPEAKER_02\n When people get really loopy and start telling lots of jokes...\n\n0:38:16\tSPEAKER_02\n I enjoy always transcribing those sections.\n\n0:38:20\tSPEAKER_04\n Do you think this is usually toward the end of the meeting or does it vary?\n\n0:38:24\tSPEAKER_02\n It seems to be more at the end.\n\n0:38:26\tSPEAKER_06\n Or in the beginning, the very beginning.\n\n0:38:28\tSPEAKER_02\n Yeah, yeah.\n\n0:38:29\tSPEAKER_06\n Yeah, yeah.\n\n0:38:30\tSPEAKER_06\n It would be joking around.\n\n0:38:31\tSPEAKER_04\n Yeah, that's true.\n\n0:38:32\tSPEAKER_04\n Do you have a favorite group that you...\n\n0:38:34\tSPEAKER_04\n I don't want to cause any partisanship here, but...\n\n0:38:37\tSPEAKER_04\n Wait, a favorite one?\n\n0:38:38\tSPEAKER_04\n A favorite type of meeting that you like or...\n\n0:38:43\tSPEAKER_02\n Oh, you mean like...\n\n0:38:45\tSPEAKER_02\n Meeting recorder as opposed to EDU as opposed...\n\n0:38:49\tSPEAKER_02\n Like those groups?\n\n0:38:50\tSPEAKER_04\n Whichever, that way or a nature of a meeting or...\n\n0:38:54\tSPEAKER_01\n I prefer ones that are somewhat linguistically related.\n\n0:38:57\tSPEAKER_01\n Yeah.\n\n0:38:58\tSPEAKER_01\n It's more interesting.\n\n0:38:59\tSPEAKER_01\n Yeah, I like those.\n\n0:39:00\tSPEAKER_01\n I don't like the technical ones because I don't understand what they're talking about.\n\n0:39:03\tSPEAKER_01\n Exactly.\n\n0:39:04\tSPEAKER_01\n And so I'm just really hard.\n\n0:39:05\tSPEAKER_01\n Yeah.\n\n0:39:06\tSPEAKER_01\n And I'm sitting there bored because I really have no concept of what they're talking about.\n\n0:39:09\tSPEAKER_01\n So I'm going, okay.\n\n0:39:10\tSPEAKER_01\n I'm just going to listen to you.\n\n0:39:13\tSPEAKER_01\n Yeah.\n\n0:39:14\tSPEAKER_05\n The ones that were they're talking about linguistic things that were great, I love those.\n\n0:39:18\tSPEAKER_04\n Would these be the EDU meetings?\n\n0:39:20\tSPEAKER_04\n That's what I think.\n\n0:39:21\tSPEAKER_01\n Is that true?\n\n0:39:22\tSPEAKER_01\n The ones that Liz and you...\n\n0:39:24\tSPEAKER_01\n Oh, really?\n\n0:39:25\tSPEAKER_01\n Yeah, yeah.\n\n0:39:26\tSPEAKER_01\n Let's do some...\n\n0:39:27\tSPEAKER_01\n And the meeting recorder ones, there's some talk of...\n\n0:39:30\tSPEAKER_01\n I don't know.\n\n0:39:31\tSPEAKER_01\n Discourse stuff.\n\n0:39:32\tSPEAKER_01\n I think it's really fun too to listen to when you give reports on transcription.\n\n0:39:35\tSPEAKER_01\n Oh, I really had the questions.\n\n0:39:37\tSPEAKER_01\n I was like, you know, talking bad about the transcribers.\n\n0:39:40\tSPEAKER_01\n I was just making fun.\n\n0:39:41\tSPEAKER_01\n Yeah.\n\n0:39:42\tSPEAKER_01\n And stuff's really funny.\n\n0:39:43\tSPEAKER_01\n Yeah.\n\n0:39:44\tSPEAKER_01\n That's why I like John.\n\n0:39:45\tSPEAKER_02\n I like fun and transcriber.\n\n0:39:46\tSPEAKER_02\n Yeah.\n\n0:39:48\tSPEAKER_02\n That's why I like listening to him.\n\n0:39:50\tSPEAKER_01\n He's always making fun of transcribers.\n\n0:39:52\tSPEAKER_04\n It would be a kick in a good nature, I know.\n\n0:39:55\tSPEAKER_04\n Yeah.\n\n0:39:56\tSPEAKER_04\n It would be really fun to have a collage of all these things like, well, the transcribers...\n\n0:39:59\tSPEAKER_02\n So it was mararuru, and then it would be some horrible thing.\n\n0:40:25\tSPEAKER_02\n I think it's funny when there's little side conversations about that that happened at the\n\n0:40:39\tSPEAKER_01\n same time too. I think those are interesting.\n\n0:40:41\tSPEAKER_01\n And I think it's really cool when people start getting really excited about something or angry about something because then they tend to interrupt each other a lot and I don't know.\n\n0:40:53\tSPEAKER_01\n I mean, I remember one where one person was really trying to get something out, really, really desperately, and he kept getting attracted by like three other people and he was like, I, I, I, I, I, I, and it was, I mean, it was kind of sad, but it was like also really interesting to watch.\n\n0:41:11\tSPEAKER_01\n I'm going to listen to.\n\n0:41:13\tSPEAKER_04\n Yeah.\n\n0:41:14\tSPEAKER_04\n If you notice that sometimes you have these...\n\n0:41:16\tSPEAKER_04\n Greater Frequency of Speechairs, I think, during times of overlap, which is just...\n\n0:41:20\tSPEAKER_04\n You can just tell a person's monitoring at two levels and it's...\n\n0:41:23\tSPEAKER_01\n They're like just trying really hard to get it out before they get it untrusted or something and it just falls apart.\n\n0:41:29\tSPEAKER_01\n Yeah.\n\n0:41:30\tSPEAKER_01\n Ellie, transcribing you because you're very polite.\n\n0:41:32\tSPEAKER_01\n Oh, thank you.\n\n0:41:33\tSPEAKER_01\n Ellie, you're all like, well, I was just thinking about this.\n\n0:41:39\tSPEAKER_01\n Maybe this might be if, you know, it's just, it's just kind of cute because everybody's like, oh, well, okay.\n\n0:41:45\tSPEAKER_01\n And they're just listening to you.\n\n0:41:46\tSPEAKER_01\n They're just like, well, okay.\n\n0:41:50\tSPEAKER_01\n It's got a neat...\n\n0:41:52\tSPEAKER_01\n Thank you.\n\n0:41:53\tSPEAKER_04\n Let's see.\n\n0:41:55\tSPEAKER_04\n Have you noticed that one of the things that I found is surprisingly difficult these days is to get certain electronic sounds to try and describe them?\n\n0:42:03\tSPEAKER_04\n I've seen about that the other day is like, it's like, you know, someone in one of these meetings they have a laptop and they hit the thing and the, and there's an error screen that comes up and it has this kind of sound.\n\n0:42:13\tSPEAKER_04\n What was that?\n\n0:42:16\tSPEAKER_04\n It's not a beep.\n\n0:42:17\tSPEAKER_04\n It's not a bell.\n\n0:42:18\tSPEAKER_04\n It's not a bell.\n\n0:42:19\tSPEAKER_04\n I mean, you, all these words that I could imagine, it's like, it's a tiny kind of electronic sound that comes up when you make an error with your laptop.\n\n0:42:26\tSPEAKER_01\n That's not very, very helpful.\n\n0:42:29\tSPEAKER_01\n I'm just wondering how they're going to transcribe you saying that.\n\n0:42:33\tSPEAKER_01\n Yes.\n\n0:42:34\tSPEAKER_04\n You mean the voice quality?\n\n0:42:36\tSPEAKER_04\n The shard.\n\n0:42:37\tSPEAKER_04\n Oh, no.\n\n0:42:38\tSPEAKER_06\n I'm trying to think things hard on ourselves.\n\n0:42:45\tSPEAKER_06\n I know.\n\n0:42:46\tSPEAKER_04\n And then, you know, there are these other things that I think are really interesting.\n\n0:42:51\tSPEAKER_04\n Like the vocal changes in character, people shifting into kind of a comic voice or sort of a mock this or mock that, you know, the sign and, oh, no.\n\n0:43:01\tSPEAKER_04\n You know, it's, it's, there are lots of nuances which we, which we use very often.\n\n0:43:07\tSPEAKER_04\n So, comic words and things like that.\n\n0:43:10\tSPEAKER_01\n I'm sorry.\n\n0:43:11\tSPEAKER_01\n I just remembered one thing that really was, you needed, I think it was you that pointed out the problem.\n\n0:43:18\tSPEAKER_01\n Like you needed to be at the meeting to be able to transcribe correctly the noise.\n\n0:43:21\tSPEAKER_01\n I think it was Adam was making this really strange noise.\n\n0:43:24\tSPEAKER_01\n And apparently he was pretending.\n\n0:43:26\tSPEAKER_01\n He was like pretending to screw something into his head.\n\n0:43:30\tSPEAKER_01\n Was that what it was?\n\n0:43:31\tSPEAKER_01\n Yes, yes.\n\n0:43:32\tSPEAKER_01\n Yes.\n\n0:43:33\tSPEAKER_04\n Oh, yes.\n\n0:43:37\tSPEAKER_04\n And he got to transcribe this meeting.\n\n0:43:39\tSPEAKER_04\n And the rest, all of us met up stuff about, because I was getting a report on what the comments were.\n\n0:43:42\tSPEAKER_04\n And it was one of these was this.\n\n0:43:44\tSPEAKER_04\n It was, what, he is what he said.\n\n0:43:47\tSPEAKER_01\n He was going like this at the time.\n\n0:43:49\tSPEAKER_01\n Just like, I am not amused.\n\n0:43:51\tSPEAKER_05\n I'm not like, try and repeat what he said because I don't want to put the transgrapher through it again.\n\n0:43:56\tSPEAKER_05\n I think he actually had a big list of things that people had transcribed and then they were reading one by one and being like, what's this?\n\n0:44:04\tSPEAKER_05\n This?\n\n0:44:05\tSPEAKER_05\n You know, this is the most beautiful sound.\n\n0:44:07\tSPEAKER_05\n This is the most beautiful sound.\n\n0:44:08\tSPEAKER_01\n I have one like that where they were describing the different qualities of uh-huh and uh-uh and uh-uh and like what EH is versus UH versus AH.\n\n0:44:18\tSPEAKER_01\n Yeah, that was really hard.\n\n0:44:20\tSPEAKER_05\n Yeah, I have one like that too.\n\n0:44:22\tSPEAKER_05\n I have one where they were just, they were just like talking about each word you know and they were saying they were just describing the word over and over again and just the quotes around the word were driving me crazy.\n\n0:44:36\tSPEAKER_05\n Knowing when to put the quotes and when and then they were talking about like the difference between uh-uh when it's A or when it's uh-uh.\n\n0:44:43\tSPEAKER_05\n At that time they were saying it so much I didn't know how to transcribe it anymore.\n\n0:44:47\tSPEAKER_04\n Yeah, I don't know if you're saying A or I anymore.\n\n0:44:52\tSPEAKER_04\n Oh.\n\n0:44:53\tSPEAKER_04\n He did an excellent job.\n\n0:44:54\tSPEAKER_04\n That was really, it was like, it's transcribed in a meta-transcribed in a meta-medicine.\n\n0:44:58\tSPEAKER_04\n It was fun.\n\n0:45:00\tSPEAKER_04\n You know, I'm really interested in this topic.\n\n0:45:02\tSPEAKER_04\n Would it be a problem if we continue to a little bit longer on this or do you need to do people need to leave?\n\n0:45:06\tSPEAKER_04\n I don't want to keep you longer than I have to get anywhere until five.\n\n0:45:10\tSPEAKER_04\n Okay, we won't be that long.\n\n0:45:11\tSPEAKER_04\n I'm really appreciate it.\n\n0:45:13\tSPEAKER_04\n This is just really, it's not interesting to me the specific experiences of having encountered these data in this way.\n\n0:45:22\tSPEAKER_04\n Does anything else want to say anything about?\n\n0:45:26\tSPEAKER_02\n I mean just weird things like before, like I had kind of a weird thing happen and we talked about it.\n\n0:45:32\tSPEAKER_02\n It was when I first started working on the project I got this discussion where this was before we had the different channels and um- Dan Ellis was one of Dan Ellis's little here so it was like kind of early on, right?\n\n0:45:43\tSPEAKER_02\n And um- he- everyone's talking and then all of a sudden you hear Dan talking to someone else and it's different people that you'd never heard before.\n\n0:45:55\tSPEAKER_02\n And what he had done is he had left the room.\n\n0:45:58\tSPEAKER_02\n He had bought the microphone with him and he was without the channelized interface.\n\n0:46:03\tSPEAKER_02\n So you have no idea.\n\n0:46:05\tSPEAKER_02\n You think everyone's just become schizophrenic or something, or like in their own world or something.\n\n0:46:10\tSPEAKER_02\n Then all of a sudden he's talking about a copy and he needs a copy machine.\n\n0:46:13\tSPEAKER_02\n I don't- I don't know.\n\n0:46:14\tSPEAKER_02\n And I'm just assuming he's still in the room and what the heck is he talking to?\n\n0:46:17\tSPEAKER_02\n And he was just weird things like that and um- yeah he had just left the room, got and made a copy and he still had his microphone on.\n\n0:46:24\tSPEAKER_02\n And I could hear the- the- the women behind the desk talking to him This is really bizarre.\n\n0:46:30\tSPEAKER_02\n So that's really funny.\n\n0:46:32\tSPEAKER_04\n Anyway, just weird things like that.\n\n0:46:35\tSPEAKER_04\n Well, it is- there's another case where I ran across like of that type when I was sitting here and we were doing- it's like one of the first meetings I ever participated in and Dan was adjusting something here and Adam was in the next room.\n\n0:46:46\tSPEAKER_04\n And um- Adam says, so I'll come in here and check the levels and- and he says something and Dan says no.\n\n0:46:55\tSPEAKER_04\n And it sounds like he's saying not to Adam.\n\n0:46:58\tSPEAKER_04\n So this would have been extremely rude. And the reason that it would be rude is because you don't have this information from hearing all these equalized volume channels.\n\n0:47:08\tSPEAKER_04\n You don't know that they're not participating in the same conversation at all.\n\n0:47:13\tSPEAKER_04\n It really is strange.\n\n0:47:16\tSPEAKER_04\n It is true that this is kind of artificial discourse aspect.\n\n0:47:23\tSPEAKER_04\n The mixed channel is artificial because we're boosting it in order to make everything audible.\n\n0:47:27\tSPEAKER_01\n It's interesting because like when I'm working late at night, I actually don't feel so lonely because there are so many voices in my head.\n\n0:47:37\tSPEAKER_04\n When you live here, when you're somewhere else.\n\n0:47:39\tSPEAKER_01\n When I'm working here, it's like 9 o'clock and nobody's here except for me.\n\n0:47:43\tSPEAKER_01\n And I'm like, you know, I don't feel so lonely because there are like eight people talking to me all at once.\n\n0:47:50\tSPEAKER_04\n Like wow.\n\n0:47:52\tSPEAKER_04\n I don't know about these meetings where there are like eight speakers in one meeting.\n\n0:47:57\tSPEAKER_04\n What are those like?\n\n0:47:58\tSPEAKER_04\n It takes a long time.\n\n0:47:59\tSPEAKER_02\n It takes a long time to do.\n\n0:48:01\tSPEAKER_02\n In a way they're more fun though.\n\n0:48:02\tSPEAKER_02\n Yeah.\n\n0:48:03\tSPEAKER_02\n It's just more variety.\n\n0:48:04\tSPEAKER_01\n I'm so nervous.\n\n0:48:05\tSPEAKER_01\n It tends to have still a dominant group of speakers.\n\n0:48:08\tSPEAKER_01\n And then there are two or three people generally who don't talk at all except to say they're digits or something or who- In the brain.\n\n0:48:15\tSPEAKER_01\n Or to breathe.\n\n0:48:16\tSPEAKER_01\n That's what it's like.\n\n0:48:17\tSPEAKER_01\n Lots of breathing.\n\n0:48:18\tSPEAKER_01\n Yeah.\n\n0:48:19\tSPEAKER_01\n But I think that still overall you're going to have probably three or four or five dominant speakers.\n\n0:48:26\tSPEAKER_01\n One thing I noticed is that like there was this one meeting I was transcribing.\n\n0:48:30\tSPEAKER_01\n There were nine speakers.\n\n0:48:31\tSPEAKER_01\n And by the end of it, I was so entirely sick of listening to the same conversation all over again.\n\n0:48:37\tSPEAKER_01\n Nine times.\n\n0:48:38\tSPEAKER_01\n Nine.\n\n0:48:39\tSPEAKER_01\n Nine.\n\n0:48:40\tSPEAKER_01\n I was in slow mode.\n\n0:48:41\tSPEAKER_01\n I was going nuts.\n\n0:48:42\tSPEAKER_01\n I was like, I cannot take this.\n\n0:48:43\tSPEAKER_01\n I cannot listen to this.\n\n0:48:44\tSPEAKER_01\n I have the same reaction.\n\n0:48:46\tSPEAKER_04\n Yeah.\n\n0:48:49\tSPEAKER_04\n Sometimes these are meetings I participated in.\n\n0:48:50\tSPEAKER_01\n This is like the test one.\n\n0:48:52\tSPEAKER_01\n Bad dream.\n\n0:48:53\tSPEAKER_01\n This is key.\n\n0:48:55\tSPEAKER_01\n This keeps happening to me.\n\n0:48:56\tSPEAKER_01\n Yeah.\n\n0:48:57\tSPEAKER_04\n And for changes.\n\n0:48:58\tSPEAKER_04\n I'm going to check out.\n\n0:48:59\tSPEAKER_04\n It's sad to be sure that we're okay with the-\n\n0:49:01\tSPEAKER_02\n Okay. Did you guys ever- This happened to me when I first started transcribing because I'd never really transcribed.\n\n0:49:06\tSPEAKER_02\n So can we stay for another half hour in this room?\n\n0:49:08\tSPEAKER_02\n Good.\n\n0:49:09\tSPEAKER_02\n Thanks.\n\n0:49:10\tSPEAKER_02\n I would leave here and I would go out and do my daily business and I would hear people speaking to me.\n\n0:49:15\tSPEAKER_02\n Yeah, I would transcribe them in my- What are the types of- Yeah.\n\n0:49:21\tSPEAKER_02\n It went away.\n\n0:49:22\tSPEAKER_02\n Maybe after a couple of weeks.\n\n0:49:24\tSPEAKER_02\n I still do that.\n\n0:49:25\tSPEAKER_01\n I still do that.\n\n0:49:26\tSPEAKER_01\n Really, I'm like on the bus or something when I'm boring.\n\n0:49:29\tSPEAKER_01\n Yep.\n\n0:49:30\tSPEAKER_01\n I didn't mean to be doing it.\n\n0:49:33\tSPEAKER_02\n It was just an intrusion.\n\n0:49:36\tSPEAKER_02\n It was just an intrusion.\n\n0:49:37\tSPEAKER_02\n Not a bad intrusion.\n\n0:49:39\tSPEAKER_02\n Not something I was sort of volitionally sort of.\n\n0:49:42\tSPEAKER_01\n I would also be really aware of how I was speaking.\n\n0:49:46\tSPEAKER_01\n Yes.\n\n0:49:47\tSPEAKER_01\n Because I also tend to- Like we were talking about so, I do that.\n\n0:49:50\tSPEAKER_01\n I'll end utterances with so or- And- Yeah.\n\n0:49:54\tSPEAKER_01\n And it'll just be a trailing off and I'll think, man, I would be such a pain in the butt to transcribe.\n\n0:49:58\tSPEAKER_01\n I just- Yeah, I do the same thing as you do.\n\n0:50:01\tSPEAKER_01\n Yeah, yeah.\n\n0:50:02\tSPEAKER_01\n I'll listen to somebody and his and her speech will be particularly idiosyncratic and I'll go, wow, I just- I'm glad I'm not transcribing him or her.\n\n0:50:10\tSPEAKER_01\n I noticed a lot of my speech.\n\n0:50:13\tSPEAKER_01\n I don't know, I wouldn't call him errors.\n\n0:50:15\tSPEAKER_01\n I guess disvalancies.\n\n0:50:16\tSPEAKER_01\n A lot more once when I started transcribing.\n\n0:50:19\tSPEAKER_01\n Just notice people in general that people- Yeah.\n\n0:50:23\tSPEAKER_01\n Right.\n\n0:50:24\tSPEAKER_01\n Yeah.\n\n0:50:25\tSPEAKER_01\n Break up their speech interestingly.\n\n0:50:26\tSPEAKER_01\n And it may sometimes that we manage to communicate.\n\n0:50:28\tSPEAKER_01\n Yeah.\n\n0:50:29\tSPEAKER_01\n Actually.\n\n0:50:30\tSPEAKER_01\n Because people will say just like monosolabic little grunts and squeaks and things- I think that shows a lot of- You mean something?\n\n0:50:40\tSPEAKER_01\n I think that shows a lot of how it's not all acoustic.\n\n0:50:42\tSPEAKER_01\n I mean, there's other things involved eye contact body language, gesture, whatever.\n\n0:50:46\tSPEAKER_04\n That raises the question.\n\n0:50:47\tSPEAKER_04\n Do you think that you would have been considerably helped if we had had videotapes of these things?\n\n0:50:54\tSPEAKER_01\n Oh, sure.\n\n0:50:55\tSPEAKER_01\n Yeah.\n\n0:50:56\tSPEAKER_01\n Okay.\n\n0:50:57\tSPEAKER_01\n I definitely think so.\n\n0:50:58\tSPEAKER_01\n And I think there would be a lot more interesting data to analyze later on.\n\n0:51:01\tSPEAKER_04\n Well, that's right.\n\n0:51:03\tSPEAKER_04\n Because you're involved in gesture research.\n\n0:51:05\tSPEAKER_01\n Yeah, because then you know exactly what's going on, what the context cues are.\n\n0:51:09\tSPEAKER_01\n And you can really get a feel for the interpersonal relationships.\n\n0:51:12\tSPEAKER_01\n Yeah.\n\n0:51:13\tSPEAKER_01\n It kind of comes into play, maybe not for speech recognition, but for other things.\n\n0:51:18\tSPEAKER_01\n Maybe.\n\n0:51:19\tSPEAKER_01\n Maybe this is what it's like to be blind.\n\n0:51:21\tSPEAKER_04\n Oh, interesting.\n\n0:51:22\tSPEAKER_04\n Yeah.\n\n0:51:23\tSPEAKER_04\n Yeah.\n\n0:51:24\tSPEAKER_04\n No, no.\n\n0:51:25\tSPEAKER_01\n Visual input at all.\n\n0:51:28\tSPEAKER_01\n Yeah, you just have to rely on your intonation and other things like that.\n\n0:51:33\tSPEAKER_01\n And you get so much more aware of all of that.\n\n0:51:36\tSPEAKER_04\n Yeah.\n\n0:51:37\tSPEAKER_04\n Maybe.\n\n0:51:38\tSPEAKER_04\n I know someone who actually recognizes perfumes in the elevator.\n\n0:51:41\tSPEAKER_04\n There's a blind man in this building.\n\n0:51:43\tSPEAKER_04\n And Lila was in the elevator one day.\n\n0:51:47\tSPEAKER_04\n And they hadn't spoken yet because he just came on the elevator and he says, then she said something and he says, you've changed your perfume.\n\n0:51:56\tSPEAKER_04\n Oh, wow.\n\n0:51:57\tSPEAKER_04\n Yes, pretty interesting.\n\n0:51:58\tSPEAKER_04\n Did she change your perfume?\n\n0:52:00\tSPEAKER_04\n Yes, she had.\n\n0:52:01\tSPEAKER_04\n Oh, wow.\n\n0:52:02\tSPEAKER_04\n Yeah.\n\n0:52:03\tSPEAKER_04\n Yeah.\n\n0:52:04\tSPEAKER_04\n Yeah.\n\n0:52:05\tSPEAKER_01\n And so, interesting.\n\n0:52:06\tSPEAKER_01\n Enhanced other senses, I guess.\n\n0:52:07\tSPEAKER_01\n That's really cool.\n\n0:52:08\tSPEAKER_01\n Right.\n\n0:52:09\tSPEAKER_04\n Have you, I've learned several things about having been with the close talking mics.\n\n0:52:14\tSPEAKER_04\n This is a new experience because I've, of course, been involved in this kind of thing for quite a while.\n\n0:52:18\tSPEAKER_04\n But there are several things that didn't realize you could hear so reliably.\n\n0:52:22\tSPEAKER_04\n And some of these are other things like when the mouth opens and the in breath and stuff.\n\n0:52:26\tSPEAKER_04\n And how extremely audible.\n\n0:52:28\tSPEAKER_04\n And visual.\n\n0:52:29\tSPEAKER_04\n I mean, you can see these, the in breath and things.\n\n0:52:31\tSPEAKER_04\n That was really surprising to me that you, that's something you don't hear in normal speech too.\n\n0:52:36\tSPEAKER_01\n In normal conversations, unless it's very dramatic or very loud, that people click their lips are always making funny noises.\n\n0:52:45\tSPEAKER_06\n And you're not talking on the phone and the phone is, the levels are funny, then you hear it.\n\n0:52:50\tSPEAKER_06\n Yeah.\n\n0:52:51\tSPEAKER_04\n So it's kind of like that.\n\n0:52:52\tSPEAKER_04\n Yeah.\n\n0:52:53\tSPEAKER_04\n I guess it's also one of these things that you usually is not meaningful.\n\n0:52:55\tSPEAKER_04\n So we sort of screen it out.\n\n0:52:57\tSPEAKER_04\n All these different, because you know, I mean, we do that all the time with all other, lots of other aspects of the acoustics, so don't you?\n\n0:53:03\tSPEAKER_04\n It sounds like it's a nice smooth melody.\n\n0:53:06\tSPEAKER_04\n But these things are voicing and unvoicing or tripping in and out and they don't.\n\n0:53:09\tSPEAKER_04\n The contour is really not nearly that neat.\n\n0:53:12\tSPEAKER_04\n Yeah.\n\n0:53:13\tSPEAKER_02\n Yeah, well, yeah, most of the time when we're listening to other people's speech, we're just trying to get the gist, not literally what people are saying.\n\n0:53:19\tSPEAKER_02\n And so, you know, all the uh, uh, uh, uh, uh, uh, uh, uh, this is terms and all the stuff that we think is tuning it out.\n\n0:53:23\tSPEAKER_02\n Yeah.\n\n0:53:24\tSPEAKER_02\n And uh, it's that top down thing again.\n\n0:53:26\tSPEAKER_02\n Just, right?\n\n0:53:27\tSPEAKER_02\n Yeah.\n\n0:53:28\tSPEAKER_02\n Yeah, absolutely.\n\n0:53:29\tSPEAKER_02\n Yeah.\n\n0:53:30\tSPEAKER_02\n What is the point of what this person is trying to communicate kind of?\n\n0:53:33\tSPEAKER_02\n Right?\n\n0:53:34\tSPEAKER_01\n So, which is a very, that's how I tended before studying linguistics anyways.\n\n0:53:40\tSPEAKER_01\n And it definitely before doing transcription, how I tended to look at all conversations and then coming here and doing this, you have to look at speech in a totally more intense way, including, I mean, every little aspect.\n\n0:53:56\tSPEAKER_01\n When I tell people what I do here and tell them, yeah, I'm transcribing, and they think I'm like a stenographer or something.\n\n0:54:04\tSPEAKER_01\n No, I don't correct the grammar.\n\n0:54:06\tSPEAKER_01\n I don't erase the umbs and uh, I record all the sides and the laughs and the breaths and there, I don't know.\n\n0:54:12\tSPEAKER_01\n It's a very different thing than most people can relate to, I guess.\n\n0:54:17\tSPEAKER_04\n But I agree.\n\n0:54:18\tSPEAKER_04\n Another thing that I think is interesting in these meetings is certain speakers have a tendency to embed utterances and other utterances.\n\n0:54:25\tSPEAKER_04\n And um, you know, it's very clear when you see it, when you hear it with the international markers, but well, just the contours.\n\n0:54:33\tSPEAKER_04\n But the words in the page is not at all clear.\n\n0:54:36\tSPEAKER_04\n Yeah.\n\n0:54:37\tSPEAKER_04\n And there are a couple people who do this in particular.\n\n0:54:39\tSPEAKER_04\n I would say that it's both, I would say that both Jerry and Morgan do this.\n\n0:54:44\tSPEAKER_04\n And it's amazing how fluent it is when you hear it, but how very complicated it is when you see the words.\n\n0:54:53\tSPEAKER_04\n Yeah.\n\n0:54:54\tSPEAKER_01\n And when you think about it, they pick up exactly where they left off.\n\n0:54:58\tSPEAKER_01\n Even though maybe it's several seconds later, there's no glitch in the syntax or anything.\n\n0:55:03\tSPEAKER_01\n We're pretty amazing.\n\n0:55:05\tSPEAKER_01\n Machines, creatures, whatever.\n\n0:55:08\tSPEAKER_01\n Yeah.\n\n0:55:09\tSPEAKER_01\n That's really cool.\n\n0:55:10\tSPEAKER_01\n Machines.\n\n0:55:11\tSPEAKER_04\n So, and then of course there are these things which I think are also nicely represented in the data, which are these funny sounds people make.\n\n0:55:21\tSPEAKER_04\n Which some greet us borrowing from comic talk.\n\n0:55:24\tSPEAKER_04\n So, I notice people going, you know, if they're trying to say something is done, the Germans do this, I think, in particular.\n\n0:55:31\tSPEAKER_04\n And there are others that we use like that, which are sort of semi-conventional lies, but you wouldn't think that you would write them down.\n\n0:55:37\tSPEAKER_01\n Yeah, the one I get all the time is, oh yes, because it's like, I don't know how, I just turn on the sky, but as I say, like click, and then I say it's like a vocal gesture.\n\n0:55:48\tSPEAKER_01\n Like a shrugger, some sort of like, well there it is, or that's it, or something like that.\n\n0:55:54\tSPEAKER_01\n You know, that people do that one a lot, and there was one speaker who used to do it constantly.\n\n0:55:59\tSPEAKER_01\n And after a while, I started getting confused as to whether or not he was like just going to himself, or whether he was meaning it in conversation.\n\n0:56:12\tSPEAKER_01\n Sometimes it was really obvious that he meant it as some sort of vocal cue, but then sometimes it was more ambiguous, like it was tough to tell, because he would just always be clicking.\n\n0:56:23\tSPEAKER_04\n Is this the one that, I mean, it could be the one we're thinking about.\n\n0:56:26\tSPEAKER_01\n It could be, but I noticed it more as it was obviously not, because it was always, and the one I'm thinking of always came in groups of four or something.\n\n0:56:38\tSPEAKER_01\n Yes, well, and so it wasn't ever like a single.\n\n0:56:43\tSPEAKER_01\n It would be as good as a lot of single ones.\n\n0:56:46\tSPEAKER_01\n How interesting.\n\n0:56:48\tSPEAKER_01\n And that's another thing, like I realize I do that too.\n\n0:56:51\tSPEAKER_04\n I'll ask you this is later, I don't want to, because I can't remember the name actually.\n\n0:56:55\tSPEAKER_04\n Okay.\n\n0:56:56\tSPEAKER_04\n The one that I'm thinking of, it's a matter of you can tell us in context where he's looking in his agenda to see, you know, do I have time to do this and he's calculating in his mind?\n\n0:57:04\tSPEAKER_04\n I don't know, almost like a stand-in for a calculator kind of thing, but it's signaling.\n\n0:57:08\tSPEAKER_04\n I'm sure that everybody, I'm sure that other people can hear it, so it's sort of like, what am I and I'm thinking?\n\n0:57:12\tSPEAKER_04\n It's not like, it's not like, it's not a standard way.\n\n0:57:16\tSPEAKER_01\n Oh, yeah, that's a different person.\n\n0:57:18\tSPEAKER_04\n Okay, I know how you're talking about it, but he must do this in a lot of meetings, because I think, you know, I've found a good message in a couple of times.\n\n0:57:25\tSPEAKER_02\n I've heard, yeah, which I just write as mouth. Oh, I see a mouth, because I think I had talked to you about this, about what, what do we do?\n\n0:57:36\tSPEAKER_02\n What was it that I, oh, I was lip smack.\n\n0:57:39\tSPEAKER_02\n Yeah, I was marking lip smack, and you said, yeah, that's, it's different noise, but it's what made me think of it.\n\n0:57:49\tSPEAKER_02\n And you said, don't do lip smack, just do, we don't need it, it's too specific, just do mouth for all those noises.\n\n0:57:55\tSPEAKER_04\n Yeah, okay, what I would say, this is good to know this, what I would say is, if it's communicatives, beyond just the mouth opening and the, you know, the mechanical aspects that happen when you happen to be about to speak, then I would like to have it, if it's communicative, it'd like to have it preserved.\n\n0:58:15\tSPEAKER_04\n But if it's just this mechanical stuff mouth is fine. It seems like the computer science people use lip smack for that.\n\n0:58:22\tSPEAKER_04\n I personally, my choice, we're still deciding on how we're going to encode it in the final version, but I tend to not like lip smack because I think that that could be meaningful and still confusing.\n\n0:58:33\tSPEAKER_04\n People talk about, you know, all of a G, that was really good, and then they do, I'm not going to do it, because I don't really know how to do lip smack, but it seems like it would be a verbal gesture.\n\n0:58:41\tSPEAKER_01\n Yeah, I was thinking the one that you just did, makes me think of what people would write as Tisk Tisk.\n\n0:58:48\tSPEAKER_01\n So yeah, you know, I'm not sure, so they're trying to communicate displeasure.\n\n0:58:53\tSPEAKER_01\n Right.\n\n0:58:54\tSPEAKER_01\n And so that, yeah, at least two or three that I can think of that to me are very different.\n\n0:59:01\tSPEAKER_01\n You know, there's like, you know, that and there's like, you know, what the one I did before, there's like, I don't know, like, I would say time click for that.\n\n0:59:11\tSPEAKER_04\n Yeah, I would also probably put in parentheses that I thought it was a vocal gesture, because I think it's communicative of a certain thing.\n\n0:59:18\tSPEAKER_06\n Yeah.\n\n0:59:19\tNone\n Yeah.\n\n0:59:20\tSPEAKER_05\n I don't know, I'm never sure whether or not to transcribe a difference with like, you know, and...\n\n0:59:27\tSPEAKER_05\n Oh, yeah, I'm not a point.\n\n0:59:31\tSPEAKER_01\n How do you transcribe?\n\n0:59:32\tSPEAKER_01\n I'll put like a good point.\n\n0:59:33\tSPEAKER_01\n I'll usually put an exclamation point.\n\n0:59:36\tSPEAKER_04\n I would too.\n\n0:59:37\tSPEAKER_04\n I think it's more infatic.\n\n0:59:39\tSPEAKER_04\n What about transcribing it?\n\n0:59:41\tSPEAKER_05\n Seignants are different.\n\n0:59:42\tSPEAKER_05\n H-M-P-H.\n\n0:59:43\tSPEAKER_05\n What about transcribing it that way?\n\n0:59:45\tSPEAKER_04\n Well, this is a good question.\n\n0:59:47\tSPEAKER_04\n I guess I would say, you know, sometimes we've seen in literature meaning, sorry.\n\n0:59:55\tSPEAKER_04\n It's a sound of indignation.\n\n0:59:57\tSPEAKER_04\n So if it's meant as a sound of indignation, then I think that would be how I would capture it with the H-M-P-H.\n\n1:00:02\tSPEAKER_01\n I usually tend to think that it's more of a...\n\n1:00:06\tSPEAKER_01\n Not indignation, something more positive.\n\n1:00:08\tSPEAKER_01\n I don't know exactly how to characterize it, but something more...\n\n1:00:11\tSPEAKER_04\n It's sort of like a sort of elevated...\n\n1:00:14\tSPEAKER_04\n It's like a sort of more surprise or...\n\n1:00:17\tSPEAKER_04\n Yeah.\n\n1:00:18\tSPEAKER_04\n Engagement?\n\n1:00:19\tSPEAKER_05\n Yeah.\n\n1:00:20\tSPEAKER_05\n I guess I could have two meanings sort of...\n\n1:00:22\tSPEAKER_02\n If it's a prize on the exclamation point, makes sense to you.\n\n1:00:25\tSPEAKER_04\n And then there's the other kind, which sounds similar, but it's really part of a laugh.\n\n1:00:29\tSPEAKER_04\n So...\n\n1:00:30\tSPEAKER_04\n Yeah.\n\n1:00:31\tSPEAKER_04\n Which is...\n\n1:00:32\tSPEAKER_04\n I would just say laugh for that.\n\n1:00:34\tSPEAKER_02\n Yeah, once Adam was laughing and it was actually written out...\n\n1:00:38\tSPEAKER_02\n And I changed it.\n\n1:00:40\tSPEAKER_02\n I'm just like, it's just laughing.\n\n1:00:42\tSPEAKER_02\n Like someone had written like...\n\n1:00:44\tSPEAKER_02\n Yeah, yeah, or...\n\n1:00:46\tSPEAKER_04\n I've had a crush that also.\n\n1:00:49\tSPEAKER_02\n And... right, change it to...\n\n1:00:52\tSPEAKER_02\n I think it's a tiger fish that's done something like they had written out of phonetic laugh.\n\n1:00:55\tSPEAKER_02\n And they didn't do it in any other place in the transcript.\n\n1:00:58\tSPEAKER_02\n I've had a crush that was a lot.\n\n1:01:00\tSPEAKER_04\n I've seen a lot of people laugh.\n\n1:01:02\tSPEAKER_01\n Yeah, that's true.\n\n1:01:03\tSPEAKER_01\n And as far as problems with laughs is a lot of them were marked as breaths.\n\n1:01:07\tSPEAKER_01\n Because a lot of people...\n\n1:01:09\tSPEAKER_01\n Yes.\n\n1:01:10\tSPEAKER_01\n I think we already talked about this last time.\n\n1:01:12\tSPEAKER_01\n But not so much as I never saw that right now, phonetically.\n\n1:01:15\tSPEAKER_02\n Well, here's a question.\n\n1:01:17\tSPEAKER_02\n And there's been some variance in transcripts that I've looked at when...\n\n1:01:21\tSPEAKER_02\n Okay.\n\n1:01:22\tSPEAKER_02\n So when you laugh, you're exhaling all this air.\n\n1:01:26\tSPEAKER_02\n And so you need to inhale.\n\n1:01:28\tSPEAKER_02\n And so how do you transcribe the inhale?\n\n1:01:30\tSPEAKER_02\n Some people are transcribing it as a breath.\n\n1:01:32\tSPEAKER_02\n I used to, you know, back in the day, back when I was transcribing.\n\n1:01:37\tSPEAKER_02\n I would do the whole thing as a laugh.\n\n1:01:39\tSPEAKER_02\n That's amazing.\n\n1:01:40\tSPEAKER_02\n And to me, the breath is part of the laugh.\n\n1:01:42\tSPEAKER_02\n Yes, that's why I prefer.\n\n1:01:43\tSPEAKER_02\n So because in the ones I've been checking actually right now, that breath gets marked as a breath.\n\n1:01:48\tSPEAKER_02\n And I've been taking them out.\n\n1:01:49\tSPEAKER_02\n Because you would have a little bit of laugh.\n\n1:01:50\tSPEAKER_02\n Well done.\n\n1:01:51\tSPEAKER_01\n Well done.\n\n1:01:52\tSPEAKER_02\n Well done.\n\n1:01:53\tSPEAKER_02\n Well done.\n\n1:01:54\tSPEAKER_02\n Breath laugh.\n\n1:01:55\tSPEAKER_02\n It should be a laugh.\n\n1:01:56\tSPEAKER_02\n And then two dots, like the next bin will be empty.\n\n1:01:57\tSPEAKER_02\n And then it'll be breath.\n\n1:01:58\tSPEAKER_02\n Oh, I think so.\n\n1:01:59\tSPEAKER_01\n Yeah, I see.\n\n1:02:00\tSPEAKER_02\n So it's like three sort of separate units as opposed to...\n\n1:02:03\tSPEAKER_02\n I think it's one sort of coherent thing.\n\n1:02:05\tSPEAKER_01\n Yeah.\n\n1:02:06\tSPEAKER_01\n So I put breath laugh in the brackets when I don't know whether it's a breath or a laugh.\n\n1:02:09\tSPEAKER_01\n It's good.\n\n1:02:10\tSPEAKER_01\n Oh, well, yeah.\n\n1:02:11\tSPEAKER_01\n That's a different.\n\n1:02:12\tSPEAKER_02\n Because sometimes it's not clear, like sometimes.\n\n1:02:15\tSPEAKER_02\n Right.\n\n1:02:16\tSPEAKER_02\n That's right.\n\n1:02:17\tSPEAKER_02\n If other people are laughing, then I'll usually get a little bit of a different thing.\n\n1:02:20\tSPEAKER_04\n I'll get a little bit of a different thing.\n\n1:02:21\tSPEAKER_04\n And I think that's important because we're capturing the communicative level.\n\n1:02:24\tSPEAKER_04\n Yeah, exactly.\n\n1:02:25\tSPEAKER_04\n And it's likely that it has a different contour than most breaths as well.\n\n1:02:28\tSPEAKER_04\n Because it's sort of expulsive and that kind of thing.\n\n1:02:31\tSPEAKER_04\n Exactly, exactly.\n\n1:02:33\tSPEAKER_04\n A lot of people go...\n\n1:02:34\tSPEAKER_04\n Yes, they do.\n\n1:02:35\tSPEAKER_04\n Yeah, the stronger ones, sometimes we'll laugh it with the breath laugh.\n\n1:02:38\tSPEAKER_04\n And you can see it.\n\n1:02:39\tSPEAKER_04\n You can see the little...\n\n1:02:40\tSPEAKER_04\n Right.\n\n1:02:41\tSPEAKER_04\n That's interesting.\n\n1:02:42\tSPEAKER_04\n But yes, exactly.\n\n1:02:43\tSPEAKER_04\n I wouldn't talk.\n\n1:02:44\tSPEAKER_04\n That's a case where I know generally with the tigerfish things, if they put breath in, we leave it in.\n\n1:02:49\tSPEAKER_04\n But absolutely there.\n\n1:02:50\tSPEAKER_04\n Yeah.\n\n1:02:51\tSPEAKER_04\n Good laugh.\n\n1:02:52\tSPEAKER_04\n Okay.\n\n1:02:53\tSPEAKER_04\n Change it.\n\n1:02:54\tSPEAKER_04\n And you know, there are other places where it's in the way.\n\n1:02:55\tSPEAKER_04\n I mainly said not to change their breaths simply because it would take time to move them.\n\n1:02:58\tSPEAKER_04\n And if they're not in the way, then don't talk too much.\n\n1:03:00\tSPEAKER_05\n A lot of times though, the breaths are results of bad segmentation.\n\n1:03:04\tSPEAKER_05\n And there's a segmentation of nothing.\n\n1:03:06\tSPEAKER_05\n And so they write it as a breath when it's clearly not a breath.\n\n1:03:10\tSPEAKER_05\n Yeah.\n\n1:03:11\tSPEAKER_05\n Now you always take those out.\n\n1:03:12\tSPEAKER_05\n I mean, usually it seems like the segment are often just sort of segments when there's really long spaces.\n\n1:03:21\tSPEAKER_05\n It's a segment's random spaces in between.\n\n1:03:24\tSPEAKER_05\n And you know, they get that and there's nothing there.\n\n1:03:26\tSPEAKER_05\n So they market as a breath when it's really actually nothing.\n\n1:03:29\tSPEAKER_05\n That's right.\n\n1:03:30\tSPEAKER_02\n So they take those out.\n\n1:03:31\tSPEAKER_02\n Yeah.\n\n1:03:32\tSPEAKER_02\n Well they give the segmenter the, because they don't have the rich interface that we do.\n\n1:03:36\tSPEAKER_02\n So they must be giving the pre-segmenter sort of the benefit of the doubt.\n\n1:03:38\tSPEAKER_02\n Well there must be something there.\n\n1:03:39\tSPEAKER_02\n Right, exactly.\n\n1:03:40\tSPEAKER_02\n Exactly.\n\n1:03:41\tSPEAKER_02\n Whether they're here or not.\n\n1:03:42\tSPEAKER_02\n Exactly.\n\n1:03:43\tSPEAKER_02\n Well it's a breath.\n\n1:03:44\tSPEAKER_01\n I wonder what they did put a missing segment.\n\n1:03:46\tSPEAKER_01\n Yeah, there are somewhere.\n\n1:03:47\tSPEAKER_01\n Yeah, somewhere.\n\n1:03:48\tSPEAKER_01\n Oh really?\n\n1:03:49\tSPEAKER_04\n Oh I always get the breath.\n\n1:03:50\tSPEAKER_04\n Well see, I do have previous filtering before I give the tiger fish ones out.\n\n1:03:55\tSPEAKER_04\n And I have tried to get that particular missing segment removed.\n\n1:04:00\tSPEAKER_04\n But I don't always.\n\n1:04:01\tSPEAKER_01\n Yeah.\n\n1:04:02\tSPEAKER_01\n I've seen a few of them.\n\n1:04:03\tSPEAKER_02\n So you've seen a few ways to allow you a misattribution to a voice.\n\n1:04:06\tSPEAKER_02\n Yeah.\n\n1:04:07\tSPEAKER_02\n And you'll hear part of what another person is saying.\n\n1:04:11\tSPEAKER_02\n And that's all transcribed on that one level.\n\n1:04:13\tSPEAKER_02\n But then you'll hear a little bit of it and then missing segment.\n\n1:04:15\tSPEAKER_02\n Yeah.\n\n1:04:16\tSPEAKER_02\n It's like okay, well it's in the wrong.\n\n1:04:17\tSPEAKER_02\n That person is not talking at all.\n\n1:04:19\tSPEAKER_02\n Yeah.\n\n1:04:20\tSPEAKER_02\n So just get rid of it.\n\n1:04:21\tSPEAKER_04\n Yeah.\n\n1:04:22\tSPEAKER_04\n Interesting.\n\n1:04:24\tSPEAKER_04\n Okay, well let's see.\n\n1:04:26\tSPEAKER_04\n So do you think that this has changed your speech in other ways in terms of myself?\n\n1:04:32\tSPEAKER_04\n I do feel that I'm, when I spend a lot of hours doing this, I've become less fluent.\n\n1:04:36\tSPEAKER_04\n Really?\n\n1:04:37\tSPEAKER_04\n More false starts and things.\n\n1:04:38\tSPEAKER_04\n Yeah.\n\n1:04:39\tSPEAKER_04\n I don't know if it could just be because you're so many more hours, I haven't been talking.\n\n1:04:43\tSPEAKER_01\n I guess I tried to be more careful in my speech more often.\n\n1:04:48\tSPEAKER_01\n Good.\n\n1:04:49\tSPEAKER_01\n Unless I'm really not paying any attention, like if I'm at a party or something and I'm just sort of having a good time then, doesn't really matter.\n\n1:04:56\tSPEAKER_01\n And you know, normal one-on-one speech.\n\n1:05:00\tSPEAKER_01\n I think I tend to try to enunciate more.\n\n1:05:03\tSPEAKER_01\n Because I've been told I mumbled.\n\n1:05:06\tSPEAKER_01\n Oh.\n\n1:05:09\tSPEAKER_01\n And I guess I used to be worse about it.\n\n1:05:11\tSPEAKER_01\n I was told by my parents that I used to mumble a lot.\n\n1:05:15\tSPEAKER_01\n And also, I have this sort of East Coast accent that comes in sometimes that makes it hard for people on the West Coast to understand what I'm saying.\n\n1:05:25\tSPEAKER_01\n A lot of times, like if I'm not paying attention, I'll say something that will not really be heard.\n\n1:05:33\tSPEAKER_01\n I tend to leave off final consonants, for instance.\n\n1:05:36\tSPEAKER_01\n And people, I have to be conscious of that sometimes.\n\n1:05:40\tSPEAKER_01\n Yeah.\n\n1:05:41\tSPEAKER_04\n So many of the clarity sounds like, yeah, phrasing or strange things.\n\n1:05:47\tSPEAKER_01\n I think that I noticed, I don't know if it's really a question of me being more changing my speech necessarily, but I'm much more aware of interruptions and conversation.\n\n1:05:58\tSPEAKER_01\n Oh.\n\n1:05:59\tSPEAKER_01\n Oh, yeah, that's true.\n\n1:06:00\tSPEAKER_01\n So maybe I am more careful in the sense that I maybe don't interrupt as much, or I'm more aware of it when I am doing it or something like that.\n\n1:06:09\tSPEAKER_01\n But I just pay attention more to the fact that every pretty much all the time in normal conversation there are interruptions.\n\n1:06:20\tSPEAKER_01\n Unless you have really, I mean, I think if there were no interruptions, it would sound really awkward.\n\n1:06:25\tSPEAKER_01\n There would be a lot of pauses, and I would kind of imply uncomfortability or something.\n\n1:06:31\tSPEAKER_01\n Right.\n\n1:06:32\tSPEAKER_04\n I guess it depends partly on the type of interruption.\n\n1:06:35\tSPEAKER_04\n Yeah.\n\n1:06:36\tSPEAKER_04\n When you're just clarifying type, like, well, do you mean when they're partway through it in our utterance?\n\n1:06:40\tSPEAKER_04\n Yeah.\n\n1:06:41\tSPEAKER_04\n Yeah.\n\n1:06:42\tSPEAKER_01\n I tend to think of a conversation that has no interruptions as being something that's unnatural and forced or something like a meeting where, you know, I mean, everybody says they're a little spiel, and people are meant to be, you know, pretty quiet and attentive for the most part, and then let them finish, and then somebody else comes in and says something about it.\n\n1:07:07\tSPEAKER_01\n And then, like, a friendly conversation, I noticed that that's not really true, like what you were saying.\n\n1:07:15\tSPEAKER_01\n Right.\n\n1:07:16\tSPEAKER_01\n But even in cases like that, even when it is, say, now I'm contradicting myself, but even when it is very turn taking is very, like, people follow the turn taking rules or whatever, and don't really blatantly interrupt people.\n\n1:07:32\tSPEAKER_01\n And I remember this actually from a meeting because Liz was complaining there wasn't enough interruptions or not enough overlaps or something.\n\n1:07:40\tSPEAKER_01\n It wasn't interruptions, it's an overlap, something about that.\n\n1:07:42\tSPEAKER_01\n I think it's not an overlap.\n\n1:07:43\tSPEAKER_01\n And so she wanted there to be an argument or something so that there would be more.\n\n1:07:46\tSPEAKER_01\n And what she didn't realize was that throughout the meeting up until then, there had been, they were just very small, but they were there.\n\n1:07:53\tSPEAKER_01\n I think they're there pretty much all the time.\n\n1:07:56\tSPEAKER_04\n I agree.\n\n1:07:57\tSPEAKER_04\n I did do one analysis, more like one meeting.\n\n1:07:59\tSPEAKER_04\n Because the climate been, actually one of the people on the meeting had made the claim in the previous meeting that, well, there probably the overlaps only occurred during setup and at the end when we're leaving.\n\n1:08:12\tSPEAKER_02\n Oh, yeah, that's totally not true.\n\n1:08:14\tSPEAKER_02\n Exactly, exactly.\n\n1:08:15\tSPEAKER_04\n Well, I think that that's sort of the feeling you would get if it was you looked at the data at this level.\n\n1:08:20\tSPEAKER_04\n And so the data analysis, in fact, it was really pretty constant rate all the way through the entire meeting and everyone was involved.\n\n1:08:26\tSPEAKER_04\n It wasn't just one or two speakers.\n\n1:08:29\tSPEAKER_01\n Everyone was kind of makes sense because if you want to speak next, it's almost like you got to get your foot in the door.\n\n1:08:36\tSPEAKER_01\n You got to be the one who, you know, make sure people recognize that you're the one who's going to speak next.\n\n1:08:42\tSPEAKER_04\n That's true.\n\n1:08:43\tSPEAKER_04\n I should say I didn't distinguish between overlaps and interruptions.\n\n1:08:46\tSPEAKER_04\n So some of these were back channels.\n\n1:08:48\tSPEAKER_04\n Oh, it's still the case.\n\n1:08:50\tSPEAKER_05\n I think silences are generally not good in conversation, too, because once you get a sil...\n\n1:08:58\tSPEAKER_05\n You know, it's to your benefit to try to get in right when you think they're done because if there's a silence, not only is it awkward, but then that sort of cues everybody to start thinking of a new topic to stop the silences.\n\n1:09:11\tSPEAKER_05\n And then you don't get to talk about what you wanted to talk about because the whole subject has changed.\n\n1:09:16\tSPEAKER_01\n You know what? Thinking about it, I think I've only noticed a couple times where there's been actual silence on all channels for a period of time.\n\n1:09:26\tSPEAKER_01\n It's true.\n\n1:09:27\tSPEAKER_01\n That's right.\n\n1:09:28\tSPEAKER_04\n I agree.\n\n1:09:29\tSPEAKER_04\n Interesting observation.\n\n1:09:30\tSPEAKER_04\n Well, this has raised a couple of things for me that I wanted to mention because, you know, at this point, we're at the really fine, grain level of standardization, which I hadn't really thought of specifying in advance before.\n\n1:09:46\tSPEAKER_04\n I wanted to maybe just mention a couple of things.\n\n1:09:48\tSPEAKER_04\n I don't think that these are very common.\n\n1:09:51\tSPEAKER_04\n But what the idea that what we're trying to do is encode the communicative stuff when we have these gray areas.\n\n1:10:00\tSPEAKER_04\n I wanted to draw attention to the fact that there are sometimes these stretches where a person is trying to say something and formulating their thought, and they're coming out with a bunch of segments, which really aren't part of a word.\n\n1:10:10\tSPEAKER_04\n If you run across that word, there's some...\n\n1:10:12\tSPEAKER_04\n Yeah.\n\n1:10:13\tSPEAKER_04\n There's a word for it.\n\n1:10:15\tSPEAKER_04\n My feeling on that is that this isn't really a phonological transcript.\n\n1:10:21\tSPEAKER_04\n And potentially those things could probably be rendered, although some of them are not even full segments.\n\n1:10:26\tSPEAKER_04\n They're even sub-segmental, I would say.\n\n1:10:28\tSPEAKER_04\n I mean, you've got a single flap of a vocal cord sometimes.\n\n1:10:31\tSPEAKER_04\n And the apparatus is almost...\n\n1:10:36\tSPEAKER_04\n Almost going to say that it has somehow this vibration hit before the rest of it.\n\n1:10:41\tSPEAKER_04\n And that's not communicative.\n\n1:10:43\tSPEAKER_04\n So the way I do those things when I hear those is to...\n\n1:10:48\tSPEAKER_04\n I use in parentheses 1x, so it's marked.\n\n1:10:52\tSPEAKER_04\n Or if it's...\n\n1:10:53\tSPEAKER_04\n Or rural, but if it's six or seven or whatever it is, what are we putting those in?\n\n1:10:58\tSPEAKER_04\n And then what I do is I put in brackets...\n\n1:11:02\tSPEAKER_04\n Uncodable, sorry, un-codable, vocal sounds.\n\n1:11:06\tSPEAKER_04\n Oh, okay.\n\n1:11:08\tSPEAKER_04\n And of course, potentially they're codable.\n\n1:11:10\tSPEAKER_04\n But I just wanted to mark roughly how long it is, then indicate what the nature is.\n\n1:11:17\tSPEAKER_04\n So no one's going to try and go back and decode it as something that's a word that was not...\n\n1:11:22\tSPEAKER_04\n It has a different status than synthesized parts when they are words involved.\n\n1:11:29\tSPEAKER_04\n Just to set it aside, have some sort of a length indication.\n\n1:11:32\tSPEAKER_04\n And sometimes I'll be put them in a separate bin, although that's not necessary.\n\n1:11:37\tSPEAKER_04\n It's just sometimes it works out that way that they do this thing.\n\n1:11:40\tSPEAKER_04\n I should do that so often, I'm sorry about that.\n\n1:11:43\tSPEAKER_04\n They do this sound, and then there's a pause, and then they start speaking.\n\n1:11:47\tSPEAKER_04\n So then it's really obvious.\n\n1:11:48\tSPEAKER_04\n I can split it apart and it won't be any problem.\n\n1:11:51\tSPEAKER_01\n I'm glad you meant brought that up because I actually...\n\n1:11:54\tSPEAKER_01\n I'm one of the culprits that puts in all the little...\n\n1:11:57\tSPEAKER_01\n It's ebitty tiny sounds in the middle of everything.\n\n1:11:59\tSPEAKER_01\n I do that too, because I was thinking like you're just supposed to write down everything you hear as closely as possible.\n\n1:12:06\tSPEAKER_01\n And so I'm glad you said that because that actually takes a good amount of time and pretty strict concentration to do that.\n\n1:12:14\tSPEAKER_05\n I put in the exes.\n\n1:12:16\tSPEAKER_05\n I put in if it's an intelligible output.\n\n1:12:18\tSPEAKER_05\n I can't have any syllables, and then I put in six notes.\n\n1:12:21\tSPEAKER_01\n I do that if it's unintelligible, but if I can tell something, if somebody goes, I'll put an R.\n\n1:12:27\tSPEAKER_01\n Oh, I see.\n\n1:12:28\tSPEAKER_01\n I see.\n\n1:12:29\tSPEAKER_01\n So if they go...\n\n1:12:31\tSPEAKER_01\n I'll go R-E-H-M-M-M.\n\n1:12:36\tSPEAKER_01\n So I've been doing that because that's what I can hear.\n\n1:12:39\tSPEAKER_01\n And I'm pretty damn sure that...\n\n1:12:41\tSPEAKER_01\n Sorry.\n\n1:12:42\tSPEAKER_01\n Sorry.\n\n1:12:44\tSPEAKER_00\n Sorry.\n\n1:12:46\tSPEAKER_00\n Sorry.\n\n1:12:48\tSPEAKER_03\n Sorry.\n\n1:12:50\tNone\n Sorry.\n\n1:12:52\tNone\n Sorry.\n\n1:12:54\tNone\n Sorry.\n\n1:12:56\tSPEAKER_02\n Sorry.\n\n1:13:00\tSPEAKER_02\n You said the F1.\n\n1:13:03\tSPEAKER_01\n I'm doing a second cut.\n\n1:13:07\tSPEAKER_01\n You were what you were going to say.\n\n1:13:10\tSPEAKER_02\n She's pretty darn sure.\n\n1:13:14\tSPEAKER_02\n She's been making out probably.\n\n1:13:16\tSPEAKER_02\n That's right.\n\n1:13:17\tSPEAKER_02\n Sorry.\n\n1:13:20\tSPEAKER_02\n I never sworn in any of the meetings.\n\n1:13:22\tSPEAKER_04\n If you heard shoot, I've heard a couple of times.\n\n1:13:25\tSPEAKER_04\n Yeah.\n\n1:13:26\tSPEAKER_02\n That's the swear word verse.\n\n1:13:27\tSPEAKER_02\n No, no, no.\n\n1:13:28\tSPEAKER_02\n They just shoot.\n\n1:13:29\tSPEAKER_04\n I've heard the swear word verse in.\n\n1:13:30\tSPEAKER_01\n Remember that?\n\n1:13:31\tSPEAKER_01\n No, no, no, no, no, no, no, no, no, no, no, no.\n\n1:13:33\tSPEAKER_01\n Back.\n\n1:13:34\tSPEAKER_01\n It was a long time.\n\n1:13:35\tSPEAKER_01\n I didn't remember that.\n\n1:13:36\tSPEAKER_01\n Yeah.\n\n1:13:37\tSPEAKER_01\n And I was like, aw.\n\n1:13:38\tSPEAKER_01\n I emailed you.\n\n1:13:39\tSPEAKER_01\n I was like, you might want to take this out.\n\n1:13:40\tSPEAKER_01\n That's right.\n\n1:13:41\tSPEAKER_01\n Yeah, I do.\n\n1:13:42\tSPEAKER_01\n But it was very quiet.\n\n1:13:43\tSPEAKER_01\n It would have been sort of gone over by accident.\n\n1:13:46\tSPEAKER_01\n It was just very quiet, like, kind of under the breath.\n\n1:13:48\tSPEAKER_01\n I have faith.\n\n1:13:49\tSPEAKER_01\n Yeah, that's why I was missed.\n\n1:13:50\tSPEAKER_01\n Yeah, I understand.\n\n1:13:51\tSPEAKER_04\n Yeah.\n\n1:13:52\tSPEAKER_04\n Yeah.\n\n1:13:53\tSPEAKER_04\n But you have to finish your point.\n\n1:13:54\tSPEAKER_04\n Oh, my goodness.\n\n1:13:55\tSPEAKER_01\n I was just saying that I'm pretty sure that I can tell what exactly what sounds are being produced.\n\n1:14:03\tSPEAKER_01\n Yes.\n\n1:14:04\tSPEAKER_01\n So if it's right or I write an R, if it's right, tell it.\n\n1:14:07\tSPEAKER_05\n Then I always think that it's closer to stick with the X's because it's like how effective.\n\n1:14:12\tSPEAKER_05\n How effective is the Roman alphabet at deciphering all the sounds that a human can make?\n\n1:14:18\tSPEAKER_05\n Yeah.\n\n1:14:19\tSPEAKER_05\n It's not the IPA.\n\n1:14:21\tSPEAKER_05\n I just sort of think it's best to leave it with X's because I, English orthography conventions are just so uncertain anyway in the first place.\n\n1:14:35\tSPEAKER_05\n I usually only use them when I know that the person was trying to make a word.\n\n1:14:40\tSPEAKER_05\n I know that the word they were trying to say and that they were stuttering that.\n\n1:14:43\tSPEAKER_05\n Then I feel fine just writing out the letters.\n\n1:14:46\tSPEAKER_05\n But otherwise, I sort of don't feel right trying to write them out because I feel like it's...\n\n1:14:51\tSPEAKER_05\n You can't really...\n\n1:14:53\tSPEAKER_05\n It's not useful.\n\n1:14:54\tSPEAKER_05\n Yeah, you can't really spell those things with the Roman alphabet.\n\n1:14:57\tSPEAKER_05\n It would say it was only set up for a different purpose, not necessarily so fun to launch it.\n\n1:15:03\tSPEAKER_04\n I agree.\n\n1:15:04\tSPEAKER_04\n I think there's another problem too.\n\n1:15:05\tSPEAKER_04\n And that is that we do have some short words which are communicative.\n\n1:15:07\tSPEAKER_04\n And sometimes, so if you have an ER as part of one of these fragments, we do have a lexicalized ER which is a filler item.\n\n1:15:18\tSPEAKER_03\n It does have a meaning.\n\n1:15:19\tSPEAKER_04\n So I think for both of those reasons, it's good to just leave it in this category of not really communicating in a word-like way.\n\n1:15:26\tSPEAKER_01\n So even if it's ER or...\n\n1:15:28\tSPEAKER_01\n I would keep ER.\n\n1:15:29\tSPEAKER_04\n Well, ER, you're not if it's filler.\n\n1:15:31\tSPEAKER_04\n I mean, ER, that stays.\n\n1:15:33\tSPEAKER_05\n But if it's part of these little fragments...\n\n1:15:37\tSPEAKER_05\n I have been transcribed that as OR.\n\n1:15:39\tSPEAKER_05\n I always thought that was OR sort of with a strange pronunciation.\n\n1:15:41\tSPEAKER_04\n I'm making a distinction.\n\n1:15:42\tSPEAKER_04\n So you have the comic ER where the person says something and then they pretend that they didn't want to say that, and they throw it in ER.\n\n1:15:50\tSPEAKER_04\n Oh, I don't get that one.\n\n1:15:51\tSPEAKER_04\n And that would be an ER, ER.\n\n1:15:53\tSPEAKER_04\n But if they're saying OR in a reduced way, so it comes out as OR, do it as OR.\n\n1:15:59\tSPEAKER_04\n Because that falls within the realm of pronunciation variants.\n\n1:16:03\tSPEAKER_04\n It's just like different ways of saying AND.\n\n1:16:05\tSPEAKER_04\n And I have two more things I wanted to say.\n\n1:16:07\tSPEAKER_04\n One of them is...\n\n1:16:09\tSPEAKER_04\n Yeah, this is an interesting category to me.\n\n1:16:11\tSPEAKER_04\n And I don't...\n\n1:16:13\tSPEAKER_04\n You don't have to mark this systematically.\n\n1:16:16\tSPEAKER_04\n But when you're going through the meeting, and what I'd like people to do if you're not...\n\n1:16:21\tSPEAKER_04\n is to go through the meeting...\n\n1:16:25\tSPEAKER_04\n So if you're doing separate channels first, and then as a final pass through the mix channel, I don't think I've made that explicit, but it's really helpful to go through it a final time through the mix channel so that you hear things in context.\n\n1:16:37\tSPEAKER_04\n At that point, what I sometimes pick up is this metal level where someone finishes someone else's utterance.\n\n1:16:42\tSPEAKER_04\n So you'll suddenly have this stranded word out in the middle of nowhere.\n\n1:16:45\tSPEAKER_04\n And it's because this other speaker on this other channel was trying to formulate this thought and they paused.\n\n1:16:51\tSPEAKER_04\n And they paused, and they paused just enough that this person leaped in and gave them a word.\n\n1:16:55\tSPEAKER_04\n Right.\n\n1:16:56\tSPEAKER_04\n And I think those are interesting.\n\n1:16:57\tSPEAKER_04\n So when I find that, I noted it as finishing...\n\n1:17:01\tSPEAKER_04\n Put capital letters, capital letter, capital letter colon, post-fias utterance.\n\n1:17:06\tSPEAKER_02\n Wait, wait, how do you mark it?\n\n1:17:08\tSPEAKER_04\n Yeah.\n\n1:17:09\tSPEAKER_04\n So in the instance in which...\n\n1:17:12\tSPEAKER_04\n Let's say that Morgan's talking.\n\n1:17:16\tSPEAKER_04\n So he's talking.\n\n1:17:19\tSPEAKER_04\n And then somewhere, there's a bit of a pause, and let's say Adam fills in a word for him.\n\n1:17:25\tSPEAKER_04\n Then what I do is on Adam's channel, I say...\n\n1:17:31\tSPEAKER_04\n I say completing...\n\n1:17:37\tSPEAKER_04\n This isn't that common of an occurrence, completing speaker initial with a colon, post-fias utterance.\n\n1:17:44\tSPEAKER_04\n And what that means is at the time when we see we're going to go to a stage of anonymization.\n\n1:17:48\tSPEAKER_04\n So it's important to have the colon here because that'll make it possible to easily know who it was without having to do the math involved and figuring out which channel it was.\n\n1:17:57\tSPEAKER_04\n The problem with...\n\n1:17:58\tSPEAKER_04\n I originally wanted to use channel numbers as the reference index, but that's not functional because we have these two different numbering schemes.\n\n1:18:06\tSPEAKER_04\n You have the numbering and the channel trends interfaced. You have the numbering and the key file.\n\n1:18:10\tSPEAKER_04\n And this can be very different.\n\n1:18:11\tSPEAKER_04\n So you know to be able to...\n\n1:18:13\tSPEAKER_04\n This is redundant in a useful way and that you know that you're not going to make a mistake. I tried to do it with the numbers and I was making all sorts of inconsistent promises.\n\n1:18:20\tSPEAKER_01\n So that's probably why you added in that thing that automatically puts in the people's initials.\n\n1:18:27\tSPEAKER_04\n I did that partly to keep track of things.\n\n1:18:30\tSPEAKER_04\n Absolutely.\n\n1:18:31\tSPEAKER_04\n Absolutely.\n\n1:18:32\tSPEAKER_01\n So it's the fact that it was easier to deal with when there are initials.\n\n1:18:36\tSPEAKER_01\n The initials I wanted to hear that.\n\n1:18:38\tSPEAKER_04\n I didn't do that systematically until really rather recently, so I'm glad you know that it's useful.\n\n1:18:43\tSPEAKER_04\n It takes an extra step.\n\n1:18:44\tSPEAKER_04\n Glad it's useful.\n\n1:18:45\tSPEAKER_04\n Okay, and I just have one more thing to say and that is that once this is just such a...\n\n1:18:50\tSPEAKER_04\n I'm getting down to like the really easy, wincey stuff.\n\n1:18:53\tSPEAKER_04\n But once I found a comment that in curly brackets about mumbling and that's...\n\n1:19:02\tSPEAKER_04\n This is just to mention an instance that happened once is really grasping for details.\n\n1:19:09\tSPEAKER_04\n I think and it may be that it was not from anybody here.\n\n1:19:14\tSPEAKER_04\n But I think that mumble is only useful to me in the sense of whispered if it's like a manner of speaking in which case it's a call, but not in terms of replacing like this string of undesirable fragments.\n\n1:19:27\tSPEAKER_04\n This was used in place of something that was unintelligible in which case to be better to use parentheses and either explanation or the number of syllables if you know...\n\n1:19:40\tSPEAKER_02\n If you know the call with the word or something.\n\n1:19:43\tSPEAKER_04\n Exactly.\n\n1:19:44\tSPEAKER_04\n If it's a manner of speaking, then it's useful.\n\n1:19:46\tSPEAKER_04\n And otherwise the parentheses with an estimate of syllables is better.\n\n1:19:51\tSPEAKER_04\n Okay.\n\n1:19:52\tSPEAKER_04\n So I guess you know I don't want to keep you. I really appreciate this.\n\n1:19:57\tNone\n Yes.\n\n1:19:57\tSPEAKER_01\n So we are for...\n\n1:19:59\tSPEAKER_01\n Qual is used for things like whispered or said while laughing or...\n\n1:20:08\tNone\n Yes.\n\n1:20:08\tSPEAKER_01\n...with that nature.\n\n1:20:09\tSPEAKER_01\n I remember at some point we were doing the difference between vocal and non-vocal sense.\n\n1:20:14\tNone\n Yes.\n\n1:20:14\tSPEAKER_04\n Oh, but good question.\n\n1:20:15\tSPEAKER_04\n And you don't have to add any of those tags.\n\n1:20:17\tSPEAKER_04\n Oh.\n\n1:20:18\tSPEAKER_04\n The only tags that you need to add is that there's like one exception that's just microscopic.\n\n1:20:22\tSPEAKER_04\n And that is sometimes...\n\n1:20:24\tSPEAKER_04\n This is again really rare.\n\n1:20:26\tSPEAKER_04\n Sometimes I've run across the word noise.\n\n1:20:28\tSPEAKER_04\n And offhand I don't know if that's a vocal noise or a non-vocal noise.\n\n1:20:32\tSPEAKER_04\n And so then I listen to it and I figured out.\n\n1:20:34\tSPEAKER_04\n But that's the only place you need to use a vocal non-vocal tag where it's potentially ambiguous between these two categories.\n\n1:20:39\tSPEAKER_04\n Because otherwise what I do when I get these is...\n\n1:20:41\tSPEAKER_04\n Of course I do my checks.\n\n1:20:42\tSPEAKER_04\n And then I have a script that I wrote which will separate everything out that has curly braces.\n\n1:20:47\tSPEAKER_04\n Do a listing of them.\n\n1:20:49\tSPEAKER_04\n And then anything...\n\n1:20:51\tSPEAKER_04\n Some of them already have tags from some previous modification.\n\n1:20:56\tSPEAKER_04\n But anything that doesn't, I just go through this list.\n\n1:20:59\tSPEAKER_04\n And I tag it right then.\n\n1:21:01\tSPEAKER_04\n And so in one change I can modify, you know, 500 instances of this.\n\n1:21:09\tSPEAKER_04\n So there's no need to add the vocal or the non-vocal.\n\n1:21:12\tSPEAKER_01\n But for noise that we know is something like mic noise or something like a noise.\n\n1:21:20\tSPEAKER_01\n Yes.\n\n1:21:21\tSPEAKER_04\n Whatever the wink and mark it as that.\n\n1:21:23\tSPEAKER_04\n If you mark it mic noise then I'll know what kind of noise it is when I go through the thing and put the BORC or N on the NTH substitution file.\n\n1:21:29\tSPEAKER_04\n But it's very efficient for me to add those tags later.\n\n1:21:31\tSPEAKER_04\n It's really not.\n\n1:21:32\tSPEAKER_04\n Same thing with the call.\n\n1:21:33\tSPEAKER_04\n Just so long as I can tell which of those three categories it is or prawn.\n\n1:21:37\tSPEAKER_04\n But you know that's really very obvious the pronunciation of.\n\n1:21:41\tSPEAKER_04\n Just so long as it's clear to me from the comment which of those three it is that I'm following.\n\n1:21:52\tSPEAKER_04\n That's great.\n\n1:21:53\tSPEAKER_04\n All right.\n\n1:21:54\tSPEAKER_04\n So I guess...\n\n1:21:55\tSPEAKER_04\n Do you want to read digits?\n\n1:21:56\tSPEAKER_04\n Do I have time?\n\n1:21:57\tSPEAKER_04\n Do we have time?\n\n1:21:58\tSPEAKER_04\n Would you mind coming to digits?\n\n1:21:59\tSPEAKER_04\n Yeah.\n\n1:22:00\tSPEAKER_04\n So do you want to do it in unison this time?\n\n1:22:03\tSPEAKER_04\n Well we did it in unison last time.\n\n1:22:04\tSPEAKER_02\n I did.\n\n1:22:05\tSPEAKER_02\n I did.\n\n1:22:06\tSPEAKER_02\n I did.\n\n1:22:07\tSPEAKER_02\n Okay.\n\n1:22:08\tSPEAKER_02\n Good deal.\n\n1:22:09\tSPEAKER_02\n Oh and do you want us to mark roughly the time we start?\n\n1:22:12\tSPEAKER_04\n That is really what that time field is.\n\n1:22:14\tSPEAKER_04\n I used to think it was the beginning of the meeting but yes.\n\n1:22:16\tSPEAKER_04\n All right.\n\n1:22:17\tSPEAKER_01\n All right.\n\n1:22:18\tSPEAKER_01\n The beginning of the meeting.\n\n1:22:19\tSPEAKER_04\n Yeah.\n\n1:22:20\tNone\n Okay.\n\n1:22:21\tSPEAKER_04\n Okay.\n\n1:22:22\tSPEAKER_04\n So who wants to start?\n\n1:22:24\tSPEAKER_04\n Well, I guess I'll start.\n\n1:22:27\tSPEAKER_04\n Okay.\n\n1:22:28\tSPEAKER_04\n Trans...\n\n1:22:29\tSPEAKER_04\n And the time is.\n\n1:22:30\tSPEAKER_04\n Okay.\n\n1:22:31\tSPEAKER_04\n Transcript.\n\n1:22:33\tSPEAKER_04\n L.\n\n1:22:34\tSPEAKER_04\n 442.\n\n1:22:35\tSPEAKER_04\n 5.\n\n1:22:37\tSPEAKER_04\n 234.\n\n1:22:39\tSPEAKER_04\n 999.\n\n1:22:40\tSPEAKER_04\n 388.\n\n1:22:41\tSPEAKER_04\n 1.\n\n1:22:42\tSPEAKER_04\n 165.\n\n1:22:43\tSPEAKER_04\n 266.\n\n1:22:44\tSPEAKER_04\n 7857.\n\n1:22:45\tSPEAKER_04\n 849.\n\n1:22:46\tSPEAKER_04\n 402.\n\n1:22:47\tSPEAKER_04\n 867.\n\n1:22:48\tSPEAKER_04\n 633.\n\n1:22:49\tSPEAKER_04\n 36.\n\n1:22:50\tSPEAKER_04\n 37.\n\n1:22:51\tSPEAKER_04\n 266.\n\n1:22:52\tSPEAKER_04\n 618.\n\n1:22:53\tSPEAKER_04\n 948.\n\n1:22:54\tSPEAKER_04\n 78.\n\n1:22:55\tSPEAKER_04\n 30.\n\n1:22:56\tSPEAKER_04\n 1.\n\n1:22:57\tSPEAKER_04\n 812.\n\n1:22:58\tSPEAKER_04\n 32.\n\n1:22:59\tSPEAKER_04\n 718.\n\n1:23:00\tSPEAKER_04\n 527.\n\n1:23:01\tSPEAKER_04\n 5139.\n\n1:23:02\tSPEAKER_04\n 422.\n\n1:23:03\tSPEAKER_04\n 8347.\n\n1:23:04\tSPEAKER_04\n 349.\n\n1:23:05\tSPEAKER_04\n 46908.\n\n1:23:06\tSPEAKER_04\n Okay.\n\n1:23:07\tSPEAKER_04\n I wanted to make one comment.\n\n1:23:08\tSPEAKER_04\n That is some of these are like two digits.\n\n1:23:09\tSPEAKER_04\n And just be sure you say both digits separately.\n\n1:23:11\tSPEAKER_04\n So 1.8 is to the 18.\n\n1:23:12\tSPEAKER_04\n Okay.\n\n1:23:13\tSPEAKER_04\n I can go.\n\n1:23:14\tSPEAKER_01\n Okay.\n\n1:23:15\tSPEAKER_01\n Okay.\n\n1:23:16\tSPEAKER_01\n Transcript L.\n\n1:23:17\tSPEAKER_01\n 435.\n\n1:23:18\tSPEAKER_01\n 0.\n\n1:23:19\tSPEAKER_01\n 676.\n\n1:23:20\tSPEAKER_01\n 34322.\n\n1:23:22\tSPEAKER_01\n 2.\n\n1:23:23\tSPEAKER_01\n 3.\n\n1:23:24\tSPEAKER_01\n 342.\n\n1:23:25\tSPEAKER_01\n 695624.\n\n1:23:27\tSPEAKER_01\n 082848.\n\n1:23:31\tSPEAKER_01\n 3439.\n\n1:23:33\tSPEAKER_01\n 135659.\n\n1:23:36\tSPEAKER_01\n 4744.\n\n1:23:38\tSPEAKER_01\n 1.719.\n\n1:23:40\tSPEAKER_01\n 85572.\n\n1:23:43\tSPEAKER_01\n 2.\n\n1:23:44\tSPEAKER_01\n 4368.\n\n1:23:46\tSPEAKER_01\n 03.\n\n1:23:47\tSPEAKER_01\n 1558.\n\n1:23:49\tSPEAKER_01\n 895.\n\n1:23:51\tSPEAKER_01\n 56.\n\n1:23:52\tSPEAKER_01\n 1691.\n\n1:23:54\tSPEAKER_01\n 8348.\n\n1:23:56\tSPEAKER_01\n 93410.\n\n1:23:58\tSPEAKER_06\n 2.\n\n1:24:00\tSPEAKER_06\n Transcript L.\n\n1:24:02\tSPEAKER_06\n 6.\n\n1:24:03\tSPEAKER_06\n 841.\n\n1:24:04\tSPEAKER_06\n 6.\n\n1:24:05\tSPEAKER_06\n 13.\n\n1:24:06\tSPEAKER_06\n 0813.\n\n1:24:07\tSPEAKER_06\n 8757.\n\n1:24:09\tSPEAKER_06\n 8874.\n\n1:24:10\tSPEAKER_06\n 9.\n\n1:24:11\tSPEAKER_06\n 848.\n\n1:24:12\tSPEAKER_06\n 4.\n\n1:24:13\tSPEAKER_06\n 4.\n\n1:24:14\tSPEAKER_06\n 4.\n\n1:24:15\tSPEAKER_06\n 4.\n\n1:24:16\tSPEAKER_06\n 869.\n\n1:24:17\tSPEAKER_06\n 2.\n\n1:24:18\tSPEAKER_06\n 6.\n\n1:24:19\tSPEAKER_06\n 834.\n\n1:24:20\tSPEAKER_06\n 8569.\n\n1:24:21\tSPEAKER_06\n 4.\n\n1:24:22\tSPEAKER_06\n 6.\n\n1:24:23\tSPEAKER_06\n 7662.\n\n1:24:24\tSPEAKER_06\n 843.\n\n1:24:26\tSPEAKER_06\n 535.\n\n1:24:27\tSPEAKER_06\n 744.\n\n1:24:28\tSPEAKER_06\n 2.\n\n1:24:29\tSPEAKER_06\n 617.\n\n1:24:30\tSPEAKER_06\n 4.\n\n1:24:31\tSPEAKER_06\n 8237.\n\n1:24:33\tSPEAKER_06\n 328280.\n\n1:24:35\tSPEAKER_06\n 550.\n\n1:24:37\tSPEAKER_06\n 4.\n\n1:24:38\tSPEAKER_06\n 788133.\n\n1:24:40\tNone\n 3.\n\n1:24:42\tSPEAKER_02\n 3.\n\n1:24:45\tSPEAKER_02\n 3.\n\n1:24:46\tSPEAKER_02\n 4.\n\n1:24:47\tSPEAKER_02\n 594.\n\n1:24:48\tSPEAKER_02\n 4.\n\n1:24:49\tSPEAKER_02\n 109.\n\n1:24:50\tSPEAKER_02\n 6.\n\n1:24:51\tSPEAKER_02\n 258.\n\n1:24:52\tSPEAKER_02\n 3.\n\n1:24:53\tSPEAKER_02\n 512.\n\n1:24:54\tSPEAKER_02\n 4.\n\n1:24:55\tSPEAKER_02\n 4.\n\n1:24:56\tSPEAKER_02\n 748.\n\n1:24:57\tSPEAKER_02\n 3.\n\n1:24:59\tSPEAKER_02\n 0.\n\n1:25:00\tSPEAKER_02\n 867.\n\n1:25:02\tSPEAKER_02\n 625601.\n\n1:25:05\tSPEAKER_02\n 2.\n\n1:25:06\tSPEAKER_02\n 786.\n\n1:25:07\tSPEAKER_02\n 2.\n\n1:25:08\tSPEAKER_02\n 3.\n\n1:25:09\tSPEAKER_02\n 1.\n\n1:25:10\tSPEAKER_02\n 0.\n\n1:25:11\tSPEAKER_02\n 4.\n\n1:25:12\tSPEAKER_02\n 894.\n\n1:25:13\tSPEAKER_02\n 4.\n\n1:25:14\tSPEAKER_02\n 82823.\n\n1:25:15\tSPEAKER_02\n 3.\n\n1:25:16\tSPEAKER_02\n 1.\n\n1:25:17\tSPEAKER_02\n 72521.\n\n1:25:18\tSPEAKER_02\n 5266.\n\n1:25:19\tSPEAKER_02\n 0.\n\n1:25:20\tSPEAKER_02\n 0.\n\n1:25:21\tSPEAKER_02\n 2.\n\n1:25:22\tSPEAKER_02\n 1.\n\n1:25:23\tSPEAKER_01\n 583.\n\n1:25:24\tSPEAKER_01\n Transcript L439.\n\n1:25:27\tSPEAKER_01\n 4262.\n\n1:25:28\tSPEAKER_01\n 842.\n\n1:25:30\tSPEAKER_01\n 842.\n\n1:25:31\tSPEAKER_01\n 844.\n\n1:25:32\tSPEAKER_01\n 776.\n\n1:25:33\tSPEAKER_01\n 078525.\n\n1:25:35\tSPEAKER_01\n 257.\n\n1:25:36\tSPEAKER_01\n 0776.\n\n1:25:38\tSPEAKER_01\n 756.\n\n1:25:40\tSPEAKER_01\n 251.\n\n1:25:41\tSPEAKER_01\n 980354.\n\n1:25:43\tSPEAKER_01\n 3016.\n\n1:25:46\tSPEAKER_01\n 849 39 3.\n\n1:25:49\tSPEAKER_01\n 0359 116068.\n\n1:25:52\tSPEAKER_01\n 355 452 253.\n\n1:25:56\tSPEAKER_01\n 4-0-1085-1177.\n\n1:26:02\tSPEAKER_05\n Transcript L-440.\n\n1:26:05\tSPEAKER_05\n 6506-4205-4013.\n\n1:26:10\tSPEAKER_05\n 6-0545-176.\n\n1:26:14\tSPEAKER_05\n 1-2-1-013-281-808-23955-2524-1708-5927.\n\n1:26:26\tSPEAKER_05\n 2-105-389-33.\n\n1:26:29\tSPEAKER_05\n 1-0-216-1429-664-3305203.\n\n1:26:37\tSPEAKER_04\n Okay, wonderful.\n\n1:26:38\tSPEAKER_04\n Thank you very, very much.\n\n1:26:40\tSPEAKER_04\n I really appreciate this.\n\n1:26:41\tSPEAKER_04\n No problem.\n\n1:26:42\tSPEAKER_04\n And Shula.\n\n1:26:43\tSPEAKER_04\n I can get to turn the microphones off.\n\n1:26:45\tSPEAKER_04\n Thank you.\n\n", "summary": [{"summary_text": "SPEAKER and Leah are going to the conventions today. They will talk about the microphone adjustments and some ideas about the return to conventions. They also discuss some things that came up with the tiger fish transcus, which is similar to the one in the transcribe."}]}