{"filename": "./data/Btr001.txt", "transcript": "0:00:00\tSPEAKER_04\n Okay, you're on.\n\n0:00:01\tSPEAKER_04\n Okay.\n\n0:00:02\tSPEAKER_04\n And you have another room?\n\n0:00:04\tSPEAKER_07\n Would you mind telling me again, please?\n\n0:00:06\tSPEAKER_07\n I'm always going to write it.\n\n0:00:10\tSPEAKER_07\n Okay.\n\n0:00:11\tSPEAKER_07\n Now, if the batteries were to go out during the meeting, there's really what do we do?\n\n0:00:22\tSPEAKER_07\n Do we have batteries back there?\n\n0:00:24\tSPEAKER_07\n Okay.\n\n0:00:25\tSPEAKER_07\n And you'll be in your office during this?\n\n0:00:26\tSPEAKER_07\n Oh, thank you very much.\n\n0:00:28\tSPEAKER_07\n Thanks a lot.\n\n0:00:29\tSPEAKER_07\n Would you close the door for me, please?\n\n0:00:30\tSPEAKER_07\n Please.\n\n0:00:31\tSPEAKER_07\n Okay.\n\n0:00:32\tNone\n Okay.\n\n0:00:33\tNone\n Thanks.\n\n0:00:34\tSPEAKER_07\n So, thanks very much for coming.\n\n0:00:40\tSPEAKER_07\n Okay.\n\n0:00:41\tSPEAKER_07\n So, let's see.\n\n0:00:43\tSPEAKER_07\n So as you know, the meeting today is to benefit from your involvement in the data and all the things that you've been exposed to in these many months.\n\n0:00:54\tSPEAKER_07\n And I just put down some ideas.\n\n0:00:57\tSPEAKER_07\n You've seen some of this in the email that I sent out earlier.\n\n0:01:00\tSPEAKER_07\n And none of these, these are not obligatory topics.\n\n0:01:03\tSPEAKER_07\n They're just things that I thought might be useful to discuss just as a way of organizing the discussion.\n\n0:01:08\tSPEAKER_07\n But if they're other topics you'd like to discuss, that'd be great, too.\n\n0:01:12\tSPEAKER_07\n All right.\n\n0:01:13\tSPEAKER_07\n So, it struck me that, you know, we could start out with some sort of general thing about things that you found easier or more difficult with respect to transcribing or checking or using the interface or dealing with a time-insur any aspect of that type.\n\n0:01:30\tSPEAKER_07\n And then maybe talk about specific, specific of the data and then maybe talk about aspects of the conventions and the technical setup regarding the auditory image and the interface.\n\n0:01:43\tSPEAKER_07\n Okay.\n\n0:01:44\tSPEAKER_07\n So, maybe we could just start with issues of the chart type up there at the top of what did you find easiest or most difficult about transcribing the data?\n\n0:01:56\tSPEAKER_04\n Okay.\n\n0:01:57\tSPEAKER_04\n Yeah.\n\n0:01:58\tSPEAKER_04\n One thing that I remember being really difficult at the beginning and it got easier as we went along was acronyms and technical terms because there are so many.\n\n0:02:08\tSPEAKER_04\n And it's a field that I'm not really very, I don't know, I don't know very much about this kind of stuff.\n\n0:02:16\tSPEAKER_04\n Computers and speech recognition.\n\n0:02:18\tSPEAKER_04\n I've never taken classes on it or anything.\n\n0:02:20\tSPEAKER_04\n So I found that really hard and I remember transcribing and having a bunch of, you know, every five words would be something I'd put in parentheses because I didn't know what it was.\n\n0:02:30\tSPEAKER_04\n So, parentheses meaning uncertainty?\n\n0:02:32\tSPEAKER_04\n Yeah.\n\n0:02:33\tSPEAKER_04\n But it's definitely gotten easier because the same things keep getting repeated once you learn what it is and you could say, okay, I know what they meant by that or I know how to spell that now or something like that.\n\n0:02:43\tSPEAKER_04\n And the cast of characters that you put up on the web is helpful.\n\n0:02:46\tSPEAKER_00\n Yeah.\n\n0:02:47\tSPEAKER_07\n Okay, good.\n\n0:02:48\tSPEAKER_07\n It's sort of like a foreign language, isn't it?\n\n0:02:50\tSPEAKER_07\n Yeah.\n\n0:02:51\tSPEAKER_07\n Basically, you have these specialized terms for things that I didn't know, needed specialized terms.\n\n0:02:56\tSPEAKER_07\n Yeah.\n\n0:02:57\tSPEAKER_04\n Especially when describing like the setup in this room also and the different types of mics, I don't know.\n\n0:03:06\tSPEAKER_04\n And it's hard to tell when people are talking relatively quickly, they just glide over some of the letters, don't fully pronounce them.\n\n0:03:14\tSPEAKER_04\n So you can't really tell even if you listen to it ten times.\n\n0:03:17\tSPEAKER_01\n Yeah, I usually put most of the acronyms in parentheses because I think it's sort of safe because people can say the acronyms really fast.\n\n0:03:25\tSPEAKER_01\n And I figure that even if I think I know exactly what letters they said, it's probably best to put them in parentheses because I probably don't.\n\n0:03:32\tSPEAKER_07\n That's not about strategy.\n\n0:03:33\tSPEAKER_07\n I mean, it's true that I always check the parentheses at the last stage and those are pretty easy to clear in terms of when they're in context, not about strategy.\n\n0:03:42\tSPEAKER_05\n Yeah.\n\n0:03:43\tSPEAKER_05\n Some of them just occurred over and over again.\n\n0:03:45\tSPEAKER_05\n So like, PDA.\n\n0:03:46\tSPEAKER_05\n Yes.\n\n0:03:47\tSPEAKER_05\n Like that.\n\n0:03:48\tSPEAKER_05\n Got it easy.\n\n0:03:49\tSPEAKER_05\n There was a bunch of them that I suspect in just having repeated often and often, you know, over and over.\n\n0:03:55\tSPEAKER_05\n Yeah.\n\n0:03:56\tSPEAKER_07\n And also when you have the juxtaposition of PDA and PGM, then you know, in context you can tell which one it's yeah, is probably likely to be the one that you had, even though\n\n0:04:09\tSPEAKER_04\n I still don't know what they are. I'm going to assume they're microphones of some sort, but that's all.\n\n0:04:14\tSPEAKER_07\n Well, these here are the PGMs right there.\n\n0:04:17\tSPEAKER_03\n Is anybody wearing one of those awful quote-croned microphones?\n\n0:04:20\tSPEAKER_03\n No, you've heard people in the crowd on a pay-ass.\n\n0:04:23\tSPEAKER_07\n No, he was telling us before the meeting that they're not in circulation right now that they were unpopular.\n\n0:04:31\tSPEAKER_07\n I liked them and I don't like them.\n\n0:04:32\tSPEAKER_07\n I thought the quality was good.\n\n0:04:33\tSPEAKER_07\n She's cute.\n\n0:04:34\tSPEAKER_07\n I wanted to say, he said some more things about that, but I was working on some things.\n\n0:04:38\tSPEAKER_07\n About the microphone.\n\n0:04:41\tSPEAKER_04\n I can't remember.\n\n0:04:44\tSPEAKER_04\n He said that they were designed for a specific size head.\n\n0:04:46\tSPEAKER_02\n Oh yeah.\n\n0:04:47\tSPEAKER_02\n That's right.\n\n0:04:48\tSPEAKER_04\n So if your head happened to be that size and you were fine and if it was bigger than it was like torture.\n\n0:04:54\tSPEAKER_04\n Oh right.\n\n0:04:55\tSPEAKER_04\n Yeah.\n\n0:04:56\tSPEAKER_04\n Or I don't know.\n\n0:04:57\tSPEAKER_07\n I like them.\n\n0:04:58\tSPEAKER_07\n Actually, there's the picture of the crown of Justin on the wall right there.\n\n0:05:02\tSPEAKER_07\n So it sort of pokes over your ears from back.\n\n0:05:04\tSPEAKER_07\n Right.\n\n0:05:05\tSPEAKER_04\n Oh yeah.\n\n0:05:06\tSPEAKER_04\n Yeah, that doesn't look so bad, but I guess it depends really.\n\n0:05:10\tSPEAKER_07\n Okay.\n\n0:05:11\tSPEAKER_07\n So now what about accents?\n\n0:05:13\tSPEAKER_03\n Do you have that you find any tough sometimes?\n\n0:05:17\tSPEAKER_03\n Some of the German accents can get a little bit daunting.\n\n0:05:19\tSPEAKER_03\n I mean, I forget who it was that I was transcribing, but it was tough to figure out what he was saying at any given point in time and I would just listen to it over and over and over and I'm going, oh my god, my head's going to explode.\n\n0:05:36\tSPEAKER_03\n Like not really understanding.\n\n0:05:38\tSPEAKER_03\n And so I was getting a little frustrated because I would put a lot of things into parentheses and then go back over it and go back over it again and still, you know, I like to try to clear as much up as I possibly can and I just felt like, you know, with the German accents just for me personally, those were probably the toughest to get around.\n\n0:06:00\tSPEAKER_03\n They weren't impossible, but just like they took the most time too.\n\n0:06:04\tSPEAKER_03\n I mean, it would take maybe twice as long on a given channel speaker who is a German accent and somebody who's, you know, an native English speaker or even Asian, like speaking Asian language I found that easier, you know, that somebody who speaks like Chinese or something.\n\n0:06:22\tSPEAKER_07\n Okay.\n\n0:06:23\tSPEAKER_07\n What you've studied some languages, which one's cheaper?\n\n0:06:25\tSPEAKER_07\n Are you studying it's more romance direction?\n\n0:06:27\tSPEAKER_03\n Yeah.\n\n0:06:28\tSPEAKER_03\n Well, I studied, I mean, I studied Old English for a while and then I've worked with Larry Heimann on like some of the Bantu languages and, you know, I'm also working with Ian Madison and he's been doing work on the like also some African languages.\n\n0:06:44\tSPEAKER_07\n So it's not really, you're not really exposed to German very much.\n\n0:06:48\tSPEAKER_03\n No, I mean, I sing in German.\n\n0:06:50\tSPEAKER_03\n Ah, interesting.\n\n0:06:51\tSPEAKER_03\n Interesting.\n\n0:06:52\tSPEAKER_03\n I mean, I can pronounce it, but I don't know any.\n\n0:06:55\tSPEAKER_03\n Okay.\n\n0:06:56\tSPEAKER_03\n That's interesting.\n\n0:06:57\tSPEAKER_03\n I can do, I can pronounce a lot of languages and I actually just speak them because of singing.\n\n0:07:02\tSPEAKER_04\n Yeah.\n\n0:07:03\tSPEAKER_04\n And then I found the Spanish speakers to be the hardest.\n\n0:07:05\tSPEAKER_04\n And the German speakers, I found a little bit easier and I thought maybe that was because I had, I took German for a semester and I had exposure to German because I had a lot of friends who were really into Germany and German language.\n\n0:07:17\tSPEAKER_04\n But and I found that I could, if they were pronouncing something in a certain way, I could say, oh, well, that's just the German way of pronouncing this and then I figured out what they were saying.\n\n0:07:26\tSPEAKER_04\n But with the Spanish speakers, it was, I've never taken Spanish, even though I've taken French and I speak French fairly well, I found the Spanish to be much harder and maybe also because the level of fluency for the Spanish speakers was a little bit less than the level of fluency of the German speakers that are here.\n\n0:07:43\tSPEAKER_01\n If you're talking about who I think you're talking about, are you talking about, um, there's a couple of different Spanish speakers.\n\n0:07:48\tSPEAKER_05\n Can we give names?\n\n0:07:49\tSPEAKER_05\n Yeah.\n\n0:07:50\tSPEAKER_07\n Which probably shouldn't, right?\n\n0:07:51\tSPEAKER_07\n Is that?\n\n0:07:52\tSPEAKER_07\n It's a good question.\n\n0:07:53\tSPEAKER_07\n Um, I can't really answer that.\n\n0:07:56\tSPEAKER_01\n Okay, well, that was a lot of particular.\n\n0:07:58\tSPEAKER_01\n Who I find the hardest to transcribe of all, um, is she Spanish?\n\n0:08:02\tSPEAKER_05\n Oh, oh, yeah.\n\n0:08:04\tSPEAKER_01\n Okay.\n\n0:08:05\tSPEAKER_01\n And, um, and I've taken lots, I'm fluent in Spanish and so, um, when I, when I correct it, I can, I can tell that the person who, um, transcribed it before me probably didn't speak Spanish because I can catch a lot of things like, like, no, that's not what she said.\n\n0:08:21\tSPEAKER_01\n I can tell she's pronouncing, pronouncing it the way that if you bet it from a, you know, a Spanish speaker's mind that you would, you know, pronounce it the way that you would pronounce it in Spanish.\n\n0:08:30\tSPEAKER_01\n At the same time, I can't get most of it because I find it one of the hardest ones to transcribe.\n\n0:08:37\tSPEAKER_07\n Well, what you can see is that it's, it's her lack of, of English fluency.\n\n0:08:40\tSPEAKER_07\n Yeah, I think so, yeah.\n\n0:08:41\tSPEAKER_07\n Yeah, that's, that's really interesting.\n\n0:08:43\tSPEAKER_07\n I do find that the German tends to be easier for me than, than the others because of my exposure and interest in German.\n\n0:08:50\tSPEAKER_03\n Yeah.\n\n0:08:51\tSPEAKER_03\n But, um, maybe I haven't transcribed this Spanish one, and I don't know if I have.\n\n0:08:54\tSPEAKER_07\n I suspect you haven't because this was earlier on that we had a lot of, actually, she, she was in the middle phase, I would say, we had another Spanish speaker who was earlier who was also difficult.\n\n0:09:05\tSPEAKER_07\n Yeah, he was hard.\n\n0:09:06\tSPEAKER_07\n Yeah, that's really interesting.\n\n0:09:07\tSPEAKER_05\n He got easier though because he started, like, he would say certain words over and over\n\n0:09:12\tSPEAKER_04\n and, and you got to know his pronunciation a bit. Yeah, so he said, sign you.\n\n0:09:16\tSPEAKER_04\n Yes, it sounds like sign.\n\n0:09:17\tSPEAKER_04\n I'm saying signal.\n\n0:09:18\tSPEAKER_04\n Yeah, I remember that.\n\n0:09:19\tSPEAKER_04\n And I can't describe it as signal.\n\n0:09:21\tSPEAKER_04\n The way he said mixed was really strange.\n\n0:09:22\tSPEAKER_04\n Yeah, mixed, mixed, yeah, for something.\n\n0:09:25\tSPEAKER_07\n Yeah.\n\n0:09:26\tSPEAKER_07\n Which was, you know, you could predict it.\n\n0:09:28\tSPEAKER_04\n I mean, if you knew, especially because also in the beginning meetings, I mean, he'd say something and no one in the meeting would understand.\n\n0:09:33\tSPEAKER_04\n And then everyone would say, what was that again?\n\n0:09:35\tSPEAKER_04\n And then they'd come up and say, no, I said so I could.\n\n0:09:38\tSPEAKER_02\n That was interesting.\n\n0:09:42\tSPEAKER_07\n Yeah.\n\n0:09:43\tSPEAKER_06\n Okay.\n\n0:09:44\tSPEAKER_05\n Yeah, I mean, he was never, like, it was never up to, like, a native speaker, but, like, it got a little easier.\n\n0:09:50\tSPEAKER_05\n I remember the game you were just sort of like, you were beating your head against the ball.\n\n0:09:56\tSPEAKER_05\n Oh, I went crazy.\n\n0:09:57\tSPEAKER_04\n I think that better.\n\n0:09:58\tSPEAKER_04\n I would skip doing that portion for as long as I could because I just couldn't deal with it.\n\n0:10:05\tSPEAKER_07\n Yeah, I had the same experience.\n\n0:10:07\tSPEAKER_07\n Yeah.\n\n0:10:08\tSPEAKER_07\n And actually, sometimes when people lack a certain level of fluency, you can ask them themselves, what did you say there?\n\n0:10:14\tSPEAKER_00\n And they can't tell you.\n\n0:10:15\tSPEAKER_07\n I think it's sort of a general variability when it's not, when you're learning a language and you have it gotten to a certain level.\n\n0:10:21\tSPEAKER_07\n Yeah.\n\n0:10:22\tSPEAKER_07\n Also, I wonder if it's partly that Spanish has different pronunciations in different regions.\n\n0:10:27\tSPEAKER_07\n I mean, do you think that maybe, I mean, being, I mean, not that I would know that.\n\n0:10:35\tSPEAKER_07\n But I just wondered if, you know, she was from probably continental Spain versus, you know, other Spanish.\n\n0:10:43\tSPEAKER_07\n I wonder if that would have a contributing factor.\n\n0:10:46\tSPEAKER_07\n I don't know.\n\n0:10:47\tSPEAKER_04\n I like the region.\n\n0:10:48\tSPEAKER_04\n I don't have an idea about Spain, but I know that in France, for example, Paris and France is much easier for me to understand because I learned it versus France in like Marseille or in the south or in like the province, like the villages and the south.\n\n0:11:01\tSPEAKER_04\n It's really hard to understand.\n\n0:11:03\tSPEAKER_05\n Or in Quebec, right?\n\n0:11:04\tSPEAKER_05\n In Canada, it's different.\n\n0:11:06\tSPEAKER_05\n It's different.\n\n0:11:07\tSPEAKER_07\n A lot of pronunciations are different.\n\n0:11:09\tSPEAKER_07\n And in my case with, with German, I, a certain region, and I do well.\n\n0:11:13\tSPEAKER_07\n And then get farther away from that region.\n\n0:11:15\tSPEAKER_07\n And I noticed it's more and more difficult.\n\n0:11:17\tSPEAKER_03\n Is there another language that's spoken in Spain too?\n\n0:11:19\tSPEAKER_03\n What am I thinking?\n\n0:11:20\tSPEAKER_03\n Castilian?\n\n0:11:21\tSPEAKER_03\n Castilian.\n\n0:11:22\tSPEAKER_03\n Yeah.\n\n0:11:23\tSPEAKER_03\n And Catalan.\n\n0:11:24\tSPEAKER_03\n Catalan.\n\n0:11:25\tSPEAKER_03\n Yeah.\n\n0:11:26\tSPEAKER_03\n So maybe, I mean, depending on where she is, like maybe.\n\n0:11:29\tSPEAKER_07\n But she was also very low volume.\n\n0:11:33\tSPEAKER_07\n And didn't say a lot.\n\n0:11:34\tSPEAKER_07\n I mean, I totally agree.\n\n0:11:35\tSPEAKER_07\n This was a difficult person to understand.\n\n0:11:38\tSPEAKER_07\n Yeah.\n\n0:11:39\tSPEAKER_01\n Well, the last one I did, she actually said a lot.\n\n0:11:40\tSPEAKER_01\n It was kind of, it was very hard to transcribe.\n\n0:11:43\tSPEAKER_01\n You know, I just think that her fluency in English wasn't very, very high up there.\n\n0:11:50\tSPEAKER_01\n So it was really difficult.\n\n0:11:52\tSPEAKER_01\n But I mean, I did find that knowing Spanish helped me a lot.\n\n0:11:55\tSPEAKER_01\n I can mention that.\n\n0:11:56\tSPEAKER_01\n I can mention that.\n\n0:11:57\tSPEAKER_01\n A lot of things that the other transcriber had put in parentheses.\n\n0:11:59\tSPEAKER_01\n I was like, I can see how you couldn't understand that.\n\n0:12:03\tSPEAKER_01\n But I think I know what she's doing.\n\n0:12:05\tSPEAKER_01\n Yeah.\n\n0:12:06\tSPEAKER_04\n I think I know the mistake she's making.\n\n0:12:07\tSPEAKER_04\n That's really good.\n\n0:12:08\tSPEAKER_04\n Yeah.\n\n0:12:09\tSPEAKER_04\n Because that's definitely something that I wouldn't be able to do.\n\n0:12:10\tSPEAKER_07\n I couldn't do it in Spanish.\n\n0:12:12\tSPEAKER_07\n I found myself doing that somewhat in German.\n\n0:12:14\tSPEAKER_07\n German.\n\n0:12:15\tSPEAKER_04\n There were problems even with English speakers though.\n\n0:12:18\tSPEAKER_04\n I mean, not in their level of fluency, obviously.\n\n0:12:20\tSPEAKER_04\n But in some people tend to mumble.\n\n0:12:22\tSPEAKER_04\n Mm-hmm.\n\n0:12:23\tSPEAKER_04\n That's right.\n\n0:12:24\tSPEAKER_04\n And it's hard to catch what it is, because it goes by really quickly and you can't really tell.\n\n0:12:31\tSPEAKER_04\n What they're laughing when they're talking.\n\n0:12:33\tSPEAKER_04\n That too.\n\n0:12:34\tSPEAKER_04\n That too.\n\n0:12:35\tSPEAKER_04\n Yeah.\n\n0:12:36\tSPEAKER_04\n Or just, I don't know.\n\n0:12:38\tSPEAKER_04\n And some people tend to get interrupted more.\n\n0:12:40\tSPEAKER_04\n I know that's not something that the person themselves can control.\n\n0:12:43\tSPEAKER_03\n Yeah.\n\n0:12:44\tSPEAKER_03\n And people talk over one another constantly.\n\n0:12:47\tSPEAKER_03\n Like there's this whole barrage of voices coming from everywhere.\n\n0:12:50\tSPEAKER_03\n It's like, oh my god, what's going on.\n\n0:12:52\tSPEAKER_04\n Especially when you were using the mics that weren't the head mounted mics.\n\n0:12:56\tSPEAKER_04\n Oh.\n\n0:12:57\tSPEAKER_04\n And there was input from other people on the same channel as the person that was talking.\n\n0:13:01\tSPEAKER_04\n Yeah.\n\n0:13:02\tSPEAKER_07\n We had the pulse for a brief.\n\n0:13:04\tSPEAKER_07\n And then sometimes people would wear these around their necks, which would mean really basically the problem that you're saying is getting input from others and also it varying when they change their head position.\n\n0:13:16\tSPEAKER_07\n Yeah.\n\n0:13:17\tSPEAKER_05\n Right.\n\n0:13:18\tSPEAKER_05\n A big and I think the transcriptions improved immensely exponentially after it was able to sort of isolate a single person onto a single channel.\n\n0:13:26\tSPEAKER_05\n Oh, excellent.\n\n0:13:27\tSPEAKER_05\n Absolutely.\n\n0:13:28\tSPEAKER_05\n Oh, there's no question.\n\n0:13:29\tSPEAKER_07\n Yes.\n\n0:13:30\tSPEAKER_07\n So that was your time that early on, the change into channel trends.\n\n0:13:33\tSPEAKER_01\n Yeah.\n\n0:13:34\tSPEAKER_01\n You guys didn't have one channel purpose before.\n\n0:13:36\tSPEAKER_04\n No.\n\n0:13:37\tSPEAKER_04\n You had to rib in for everybody and you could switch signals, like you could listen to a different one, but you couldn't really...\n\n0:13:43\tSPEAKER_04\n Well, could you...\n\n0:13:44\tSPEAKER_04\n You couldn't do that very much.\n\n0:13:45\tSPEAKER_04\n You couldn't visually do it.\n\n0:13:47\tSPEAKER_05\n No.\n\n0:13:48\tSPEAKER_05\n And you had to mark interruptions by a slash.\n\n0:13:50\tSPEAKER_05\n That's right.\n\n0:13:51\tSPEAKER_04\n And it was very hard to be precise about it.\n\n0:13:53\tSPEAKER_04\n And it was very hard to tell.\n\n0:13:54\tSPEAKER_04\n I had so much trouble at the very beginning trying to figure out who was who.\n\n0:13:57\tSPEAKER_04\n Yeah.\n\n0:13:58\tSPEAKER_04\n Because there's so many men and so few women, the women were easy to figure out who was who.\n\n0:14:03\tSPEAKER_04\n And then the men, all their voices sounded the same except I think there was one British English speaker and that was easy but...\n\n0:14:09\tSPEAKER_04\n Well, that's difficult.\n\n0:14:10\tSPEAKER_05\n You know what?\n\n0:14:11\tSPEAKER_05\n There might be a gender thing there though too because I think as women it might be easier to differentiate...\n\n0:14:15\tSPEAKER_05\n Well there were fewer women too.\n\n0:14:16\tSPEAKER_05\n But I would have a man transcribing all the guys would have had an easier time.\n\n0:14:19\tSPEAKER_05\n Like if you had transcribed it, you would have had an easier time differentiating them.\n\n0:14:23\tSPEAKER_05\n I don't know why.\n\n0:14:24\tSPEAKER_05\n That would be true.\n\n0:14:25\tSPEAKER_00\n That's just...\n\n0:14:26\tSPEAKER_05\n It's wonderful.\n\n0:14:27\tSPEAKER_05\n You want to have a gender difference there?\n\n0:14:28\tSPEAKER_05\n I don't know.\n\n0:14:29\tSPEAKER_05\n I'm thinking about it as a psychologist I suppose.\n\n0:14:30\tSPEAKER_02\n It's possible.\n\n0:14:31\tSPEAKER_02\n Well, it's...\n\n0:14:32\tSPEAKER_03\n Oh yeah.\n\n0:14:33\tSPEAKER_03\n Yeah, that's possible.\n\n0:14:34\tSPEAKER_03\n I was just going to say something.\n\n0:14:36\tSPEAKER_03\n I was going to say that.\n\n0:14:37\tSPEAKER_03\n I mean, it's easier for people to mimic like the timbre of somebody's voice if it's the same...\n\n0:14:42\tSPEAKER_03\n If that person's voice is the same...\n\n0:14:44\tSPEAKER_03\n If that person is the same sex as you.\n\n0:14:47\tSPEAKER_03\n So maybe like implicitly people pay attention more closely to speakers of the same sex.\n\n0:14:54\tSPEAKER_03\n Hmm.\n\n0:14:55\tSPEAKER_03\n I don't know.\n\n0:14:56\tSPEAKER_03\n I don't know if that's actually true but I'm just...\n\n0:14:59\tSPEAKER_03\n During that out there.\n\n0:15:00\tSPEAKER_03\n It's interesting.\n\n0:15:01\tSPEAKER_03\n I don't know.\n\n0:15:02\tSPEAKER_03\n I have an interesting research project.\n\n0:15:05\tSPEAKER_07\n Yeah, it seems like it's related to this production idea of how you internalize what you're externalizing in a way.\n\n0:15:13\tSPEAKER_04\n Yeah, but it definitely got much better when you match each other.\n\n0:15:17\tSPEAKER_05\n Oh yeah.\n\n0:15:18\tSPEAKER_05\n So it'd be much easier.\n\n0:15:21\tSPEAKER_07\n And you've also gone through...\n\n0:15:22\tSPEAKER_07\n They've been here since the beginning.\n\n0:15:23\tSPEAKER_07\n You've also gone through the introduction of the pre-segmentation and the kind of thing.\n\n0:15:29\tSPEAKER_07\n So initially they had to actually mark all the timbens themselves as well.\n\n0:15:33\tSPEAKER_05\n That's...\n\n0:15:34\tSPEAKER_05\n It's just a time.\n\n0:15:35\tSPEAKER_04\n It's just a time.\n\n0:15:36\tSPEAKER_05\n Yeah.\n\n0:15:37\tSPEAKER_05\n I find that I have to adjust the timbens a lot anyway.\n\n0:15:40\tSPEAKER_05\n Yeah, I'm always adjusting timbens.\n\n0:15:43\tSPEAKER_05\n Not for the end of the utterance but for the beginning.\n\n0:15:45\tSPEAKER_05\n Yeah, really?\n\n0:15:46\tSPEAKER_05\n The beginning...\n\n0:15:47\tSPEAKER_05\n The person started to say something.\n\n0:15:49\tSPEAKER_05\n It's a very slight difference and then the timbens starts.\n\n0:15:52\tSPEAKER_05\n Yeah, that happens a lot.\n\n0:15:53\tSPEAKER_05\n So you have to just move it back a little bit.\n\n0:15:54\tSPEAKER_05\n And I think you mentioned at some point that you wanted a little pad of time anyway.\n\n0:15:59\tSPEAKER_07\n It doesn't hurt to have a pad.\n\n0:16:00\tSPEAKER_07\n It's nicer to have a pad than not.\n\n0:16:02\tSPEAKER_07\n And that's...\n\n0:16:03\tSPEAKER_07\n I feel like...\n\n0:16:05\tSPEAKER_01\n I always wonder about the timbens.\n\n0:16:06\tSPEAKER_01\n I mean, I usually end up adjusting them a little bit.\n\n0:16:08\tSPEAKER_01\n I mean, definitely when something's cut off at the beginning or the end.\n\n0:16:11\tSPEAKER_01\n But also sometimes there's just like huge pads of air before or after that I don't really feel is necessary for that segment.\n\n0:16:22\tSPEAKER_01\n And I usually shrink a little bit.\n\n0:16:25\tSPEAKER_06\n Yeah, I always have to cut off my pads at the end.\n\n0:16:28\tSPEAKER_06\n I don't have so much problem at the beginning, but...\n\n0:16:30\tSPEAKER_04\n A breath or a breath or nothing.\n\n0:16:33\tSPEAKER_03\n There's nothing going on.\n\n0:16:34\tSPEAKER_03\n At the beginning it seems to happen when voicing occurs later.\n\n0:16:38\tSPEAKER_03\n Yeah, you know, with fricatives a lot.\n\n0:16:39\tSPEAKER_03\n Yeah, with fricatives and with like...\n\n0:16:42\tSPEAKER_03\n I mean, like it doesn't happen with...\n\n0:16:44\tSPEAKER_03\n Like, so much because you've got the prevoicing before the consonant actually.\n\n0:16:48\tSPEAKER_04\n Although I found one and actually I was just working right before this meeting.\n\n0:16:53\tSPEAKER_04\n One word someone said great.\n\n0:16:55\tSPEAKER_04\n And the...\n\n0:16:57\tSPEAKER_04\n The G, it was pronounced as a K.\n\n0:16:59\tSPEAKER_04\n So it was unvoiced and the part of the R was cut off in the beginning.\n\n0:17:02\tSPEAKER_04\n And then you...\n\n0:17:03\tSPEAKER_04\n It sounded like great if you just listened to that time and it still sounded like great.\n\n0:17:08\tSPEAKER_04\n But if you listened to it right before you could hear a little bit of the K or whatever and a little bit of the R.\n\n0:17:14\tSPEAKER_04\n So I don't know.\n\n0:17:15\tSPEAKER_04\n Usually it's not...\n\n0:17:16\tSPEAKER_04\n Usually that doesn't happen, but this time it did.\n\n0:17:19\tSPEAKER_05\n So for the non-linguists what's fricative?\n\n0:17:21\tSPEAKER_05\n Oh.\n\n0:17:22\tSPEAKER_03\n It's like...\n\n0:17:24\tSPEAKER_03\n Or...\n\n0:17:25\tSPEAKER_03\n Oh, okay.\n\n0:17:26\tSPEAKER_03\n It's a sound.\n\n0:17:29\tSPEAKER_03\n It's like the noisy...\n\n0:17:32\tSPEAKER_03\n Like airflow ones where you've got like a stoppage in your mouth.\n\n0:17:36\tSPEAKER_03\n Like, oh, you're like...\n\n0:17:37\tSPEAKER_04\n But it's not completely blocking the airflow.\n\n0:17:39\tSPEAKER_01\n You can sort of keep it going a little bit.\n\n0:17:41\tSPEAKER_06\n Oh, like a...\n\n0:17:42\tSPEAKER_06\n Or a cut that just stops.\n\n0:17:44\tSPEAKER_05\n Yeah.\n\n0:17:45\tSPEAKER_05\n Right.\n\n0:17:46\tSPEAKER_05\n Got it.\n\n0:17:47\tSPEAKER_05\n Sorry.\n\n0:17:48\tSPEAKER_05\n I guess I'd be only non-linguist.\n\n0:17:49\tSPEAKER_07\n I'm sort of a hybrid.\n\n0:17:50\tSPEAKER_07\n So I...\n\n0:17:51\tSPEAKER_07\n I appreciate having them do this.\n\n0:17:53\tSPEAKER_07\n Oh, right.\n\n0:17:54\tSPEAKER_07\n Yeah.\n\n0:17:55\tSPEAKER_07\n Have you run into places I run into a couple where actually the word was totally different when you adjusted the time.\n\n0:18:00\tSPEAKER_07\n And if you have that happen, yeah.\n\n0:18:01\tSPEAKER_03\n Yeah.\n\n0:18:02\tSPEAKER_03\n It's fascinating.\n\n0:18:03\tSPEAKER_03\n I like that.\n\n0:18:04\tSPEAKER_03\n Oh, it's really fun.\n\n0:18:05\tSPEAKER_03\n And it's so much dangerous the entire utterance.\n\n0:18:07\tSPEAKER_04\n Oh, it does.\n\n0:18:08\tSPEAKER_04\n Completely.\n\n0:18:09\tSPEAKER_04\n Yeah, I don't remember the words exactly.\n\n0:18:10\tSPEAKER_04\n It's a shame.\n\n0:18:11\tSPEAKER_04\n There was one that was a whole sentence was broken up in the middle and there was a little like millisecond of break in the middle.\n\n0:18:19\tSPEAKER_04\n And if you connected it all together, it completely changed what was right before it and what was right after it.\n\n0:18:23\tSPEAKER_04\n It was written as something else and then it became a word together from what was before and after and then with this little tiny millisecond pause.\n\n0:18:31\tSPEAKER_04\n So I guess...\n\n0:18:32\tSPEAKER_04\n I don't know.\n\n0:18:33\tSPEAKER_04\n I mean, I guess when we talk in between different segments of the word, maybe there's pauses somehow, I guess, or you can...\n\n0:18:40\tSPEAKER_04\n We stop voicing sometimes.\n\n0:18:41\tSPEAKER_04\n Yeah.\n\n0:18:42\tSPEAKER_04\n Or something like that.\n\n0:18:44\tSPEAKER_04\n It's probably like inaudible for us.\n\n0:18:47\tSPEAKER_04\n But...\n\n0:18:48\tSPEAKER_04\n And maybe the pause was just so short that it made up a pause.\n\n0:18:51\tSPEAKER_04\n I don't know if that's the make any sense, but...\n\n0:18:54\tSPEAKER_07\n There are sometimes when there have been words that they just pause right in the middle of here.\n\n0:18:58\tSPEAKER_04\n It's on purpose, though.\n\n0:19:01\tSPEAKER_07\n Or not.\n\n0:19:02\tSPEAKER_07\n Well, I'm sure sometimes on purpose, but sometimes there just be saying something, especially people who have really longation in their style.\n\n0:19:11\tSPEAKER_07\n That's really fast.\n\n0:19:12\tSPEAKER_07\n The nating.\n\n0:19:13\tSPEAKER_07\n It's not a great example, but...\n\n0:19:20\tSPEAKER_07\n Yeah.\n\n0:19:22\tSPEAKER_07\n It's funny how...\n\n0:19:26\tSPEAKER_07\n It's funny to me that something like that.\n\n0:19:28\tSPEAKER_07\n You just change one little boundary and suddenly the whole meaning changes and I run across\n\n0:19:32\tSPEAKER_06\n that also.\n\n0:19:33\tNone\n Yeah. Yeah, that is true.\n\n0:19:36\tSPEAKER_01\n Would you want a transcription of something like that of a big pause in between in the middle of a word or just leave it as fascinating?\n\n0:19:46\tSPEAKER_07\n What I've done, it's very rare.\n\n0:19:47\tSPEAKER_07\n I mean, when I run across it.\n\n0:19:49\tSPEAKER_07\n And maybe there are times that I haven't detected it and I haven't looked at everything.\n\n0:19:54\tSPEAKER_07\n I've probably looked at at least 80% of the data all the way through every meeting, about 80% of the stuff that I cleared so far.\n\n0:20:04\tSPEAKER_07\n And you guys are getting so good that it's like I can get through them faster and then I'm getting to the point where I maybe don't have to go through them all the way.\n\n0:20:12\tSPEAKER_07\n So it's like we've gotten to a level, it's just really great of preprecision that it takes a lot of a load off of me.\n\n0:20:23\tSPEAKER_07\n And so I'm not going to be checking them all.\n\n0:20:25\tSPEAKER_07\n I don't think through the whole rest of the project.\n\n0:20:28\tSPEAKER_07\n But certainly spot checking.\n\n0:20:31\tSPEAKER_07\n But those that I have found that way to me, I think the most sensible way to handle it from my perspective was to treat it as a pronunciation situation.\n\n0:20:39\tSPEAKER_07\n So just to mark then fascinating and then put PR in.\n\n0:20:44\tSPEAKER_07\n That was really pretty.\n\n0:20:45\tSPEAKER_07\n Interrupted by a pause or some kind of other gloss like that.\n\n0:20:48\tSPEAKER_07\n I think PR dot dot fascinating.\n\n0:20:50\tSPEAKER_04\n I mean pronunciation convention.\n\n0:20:52\tSPEAKER_04\n Sorry, what was this?\n\n0:20:54\tSPEAKER_04\n I get confused with pronunciation like when there's a strange pronunciation that I want to mark.\n\n0:20:59\tSPEAKER_04\n Because I think in the beginning did we do the strange pronunciation and then write PR in and what it really was meant to be.\n\n0:21:07\tSPEAKER_04\n And now we're doing the normal word and then inside the brackets what it sounded like.\n\n0:21:12\tSPEAKER_04\n We did a switch, right?\n\n0:21:13\tSPEAKER_04\n Or not.\n\n0:21:14\tSPEAKER_04\n I don't know if it's just me that's confused.\n\n0:21:15\tSPEAKER_05\n I never occurred to me, but now that you're mentioning it, yeah, possibly.\n\n0:21:19\tSPEAKER_05\n There was an adjustment.\n\n0:21:20\tSPEAKER_07\n And I switched them all all the way at this point.\n\n0:21:23\tSPEAKER_04\n So the convention as it stands now is write the word as it is normally conventionally spelled in English with a little post-trophy or whatever.\n\n0:21:32\tSPEAKER_04\n That's right.\n\n0:21:33\tSPEAKER_07\n And then the bracket's what it is.\n\n0:21:35\tSPEAKER_07\n So OK is a very easy example.\n\n0:21:37\tSPEAKER_07\n In person says OK.\n\n0:21:38\tSPEAKER_07\n It's OK with a hatch and then PRN and then OK or whatever it is.\n\n0:21:45\tSPEAKER_05\n OK.\n\n0:21:46\tSPEAKER_05\n I think Nelson's the only one who...\n\n0:21:48\tSPEAKER_05\n Oh, Morgan.\n\n0:21:49\tSPEAKER_05\n You guys call him Morgan.\n\n0:21:51\tSPEAKER_05\n He's the only one who ever did that, I think.\n\n0:21:53\tSPEAKER_05\n OK.\n\n0:21:54\tSPEAKER_05\n He does it a lot.\n\n0:21:55\tSPEAKER_01\n Yeah.\n\n0:21:56\tSPEAKER_03\n And some people just say OK.\n\n0:21:57\tSPEAKER_03\n Yeah.\n\n0:21:58\tSPEAKER_07\n That's true.\n\n0:21:59\tSPEAKER_07\n Yeah.\n\n0:22:00\tSPEAKER_07\n And of course, there's also this other reduction that we've done in terms of not capture in every time person says and versus and versus, you know, whatever all the different ways of reducing and because you can assume that the speech recognition pronunciation models will handle certain amount of reductions of these types and the same thing for the versus the, that there are those known variants and what A versus exactly.\n\n0:22:29\tSPEAKER_07\n And that they should be able to handle themselves.\n\n0:22:31\tSPEAKER_07\n And that we assume also that for discourse purposes those distinctions are not really the focus right now and those distinctions could be added later if needed but it's unlikely that they would be in a so time consuming.\n\n0:22:42\tSPEAKER_07\n So we've made these simplifying assumptions with that and so then you begin to think, well, what about OK?\n\n0:22:46\tSPEAKER_07\n I mean, maybe OK is an appropriate variant for OK and it wouldn't be necessary to mark those either.\n\n0:22:52\tSPEAKER_07\n So it's...\n\n0:22:53\tSPEAKER_07\n Definitely there's a choice of how far you go with that and whether OK is enough of a variant, you know, this is a case where I appreciate it when people mark those kinds of things but I sort of figure that that's not as far away from OK is OK so it's not quite so but I don't change it back if it's there.\n\n0:23:13\tSPEAKER_03\n I think with like some of them like, you know, with the difference between Z and the, you can you can distinguish very definitively like what context they're going to be used in.\n\n0:23:28\tSPEAKER_03\n Like you would say the apple because it's the plus then the next word starts with the vowel or the cat because it's next.\n\n0:23:34\tSPEAKER_04\n There's a study done on when people say, and when people say, um, yeah, I'm sure there's content and contextual variation and it's predictable apparently I haven't read the...\n\n0:23:43\tSPEAKER_01\n I was trying to figure that out myself a couple times.\n\n0:23:46\tSPEAKER_01\n It's really interesting and I couldn't get anything.\n\n0:23:48\tSPEAKER_01\n Yeah.\n\n0:23:49\tSPEAKER_01\n I should have looking at all the as of the as and as like, oh this would be hard to do.\n\n0:23:54\tSPEAKER_04\n Yeah.\n\n0:23:55\tSPEAKER_04\n And on that sort of similar topic, I just thought of something that's been hard for me sometimes is you can have a pronunciation of the word A as a and then you can have a like pause or whatever as a and sometimes it's hard to tell what the person meant.\n\n0:24:11\tSPEAKER_04\n Aren't they mean like they're pausing or did they mean like, yeah, yeah, yeah, yeah, yeah, yeah, yeah.\n\n0:24:17\tSPEAKER_04\n That's right.\n\n0:24:18\tSPEAKER_04\n You can kind of tell from the context but sometimes it's hard.\n\n0:24:21\tSPEAKER_04\n Yeah, I came up a couple of times.\n\n0:24:22\tSPEAKER_07\n I agree and when I'm totally in doubt if there's a case where it really could be either and I could flip a coin, I'll choose the one that would make syntactically the most sense, given that it's out, they're being fluent about it.\n\n0:24:35\tSPEAKER_03\n Sometimes I'll put in like a bracket like, you know, orthographic A slash UH, like if I'm really like a campus, yeah, kind of go well, there's two.\n\n0:24:45\tSPEAKER_03\n So here.\n\n0:24:46\tSPEAKER_07\n I must be really rare though, I haven't run across that often.\n\n0:24:48\tSPEAKER_04\n It's really, yeah, relatively rare.\n\n0:24:52\tSPEAKER_04\n Yeah, I mean, I can only think of like two or three occasions where I sat and thought about it for a while.\n\n0:25:01\tSPEAKER_04\n Other times just you figure, you look at it, what's the context.\n\n0:25:05\tSPEAKER_04\n Yeah.\n\n0:25:06\tSPEAKER_04\n It's okay.\n\n0:25:07\tSPEAKER_07\n Right.\n\n0:25:08\tSPEAKER_07\n Okay.\n\n0:25:09\tSPEAKER_07\n Well, let's see now.\n\n0:25:10\tSPEAKER_07\n There's another method like what I want to ask you at some point, just to encourage to me.\n\n0:25:15\tSPEAKER_07\n I'd like to ask you the following question maybe you can have this in the back of your mind.\n\n0:25:18\tSPEAKER_07\n Like, you know, what sorts of hypothesis, your hypothesis about the, you know, time to find the distributional explanations for some of these things.\n\n0:25:26\tSPEAKER_07\n What kind of a hypothesis has this caused you, I mean, don't want to have you give away a paper topic that you want to explore.\n\n0:25:34\tSPEAKER_07\n But it's interesting hypotheses that have been suggested to you by looking at the data, that kind of thing maybe at some point.\n\n0:25:42\tSPEAKER_07\n So, and I also want to say that I'd like to meet again also next week.\n\n0:25:48\tSPEAKER_07\n And I don't know if this is a good time frame.\n\n0:25:50\tSPEAKER_07\n Maybe it would be good to have it an hour later or, I don't know, I mean, could do anything.\n\n0:25:54\tSPEAKER_07\n This time is fine for me.\n\n0:25:56\tSPEAKER_01\n Yeah, this is a good time for me.\n\n0:25:58\tSPEAKER_05\n It should be.\n\n0:25:59\tSPEAKER_05\n Okay.\n\n0:26:00\tSPEAKER_05\n I know I have something in the morning, which I don't normally have.\n\n0:26:03\tSPEAKER_05\n I don't remember off the top of my head when it ends.\n\n0:26:07\tSPEAKER_05\n I'll let you know if it'll be a problem, but it should be okay.\n\n0:26:10\tSPEAKER_05\n Okay.\n\n0:26:11\tSPEAKER_07\n 2.30 should be late enough.\n\n0:26:12\tSPEAKER_07\n Okay.\n\n0:26:13\tSPEAKER_07\n Excellent.\n\n0:26:14\tSPEAKER_07\n Because we could probably move it one hour later.\n\n0:26:15\tSPEAKER_07\n I mean, I think it was.\n\n0:26:16\tSPEAKER_03\n I'm just saying maybe 15 minutes later would help me a little bit just because I have a class up at one hour or 15 minutes before the point.\n\n0:26:21\tSPEAKER_03\n Oh, I see.\n\n0:26:22\tSPEAKER_07\n What was the wait today?\n\n0:26:23\tSPEAKER_07\n You did really well.\n\n0:26:24\tSPEAKER_03\n Yeah.\n\n0:26:25\tSPEAKER_03\n Well, I took the bus for part of the way.\n\n0:26:26\tSPEAKER_03\n You did.\n\n0:26:27\tSPEAKER_03\n Okay.\n\n0:26:28\tSPEAKER_03\n But that might help me just a little bit because then I know I'm going to be hobbling a little\n\n0:26:31\tSPEAKER_07\n slowly. Would anybody be constrained by having it be a full half hour later?\n\n0:26:36\tSPEAKER_07\n No.\n\n0:26:37\tSPEAKER_07\n No.\n\n0:26:38\tSPEAKER_07\n Okay.\n\n0:26:39\tSPEAKER_05\n And final question.\n\n0:26:40\tSPEAKER_05\n So we'll mistreat time.\n\n0:26:41\tSPEAKER_01\n Oh.\n\n0:26:42\tSPEAKER_01\n Oh.\n\n0:26:43\tSPEAKER_07\n Oh, that's right.\n\n0:26:44\tSPEAKER_07\n I might.\n\n0:26:46\tSPEAKER_07\n I might.\n\n0:26:47\tSPEAKER_04\n She said mistreat.\n\n0:26:48\tSPEAKER_04\n Oh.\n\n0:26:49\tNone\n I have half hour, let's go break.\n\n0:26:51\tSPEAKER_01\n That's some good motivation to not start a half hour.\n\n0:26:55\tSPEAKER_04\n We could just ask the someone like the friend us person or Lila to like set aside a little bit.\n\n0:27:03\tSPEAKER_07\n For us to.\n\n0:27:04\tSPEAKER_07\n Oh, that's true.\n\n0:27:05\tSPEAKER_07\n Yeah, they would.\n\n0:27:06\tSPEAKER_07\n That's not a bad solution.\n\n0:27:07\tSPEAKER_05\n It's not going to be birthday cake.\n\n0:27:08\tSPEAKER_05\n So.\n\n0:27:09\tSPEAKER_05\n Yeah.\n\n0:27:10\tSPEAKER_05\n So we'll survive.\n\n0:27:11\tSPEAKER_04\n That's right.\n\n0:27:12\tSPEAKER_04\n This is very important.\n\n0:27:13\tSPEAKER_07\n Yeah.\n\n0:27:14\tSPEAKER_07\n Yeah.\n\n0:27:15\tSPEAKER_07\n These things also.\n\n0:27:16\tSPEAKER_07\n Okay.\n\n0:27:17\tSPEAKER_07\n So, um, oh, uh, then I was going to ask you, what about an hour later?\n\n0:27:20\tSPEAKER_07\n I mean, if we had those things an hour later, like people, okay, that's fine too.\n\n0:27:24\tSPEAKER_07\n Okay.\n\n0:27:25\tSPEAKER_07\n Good.\n\n0:27:26\tSPEAKER_07\n So I'll sell.\n\n0:27:27\tSPEAKER_07\n Okay.\n\n0:27:28\tSPEAKER_07\n Now, I wanted to say, you've been through a couple of different, uh, improvements in the methods, uh, presuppmentation.\n\n0:27:33\tSPEAKER_07\n There was another improvement, uh, another improvement in that, well, let's ask if it was an improvement from your standpoint, the Tiger Fish, um, approach.\n\n0:27:41\tSPEAKER_07\n So, uh, moving from having the first transcription done by an external service and then you correcting that versus doing the initial transcription yourselves.\n\n0:27:51\tSPEAKER_07\n How, how, how, how do you, and so I think you, I think you, did you, I already have,\n\n0:27:58\tSPEAKER_01\n I have ever done one from an external. I, uh, I feel like they've all been done probably by another transcriber.\n\n0:28:05\tSPEAKER_03\n You talk about the IBM ones.\n\n0:28:07\tSPEAKER_07\n IBM or if it was dashed TF.\n\n0:28:09\tSPEAKER_07\n That's the Tiger Fish.\n\n0:28:10\tSPEAKER_03\n Right.\n\n0:28:11\tSPEAKER_01\n Okay.\n\n0:28:12\tSPEAKER_01\n Again, then I guess I have maybe the one I'm working on now.\n\n0:28:15\tSPEAKER_01\n I just tell you something.\n\n0:28:16\tSPEAKER_01\n They have different, definitely different style, right?\n\n0:28:18\tSPEAKER_01\n Do they end all the mall and dots, like dots, like, there's a lot of that.\n\n0:28:21\tSPEAKER_01\n And they capitalize like every single first.\n\n0:28:24\tSPEAKER_04\n And they put, um, not parentheses, what's it called?\n\n0:28:27\tSPEAKER_04\n Punctuation after brackets.\n\n0:28:29\tSPEAKER_04\n Yeah.\n\n0:28:30\tSPEAKER_01\n That's right.\n\n0:28:31\tSPEAKER_01\n Okay.\n\n0:28:32\tSPEAKER_05\n Yeah, and then I'm doing that right now.\n\n0:28:33\tSPEAKER_05\n Oh, right, laugh period.\n\n0:28:34\tSPEAKER_01\n Yeah.\n\n0:28:35\tSPEAKER_01\n Which makes those sense to be.\n\n0:28:36\tSPEAKER_01\n No, it doesn't look like that.\n\n0:28:37\tSPEAKER_01\n Yeah.\n\n0:28:38\tSPEAKER_01\n Yeah.\n\n0:28:39\tSPEAKER_05\n Yeah.\n\n0:28:40\tSPEAKER_03\n Exactly.\n\n0:28:41\tSPEAKER_03\n Well, they're not linguists.\n\n0:28:42\tSPEAKER_03\n So, if I could be completely frank, I really didn't like the IBM ones.\n\n0:28:46\tSPEAKER_07\n Oh, good to know.\n\n0:28:47\tSPEAKER_07\n Yeah.\n\n0:28:48\tSPEAKER_03\n I found them to be just, I just, I ended up basically redoing them.\n\n0:28:52\tSPEAKER_03\n Okay.\n\n0:28:53\tSPEAKER_03\n Like from start to finish.\n\n0:28:55\tSPEAKER_03\n So when I was checking them, like, it would take me basically as long as it would have taken me just to transcribe it by myself.\n\n0:29:01\tSPEAKER_07\n Wow.\n\n0:29:02\tSPEAKER_04\n Wow.\n\n0:29:03\tSPEAKER_04\n I think it was a little bit faster than just transcribing it, but I definitely saw a lot of, there was a lot of errors that are not in the Tiger Fish once.\n\n0:29:10\tSPEAKER_04\n Yeah, Tiger Fish are better.\n\n0:29:12\tSPEAKER_04\n Yeah.\n\n0:29:13\tSPEAKER_04\n And they just have better intuitions, or I don't know what, but what are the two differences?\n\n0:29:17\tSPEAKER_01\n I'm not sure.\n\n0:29:18\tSPEAKER_07\n I'm not sure if you had an IBM one, so this was earlier.\n\n0:29:21\tSPEAKER_01\n So do I have a Tiger Fish one right now?\n\n0:29:22\tSPEAKER_01\n If it says, probably do.\n\n0:29:23\tSPEAKER_01\n Yeah.\n\n0:29:24\tSPEAKER_00\n Uh-huh.\n\n0:29:25\tSPEAKER_03\n Okay.\n\n0:29:26\tSPEAKER_03\n Yeah.\n\n0:29:27\tSPEAKER_01\n So I don't think IBM are like, the IBM ones were the ones that came in huge, huge paragraphs, huh?\n\n0:29:31\tSPEAKER_01\n Yes.\n\n0:29:32\tSPEAKER_03\n Yeah.\n\n0:29:33\tSPEAKER_03\n Yeah.\n\n0:29:34\tSPEAKER_07\n Yeah.\n\n0:29:35\tSPEAKER_05\n So you didn't get one wrong, just saying.\n\n0:29:36\tSPEAKER_05\n Okay.\n\n0:29:37\tSPEAKER_04\n You know, they don't show up in Tiger Fish, too, because I think I've had a good time in Tiger Fish.\n\n0:29:41\tSPEAKER_04\n Yeah, but they're not like, they break them up.\n\n0:29:42\tSPEAKER_01\n Yeah, I can remember.\n\n0:29:43\tSPEAKER_01\n I used to see.\n\n0:29:44\tSPEAKER_05\n Oh, really?\n\n0:29:45\tSPEAKER_05\n Yeah.\n\n0:29:46\tSPEAKER_05\n I think they sort of break them down.\n\n0:29:47\tSPEAKER_01\n Do they get them, um, it's, they don't have like an interface, right?\n\n0:29:51\tSPEAKER_07\n They just, no.\n\n0:29:52\tSPEAKER_07\n In either case, and I'm thinking, I'm thinking, you're causing me to think back over what the differences were and then what they got in IBM.\n\n0:29:57\tSPEAKER_01\n They just have, they just have it segmented.\n\n0:29:59\tSPEAKER_01\n You can tell because sometimes they have it so wrong and it's like, well, if you had just listened to what was before.\n\n0:30:05\tSPEAKER_01\n Yeah.\n\n0:30:06\tSPEAKER_01\n Yeah.\n\n0:30:07\tSPEAKER_01\n They don't have that.\n\n0:30:08\tSPEAKER_01\n Yeah.\n\n0:30:09\tSPEAKER_07\n Right.\n\n0:30:10\tSPEAKER_07\n There's also some, if he knows about how, we're not sure really how Tiger Fish does it, you know, the methodology.\n\n0:30:17\tSPEAKER_07\n How do they do this?\n\n0:30:18\tSPEAKER_07\n Because sometimes you'll have a, a same word.\n\n0:30:19\tSPEAKER_07\n And I've seen this like within, well, within the single turn, they will be spelled in three different ways.\n\n0:30:25\tSPEAKER_07\n And it's like, no, is this the same person who's kind of forgetful or is it that they have some people doing it together?\n\n0:30:30\tSPEAKER_07\n You know, maybe it's parallel.\n\n0:30:31\tSPEAKER_07\n Maybe they're all doing it in parallel and one falls behind the other one.\n\n0:30:34\tSPEAKER_04\n And they don't, one person doesn't listen to all the channels of one meeting, right?\n\n0:30:37\tSPEAKER_04\n They can't get clues from the other channels.\n\n0:30:40\tSPEAKER_07\n Well, you know, the way they're listening to it is they get, they get, it's linearized.\n\n0:30:46\tSPEAKER_07\n So if you picture what we have on the screen, you know, there's this block and it goes over, I'm doing it from my perspective.\n\n0:30:53\tSPEAKER_07\n It goes over here and stops and this person starts to talk and it goes over here.\n\n0:30:57\tSPEAKER_07\n And then you have an overlap over here.\n\n0:30:59\tSPEAKER_07\n And so what they would get is this block from the first guy, this block from the second guy.\n\n0:31:04\tSPEAKER_07\n And then the top of the overlap and then the second guy in the overlap.\n\n0:31:06\tSPEAKER_07\n And then it would move on.\n\n0:31:08\tSPEAKER_07\n So it's sort of like this, you know, you go this way as much as you can and you cycle through there and then you go up to this block.\n\n0:31:12\tSPEAKER_07\n So they hear all the channels at once like you guys were saying at the first door?\n\n0:31:15\tSPEAKER_07\n Okay.\n\n0:31:16\tSPEAKER_07\n Let's see, they hear them, oh, they hear them separately in two chunks, but then sometimes they get confused about who the foreground speaker is because they're not being told who the foreground speaker is.\n\n0:31:28\tSPEAKER_07\n You know, and especially you can see if you have like four speakers, be reasonable, you could maybe find a way of doing that with nine speakers.\n\n0:31:34\tSPEAKER_07\n So what they get is they get a beep that tells them when there's something that they think that the pre-segmenter thought there should be transcribed in there.\n\n0:31:43\tSPEAKER_07\n And so they'll get, and it's numbered so that we end up with the same number of transcribed slots.\n\n0:31:49\tSPEAKER_07\n Exactly.\n\n0:31:50\tSPEAKER_07\n Because the first time when we didn't have them numbered, we ended up with a couple extra segments that were transcribed.\n\n0:31:55\tSPEAKER_07\n It's hard to patch the whole thing back together because when it comes back to our end, it's just as long string of things that they've partitioned according to the tape that they were given.\n\n0:32:06\tSPEAKER_07\n Because they don't have digital interface either, so it's audio tape.\n\n0:32:10\tSPEAKER_07\n Oh, wow.\n\n0:32:11\tSPEAKER_07\n And they type it on.\n\n0:32:12\tSPEAKER_07\n And then it comes back to us and Adam and Tilo have a program, they put it back together into our interface format and then we use it.\n\n0:32:20\tSPEAKER_07\n But there are cases where you'll get a segment and it's someone else's utterance, and that's because that was overlapping with someone else, and this is the weaker speaker of the two.\n\n0:32:31\tSPEAKER_07\n You'll have two totally parallel renditions of the same thing.\n\n0:32:35\tSPEAKER_07\n Because it's just, so what they get is, is they get some like beep one, and then they get beep two, beep three, check what does the numbers.\n\n0:32:45\tSPEAKER_07\n And cycle through.\n\n0:32:46\tSPEAKER_05\n Oh, so they don't, do they know the names of the speakers?\n\n0:32:49\tSPEAKER_05\n No.\n\n0:32:50\tSPEAKER_05\n Okay.\n\n0:32:51\tSPEAKER_05\n And they don't know which channel is supposed to be interesting things where there would be a misunderstanding about like Morgan would be speaking, but it'd be on your channel.\n\n0:33:02\tSPEAKER_05\n Yes, exactly.\n\n0:33:03\tSPEAKER_05\n This is clearly not a woman's speaker.\n\n0:33:05\tSPEAKER_00\n That's quite right.\n\n0:33:06\tSPEAKER_00\n And that's why they do that.\n\n0:33:08\tSPEAKER_05\n It seems more reasonable that they'd make a mistake like that if they had no idea.\n\n0:33:13\tSPEAKER_04\n It must take them a really long time to do these.\n\n0:33:16\tSPEAKER_07\n They're very fast.\n\n0:33:17\tSPEAKER_04\n It's amazing.\n\n0:33:18\tSPEAKER_07\n Yeah.\n\n0:33:19\tSPEAKER_07\n It's so hard.\n\n0:33:20\tSPEAKER_07\n It turns out that they're really much faster than the other approaches we've used.\n\n0:33:24\tSPEAKER_07\n We don't know exactly how they do it.\n\n0:33:25\tSPEAKER_07\n And I think that that's by intention, not just me, the things.\n\n0:33:28\tSPEAKER_07\n That's the, prior to early, it's very competitive business and they probably don't want to leak their seats.\n\n0:33:34\tSPEAKER_07\n Say too much about it.\n\n0:33:35\tSPEAKER_07\n Yeah.\n\n0:33:36\tSPEAKER_07\n Yeah.\n\n0:33:37\tSPEAKER_07\n But they're very fast.\n\n0:33:38\tSPEAKER_04\n It's so.\n\n0:33:39\tSPEAKER_04\n Well, I definitely prefer not doing transcript.\n\n0:33:40\tSPEAKER_04\n I mean, I liked transcribing because I felt like I was much closer to the data.\n\n0:33:43\tSPEAKER_04\n Yeah.\n\n0:33:44\tSPEAKER_04\n And I had a lot more ideas like you're saying hypotheses of what's going on.\n\n0:33:49\tSPEAKER_04\n But it took a really long time and I'd get frustrated with it.\n\n0:33:53\tSPEAKER_04\n And I think that I would lose my, I don't know, I would not be as thorough, not be as careful.\n\n0:33:59\tSPEAKER_04\n Excellent.\n\n0:34:00\tSPEAKER_07\n You miss it.\n\n0:34:01\tSPEAKER_01\n Oh, I see.\n\n0:34:02\tSPEAKER_01\n I like transcribing.\n\n0:34:03\tSPEAKER_01\n I, you know, I feel like it was more personal.\n\n0:34:07\tSPEAKER_01\n I was.\n\n0:34:08\tSPEAKER_01\n It was more personal.\n\n0:34:09\tSPEAKER_01\n You know, this is sort of just, you know, correcting other.\n\n0:34:11\tSPEAKER_01\n I feel like I'm just sort of like correcting a test or something now.\n\n0:34:14\tSPEAKER_01\n Okay.\n\n0:34:15\tSPEAKER_01\n You know, that's interesting.\n\n0:34:16\tSPEAKER_01\n Oh, interesting.\n\n0:34:17\tSPEAKER_01\n But I mean, it's still, it's still cool.\n\n0:34:19\tSPEAKER_01\n But yeah, I did like actually doing the transcribing.\n\n0:34:22\tSPEAKER_04\n You don't tend to notice as much.\n\n0:34:24\tSPEAKER_04\n I don't think checking as you do transcribing because it's already there.\n\n0:34:27\tSPEAKER_01\n So you don't have to pay as much attention.\n\n0:34:29\tSPEAKER_01\n Yeah.\n\n0:34:30\tSPEAKER_01\n And when you're, when you're just checking, you're usually just looking for certain things that you know are going to come up.\n\n0:34:34\tSPEAKER_01\n And I usually assume that the words are mostly right.\n\n0:34:38\tSPEAKER_01\n Although I, you know, I go through and I look and make sure all the words are right.\n\n0:34:41\tSPEAKER_01\n But usually it's like punctuation and capitalization and other things that end up changing.\n\n0:34:46\tSPEAKER_01\n And time ends, yeah.\n\n0:34:48\tSPEAKER_03\n I guess I'm such a perfectionist that I sort of combine the two when I'm checking.\n\n0:34:54\tSPEAKER_03\n Like I act as though I'm transcribing it.\n\n0:34:57\tSPEAKER_03\n And so yeah, I really do.\n\n0:34:59\tSPEAKER_03\n Like I tend to take a little longer maybe than other people doing checking.\n\n0:35:04\tSPEAKER_03\n But like I'm like ultra careful.\n\n0:35:07\tSPEAKER_03\n This is how I am.\n\n0:35:08\tSPEAKER_03\n But like I, I think I really like think of it in terms of re transcribing it almost.\n\n0:35:15\tSPEAKER_03\n And I only, you know, so like I change time bends a lot.\n\n0:35:20\tSPEAKER_03\n And then like we'll change what people write like for whatever words they write a lot.\n\n0:35:27\tSPEAKER_03\n Like, so I guess I don't see too much of a difference.\n\n0:35:32\tSPEAKER_03\n But that's just because it's me.\n\n0:35:35\tSPEAKER_03\n Like I think I like checking more for that reason because then it's sort of, it's like, it's a little helpful.\n\n0:35:41\tSPEAKER_03\n Like kind of, you know, somebody's helping me a little bit, but I'm actually doing the work anyway.\n\n0:35:46\tSPEAKER_03\n It's kind of how I see it.\n\n0:35:49\tSPEAKER_04\n One thing that's annoying, I think with checking is that a lot of times in the meetings, you tend to have one or two people who talk a lot and the rest of the people just sit there until it's their turn to give their little report or whatever.\n\n0:36:01\tSPEAKER_04\n And yet you have to check the channels for if they did back channels or if they did other things that you need to encode that weren't on the pre-secondary.\n\n0:36:11\tSPEAKER_04\n But sometimes it's not visually easy.\n\n0:36:16\tSPEAKER_04\n And so I'm, sometimes I debate with myself whether it's really worth it to sit there and listen to the whole thing or risk missing a little bit and doing it visually.\n\n0:36:27\tSPEAKER_04\n It's hard to decide sometimes.\n\n0:36:28\tSPEAKER_07\n And this is when you crank up the visual.\n\n0:36:30\tSPEAKER_07\n Yeah.\n\n0:36:31\tSPEAKER_01\n Yeah.\n\n0:36:32\tSPEAKER_01\n Well, sometimes when you crank up the visual, all it gives you is the background speaker.\n\n0:36:35\tSPEAKER_01\n Yeah.\n\n0:36:36\tSPEAKER_04\n That's the thing.\n\n0:36:37\tSPEAKER_07\n It's true, which is a bit harder to say.\n\n0:36:39\tSPEAKER_07\n Yeah, that's right.\n\n0:36:40\tSPEAKER_07\n Well, it's a judgment call.\n\n0:36:41\tSPEAKER_07\n And you can also say, well, if the back channels were so low on volume that they weren't visually obvious, then you can say, well, it's reasonable not to worry about them.\n\n0:36:53\tSPEAKER_01\n Yeah.\n\n0:36:54\tSPEAKER_01\n But also if they have it all pre-segmented and they can only hear the segments, they often miss what's in between because they didn't even have the option of listening to what's in between.\n\n0:37:02\tSPEAKER_01\n Right.\n\n0:37:03\tSPEAKER_01\n Yeah.\n\n0:37:04\tSPEAKER_01\n So, and you know, the segmenter usually misses little things like, mm-hmm.\n\n0:37:07\tSPEAKER_04\n Yeah.\n\n0:37:08\tSPEAKER_04\n And even bigger things.\n\n0:37:09\tSPEAKER_01\n Sometimes the segmenter will.\n\n0:37:10\tSPEAKER_04\n You said things that weren't caught on the pre-segmenter, like whispers kind of, just like, oh, that's interesting or something like that.\n\n0:37:18\tSPEAKER_03\n Or like little size or like in breaths, like as though you're going to start speaking.\n\n0:37:23\tSPEAKER_03\n Which I feel is important because it means that somebody is about to interject something but then they decide for whatever reason that they're not going to.\n\n0:37:31\tSPEAKER_03\n And oftentimes I find that the segmenter will miss those kind of things, those kind of vocal cues.\n\n0:37:36\tSPEAKER_03\n And sometimes even laughs.\n\n0:37:37\tSPEAKER_04\n Yeah.\n\n0:37:38\tSPEAKER_03\n Breathless especially.\n\n0:37:39\tSPEAKER_03\n Oh yeah.\n\n0:37:40\tSPEAKER_01\n I usually take out, I usually don't put in any of the breaths unless they're laughs.\n\n0:37:45\tSPEAKER_01\n I usually don't transcribe the in breaths or things like that.\n\n0:37:48\tSPEAKER_04\n I don't either.\n\n0:37:49\tSPEAKER_04\n But I mean, I don't take them out authority there.\n\n0:37:50\tSPEAKER_05\n If it sounds like a ton, I've transcribed yons.\n\n0:37:54\tSPEAKER_05\n Mm-hmm.\n\n0:37:55\tSPEAKER_05\n Yeah.\n\n0:37:56\tSPEAKER_05\n You can hear those like, mm-hmm.\n\n0:37:58\tSPEAKER_00\n You know, it's like that.\n\n0:38:00\tSPEAKER_05\n Well, it's communicative.\n\n0:38:01\tSPEAKER_05\n Yeah.\n\n0:38:02\tSPEAKER_05\n Or when it's a laugh, I mean, often in the tiger fish, it would say breath.\n\n0:38:06\tSPEAKER_05\n Yeah.\n\n0:38:07\tSPEAKER_05\n It's a laugh, yeah.\n\n0:38:09\tSPEAKER_05\n Because everyone's laughing.\n\n0:38:10\tSPEAKER_05\n Someone has just said something funny and everyone else is laughing in the right person.\n\n0:38:13\tSPEAKER_04\n It's like, but it's not an actual laugh.\n\n0:38:16\tSPEAKER_04\n Right.\n\n0:38:17\tSPEAKER_04\n It's not a very committed laugh.\n\n0:38:19\tSPEAKER_05\n It's like, yeah.\n\n0:38:21\tSPEAKER_05\n Yeah, I guess I'll laugh because everyone else is laughing.\n\n0:38:24\tSPEAKER_05\n Yeah.\n\n0:38:25\tSPEAKER_07\n Have you noticed that the tiger fish uses cough a lot where they just really cough in the throat?\n\n0:38:33\tSPEAKER_04\n Yeah.\n\n0:38:34\tSPEAKER_07\n Yeah.\n\n0:38:35\tSPEAKER_04\n It just fixed that.\n\n0:38:36\tSPEAKER_07\n Yeah.\n\n0:38:37\tSPEAKER_07\n Yeah, it's fun.\n\n0:38:38\tSPEAKER_07\n This has cost me to wonder.\n\n0:38:39\tSPEAKER_07\n So, in tiger fish ones, do you find that where they have, like, dots, because the segments they didn't hear, that you add...\n\n0:38:48\tSPEAKER_07\n You probably do add things in those places where it's...\n\n0:38:52\tSPEAKER_07\n Where nothing is transcribed, really, because they didn't even hear it.\n\n0:38:56\tSPEAKER_04\n You mean in between the segments that they did transcribe?\n\n0:38:58\tSPEAKER_04\n Yeah.\n\n0:38:59\tSPEAKER_01\n Oh, yeah.\n\n0:39:00\tSPEAKER_01\n That's where you've tried to find...\n\n0:39:01\tSPEAKER_01\n Yeah, you find little lost words in the middle.\n\n0:39:04\tSPEAKER_04\n Yeah.\n\n0:39:05\tSPEAKER_04\n It depends on the person.\n\n0:39:07\tSPEAKER_04\n I mean, some people don't tend to do...\n\n0:39:10\tSPEAKER_04\n Aren't that involved in the meeting or something, and they don't tend to say as much.\n\n0:39:14\tSPEAKER_04\n Backchannels or whatever.\n\n0:39:16\tSPEAKER_04\n And some people...\n\n0:39:17\tSPEAKER_04\n I mean, I remember transcribing one person.\n\n0:39:20\tSPEAKER_04\n All they did was clear their throat and breathe.\n\n0:39:22\tSPEAKER_04\n Yeah.\n\n0:39:23\tSPEAKER_00\n And then my digits and then it was like...\n\n0:39:25\tSPEAKER_04\n Go behind them.\n\n0:39:26\tSPEAKER_02\n I'm gonna be talking about it.\n\n0:39:28\tSPEAKER_04\n But there's some people tend to...\n\n0:39:31\tSPEAKER_04\n It's really cute, actually.\n\n0:39:34\tSPEAKER_04\n Other than there are some people who are, even if they're not actually speaking, you can tell they're more involved or interested or something, because they're always...\n\n0:39:42\tSPEAKER_04\n Yeah, really.\n\n0:39:43\tSPEAKER_07\n Yeah.\n\n0:39:44\tSPEAKER_07\n Yeah.\n\n0:39:45\tSPEAKER_07\n I just occurred to me.\n\n0:39:46\tSPEAKER_07\n This is a different kind of question.\n\n0:39:48\tSPEAKER_07\n But I, from having listened to all these people, I mean, and it is kind of abnormal to be listening to them as if they're talking into your ear really.\n\n0:39:55\tSPEAKER_07\n You know, it's really unusual acoustic circumstances.\n\n0:39:59\tSPEAKER_07\n I sort of end up feeling like I know these people better than I really do.\n\n0:40:03\tSPEAKER_07\n It's like you go out to tea and there they are.\n\n0:40:04\tSPEAKER_07\n And how you were so funny in that meeting.\n\n0:40:07\tSPEAKER_07\n It has this sort of unusual dynamic, because I'm privy to information, which really by all rights I shouldn't be, except, of course, they agreed.\n\n0:40:14\tSPEAKER_07\n They signed.\n\n0:40:15\tSPEAKER_00\n They were there.\n\n0:40:16\tSPEAKER_07\n But it's sort of an unusual relationship to say, you know, if you're in the meeting yourself, then of course you'd have access to all this information and all your inferences about whether they're funny or not funny or whatever.\n\n0:40:29\tSPEAKER_04\n I remember from the very beginning, I would go to tea and start recognizing voices.\n\n0:40:34\tSPEAKER_04\n Oh, that'd be a lot of fun.\n\n0:40:35\tSPEAKER_04\n And please turn around and be like, wait, that person doesn't look anything like I imagine.\n\n0:40:39\tSPEAKER_03\n You know who I kept wanting to meet was Basqara.\n\n0:40:43\tSPEAKER_03\n He's on campus.\n\n0:40:44\tSPEAKER_03\n I found this out.\n\n0:40:45\tSPEAKER_07\n Is he really?\n\n0:40:46\tSPEAKER_07\n He is such a nice voice.\n\n0:40:47\tSPEAKER_03\n I really like his voice.\n\n0:40:48\tSPEAKER_03\n I like him wanting to be.\n\n0:40:49\tSPEAKER_03\n And then John told me that he's not around anymore.\n\n0:40:54\tSPEAKER_03\n Oh, but he is.\n\n0:40:55\tSPEAKER_07\n I actually wanted to hike with him two weeks, three weeks ago.\n\n0:40:58\tSPEAKER_07\n Oh, cool.\n\n0:40:59\tSPEAKER_07\n Just curious.\n\n0:41:00\tSPEAKER_07\n Nice guy.\n\n0:41:01\tSPEAKER_05\n I just want to know what Liz looked like.\n\n0:41:03\tSPEAKER_05\n I've never gotten to see her.\n\n0:41:05\tSPEAKER_05\n She's here.\n\n0:41:06\tSPEAKER_02\n She's got a nice voice.\n\n0:41:07\tSPEAKER_05\n I know she's here.\n\n0:41:08\tSPEAKER_05\n I know she's a big part of the institute, right?\n\n0:41:10\tSPEAKER_07\n So, yeah, I'm sure you've seen her.\n\n0:41:13\tSPEAKER_05\n I must have.\n\n0:41:14\tSPEAKER_05\n I just don't know what she looks like.\n\n0:41:16\tSPEAKER_05\n Yeah.\n\n0:41:17\tSPEAKER_05\n Yeah, I think she's got a nice voice.\n\n0:41:19\tSPEAKER_05\n But anyway.\n\n0:41:20\tSPEAKER_05\n She always tends to get drunk.\n\n0:41:22\tSPEAKER_05\n Don't you always say nice things about these people?\n\n0:41:24\tSPEAKER_07\n Yeah.\n\n0:41:25\tSPEAKER_07\n I also find that if someone sits there and there's this one who doesn't say much, but she just always pleasant.\n\n0:41:35\tSPEAKER_07\n And kind of a smiling voice and she laughs.\n\n0:41:37\tSPEAKER_00\n What difference?\n\n0:41:38\tSPEAKER_07\n Yeah, I mean, it's like, actually, she's just so pleasant.\n\n0:41:44\tSPEAKER_07\n And it adds a lot.\n\n0:41:45\tSPEAKER_07\n Just by virtue of that, people will talk in these technical things.\n\n0:41:48\tSPEAKER_07\n But she'll say something technical and then laugh.\n\n0:41:51\tSPEAKER_07\n It's very interesting.\n\n0:41:52\tSPEAKER_07\n The only thing you can get through these things.\n\n0:41:54\tSPEAKER_04\n This really makes it a lot nicer to transcribe because there can be a lot of heated discussions about these reg technical issues and people have their opinions.\n\n0:42:04\tSPEAKER_04\n And then you can, it's really nice to have a little bit of humor or a little bit of break away from that because it's hard to sit there and let's see.\n\n0:42:12\tNone\n But don't you see you're being rude to this person?\n\n0:42:14\tSPEAKER_03\n I know.\n\n0:42:15\tSPEAKER_03\n This person.\n\n0:42:16\tSPEAKER_03\n That nice?\n\n0:42:17\tSPEAKER_03\n I start kind of making mental friends.\n\n0:42:19\tSPEAKER_03\n Just like, I really like that person.\n\n0:42:23\tSPEAKER_07\n I'm going to be his or her friend.\n\n0:42:27\tSPEAKER_07\n I agree with you.\n\n0:42:28\tSPEAKER_07\n It's really interesting.\n\n0:42:30\tSPEAKER_07\n It's a persona.\n\n0:42:31\tSPEAKER_07\n You get this.\n\n0:42:32\tSPEAKER_04\n Yeah.\n\n0:42:33\tSPEAKER_04\n You definitely get an image of, especially if you can relate it to what the person, what you assume the person is interested in academically.\n\n0:42:42\tSPEAKER_03\n Yeah.\n\n0:42:43\tSPEAKER_03\n Yeah.\n\n0:42:44\tSPEAKER_03\n Some of that computer stuff.\n\n0:42:45\tSPEAKER_03\n I just, oh my god.\n\n0:42:46\tSPEAKER_03\n I'll just sit there like going, oh, it's going right over my head.\n\n0:42:51\tSPEAKER_03\n Yeah.\n\n0:42:52\tSPEAKER_03\n I start zoning out sometimes like, I don't mean to, but I'm just kind of going, I don't know what any of these acronyms are.\n\n0:42:58\tSPEAKER_03\n And there's a whole set of meetings that are like that.\n\n0:43:00\tSPEAKER_03\n That's something.\n\n0:43:01\tSPEAKER_03\n Yeah.\n\n0:43:02\tSPEAKER_03\n That's really hard.\n\n0:43:03\tSPEAKER_03\n And they're writing stuff on boards and stuff that we can't see.\n\n0:43:05\tSPEAKER_03\n Yeah.\n\n0:43:06\tSPEAKER_03\n And so we don't know what they're referring to.\n\n0:43:08\tSPEAKER_03\n Yeah.\n\n0:43:09\tSPEAKER_03\n I hear the squeaky pen.\n\n0:43:10\tSPEAKER_03\n Yeah.\n\n0:43:11\tSPEAKER_03\n Oh, no.\n\n0:43:12\tSPEAKER_03\n It's going on that I don't know.\n\n0:43:13\tSPEAKER_03\n They're referring to this or that or the other thing and you're just going to know.\n\n0:43:16\tSPEAKER_03\n Yeah.\n\n0:43:17\tSPEAKER_03\n I don't understand.\n\n0:43:18\tSPEAKER_05\n Yeah.\n\n0:43:19\tSPEAKER_05\n You guys talk about doing a videotape.\n\n0:43:21\tSPEAKER_07\n Yes.\n\n0:43:22\tSPEAKER_07\n It's mainly a matter of two things.\n\n0:43:25\tSPEAKER_07\n First is the storage.\n\n0:43:26\tSPEAKER_07\n It'd be so huge that you'd want to be sure that it was of interest to someone that it would be worthwhile doing it.\n\n0:43:30\tSPEAKER_07\n And that's the other thing that we don't have someone currently doing the video thing.\n\n0:43:34\tSPEAKER_07\n It would really be interesting.\n\n0:43:35\tSPEAKER_05\n Yeah.\n\n0:43:36\tSPEAKER_05\n Because I know it was mentioned.\n\n0:43:37\tSPEAKER_05\n Also having a meeting where you all were blindfolds.\n\n0:43:39\tSPEAKER_05\n Yeah.\n\n0:43:40\tSPEAKER_05\n Oh, oh.\n\n0:43:41\tSPEAKER_04\n Who's this idea?\n\n0:43:42\tSPEAKER_04\n Wasn't it?\n\n0:43:43\tSPEAKER_04\n That was this idea.\n\n0:43:44\tSPEAKER_04\n What would be the point of that?\n\n0:43:45\tSPEAKER_07\n Who else?\n\n0:43:46\tSPEAKER_07\n Question of feedback.\n\n0:43:47\tSPEAKER_07\n Being able to give feedback.\n\n0:43:48\tSPEAKER_07\n Oh, wow.\n\n0:43:49\tSPEAKER_00\n I think I've heard a lot of interesting things.\n\n0:43:50\tSPEAKER_03\n No, I see.\n\n0:43:51\tSPEAKER_03\n So you have to do it vocally as opposed to visually.\n\n0:43:53\tSPEAKER_03\n Like you can't use gesture.\n\n0:43:55\tSPEAKER_03\n Exactly.\n\n0:43:56\tSPEAKER_07\n Yeah.\n\n0:43:57\tSPEAKER_07\n And that was the meeting where partitions wouldn't work.\n\n0:44:02\tSPEAKER_07\n Another possibility is that partitions wouldn't work because then it would cut off the PCMs from having the indirects.\n\n0:44:07\tSPEAKER_07\n So it's like, yeah, these unusual configuration problems that you wouldn't normally have.\n\n0:44:12\tSPEAKER_07\n Yeah.\n\n0:44:13\tSPEAKER_07\n Blindfolds.\n\n0:44:14\tSPEAKER_07\n And someone else said, well, maybe you could just turn the light out.\n\n0:44:17\tSPEAKER_07\n Oh, my God.\n\n0:44:18\tSPEAKER_07\n Someone else said no because there are these special lights that have to stay on all the time for the fire coder.\n\n0:44:25\tSPEAKER_05\n But then I would just be so worried that someone would cheat.\n\n0:44:29\tSPEAKER_05\n You know, it's sort of like a prison dilemma game where everyone's wearing their blindfold because someone could just cheat.\n\n0:44:34\tSPEAKER_05\n What's going on?\n\n0:44:35\tNone\n Are you using your hand?\n\n0:44:36\tSPEAKER_05\n No.\n\n0:44:37\tSPEAKER_05\n There's somebody just being in the limpsino.\n\n0:44:38\tSPEAKER_05\n It's a coffee comes back.\n\n0:44:39\tSPEAKER_05\n Someone knows.\n\n0:44:40\tSPEAKER_05\n It gets bored.\n\n0:44:41\tSPEAKER_07\n Yeah, I mean, there are other things we could expand on with in terms of the methodology.\n\n0:44:52\tSPEAKER_07\n It's nice to have a core set of data, though, and they've actually done some, they had some good results in terms of the digits, which they do in terms of having a nice broad set of speakers doing the same thing, meeting after meeting after meeting.\n\n0:45:07\tSPEAKER_07\n So that's good.\n\n0:45:09\tSPEAKER_07\n I'm wondering.\n\n0:45:10\tSPEAKER_07\n So we still technically, you know, I mean, what should we do in terms of T?\n\n0:45:15\tSPEAKER_07\n Technically, if we could hang on for 15 more minutes and have T?\n\n0:45:18\tSPEAKER_07\n Yeah, that's okay.\n\n0:45:19\tSPEAKER_00\n And then I'll continue with this next week.\n\n0:45:20\tSPEAKER_07\n Sure.\n\n0:45:21\tSPEAKER_07\n That'd be great.\n\n0:45:22\tSPEAKER_07\n Okay, so, let's see.\n\n0:45:24\tSPEAKER_04\n I had something that I could bring up as far as ideas about looking at the data and getting ideas about whatever you said hypotheses about, how to figure it out.\n\n0:45:36\tSPEAKER_04\n One thing that I, you probably remember this, that I was really interested in is the use of so and the use of or.\n\n0:45:43\tSPEAKER_04\n Because the way people use it in these meetings, I found was, I don't know if it was, if it's different than other people, I don't know if it's a computer speech thing, I mean, computer people's speech thing, but people tend to end utterances quite often with so or and trailing off.\n\n0:45:59\tSPEAKER_04\n A couple people in particular.\n\n0:46:00\tSPEAKER_04\n Yeah, yeah.\n\n0:46:01\tSPEAKER_04\n That's cool.\n\n0:46:02\tSPEAKER_04\n And I found that really interesting.\n\n0:46:03\tSPEAKER_04\n I was interested to figure out when that happened, if it happened in certain occasions and whatever, and I never really got around to it.\n\n0:46:09\tSPEAKER_07\n Do you, people, I mean, does everyone agree with that?\n\n0:46:12\tSPEAKER_07\n I mean, I share her intuition that it's sort of unusual to have so use as a final part of a person's turn.\n\n0:46:20\tSPEAKER_04\n It doesn't sound strange.\n\n0:46:21\tSPEAKER_04\n I mean, it doesn't sound like bizarre enough that I don't understand, but I don't think it's something that happens in just everyday speech, really.\n\n0:46:29\tSPEAKER_03\n I don't know.\n\n0:46:30\tSPEAKER_03\n I don't agree necessarily.\n\n0:46:31\tSPEAKER_03\n Really?\n\n0:46:32\tSPEAKER_03\n I do it.\n\n0:46:33\tSPEAKER_03\n I don't agree a lot with so.\n\n0:46:35\tSPEAKER_03\n I don't necessarily do it as often as the one speaker I'm thinking of, but I do do that because I think partly because I want to make sure that people know that my thought, my utterance is finished.\n\n0:46:52\tSPEAKER_03\n Yeah.\n\n0:46:53\tSPEAKER_03\n But that it's not necessarily final, like that you're flexible.\n\n0:46:57\tSPEAKER_03\n Right.\n\n0:46:58\tSPEAKER_03\n Or you can build on it or.\n\n0:46:59\tSPEAKER_01\n Right.\n\n0:47:00\tSPEAKER_01\n I think it's sort of a like, you guys can take from here.\n\n0:47:02\tSPEAKER_01\n Yeah.\n\n0:47:03\tSPEAKER_01\n I think somebody build on my thought.\n\n0:47:04\tSPEAKER_01\n People also do it with.\n\n0:47:05\tSPEAKER_01\n It's kind of like a shag.\n\n0:47:06\tSPEAKER_04\n Yeah, but it takes to happen.\n\n0:47:08\tSPEAKER_04\n I mean, so tends to happen when the person brings up a new idea that kind of goes against with the other people saying, or at least that's what I've been found.\n\n0:47:16\tSPEAKER_04\n Like if someone in a meeting is talking about a certain thing and someone kind of interrupts or doesn't necessarily interrupt and says something, either a new topic or a different take on the same topic, we'll tend to use trail off of a couple.\n\n0:47:29\tSPEAKER_06\n You can see you might be wrong with it.\n\n0:47:31\tSPEAKER_06\n I don't want to actually say that.\n\n0:47:32\tSPEAKER_04\n Yeah, kind of.\n\n0:47:33\tSPEAKER_04\n Yeah.\n\n0:47:34\tSPEAKER_04\n Yeah.\n\n0:47:35\tSPEAKER_04\n Interesting.\n\n0:47:36\tSPEAKER_04\n And or tends to be used with questions.\n\n0:47:38\tSPEAKER_04\n More than.\n\n0:47:39\tSPEAKER_04\n Yeah.\n\n0:47:40\tSPEAKER_04\n So.\n\n0:47:41\tSPEAKER_04\n What's trend?\n\n0:47:42\tSPEAKER_03\n I've heard you say so when that sort of sounds like a.\n\n0:47:47\tSPEAKER_03\n So in other words, blah, blah, blah, blah.\n\n0:47:50\tSPEAKER_07\n Like sort of an end it.\n\n0:47:51\tSPEAKER_07\n Of course.\n\n0:47:52\tSPEAKER_07\n But that's not really an example of this because I just say so.\n\n0:47:54\tSPEAKER_07\n That's the right.\n\n0:47:55\tSPEAKER_03\n I mean, so.\n\n0:47:56\tSPEAKER_03\n Or maybe I'm misunderstanding about you.\n\n0:47:58\tSPEAKER_00\n When you end with so.\n\n0:47:59\tSPEAKER_03\n When you end.\n\n0:48:00\tSPEAKER_07\n Just ending with that.\n\n0:48:01\tSPEAKER_01\n Right.\n\n0:48:02\tSPEAKER_07\n I can get all those extra signatures, but I don't know.\n\n0:48:06\tSPEAKER_07\n So.\n\n0:48:07\tSPEAKER_00\n Yeah.\n\n0:48:08\tSPEAKER_03\n Right.\n\n0:48:09\tSPEAKER_03\n It's like a vocal shrug.\n\n0:48:10\tSPEAKER_03\n Yeah.\n\n0:48:11\tSPEAKER_07\n That's a very nice characterization.\n\n0:48:13\tSPEAKER_07\n Interesting.\n\n0:48:14\tSPEAKER_04\n I definitely like to look more at that if I can.\n\n0:48:18\tSPEAKER_04\n But that's cool.\n\n0:48:19\tSPEAKER_01\n I think people end in butt a lot too.\n\n0:48:21\tSPEAKER_01\n And I feel that that means that they want somebody else to take it up or something to sort of like, you know, take it from here.\n\n0:48:27\tSPEAKER_01\n So, you know, blah, blah, blah, blah.\n\n0:48:29\tSPEAKER_01\n But I'm not really sure.\n\n0:48:31\tSPEAKER_04\n Is it a shrug?\n\n0:48:32\tSPEAKER_04\n Is it a shrug?\n\n0:48:33\tSPEAKER_01\n Is it a shrug?\n\n0:48:34\tSPEAKER_01\n It's a different kind of shrug.\n\n0:48:35\tSPEAKER_01\n I feel like it sort of asks for somebody else to put input in now.\n\n0:48:40\tSPEAKER_04\n I think it shows less of confidence, like less confidence in what they just said.\n\n0:48:43\tSPEAKER_03\n Okay.\n\n0:48:44\tSPEAKER_03\n Same with, I don't know.\n\n0:48:45\tSPEAKER_03\n You can also end in an order.\n\n0:48:46\tSPEAKER_03\n It's with blah, blah, blah.\n\n0:48:47\tSPEAKER_03\n I don't know.\n\n0:48:48\tSPEAKER_03\n Yeah.\n\n0:48:49\tSPEAKER_03\n Like that.\n\n0:48:50\tSPEAKER_03\n Yeah.\n\n0:48:51\tSPEAKER_03\n Like I feel like maybe that's similar to butt.\n\n0:48:55\tSPEAKER_03\n Yeah.\n\n0:48:56\tSPEAKER_03\n More similar than to.\n\n0:48:57\tSPEAKER_02\n Yeah.\n\n0:48:58\tSPEAKER_07\n I think so too.\n\n0:49:00\tSPEAKER_07\n Huh.\n\n0:49:01\tSPEAKER_07\n Interesting.\n\n0:49:02\tSPEAKER_07\n What about the way people treat when they give a joke?\n\n0:49:04\tSPEAKER_07\n I mean, and they're like, they laugh and then after they laugh, they say, ah, I mean, he's so excited.\n\n0:49:10\tSPEAKER_07\n Ah, ah.\n\n0:49:11\tSPEAKER_07\n Do you, if you find a question?\n\n0:49:14\tSPEAKER_07\n Yeah.\n\n0:49:15\tSPEAKER_07\n And it's like to me, I think I've heard comedians do that.\n\n0:49:18\tSPEAKER_07\n There's something there about, you know, you make a joke and then you have an ah in there somehow, which I don't really understand the function of.\n\n0:49:26\tSPEAKER_03\n Maybe it's like saying like, this is funny, but maybe it shouldn't be funny or this is funny, but maybe it's funny for some sort of perverse reason.\n\n0:49:35\tSPEAKER_04\n Or maybe it's just a link to get back to the conversation or something like to connect it with what is going on.\n\n0:49:41\tSPEAKER_04\n Well, how is it?\n\n0:49:42\tSPEAKER_03\n Okay.\n\n0:49:43\tSPEAKER_03\n So the one I'm thinking of is like, like, haha, you say you would say like, okay, so he's laughing hot and then you go.\n\n0:49:54\tSPEAKER_04\n Like kind of laughing with it.\n\n0:49:57\tSPEAKER_03\n Kind of like, yeah, kind of like, yeah.\n\n0:50:00\tSPEAKER_03\n And to me, that's more of like the, maybe this shouldn't be funny, but it is, maybe this is funny because it's kind of disgusting or perverse.\n\n0:50:08\tSPEAKER_03\n So it's possible.\n\n0:50:09\tSPEAKER_07\n Now, what I'm thinking, I didn't have the extra, what do you say?\n\n0:50:14\tSPEAKER_07\n Nuances in the ah, which you just, which you just did.\n\n0:50:17\tSPEAKER_07\n However, the context fits.\n\n0:50:18\tSPEAKER_07\n I mean, that's an interesting take on it.\n\n0:50:21\tSPEAKER_03\n It's possible.\n\n0:50:24\tSPEAKER_07\n So you meant just sort of like a normal ah, but it's stuck in, maybe it's a little louder than usual.\n\n0:50:30\tSPEAKER_07\n There's not any of the extra, you know, glottal thing.\n\n0:50:33\tSPEAKER_03\n Meaning let's keep going.\n\n0:50:35\tSPEAKER_07\n Maybe it means that.\n\n0:50:36\tSPEAKER_07\n But it just seems like it's more prominent than it really is like a placeholder of some sort, like, which I think is self reflexive and the sort of brings focus back onto the joke maker.\n\n0:50:48\tSPEAKER_04\n Yeah.\n\n0:50:49\tSPEAKER_04\n Maybe it's when people don't laugh enough or something.\n\n0:50:52\tSPEAKER_00\n It's possible.\n\n0:50:54\tSPEAKER_03\n Yeah, like let's come back to the original subject and I will take it from there.\n\n0:50:59\tSPEAKER_03\n Oh, it could be.\n\n0:51:00\tSPEAKER_03\n Yeah, it's possible.\n\n0:51:01\tSPEAKER_03\n Maybe.\n\n0:51:02\tSPEAKER_03\n Because I've heard, um, Morion do that.\n\n0:51:04\tSPEAKER_03\n Exactly who I was thinking of actually.\n\n0:51:05\tSPEAKER_03\n Yeah.\n\n0:51:06\tSPEAKER_07\n He does that.\n\n0:51:07\tSPEAKER_07\n Yeah, exactly.\n\n0:51:08\tSPEAKER_07\n Yeah.\n\n0:51:09\tSPEAKER_07\n For obvious reasons, probably if that's the way he uses it.\n\n0:51:11\tSPEAKER_07\n That's true.\n\n0:51:12\tSPEAKER_07\n That would, and he does continue after that.\n\n0:51:14\tSPEAKER_07\n But it's just, you know, to say, ah, to say, ah, well, you're laughing, it's just to say, ah, I'm sorry.\n\n0:51:20\tSPEAKER_01\n It's a matter of time.\n\n0:51:21\tSPEAKER_01\n I think it may almost have to do with like, okay, I told the joke, everyone's laughing, and that's common courtesy.\n\n0:51:25\tSPEAKER_01\n I'll sort of tell everyone to stop laughing, you know, if you don't offend me about how good my joke was.\n\n0:51:30\tSPEAKER_01\n It's almost like, okay, my joke's over.\n\n0:51:34\tSPEAKER_01\n You know, you could stop laughing now.\n\n0:51:36\tSPEAKER_04\n That's possible.\n\n0:51:37\tSPEAKER_01\n Giving them permission.\n\n0:51:38\tSPEAKER_01\n Yeah.\n\n0:51:39\tSPEAKER_01\n You know, because it's like, I don't know, I don't know if I should.\n\n0:51:41\tSPEAKER_01\n How do you, you know, how much do you laugh after someone's joke to tell them how much you enjoy it later?\n\n0:51:46\tSPEAKER_01\n Yeah.\n\n0:51:47\tSPEAKER_01\n Or how long do you wait after the joke?\n\n0:51:49\tSPEAKER_04\n To keep going with the meeting.\n\n0:51:50\tSPEAKER_04\n Right.\n\n0:51:51\tSPEAKER_04\n Yeah.\n\n0:51:52\tSPEAKER_04\n Interesting.\n\n0:51:53\tSPEAKER_04\n Interesting.\n\n0:51:54\tSPEAKER_04\n Because sometimes you can get on digressions, which just lasts for like minutes and times.\n\n0:51:56\tSPEAKER_04\n Right.\n\n0:51:57\tSPEAKER_04\n Yes.\n\n0:51:58\tSPEAKER_04\n And people are just hysterical and they're like, what were we talking about?\n\n0:52:00\tSPEAKER_04\n I don't know.\n\n0:52:01\tSPEAKER_04\n It's hard when people get really, really into their laughing and start talking at the same time.\n\n0:52:09\tSPEAKER_04\n Yeah.\n\n0:52:10\tSPEAKER_04\n It's hard to figure out what they're talking about.\n\n0:52:12\tSPEAKER_04\n And also, they don't tend to talk very, there's a lot of dissonances when they're laughing and talking.\n\n0:52:16\tSPEAKER_01\n It's hard to.\n\n0:52:17\tSPEAKER_01\n Sometimes they make me laugh so hard.\n\n0:52:19\tSPEAKER_01\n They'll just be talking about something technical and it'll be so boring.\n\n0:52:23\tSPEAKER_01\n Suddenly they'll say something that they only just sort of chuckle at and that I laugh at for the next like 20 minutes.\n\n0:52:29\tSPEAKER_01\n I think it's so funny.\n\n0:52:31\tSPEAKER_01\n I think what time everybody was doing the digits and they were all doing it at the same time and they started off kind of shaky.\n\n0:52:38\tSPEAKER_01\n They were like, oh do we want to do this at the same time?\n\n0:52:40\tSPEAKER_01\n You know, that's not all start laughing and then they all did it at the same time.\n\n0:52:44\tSPEAKER_01\n One person ended up at the very end doing the digits and everybody had finished and we had like two people to laugh at.\n\n0:52:51\tSPEAKER_01\n And they ended so they turned them in and went, you!\n\n0:52:54\tSPEAKER_01\n I just kept laughing, laughing, laughing, laughing.\n\n0:53:01\tSPEAKER_03\n John will keep making comments about the transcribers.\n\n0:53:04\tSPEAKER_03\n Yes.\n\n0:53:05\tSPEAKER_03\n It's the funniest thing.\n\n0:53:06\tSPEAKER_03\n He'll say like, mean things about the transcribers.\n\n0:53:10\tSPEAKER_04\n He'll be like, I don't mean the transcribers we have here of course.\n\n0:53:14\tSPEAKER_03\n Sometimes I'll do that.\n\n0:53:16\tSPEAKER_03\n Yeah.\n\n0:53:17\tSPEAKER_03\n But sometimes he doesn't and sometimes he'll just be like, you know, he transcribers, transcribers, they're like when they do read the numbers they have no idea.\n\n0:53:28\tSPEAKER_07\n He's very funny.\n\n0:53:30\tSPEAKER_07\n I started laughing.\n\n0:53:31\tSPEAKER_07\n Something he said was the beginning of a meeting and he hadn't gotten far into it and he's doing this one of these mock fights with Nancy which he does.\n\n0:53:38\tSPEAKER_07\n He never passed these mock fights and he says something like, yeah.\n\n0:53:45\tSPEAKER_07\n They had this nice mutual condescending joking thing going on.\n\n0:53:50\tSPEAKER_07\n And he says, I can explain this to you.\n\n0:53:52\tSPEAKER_07\n I have a better laugh than you do.\n\n0:53:54\tSPEAKER_07\n The transcribers told me so.\n\n0:53:56\tSPEAKER_07\n They went a little longer but it's like this.\n\n0:54:01\tSPEAKER_07\n At one point she, you know, in another meeting she was not sure which channel she was on and he said, well, I think you're on channel so and so on.\n\n0:54:08\tSPEAKER_07\n And she said, well, no, it shouldn't be channel so and so on.\n\n0:54:11\tSPEAKER_07\n Well, no, it should be channel so and so and then it turned out it was channel so and so which he said and she said, he said, I bested you again Nancy.\n\n0:54:19\tSPEAKER_07\n She said, yes, that's my recollection of all of our meetings together.\n\n0:54:25\tSPEAKER_07\n The path is really nice.\n\n0:54:27\tSPEAKER_07\n Those sorts of things, it's true.\n\n0:54:29\tSPEAKER_07\n It really does live and things happen to have the nice interrelationships.\n\n0:54:34\tSPEAKER_07\n I think I found that's a nice aspect of a lot of these meetings.\n\n0:54:38\tSPEAKER_07\n The little periods of humor like that.\n\n0:54:42\tSPEAKER_07\n Yeah.\n\n0:54:43\tSPEAKER_07\n All right, well, so do we, we could do digits if we so desired if we wanted to do digits.\n\n0:54:48\tSPEAKER_03\n Let's do simultaneous digits.\n\n0:54:50\tSPEAKER_03\n And somebody explains why you do digits.\n\n0:54:54\tSPEAKER_03\n I still don't really know.\n\n0:54:55\tSPEAKER_07\n Okay, the idea is that you have then you have ground truth.\n\n0:54:59\tSPEAKER_07\n You know exactly what they're supposed to have said.\n\n0:55:01\tSPEAKER_07\n And then of course sometimes we go through and actually people do double check that they read them correctly and all.\n\n0:55:07\tSPEAKER_07\n So that we're sure as you've done.\n\n0:55:09\tSPEAKER_05\n I remember I did that one too.\n\n0:55:11\tSPEAKER_06\n Yeah, we are meant to be transcribing if they're just left in the curly brackets.\n\n0:55:16\tSPEAKER_07\n No, because it's it should be able to be taken care of efficiently with this interface.\n\n0:55:21\tSPEAKER_07\n I mean, if the entire fish people do it then do it.\n\n0:55:24\tSPEAKER_03\n Yeah, that's fine.\n\n0:55:25\tSPEAKER_03\n Yeah, I've been writing numbers because I wasn't sure what to do.\n\n0:55:28\tSPEAKER_07\n Well, if you do that's that's all right as well.\n\n0:55:31\tSPEAKER_07\n You don't have to.\n\n0:55:32\tSPEAKER_07\n You don't have to.\n\n0:55:33\tSPEAKER_07\n Okay, because we're we had the assumption that we'll take care of it this other way.\n\n0:55:37\tSPEAKER_07\n But in the case the idea is that you have ground truth.\n\n0:55:39\tSPEAKER_07\n You know exactly what the person should have said and you check to be sure.\n\n0:55:42\tSPEAKER_07\n And usually there aren't many errors when they were checked.\n\n0:55:45\tSPEAKER_07\n And then you have this multiplicity of voices.\n\n0:55:49\tSPEAKER_07\n Reading these things and you can do really good speech recognition that way.\n\n0:55:53\tSPEAKER_07\n So they have some papers out that they've done this.\n\n0:55:56\tSPEAKER_07\n It's been very fruitful in terms of the analyses.\n\n0:55:59\tSPEAKER_07\n It's nice to have a standard.\n\n0:56:01\tSPEAKER_07\n You know, it's like psychological approach also that you'd like to have some standard stimulus here.\n\n0:56:06\tSPEAKER_07\n No, I agree.\n\n0:56:07\tSPEAKER_07\n Yeah, I agree.\n\n0:56:08\tSPEAKER_07\n I think it's a nice designed feature.\n\n0:56:10\tSPEAKER_03\n Where's the little thing that's supposed to say transcript L dash blah blah.\n\n0:56:14\tSPEAKER_03\n Yes, you're right.\n\n0:56:15\tSPEAKER_07\n See, I guess it would be.\n\n0:56:17\tSPEAKER_07\n It's up here.\n\n0:56:18\tSPEAKER_05\n Oh, I see.\n\n0:56:19\tSPEAKER_05\n Oh, okay.\n\n0:56:20\tSPEAKER_05\n So I have a question.\n\n0:56:22\tSPEAKER_05\n Because now I'm looking at this and I realize I don't know the answer is sometimes when people are reading zero.\n\n0:56:30\tSPEAKER_05\n Yeah, they say, oh, yes.\n\n0:56:32\tSPEAKER_05\n And sometimes they say zero.\n\n0:56:33\tSPEAKER_05\n But and I thought that there must be an indication.\n\n0:56:36\tSPEAKER_05\n It used to be.\n\n0:56:37\tSPEAKER_05\n That's what I thought to be.\n\n0:56:38\tSPEAKER_05\n Oh, they changed them.\n\n0:56:39\tSPEAKER_07\n Initially it was words all spelled out.\n\n0:56:42\tSPEAKER_07\n So oh, oh, oh, my.\n\n0:56:44\tSPEAKER_05\n Yes.\n\n0:56:45\tSPEAKER_07\n And that was like a stupe test.\n\n0:56:46\tSPEAKER_07\n And some ways took a lot of time when I was doing those.\n\n0:56:48\tSPEAKER_07\n I had to really concentrate.\n\n0:56:49\tSPEAKER_07\n I was like, really had to see the words and the numbers.\n\n0:56:53\tSPEAKER_07\n And then you have an OH periodically.\n\n0:56:55\tSPEAKER_07\n And they were initially spelled out that way.\n\n0:56:58\tSPEAKER_07\n I see.\n\n0:56:59\tSPEAKER_04\n So that's why.\n\n0:57:00\tSPEAKER_07\n But we converted them to this format.\n\n0:57:02\tSPEAKER_07\n And then the idea, I mean, you could conceivably put an OH or a zero for the O's and still have this benefit.\n\n0:57:07\tSPEAKER_07\n But I think that the idea is that people can choose what they think is most natural for them to say in those locations.\n\n0:57:13\tSPEAKER_07\n And maybe they'd be.\n\n0:57:14\tSPEAKER_05\n So it's optional.\n\n0:57:15\tSPEAKER_05\n You can say one or the other.\n\n0:57:16\tSPEAKER_05\n Yes.\n\n0:57:17\tSPEAKER_07\n Okay.\n\n0:57:18\tSPEAKER_07\n Okay.\n\n0:57:19\tSPEAKER_06\n So, um, can I ask also?\n\n0:57:23\tSPEAKER_06\n Sure.\n\n0:57:24\tSPEAKER_06\n It says it looks like the grouping is are important.\n\n0:57:26\tSPEAKER_06\n But some of the transcripts I've seen they don't have any commas or breaks.\n\n0:57:28\tSPEAKER_06\n It's just a string of numbers.\n\n0:57:30\tSPEAKER_06\n So we should be adding the breaks if.\n\n0:57:32\tSPEAKER_07\n Yes.\n\n0:57:33\tSPEAKER_07\n Well, see, also this has been a change in the procedure that used to be that they were like one long string, different size strings.\n\n0:57:39\tSPEAKER_07\n But to have them broken up like this, it's been about maybe half a year that this maybe maybe seven months.\n\n0:57:47\tSPEAKER_07\n I know.\n\n0:57:48\tSPEAKER_07\n Maybe longer.\n\n0:57:49\tSPEAKER_07\n That they got and actually broken up within the line.\n\n0:57:52\tSPEAKER_07\n So the idea is to pause when you see that.\n\n0:57:55\tSPEAKER_04\n But in the transcriptions, I mean, we don't have to deal with that because when you know the other interface deals with that then they break it up.\n\n0:58:01\tSPEAKER_07\n That's right.\n\n0:58:02\tSPEAKER_07\n Break it up more finely.\n\n0:58:03\tSPEAKER_06\n But if you can clearly hear pauses and they've not been transcribed, we should be adding the commas or not.\n\n0:58:08\tSPEAKER_07\n The one I'm working on now is like that.\n\n0:58:10\tSPEAKER_07\n I would say don't worry about that because, um, this is, again, you know, it'd be nice to get the words right.\n\n0:58:16\tSPEAKER_07\n But, um, the interface that these guys used allows you to set the time boundaries really accurately.\n\n0:58:23\tSPEAKER_07\n So it's not so important.\n\n0:58:25\tSPEAKER_07\n It's more important to focus on the words because there we don't know the ground truth.\n\n0:58:30\tSPEAKER_07\n So are we going to do them together?\n\n0:58:33\tSPEAKER_07\n Well, I don't know.\n\n0:58:34\tSPEAKER_07\n How do you feel?\n\n0:58:35\tSPEAKER_07\n I don't care.\n\n0:58:36\tSPEAKER_07\n What we could do is we could do it together one week and then separate the next or something like that to give the variety.\n\n0:58:40\tSPEAKER_07\n Why don't we do them together this time just because in just a time to get you out of time.\n\n0:58:45\tSPEAKER_07\n Okay, so, um, we just start out, we, and you say transcript L, whatever it is, and then launch into the numbers, and then pause between the groups of the gaps.\n\n0:58:53\tSPEAKER_07\n And then I guess you're supposed to treat...\n\n0:58:54\tSPEAKER_07\n After each line?\n\n0:58:56\tSPEAKER_07\n Yes, well, you're supposed to treat each line as kind of like a little sentence.\n\n0:58:59\tSPEAKER_07\n What do they say each name?\n\n0:59:00\tSPEAKER_07\n For instance, smaller groups.\n\n0:59:02\tSPEAKER_07\n Please read each string as if you were given to someone over the telephone.\n\n0:59:04\tSPEAKER_07\n He's in the groupings indicated.\n\n0:59:06\tSPEAKER_07\n I think the groupings says, so many groupings in telephone numbers, social security number.\n\n0:59:10\tSPEAKER_04\n Pause briefly between lines.\n\n0:59:12\tSPEAKER_07\n Yes.\n\n0:59:13\tSPEAKER_07\n Okay.\n\n0:59:14\tSPEAKER_07\n Ready?\n\n0:59:15\tSPEAKER_07\n Set?\n\n0:59:16\tSPEAKER_07\n Go.\n\n0:59:17\tSPEAKER_02\n transcript L.\n\n0:59:18\tSPEAKER_02\n 330.\n\n0:59:19\tSPEAKER_02\n 516.\n\n0:59:20\tSPEAKER_00\n 314.\n\n0:59:21\tSPEAKER_00\n 1, 7173.\n\n0:59:22\tSPEAKER_00\n 3214.\n\n0:59:23\tSPEAKER_00\n 445.\n\n0:59:24\tSPEAKER_02\n 645.\n\n0:59:25\tSPEAKER_02\n 645.\n\n0:59:26\tSPEAKER_00\n 7174.\n\n0:59:27\tSPEAKER_00\n 5187.\n\n0:59:29\tSPEAKER_03\n 6305.\n\n0:59:31\tSPEAKER_03\n 6296.\n\n0:59:32\tSPEAKER_03\n 6186.\n\n0:59:33\tSPEAKER_03\n 1175.\n\n0:59:34\tSPEAKER_03\n 6196.\n\n0:59:35\tSPEAKER_03\n 6176.\n\n0:59:36\tSPEAKER_00\n 6296.\n\n0:59:37\tSPEAKER_00\n 6178.\n\n0:59:38\tSPEAKER_00\n 1, 6365.\n\n0:59:39\tSPEAKER_00\n 5166.\n\n0:59:40\tSPEAKER_00\n 1, 0675.\n\n1:00:11\tSPEAKER_01\n But I had one page of numbers left Get it\n\n1:00:17\tSPEAKER_05\n I'm just happy I didn't make any mistakes\n\n1:00:26\tSPEAKER_07\n I'm distracting it is Did you finish your last I finished my last one really hard though\n\n1:00:33\tSPEAKER_01\n I'm in the middle of it. Yeah, I got all the way down and then the very last one. Okay, but I was like I have it left\n\n1:00:47\tSPEAKER_07\n Okay, well I want to thank you very much and Look and so we'll meet next week the same time and less than anything I need to check on the schedule, but I think Okay, so unless we have the same time or within an hour. Okay, good. Thanks very much signing off\n\n1:01:25\tNone\n You You You You You You You You You You\n\n", "summary": [{"summary_text": "Today's meeting is to benefit from Speaker's involvement in the data and all the things that he's been exposed to in the last few months. Speaker will be in his office during the meeting. He will start with issues of the chart type and then talk about the technical setup regarding the auditory image and the interface."}]}