{"filename": "./data/ES2005a.txt", "transcript": "0:00:00\tSPEAKER_02\n making a profit of 50 million euros.\n\n0:00:04\tSPEAKER_02\n So it's going to have to be pretty out-candy.\n\n0:00:07\tSPEAKER_01\n All your remote controls I use usually come with the television.\n\n0:00:10\tSPEAKER_01\n Yeah, fairly basic.\n\n0:00:13\tSPEAKER_02\n Yeah, I was thinking that as well.\n\n0:00:14\tSPEAKER_02\n I think the only ones that I've seen that you buy are the sort of one for all type thing.\n\n0:00:20\tSPEAKER_02\n Yeah, the Universal ones.\n\n0:00:22\tSPEAKER_02\n So presumably that might be an idea too.\n\n0:00:24\tSPEAKER_01\n But the source. 25 new lot of new features.\n\n0:00:30\tSPEAKER_01\n Yeah.\n\n0:00:30\tSPEAKER_02\n Yeah, because I mean what?\n\n0:00:33\tSPEAKER_02\n The 25 euros that's about 15 pounds or so.\n\n0:00:38\tSPEAKER_02\n And that's quite a lot for a more control.\n\n0:00:43\tSPEAKER_04\n Well, my first thoughts would be most remote controls are grey or black as you said they come with a TV so it's normally just your basic grey black remote controls as a function.\n\n0:00:52\tSPEAKER_04\n So maybe we could think about colour.\n\n0:00:56\tSPEAKER_04\n That might make it a bit different from the rest at least.\n\n0:01:01\tSPEAKER_04\n And as you say, we need to have some kind of gimmick.\n\n0:01:05\tSPEAKER_04\n So I thought maybe something like if you lose it and you can whistle, you know that?\n\n0:01:11\tSPEAKER_04\n Like the key right?\n\n0:01:12\tSPEAKER_02\n Because we always lose our own child.\n\n0:01:14\tSPEAKER_02\n Yeah, right.\n\n0:01:14\tSPEAKER_02\n Okay, let's go.\n\n0:01:17\tSPEAKER_00\n Yeah, being as a marketing expert I would like to say like before deciding the cost of this remote control or and other things we must see the market potential for this product like what is the competition in the market?\n\n0:01:31\tSPEAKER_00\n What are the available prices of the other remote controls in the prices?\n\n0:01:35\tSPEAKER_00\n What specialty our remote controls are having?\n\n0:01:39\tSPEAKER_00\n And how complicated it is to use this remote controls as compared to other remote controls available in the market?\n\n0:01:46\tSPEAKER_00\n So before deciding or before finalizing this project we must discuss all these things.\n\n0:01:52\tSPEAKER_00\n And apart from this, it should be having a good look also.\n\n0:01:57\tSPEAKER_00\n Because people really like to play with it when they are watching movies or playing with or playing with their CD player, MP3 player like any electronic devices.\n\n0:02:07\tSPEAKER_00\n They really want to have something good having a good design in their hands.\n\n0:02:11\tSPEAKER_00\n So yes, all this.\n\n0:02:13\tSPEAKER_02\n So we're looking for.\n\n0:02:19\tSPEAKER_01\n Okay, we're looking for the size of the.\n\n0:02:23\tSPEAKER_01\n Sorry, because as you add more buttons to their modes sometimes it gets so big and clunky.\n\n0:02:28\tSPEAKER_01\n Yeah, it's like a hundred buttons on it.\n\n0:02:31\tSPEAKER_01\n Or you could have a really small slim one but they can lose it easily.\n\n0:02:34\tSPEAKER_01\n They need to lose it.\n\n0:02:34\tSPEAKER_04\n Yeah, kind of maybe more like a pda kind of just handhelds like because\n\n0:02:43\tSPEAKER_02\n For remember we're trying to make it for 12 years 50.\n\n0:02:47\tSPEAKER_02\n Yeah, I wasn't sorry, I was thinking of the screen.\n\n0:02:50\tSPEAKER_02\n Okay, well I have to I'm having an army in half an hour.\n\n0:02:55\tSPEAKER_02\n So we're still looking to a bit actually, no, well I'll keep.\n\n0:03:02\tSPEAKER_02\n So you do the looking around at other remote controls.\n\n0:03:06\tSPEAKER_02\n Yeah, if you could maybe come up with sort of shapes and suggested shades or whatever and you could look into Basically how how it's made I like how you make it all in one how What sort of materials are available to you, whatever and obviously other instructions have come from The PowerShell Code Right, which will probably just be certain why say so.\n\n0:03:37\tSPEAKER_02\n So you want me to look at shapes and everything shapes and colors.\n\n0:03:40\tSPEAKER_02\n Okay, um basically how to make it attractive design And you make it competition Yeah, do they?\n\n0:03:54\tSPEAKER_02\n Go, okay?\n\n0:03:57\tSPEAKER_02\n So we have\n\n0:03:59\tSPEAKER_03\n Wait for emails\n\n0:04:30\tNone\n Okay Okay, grubby And now that we'll get\n\n0:04:43\tSPEAKER_04\n Oh no, I'm sorry\n\n0:04:45\tSPEAKER_02\n Okay, uh Mornings for next meetings as well\n\n0:04:49\tSPEAKER_04\n Okay\n\n0:04:51\tSPEAKER_02\n Okay So, I can't imagine these 1000\n\n0:05:08\tNone\n Okay Yeah Okay, let's go.\n\n0:05:29\tSPEAKER_02\n I guess I'm going to have to do it.\n\n0:05:39\tNone\n Okay.\n\n0:05:49\tNone\n Okay.\n\n0:06:09\tSPEAKER_03\n Okay.\n\n0:06:29\tSPEAKER_03\n Okay.\n\n0:06:49\tSPEAKER_04\n Okay.\n\n0:06:59\tSPEAKER_01\n Okay.\n\n0:07:09\tSPEAKER_01\n Okay.\n\n0:07:19\tSPEAKER_02\n Okay.\n\n0:07:29\tNone\n Okay.\n\n0:07:39\tNone\n Okay.\n\n0:07:49\tNone\n Okay.\n\n0:07:59\tNone\n Okay.\n\n", "summary": [{"summary_text": "SPEAKER is making a profit of 50 million euros. He's looking for a new remote control for 25 euros. The colour of the remote control should be different from the grey or black ones that usually come with the TV. It should have a gimmick like if you lose it and you can whistle. "}]}