{"filename": "./data/ES2008b.txt", "transcript": "0:00:30\tSPEAKER_04\n Good to see you all again.\n\n0:00:51\tSPEAKER_03\n Let's see if that can be done.\n\n0:00:58\tSPEAKER_04\n This is our functional design meeting.\n\n0:01:05\tSPEAKER_03\n Okay.\n\n0:01:10\tSPEAKER_04\n We put the fashion in electronics.\n\n0:01:15\tSPEAKER_04\n Let's start.\n\n0:01:16\tSPEAKER_04\n Okay, our agenda today.\n\n0:01:18\tSPEAKER_04\n Just took time.\n\n0:01:19\tSPEAKER_04\n It's 12-13.\n\n0:01:20\tSPEAKER_04\n I'm going to do an opening.\n\n0:01:27\tSPEAKER_04\n Did you all get the minutes?\n\n0:01:28\tSPEAKER_04\n I emailed them to you.\n\n0:01:29\tSPEAKER_04\n I'm also putting them in the shared folder.\n\n0:01:33\tSPEAKER_04\n We'll talk about our general objectives and have your three presentations.\n\n0:01:37\tSPEAKER_04\n I'll talk about the new project requirements I've just received.\n\n0:01:41\tSPEAKER_04\n Then we have to make a decision on our route control functions.\n\n0:01:43\tSPEAKER_04\n Finally, we'll just close.\n\n0:01:45\tSPEAKER_04\n We're starting this meeting at approximately 12-13 and we have 40 minutes.\n\n0:01:49\tSPEAKER_04\n First of all, the functional design objectives.\n\n0:01:54\tSPEAKER_04\n We need to keep in mind the user requirements specification, what needs and desires are to be fulfilled.\n\n0:02:01\tSPEAKER_04\n Detectional functions design, what effect the apparatus should have, and the working design.\n\n0:02:06\tSPEAKER_04\n How the apparatus actually works to fulfill its function.\n\n0:02:09\tSPEAKER_04\n Okay, three presentations.\n\n0:02:11\tSPEAKER_04\n You can go in any order you choose.\n\n0:02:14\tSPEAKER_01\n Should we go in the order that you just did it?\n\n0:02:17\tSPEAKER_03\n Sure.\n\n0:02:18\tSPEAKER_01\n Please do.\n\n0:02:19\tSPEAKER_01\n How do I hook my screen up?\n\n0:02:28\tSPEAKER_02\n I think you might have to dis-extros.\n\n0:02:30\tSPEAKER_02\n Yes, do you?\n\n0:02:31\tNone\n How does it work?\n\n0:02:32\tSPEAKER_00\n How does it work?\n\n0:02:59\tSPEAKER_03\n I hope it's fit.\n\n0:03:02\tNone\n Boowski I think yes.\n\n0:03:04\tNone\n So, this balance here will be a result after this section7.\n\n0:03:06\tSPEAKER_00\n That's a function I think yes.\n\n0:03:10\tNone\n Vite speaker.\n\n0:03:12\tNone\n Blue one.\n\n0:03:13\tSPEAKER_03\n Nothing.\n\n0:03:14\tSPEAKER_03\n one. That's it.\n\n0:03:29\tSPEAKER_04\n Is it plugged in all the way and you screwed it in and...\n\n0:03:32\tSPEAKER_01\n How weird, it's weird.\n\n0:03:34\tSPEAKER_02\n I think you just have to push it in really hard.\n\n0:03:40\tSPEAKER_02\n That's it.\n\n0:03:41\tSPEAKER_03\n Oh, got it.\n\n0:03:42\tSPEAKER_03\n Let's take a little bit.\n\n0:03:44\tSPEAKER_01\n I'm not attached to anything.\n\n0:03:47\tSPEAKER_01\n You do, right?\n\n0:03:49\tSPEAKER_01\n There you go.\n\n0:03:50\tSPEAKER_01\n All right.\n\n0:03:52\tSPEAKER_01\n So, I don't know if you guys are able to get access to the report that was online or if I'm the only one who is.\n\n0:04:00\tSPEAKER_01\n But, I don't even know how to play this.\n\n0:04:07\tSPEAKER_04\n Press the little presentation.\n\n0:04:09\tSPEAKER_04\n It's the... it looks like a Y kind of over there above draw.\n\n0:04:14\tSPEAKER_04\n There. That one.\n\n0:04:16\tSPEAKER_01\n There you go. Right.\n\n0:04:17\tSPEAKER_01\n So, we're just going to talk a little bit about functional requirements that people specified when they were asked.\n\n0:04:23\tSPEAKER_01\n I guess, real reaction did some market research.\n\n0:04:26\tSPEAKER_01\n They had 100 subjects into their usability lab and they watched them, watched TV, and recorded the frequency that they used, particular buttons and the relevance that those buttons had.\n\n0:04:45\tSPEAKER_01\n What they found was they analyzed people's desires and needs.\n\n0:04:49\tSPEAKER_01\n Focusing on their desires, people specifically said that they thought remotes were ugly.\n\n0:04:55\tSPEAKER_01\n 75% of the 100 subjects noted that and that they... more importantly though, 80% said that they would be willing to pay more for a fancier looking remote.\n\n0:05:06\tSPEAKER_01\n I don't know anything beyond what fancy means, but that's particularly of use to us, I think.\n\n0:05:13\tSPEAKER_01\n Also, they did some questions on voice recognition and found that the desire for voice recognition was inversely related to age.\n\n0:05:22\tSPEAKER_01\n So, younger people were more inclined to want something with voice recognition, whereas the older people in the, like, 60 and above segment or so, did not really think that they would pay more money for voice recognition.\n\n0:05:37\tSPEAKER_01\n People also had certain frustrations that I think that we could try to take into consideration with our design, that being people frustrated with losing their remotes.\n\n0:05:51\tSPEAKER_01\n I think over 50% of the people mentioned that that was their biggest frustration.\n\n0:05:56\tSPEAKER_01\n People were also frustrated with the difficulty it is to learn how to use a remote.\n\n0:06:02\tSPEAKER_01\n And I think that ties back to what you were saying before, just that there's too many buttons, it just needs to be easy to use.\n\n0:06:08\tSPEAKER_01\n It also mentioned something called RSI, and I was hoping someone might be able to inform me as to what RSI is.\n\n0:06:14\tSPEAKER_01\n I don't know.\n\n0:06:16\tSPEAKER_00\n What?\n\n0:06:18\tSPEAKER_01\n Ah, there we go.\n\n0:06:21\tSPEAKER_01\n People did not like that, so I guess sort of the carpal tunnel type thing.\n\n0:06:25\tSPEAKER_01\n People did not like that.\n\n0:06:27\tSPEAKER_01\n The repetitive use, I guess, caused a strain.\n\n0:06:30\tSPEAKER_01\n Looking at the needs, people specified.\n\n0:06:33\tSPEAKER_01\n The problem right now is that people's remotes are not matching their operating behavioral.\n\n0:06:38\tSPEAKER_01\n People are only using 10% of the buttons that they have offered to them on their remote.\n\n0:06:46\tSPEAKER_01\n And what people do most often is changing the channel and changing the volume.\n\n0:06:51\tSPEAKER_01\n People also zap, like change the channel, about 65% during an hour of use.\n\n0:06:59\tSPEAKER_01\n So we really just need to focus in on those volumes and channel changers, rather than things like the audio settings, the screen settings, and the channel settings, because they're used much more infrequently and probably complicate what's going on.\n\n0:07:15\tSPEAKER_01\n So I think that something that we might want to think about, the idea of an LCD screen was brought up, although they didn't have any details on what people's preferences on that were.\n\n0:07:25\tSPEAKER_01\n So I don't know if that's coming to me later.\n\n0:07:27\tSPEAKER_01\n I wasn't like that, but something for us to consider.\n\n0:07:29\tSPEAKER_01\n Also, just the phenomenon that lasts is more when it comes to the buttons on their remote or what we want to make easiest to use.\n\n0:07:37\tSPEAKER_01\n Make sure that something like an audio setting isn't given as much importance and visibility on the remote, as something like channel changing, that's used a lot more often.\n\n0:07:48\tSPEAKER_01\n And basically in order for us to win over to the consumer, we just need to focus on what it looks like that it has a fancy appeal and that it's not ugly, and that it feels like the way they're going to use it.\n\n0:08:00\tSPEAKER_01\n So it doesn't give them any hand injuries or things like that.\n\n0:08:05\tSPEAKER_04\n Thank you very much. That was great.\n\n0:08:12\tSPEAKER_04\n Let's move on to the next presentation on effects.\n\n0:08:17\tSPEAKER_04\n So you, great.\n\n0:08:21\tSPEAKER_01\n Can we go up on the spare end?\n\n0:08:28\tSPEAKER_03\n The user interface, right?\n\n0:08:36\tSPEAKER_02\n Oh no.\n\n0:08:44\tSPEAKER_01\n I think that's in the shared. If I did it right, if anyone wants to look at it, I'm going to go ahead and say thank you.\n\n0:09:14\tNone\n Okay.\n\n0:09:21\tSPEAKER_00\n So I'm going to talk about the technical functions design that we're going to make from.\n\n0:09:35\tSPEAKER_00\n We need to start by considering what our remote control actually is. It's a device that allows us to produce certain effects on our television.\n\n0:09:48\tSPEAKER_00\n So it's basically communication device. We tell the remote control what we want to do.\n\n0:09:55\tSPEAKER_00\n So it's an advantage to the television, saying change the channel, change the volume. Yeah, I just need to set in the just the buttons.\n\n0:10:05\tSPEAKER_00\n How do we actually go about designing any television remote control?\n\n0:10:09\tSPEAKER_00\n The first thing to do is to come up with the design specifications.\n\n0:10:13\tSPEAKER_00\n We need to know what our final product is going to be like.\n\n0:10:16\tSPEAKER_00\n So we need a clear idea of exactly what this product does, how it works, and what the end user is going to want to do this product.\n\n0:10:29\tSPEAKER_00\n So a way I'd suggest that we could go about this by designing several different prototypes to use the interfaces for this product. And then trying to get some feedback about how well these particular prototypes work.\n\n0:10:48\tSPEAKER_00\n So by now what people think of them using a remote control is quite a subjective experience. And different people. We should remember that remote controls are a fairly standard piece of equipment when it uses using a remote control.\n\n0:11:09\tSPEAKER_00\n So the future expects the buttons to be in certain places. So in some sense we're going to have to aim for the device which is very conventional in design.\n\n0:11:19\tSPEAKER_00\n So we're not completely shocking people. But I think within that there is also been just to introduce novel ideas and to make something that's perhaps a little bit different from something that stands out.\n\n0:11:34\tSPEAKER_00\n So in designing the user interface we need to consider practicalities. The first of these is technological. What can we do with the current state of technology as it is.\n\n0:11:45\tSPEAKER_00\n The second is economic. We need to find the balance between features and price. So as you mentioned things like waste recognition would add to the price.\n\n0:11:55\tSPEAKER_00\n And we would also need to improve the design of the products. So I have a look on the web to see if I can find a few examples of existing television and make control in analyzing these.\n\n0:12:09\tSPEAKER_00\n We can consider what things what's good about them. What things do they get like what's bad about them. It's wrong with them.\n\n0:12:16\tSPEAKER_00\n How we can improve on the designs that are found. And what can we do to make our products stand out from the large majority of the remote controls.\n\n0:12:28\tSPEAKER_00\n Here's two examples. Probably at the extreme ends of the spectrum. On the left here we've got an engineering based design of the remote control.\n\n0:12:41\tSPEAKER_00\n So it's one that's got lots of buttons. It's fully featured. Everything you might possibly want to do is there. You know it's got forward backwards, up, down, channel numbers, volume, these things.\n\n0:12:53\tSPEAKER_00\n It's fully featured. And it might take a while to get to learn to use it. But once you've learned it, you can do whatever you want with your TV.\n\n0:13:02\tSPEAKER_00\n The one on the right is a lot more basic. It's just got the essential functions of the TV, changing the channel, place, volume. It would be a lot quicker to learn to use it.\n\n0:13:11\tSPEAKER_00\n But again, it swings around about the disadvantages. It can't use it. Say to freeze the television picture. There's a lot of features that are missing from that remote control.\n\n0:13:23\tSPEAKER_00\n So we've got to find our find a way of striking the balance between the two.\n\n0:13:29\tSPEAKER_00\n As I said before, the back control is also objective. Different people want different things.\n\n0:13:36\tSPEAKER_00\n Personally what I want to know about control is a device that's simple. It's easy to use. It's got big buttons for doing the things I do most often, changing the volume, changing the channel.\n\n0:13:49\tSPEAKER_00\n It does everything that I need it to. As I said before, I'm quite lazy. I don't want to walk across the beam just to adjust my television. I also want something that looks cool and that feels like this ergonomically designed.\n\n0:14:07\tSPEAKER_04\n Thank you very much. That was very useful. It's funny to see the drastic difference between those two remotes. Neither of them were very pretty.\n\n0:14:20\tSPEAKER_02\n I think that could be our selling point. Fashion, fashion, the mode, rights.\n\n0:14:26\tSPEAKER_00\n There's certainly a market technology that looks cool. That's my company's app. I really can't see what I'm doing. There it is.\n\n0:14:40\tSPEAKER_02\n I'm looking at it. Showing up already? Did it let you go on the internet? That was just funny.\n\n0:14:57\tSPEAKER_04\n I was like, I'm going to be going to the link. How do I play again? It's right above draw. There are three things. It's with bottom. There are three icons. It's the one that looks like a desk.\n\n0:15:20\tSPEAKER_02\n This is our working design presentation. I had a bit of some issues with this because I wasn't able to find everything I needed.\n\n0:15:30\tSPEAKER_02\n I guess we're still in early stages. The thing about working design is that we're trying to do as a working designer to figure out how the apparatus can fulfill its function.\n\n0:15:45\tSPEAKER_02\n One of the examples that kept coming up for me is that a coffee grinder. It works because it converts electrical energy to grinding the beans.\n\n0:15:54\tSPEAKER_02\n Then put the beans through a filter. That filters out. Then you get coffee at the end. That's nice and hot because of the combination of electrical energy and then other things that are brought in to make it work.\n\n0:16:06\tSPEAKER_02\n I don't know if I'm explaining that very well, but how do I get to the next? The method as working designers figure out what you need to make it fulfill this practical function, what needs to be done, and how do we convert all elements to make that done?\n\n0:16:25\tSPEAKER_02\n The easiest thing to do is to break down all the points at which you need something to happen. You make a schematic of the way that the energy is converted towards this practical function.\n\n0:16:40\tSPEAKER_02\n Then I think the easiest thing to do is work on each task separately.\n\n0:16:50\tSPEAKER_02\n The findings that I got very briefly is that you have a choice of the way that the information is projected to the receiver.\n\n0:17:01\tSPEAKER_02\n In my opinion, infrared is the best way to do that because you don't need a sight line. That's one thing we're going to work on.\n\n0:17:07\tSPEAKER_02\n The user interface is critical here because a lot of the things that happen in a remote control happen through the chip that converts the electrical energy into data, which then goes through the infrared.\n\n0:17:21\tSPEAKER_02\n The chip that I think Ian is designing is going to be crucial. Really, it all comes down to the user because they're the one that's controlling most of the working design.\n\n0:17:31\tSPEAKER_02\n The components that we find here are the energy source, the battery, or whatever that's going to make it work. Then the chip, which converts the data, the user that's controlling the chip, and the infrared bulb that's going to let us move the data to the receiver.\n\n0:17:45\tSPEAKER_02\n So you have four main components, and they are designed sort of like this. You have your energy source right there, which then brings energy or information to the chip, which is also controlled by the user.\n\n0:18:04\tSPEAKER_02\n So you have energy going to the user who is controlling the chip. It's not what I wanted to use. Use that thing down that you can go back previous.\n\n0:18:16\tSPEAKER_02\n Sorry about that, guys.\n\n0:18:19\tSPEAKER_02\n Oh, no, no, no, no, no. Okay, let's just get back to my skin out of care.\n\n0:18:27\tSPEAKER_02\n Double click on it with the right with the left hand one. Yeah, I am. I think it's frozen here. Don't show me that.\n\n0:18:36\tSPEAKER_02\n There we are. Sorry about this, guys. I'm kind of pathetic with things like this.\n\n0:18:42\tSPEAKER_02\n All right, so you have your energy source, your user interface, who's controlling the chip, the chip also uses the energy, and the chip through the use of the user interface is going to control the switch, which will work your infrared bulb, which will then bring the data to the receiver.\n\n0:18:57\tSPEAKER_02\n So hopefully that makes sense for everyone in my kind of garbled way. This is the parts of the working design that need to be figured out.\n\n0:19:07\tSPEAKER_02\n And personal references, besides the fact that I can't spell, we need a long lasting energy source. People don't want to be changing it a lot.\n\n0:19:15\tSPEAKER_02\n We need a chip that works well with the user interface that isn't too complicated.\n\n0:19:21\tSPEAKER_02\n We have straightforward interface like Ian was saying, simple, not overwhelming it with information, and we need a reliable and clear infrared signal, so that you're not waving your remote around it, having to get frustrated and go do it by hands.\n\n0:19:35\tSPEAKER_02\n That's pretty much it for the working design.\n\n0:19:40\tSPEAKER_03\n Excellent.\n\n0:19:47\tSPEAKER_02\n Let's do you think it can give you a hint of this? Yes, absolutely.\n\n0:20:07\tSPEAKER_04\n I can never tell what to turn these things. Lefty Lucy, righty, tidy, right?\n\n0:20:22\tSPEAKER_03\n Yeah. Lefty Lucy, righty, tidy.\n\n0:20:28\tSPEAKER_00\n Oh, yes.\n\n0:20:34\tSPEAKER_00\n I think about every time.\n\n0:20:39\tSPEAKER_04\n It's going to be a lot of fun.\n\n0:20:41\tSPEAKER_04\n It's going to be a lot of fun.\n\n0:20:44\tSPEAKER_03\n Okay.\n\n0:21:06\tSPEAKER_04\n Oh, no, Lucy. Yes. Okay. Requirements. We have a couple of new requirements that I was just emailed right before the meeting that we have to keep in mind as we're creating this.\n\n0:21:18\tSPEAKER_04\n We didn't bring it up yet, or at all in the meetings so far, but we're not going to work with teletext because that's been taken over by the internet, so we're not going to worry about that.\n\n0:21:30\tSPEAKER_04\n That's how it was passed. It's a pressure state. No.\n\n0:21:37\tSPEAKER_00\n Would you care to explain it?\n\n0:21:42\tSPEAKER_00\n We have a number of numbers in the network. We have numbers in the network control. We type in the page number once. We type 100 and we have a control. This kind of index is on the television screen.\n\n0:22:03\tSPEAKER_00\n We have numbers in the network control.\n\n0:22:13\tSPEAKER_02\n We have a lot of numbers in the network.\n\n0:22:33\tSPEAKER_04\n We're not going to work with that.\n\n0:22:44\tSPEAKER_04\n We're also going to, like your question earlier, whether this is going to be for television video or et cetera, just for television.\n\n0:22:51\tSPEAKER_04\n That's what we're focused on. Otherwise, it becomes too complex. We want to get this out very quickly. We only have a short amount of time.\n\n0:23:00\tSPEAKER_04\n Finally, this is more marketing. Our corporate image has to be recognizable. While we're going to make it look pretty, we need to use our color and our slogan in the new design.\n\n0:23:14\tSPEAKER_00\n What's our corporate image like? It's kind of yellow color.\n\n0:23:18\tSPEAKER_04\n It looks like a yellow and black. We have the emphasis on the R's. We put the fashion and electronics. We have to keep that in mind.\n\n0:23:39\tSPEAKER_04\n Maybe some buttons could be yellow. We can play around with it a little bit. We need to talk about our functions and our target group.\n\n0:23:51\tSPEAKER_04\n We decide who our target group is. You, in your analysis of the marketing, identified that different groups wanted different things or had certain preferences.\n\n0:24:01\tSPEAKER_04\n For example, that older people didn't really care for voice recognition, but younger people did. Who are we aiming at?\n\n0:24:15\tSPEAKER_02\n If we're going to say that function of fashion, we put the fashion and electronics, then automatically I think sort of younger group, that's who's going to be attracted to this.\n\n0:24:29\tSPEAKER_04\n We have to think who's going to have the money to buy it. It's going to be 25 euro, remember. It has to be marketable to whoever it is.\n\n0:24:41\tSPEAKER_00\n This is something that's going to be something that's going to be something that's going to be something that's going to be developed in the way that we market.\n\n0:24:50\tSPEAKER_04\n What we're doing is deciding on just the remote itself. It will probably be sold separately. 25 euro by itself.\n\n0:25:00\tSPEAKER_01\n The only breakdown that I was given in terms of age was the voice activation. Basically, there's a big jump after 35. People don't really care if it has voice. It's basically 15 to 35.\n\n0:25:12\tSPEAKER_01\n I don't know if I'm going to be given any other numbers broken down in terms of age later, but if that's the only quality that we have that is divided into age, then we would want to stick between the 15 to 35 range.\n\n0:25:26\tSPEAKER_02\n That's probably a population of quite a little bit of disposable income for use on technology anyway. That might be a fairly good target group for us.\n\n0:25:35\tSPEAKER_04\n Those are all specific for speech recognition. Are we going to use that as one of our functions?\n\n0:25:43\tSPEAKER_00\n I would say no, because it's going to have too many people in the press. Especially if we are marketing, it's something that we can again be doing.\n\n0:25:56\tSPEAKER_00\n But we've got a 5-limit with 12, 12, and a half euro.\n\n0:26:01\tSPEAKER_00\n To produce it?\n\n0:26:02\tSPEAKER_00\n To produce it, yes.\n\n0:26:03\tSPEAKER_00\n I want to get a voice that we mentioned in the 12, and a half euro. We've got nothing to do with another company.\n\n0:26:09\tSPEAKER_01\n But what else are we going to put? I mean, not that I'm really going to hold about it. I don't know what else you can put in a remote to make it technologically advanced though.\n\n0:26:17\tSPEAKER_01\n So other than just making it look good, how is it? I mean, it can look really great and still have the same up and down button than mine, then we're going to buy a new remote.\n\n0:26:26\tSPEAKER_02\n Why are we aiming for a technological advancement? Everything we're talking about is ease of use and simple, and that doesn't necessarily mean more technology.\n\n0:26:36\tSPEAKER_02\n I think it could just be mine. It could mean not. If they might be overwhelmed with remote that have too many buttons and too much technology.\n\n0:26:45\tSPEAKER_01\n If someone's looking to buy a new remote, don't they want like an upgrade? I don't know.\n\n0:26:50\tSPEAKER_04\n Upgrade? Well, we can look at upgrade or we can look at user friendly.\n\n0:26:55\tSPEAKER_02\n Yeah, simplification. It could have a crapper remote that came with our TV that's just impossible to use, or maybe it broke, or maybe they're just missing it.\n\n0:27:05\tSPEAKER_04\n And we also need to talk about if we're only going to have the very simple ones, or also have the other ones just separate somehow.\n\n0:27:15\tSPEAKER_01\n I mean, this might be too complicated, but I wish I had some way to explain it.\n\n0:27:20\tSPEAKER_01\n Like, if it was just a simple either the swear of the swear that had the main buttons and then you could pull something out kind of and you got the rest of the button, but the rest of them went in.\n\n0:27:28\tSPEAKER_00\n Do you know what I'm saying? I can pull out of the side. Yeah, like some TVs that have a smart screen, I'm going to like control the lines of the complicated buttons.\n\n0:27:39\tSPEAKER_00\n But you want to do something complicated, so that you can tell the difference between it and you open up this little hatch, you want to slide it down and then you can just press the button.\n\n0:27:49\tSPEAKER_01\n Because then like people who don't want to ever look at them never even have to see them. And if you get the instruction manual that comes with it and you just don't even read it, then you'll never even know that those things can pull out.\n\n0:28:00\tSPEAKER_01\n And you're a happy person and everyone else doesn't have to have like two remotes, one that has the easy ones and one that has more complicated ones.\n\n0:28:07\tSPEAKER_03\n That's a good idea.\n\n0:28:08\tSPEAKER_04\n We have to be careful that that doesn't impede the chip transmitting information.\n\n0:28:16\tSPEAKER_04\n But that's going to be mostly technological thing.\n\n0:28:23\tSPEAKER_04\n Okay, so what are we emphasizing in this project?\n\n0:28:31\tSPEAKER_04\n Simplicity and fashion.\n\n0:28:34\tSPEAKER_04\n Okay, those are very good goals, I think, that we have to keep in mind with everything we do. Simplicity and fashion and or usability, however you want to say that, which includes an emphasis on making the infrared very functional so that you don't have to travel around a lot.\n\n0:28:55\tSPEAKER_01\n What can you do to make the infrared more functional? Why would it not be? I think it's a lot to do with battery, but that's just my battery.\n\n0:29:06\tSPEAKER_02\n And that I think that the chip takes the data and presents it well without sort of scattering. So it's just the quality of a chip.\n\n0:29:14\tSPEAKER_02\n Yeah, I think so.\n\n0:29:16\tSPEAKER_02\n The quality of all the components really, we can't really do anything. Shall we work? It's going to be a physical tell in the live.\n\n0:29:29\tSPEAKER_04\n So our target group, we're saying 15 to 35?\n\n0:29:33\tSPEAKER_01\n Well, I don't know how useful that number is if we're not doing voice recognition.\n\n0:29:37\tSPEAKER_04\n Which I kind of I kind of feel like voice recognition is not necessary in our remote control. Like it might be necessary for a TV, but not for the remote.\n\n0:29:47\tSPEAKER_04\n Yeah, and it might be too expensive.\n\n0:29:50\tSPEAKER_01\n And if the whole idea is you're using a remote, then why would you have a voice? Like you would need a remote, you would just talk to your TV.\n\n0:29:57\tSPEAKER_01\n Yeah, maybe I mean, if I get more numbers, I'll email you before the next meeting in terms of ages, but this doesn't divide up anything.\n\n0:30:11\tSPEAKER_01\n And there was only 100 subjects also, which isn't, I mean, really, it's not representative, especially if it's 100 subjects, they then can subdivide into age groups.\n\n0:30:20\tSPEAKER_04\n That means a very few in each age group. So I think regardless, we're aiming for the under 65 or something under 65. Okay, that's a good start.\n\n0:30:33\tSPEAKER_04\n I'd say where can we narrow down to maybe teenagers and families?\n\n0:30:40\tSPEAKER_02\n Because that would go up to like 50 professionals or something.\n\n0:30:49\tSPEAKER_04\n It's hard to narrow down.\n\n0:30:52\tSPEAKER_02\n I don't think you're out right now.\n\n0:30:54\tSPEAKER_00\n I think the fact that it's not built across the board by a device, and we said simplicity is one of the features.\n\n0:31:02\tSPEAKER_00\n So it's going to appeal to people. Maybe people who have problems with technology, they don't really get that.\n\n0:31:08\tSPEAKER_00\n Okay.\n\n0:31:09\tSPEAKER_00\n And that might be older people, but then we've also got passion, which is something that definitely is.\n\n0:31:15\tSPEAKER_01\n Well, maybe we don't have to define this hard group by the demographic of the age. We're defined by the demographic of how much money they have to spend or something like that.\n\n0:31:25\tSPEAKER_01\n That's a good one. Obviously, that's to be someone who owns the television.\n\n0:31:28\tSPEAKER_01\n And how recently have they bought their television? Like that sort of thing.\n\n0:31:32\tSPEAKER_04\n So maybe it's more useful to just find objectives, like passion, simplicity, then to find specific target group as far as ages.\n\n0:31:41\tSPEAKER_04\n Because yeah, things will different will appeal to different people.\n\n0:31:46\tSPEAKER_04\n Okay.\n\n0:31:47\tSPEAKER_04\n Oh, there are a couple of functions.\n\n0:31:49\tSPEAKER_04\n Do we want something so that do we want some kind of thing to find it if it's lost?\n\n0:31:56\tSPEAKER_04\n Like a button on the TV, you can press in it or ring or something. I don't know. Like, or beep.\n\n0:32:02\tSPEAKER_01\n I guess I before 50% of the frustration someone could have that was the biggest one and half people said that happened. And we all mentioned it before.\n\n0:32:11\tSPEAKER_01\n We knew about it.\n\n0:32:14\tSPEAKER_01\n And if we're talking about making something easy, that sort of goes along with it. So it wouldn't be like a random thing to sort of add in.\n\n0:32:21\tSPEAKER_01\n It would be relevant like the overall goal.\n\n0:32:25\tSPEAKER_04\n Okay, we have to we have about four minutes left to define our functions. So let's do that quickly.\n\n0:32:31\tSPEAKER_04\n So we want something to keep it from getting lost.\n\n0:32:36\tSPEAKER_04\n And we want.\n\n0:32:43\tSPEAKER_04\n We want large buttons for the essential things.\n\n0:32:46\tSPEAKER_04\n Yeah, large, accessible buttons for the essentials.\n\n0:32:52\tSPEAKER_04\n We want a possibility to get.\n\n0:33:01\tSPEAKER_04\n Possibility to get the extra functions.\n\n0:33:06\tSPEAKER_00\n Which kind of hidden away in some way.\n\n0:33:10\tSPEAKER_00\n We're not hidden.\n\n0:33:13\tSPEAKER_00\n They're not as prominent as the main.\n\n0:33:19\tSPEAKER_04\n Yeah, and we also want it to be fashionable, which I'm not sure if that's a function so much as a.\n\n0:33:30\tSPEAKER_01\n I'm not like an ice or.\n\n0:33:41\tSPEAKER_04\n Do any other essential functions that we need battery? Do we need a long life battery use?\n\n0:33:49\tSPEAKER_02\n Yeah, but I think that goes in with simplicity and ease of use really.\n\n0:33:53\tSPEAKER_01\n But we never have to change that.\n\n0:33:58\tSPEAKER_00\n We should.\n\n0:34:04\tSPEAKER_04\n I would imagine just because it is an electronic device.\n\n0:34:08\tSPEAKER_02\n I think it does. I don't think of a way you can operate a chip and convert that much data without.\n\n0:34:14\tSPEAKER_02\n Without one.\n\n0:34:17\tSPEAKER_02\n But you could maybe have it in a little charging station like a mobile phone.\n\n0:34:20\tSPEAKER_02\n Or like a little cradle for your iPod.\n\n0:34:23\tSPEAKER_02\n Maybe do that instead.\n\n0:34:26\tSPEAKER_02\n So you don't have a rechargeable battery.\n\n0:34:30\tSPEAKER_02\n I don't know. That might contribute to less people losing it too.\n\n0:34:34\tSPEAKER_02\n It stays one place.\n\n0:34:37\tSPEAKER_04\n I think about space in the rooms too.\n\n0:34:40\tSPEAKER_04\n Would you put it on top of the TV?\n\n0:34:43\tSPEAKER_04\n I don't know.\n\n0:34:46\tSPEAKER_02\n Okay, that's a good idea.\n\n0:34:48\tSPEAKER_04\n We'll keep it.\n\n0:34:50\tSPEAKER_04\n Let's just off the top of the head.\n\n0:34:52\tSPEAKER_04\n Okay.\n\n0:34:53\tSPEAKER_04\n We're going to conclude now.\n\n0:34:56\tSPEAKER_04\n As everyone said, their functions.\n\n0:34:58\tSPEAKER_04\n After the meeting, we're going to each complete questionnaire in the summer's summary.\n\n0:35:04\tSPEAKER_04\n And then we'll have our lunch break.\n\n0:35:07\tSPEAKER_04\n After that, we have 30 minutes of individual work.\n\n0:35:10\tSPEAKER_04\n I'll make sure to put the minutes in the project documentation and including this PowerPoint slides.\n\n0:35:15\tSPEAKER_04\n If everyone could do that as well, that'd be great.\n\n0:35:18\tSPEAKER_04\n You have individual actions.\n\n0:35:21\tSPEAKER_04\n ID, industrial design.\n\n0:35:23\tSPEAKER_04\n If your components concept, user interface, the user interface concept, market trend watching.\n\n0:35:31\tSPEAKER_04\n And then you can get specific instructions from your personal coach emailed to you.\n\n0:35:37\tSPEAKER_04\n Hopefully, I hope next time you'll be able to access more of the website that they seem to tell you that you could.\n\n0:35:43\tSPEAKER_04\n It's kind of frustrating, but you should note any frustrations or any issues that come up in your summary.\n\n0:35:57\tSPEAKER_02\n Okay.\n\n0:35:59\tSPEAKER_02\n That sounds good.\n\n0:36:01\tSPEAKER_04\n Great to know.\n\n0:36:03\tSPEAKER_02\n That's good.\n\n0:36:05\tSPEAKER_01\n Did you, um, were you able to, like, put yours in the group folder?\n\n0:36:10\tSPEAKER_02\n Yes.\n\n0:36:11\tSPEAKER_02\n I just did that.\n\n0:36:12\tSPEAKER_02\n Hopefully it is there for people.\n\n0:36:14\tSPEAKER_02\n Yeah.\n\n0:36:15\tNone\n Yeah.\n\n0:36:16\tSPEAKER_04\n It looks like there are, um, looks like there's a second one kind of mine.\n\n0:36:21\tSPEAKER_04\n Yeah.\n\n0:36:22\tSPEAKER_04\n That I didn't do.\n\n0:36:23\tSPEAKER_04\n It's from like an earlier project, I think.\n\n0:36:25\tSPEAKER_04\n So, okay.\n\n0:36:26\tSPEAKER_01\n Where is that?\n\n0:36:28\tSPEAKER_04\n Under the shared folder.\n\n0:36:30\tSPEAKER_04\n I don't know.\n\n0:36:31\tSPEAKER_04\n It might not even be under your.\n\n0:36:32\tSPEAKER_02\n So in there, we have technical functions, presentation, working design, presentation, and the functional requirements.\n\n0:36:38\tSPEAKER_02\n At least that's right.\n\n0:36:39\tSPEAKER_01\n I have three.\n\n0:36:40\tSPEAKER_02\n I just have like R three.\n\n0:36:41\tSPEAKER_02\n Yeah.\n\n0:36:42\tSPEAKER_04\n That's what I have as well.\n\n0:36:43\tSPEAKER_04\n You don't have mine.\n\n0:36:45\tSPEAKER_01\n No, but that's because I think yours is in the email separately.\n\n0:36:48\tSPEAKER_01\n It's not on the server.\n\n0:36:56\tSPEAKER_01\n But if I open it and then save it, probably will be there.\n\n0:36:59\tSPEAKER_01\n I'll wait and I'll remind you can't save.\n\n0:37:05\tSPEAKER_04\n Okay.\n\n0:37:06\tSPEAKER_04\n Well, I'll figure that out in the meantime.\n\n0:37:08\tSPEAKER_04\n Okay.\n\n0:37:09\tSPEAKER_04\n I'm going.\n\n0:37:10\tNone\n Okay.\n\n", "summary": [{"summary_text": "Today is the functional design meeting. It starts at 12-13 and lasts for 40 minutes. Speaker will talk about the general objectives, the three presentations and the new project requirements. He will also make a decision on the route control functions. Boowski, Speaker and Speaker's colleague will dis-extend the presentations."}]}