{"filename": "./data/ES2003a.txt", "transcript": "0:00:00\tSPEAKER_02\n Okay, well I think we're ready to begin.\n\n0:00:03\tSPEAKER_02\n Right, my name's Adnjogged, we're here because of real reaction.\n\n0:00:10\tSPEAKER_02\n We have a new group.\n\n0:00:13\tSPEAKER_01\n Oh, Ebenezer, Ademisoye.\n\n0:00:15\tSPEAKER_01\n You like to support it?\n\n0:00:17\tSPEAKER_02\n Yeah, go for it.\n\n0:00:19\tSPEAKER_02\n Any Z.\n\n0:00:20\tSPEAKER_02\n Any Z.\n\n0:00:21\tSPEAKER_02\n E-R.\n\n0:00:22\tSPEAKER_01\n Ebenezer, and you're ruled as?\n\n0:00:26\tSPEAKER_01\n I'm the marketing expert.\n\n0:00:28\tSPEAKER_02\n Okay.\n\n0:00:29\tSPEAKER_04\n Next we have TireGrammer, T-A-R-I-K, T-R-I-K.\n\n0:00:35\tSPEAKER_04\n And your rule in this is?\n\n0:00:39\tSPEAKER_02\n Industrial designer, industrial designer.\n\n0:00:45\tSPEAKER_02\n And lastly we have Dave Kachren.\n\n0:00:50\tSPEAKER_02\n And you're going to be the user interface.\n\n0:00:54\tSPEAKER_02\n Right, this is the agenda for today's meeting.\n\n0:01:04\tSPEAKER_02\n As you can see, we're opening acquaintance, tool training, project plan, discussion, and closing.\n\n0:01:11\tSPEAKER_02\n We already got through opening and partially through acquaintance.\n\n0:01:15\tSPEAKER_02\n So the reason we're here, we're going to design a new remote control, as you probably all know.\n\n0:01:20\tSPEAKER_02\n The very broad overview is original, trendy, and user friendly.\n\n0:01:24\tSPEAKER_02\n Of course, we'll have to go into a bit more detail in that.\n\n0:01:29\tSPEAKER_02\n But personally, I think that the original is going to be a very key aspect of this design.\n\n0:01:35\tSPEAKER_02\n There's a lot of remote controls out there anyway, so we're going to need something that's really going to set it apart.\n\n0:01:45\tSPEAKER_02\n This is how today seems to be going to work.\n\n0:01:47\tSPEAKER_02\n Now the three-k faces, as you've probably already been told, the functional, conceptual, and the detailed design.\n\n0:01:58\tSPEAKER_02\n The first one is going to be covering the user requirements spec, technical functions, working design.\n\n0:02:03\tSPEAKER_02\n Second, seems to be conceptual components, properties, materials.\n\n0:02:06\tSPEAKER_02\n And the last one is a detailed analysis of our design so far.\n\n0:02:11\tSPEAKER_02\n Of course, you've all got the similar emails, I believe.\n\n0:02:16\tNone\n What can I say?\n\n0:02:17\tSPEAKER_02\n Every user?\n\n0:02:18\tSPEAKER_02\n Do you want to draw your favorite animal?\n\n0:02:22\tSPEAKER_02\n Sure.\n\n0:02:23\tSPEAKER_00\n Whiteboard.\n\n0:02:30\tSPEAKER_00\n Okay.\n\n0:02:32\tSPEAKER_01\n I'll make this quick since we don't have much time.\n\n0:02:49\tNone\n Okay.\n\n0:03:09\tNone\n Okay.\n\n0:03:29\tSPEAKER_01\n So it's not the best picture in the world.\n\n0:03:42\tSPEAKER_01\n Also, elephants have a very good memory, much like myself.\n\n0:03:46\tSPEAKER_01\n And I can't remember back when I used to live in Nigeria, but I think I used to have a pet elephant.\n\n0:03:52\tSPEAKER_01\n So elephants are big, strong, and gentle, and they have great memories, and they began to let it eat, just like I've been using.\n\n0:04:02\tSPEAKER_02\n Brilliantly done.\n\n0:04:03\tSPEAKER_02\n Thank you.\n\n0:04:04\tSPEAKER_02\n Do you like to have a shot at the artistry?\n\n0:04:11\tSPEAKER_04\n Oh, I'm going to take it to your belt.\n\n0:04:17\tSPEAKER_02\n Oh, I think you should also have your little pal mic on as well.\n\n0:04:24\tNone\n Oh, that's good.\n\n0:04:25\tSPEAKER_01\n We can clip them on.\n\n0:04:27\tSPEAKER_01\n Okay.\n\n0:04:28\tSPEAKER_01\n Yeah, there's this microphone as well.\n\n0:04:34\tSPEAKER_01\n Just somewhere.\n\n0:04:44\tSPEAKER_02\n Yeah, it's just across here.\n\n0:04:51\tNone\n Yep.\n\n0:04:54\tSPEAKER_03\n This is what's we clip?\n\n0:05:00\tSPEAKER_02\n Yeah, I'll follow you if you.\n\n0:05:04\tSPEAKER_02\n There you go.\n\n0:05:07\tSPEAKER_02\n You probably just stick it in your pocket for now.\n\n0:05:09\tSPEAKER_02\n I wouldn't worry too much.\n\n0:05:10\tSPEAKER_02\n I'm just going to go back and do it.\n\n0:05:17\tSPEAKER_04\n Yeah, I'm destroying your outfit there.\n\n0:05:24\tNone\n Yeah, I'm just going to go back and do it.\n\n0:05:43\tNone\n Yeah, I'm just going to go back and do it.\n\n0:05:57\tNone\n Yeah, I'm just going to go back and do it.\n\n0:06:16\tSPEAKER_04\n All right, here we have a tiger.\n\n0:06:34\tSPEAKER_04\n I was love tigers.\n\n0:06:38\tSPEAKER_04\n They're big, they're big as cats.\n\n0:06:40\tSPEAKER_04\n They're a project on cats of the wild and as a kid.\n\n0:06:43\tSPEAKER_04\n It was my favourite cat just because it looks the best.\n\n0:06:47\tSPEAKER_04\n The stripes are orange.\n\n0:06:49\tSPEAKER_04\n My dad used to talk about it.\n\n0:06:50\tSPEAKER_04\n He's from Bangladesh.\n\n0:06:51\tSPEAKER_04\n I used to tell me how bad the money is.\n\n0:06:53\tSPEAKER_04\n That was a kid.\n\n0:06:54\tSPEAKER_04\n They're just the most ferocious animals in the wild.\n\n0:07:00\tSPEAKER_04\n That's why I like them.\n\n0:07:03\tSPEAKER_04\n It doesn't say I'm going to let me really pull.\n\n0:07:07\tSPEAKER_02\n Excellent.\n\n0:07:08\tSPEAKER_02\n Thank you, right?\n\n0:07:09\tSPEAKER_02\n I love you if you'd like to have a dash.\n\n0:07:39\tNone\n Thank you.\n\n0:08:09\tNone\n Thank you.\n\n0:08:16\tNone\n Thank you.\n\n0:08:23\tNone\n Thank you.\n\n0:08:52\tSPEAKER_03\n Thank you.\n\n0:09:21\tSPEAKER_03\n Thank you.\n\n0:09:28\tSPEAKER_03\n Thank you.\n\n0:09:35\tSPEAKER_03\n Thank you.\n\n0:09:45\tSPEAKER_03\n Thank you.\n\n0:09:52\tSPEAKER_03\n Thank you.\n\n0:09:55\tSPEAKER_03\n Thank you.\n\n0:10:03\tSPEAKER_00\n Thank you.\n\n0:10:21\tNone\n Thank you.\n\n0:10:36\tSPEAKER_02\n I'll call the best drone in the world, but it'll be for now.\n\n0:10:58\tSPEAKER_02\n I'm not quite as feared as your average tiger, but cats are one of my favourite animals.\n\n0:11:09\tSPEAKER_02\n What can you say?\n\n0:11:11\tSPEAKER_02\n You've got all of those qualities in an animal.\n\n0:11:19\tSPEAKER_02\n We've all managed to master the whiteboard there.\n\n0:11:24\tSPEAKER_02\n So, on to project finance.\n\n0:11:28\tSPEAKER_02\n As you can see, 12.5 euros per unit.\n\n0:11:33\tSPEAKER_02\n That's not a terrible lot as far as I'm aware.\n\n0:11:36\tSPEAKER_02\n We're hoping to sell them for 25.\n\n0:11:38\tSPEAKER_02\n If we're aiming for 50 million euros, we're going to have to be selling an awful lot of them.\n\n0:11:45\tSPEAKER_01\n That was a property.\n\n0:11:48\tSPEAKER_02\n That's the amount made.\n\n0:11:51\tSPEAKER_02\n 50 million, and if you're making 12.5 euros in each one, then awful lot need to be sold.\n\n0:12:00\tSPEAKER_02\n Okay.\n\n0:12:01\tSPEAKER_02\n Now we better just get on with the meat of the project.\n\n0:12:05\tSPEAKER_02\n So, I'm going to guess that we've all used remote controls.\n\n0:12:10\tSPEAKER_02\n Any ideas of where you think a new remote control could go into this market?\n\n0:12:16\tSPEAKER_03\n Well, the thing I'm aware of is that there are a very high price end of the market.\n\n0:12:23\tSPEAKER_03\n There's emerging markets such as touch screen, LCD remote.\n\n0:12:28\tSPEAKER_03\n There can be programmed in much more sophisticated ways, conventional models.\n\n0:12:34\tSPEAKER_03\n So, you can redesign the interface to your own needs.\n\n0:12:41\tSPEAKER_03\n You can program in macros and you get a much greater degree.\n\n0:12:46\tSPEAKER_03\n When you get these three and one five normal transfers, but you can get integration between the different things that is designed to control too much greater extent.\n\n0:12:57\tSPEAKER_03\n You can have one macro to turn the TV to the right channel, rewind the tape and the VCR and get it to play what's this rewind, for instance.\n\n0:13:09\tSPEAKER_03\n Okay.\n\n0:13:12\tSPEAKER_03\n It occurs to me there might be a niche for a remote that aimed towards some of that sort of functionality, but using a conventional push button design.\n\n0:13:26\tSPEAKER_03\n And therefore putting it into a much lower price bracket.\n\n0:13:32\tSPEAKER_02\n Okay, that's true. With the price range we're looking at going for a touch screen would probably possibly be a bit.\n\n0:13:40\tSPEAKER_02\n But you think again, something to control multiple units in a simple fashion.\n\n0:13:45\tSPEAKER_03\n Yeah, I mean, I see you get ones that you can switch between multiple units, but something that could operate between multiple units in a more integrated fashion.\n\n0:13:55\tSPEAKER_03\n And I did something into which would you have some at least limited facility for running macros.\n\n0:14:05\tSPEAKER_02\n Would it be ideal something along the lines of one on button would turn on say the video recorded the TV, maybe the sound system as well on one go.\n\n0:14:13\tSPEAKER_03\n For instance, I say, or you press say the play button for the DVD player and it turns the TV on and on to the right channel as well.\n\n0:14:30\tSPEAKER_02\n Okay, that sounds like a good strong idea.\n\n0:14:37\tSPEAKER_02\n Any takes this.\n\n0:14:39\tSPEAKER_01\n I've noticed that gaming becoming quite popular with television.\n\n0:14:45\tSPEAKER_01\n When I was younger we used to play games using our cable using the cable subscribe cable providers.\n\n0:14:53\tSPEAKER_01\n But our remote controls get worn out really easily.\n\n0:14:56\tSPEAKER_01\n And the remote controls not a great kind of keyboard keypad for playing games.\n\n0:15:02\tSPEAKER_01\n So perhaps one that was more specialized for game playing or interactive television.\n\n0:15:09\tSPEAKER_01\n They recently brought out this new remote control for people to sit their favorite channels to record things.\n\n0:15:17\tSPEAKER_01\n Instead of people entering in what time things start, you simply start a slide of bar to say what time it begins and slide a never bar to say what time it ends.\n\n0:15:27\tSPEAKER_02\n Do you have heard I've seen the barcode design before?\n\n0:15:33\tSPEAKER_01\n It's taken out the you don't have to be really clever to use the remote control.\n\n0:15:37\tSPEAKER_01\n I think the gaming you know you want you want some big buttons for up down left and right shoot.\n\n0:15:44\tSPEAKER_01\n You want to be able to change angles and interactive television.\n\n0:15:48\tSPEAKER_01\n So you need buttons to change the television angle.\n\n0:15:50\tSPEAKER_01\n The camera angles and stuff like that.\n\n0:15:52\tSPEAKER_02\n Okay, well we're beginning to run out of time now. So we've got a couple of ideas we can.\n\n0:15:57\tSPEAKER_02\n We'll have to work fast.\n\n0:16:01\tSPEAKER_02\n All right, as you can see we've got 30 minutes until the next meeting.\n\n0:16:06\tSPEAKER_02\n So we'll have to try and decide on some of the basic functionality.\n\n0:16:10\tSPEAKER_02\n How the user interface might work. That'll be a key aspect, especially if the idea of some kind of macro facility because you have to program it.\n\n0:16:18\tSPEAKER_02\n You have to have a lot of response back or at least some kind.\n\n0:16:26\tSPEAKER_02\n And we're going to maybe try and have to figure out what the user wants.\n\n0:16:31\tSPEAKER_02\n What the user wants. Yes.\n\n0:16:35\tSPEAKER_02\n Right. Has anybody got anything they'd like to add at this stage?\n\n0:16:38\tSPEAKER_02\n Anything you think that might have been missed so far?\n\n0:16:41\tSPEAKER_04\n When you talk about gaming, do you think they should have some sort of stick on it rather than the.\n\n0:16:48\tSPEAKER_04\n Okay, that's like control that's you know of games for.\n\n0:16:53\tSPEAKER_04\n Reset that ridiculous.\n\n0:16:56\tSPEAKER_02\n I don't see why not almost everybody's probably used to a console by now and all of them incorporate small.\n\n0:17:01\tSPEAKER_02\n Deep ads on them. In fact, even the mobile phones these days are beginning to use them as well.\n\n0:17:06\tSPEAKER_02\n It's probably an interface that most people are used to.\n\n0:17:12\tSPEAKER_02\n And that could allow easy navigation users as a joystick as well.\n\n0:17:25\tSPEAKER_03\n And the other key feature that would be a good idea of building it is to make something fairly ergonomic.\n\n0:17:36\tSPEAKER_03\n Fits as comfortably as possible into the hand.\n\n0:17:39\tSPEAKER_03\n Of course, it also allows for the possibility of a more sort of slightly unconventional attractive shape for it overall.\n\n0:17:54\tSPEAKER_02\n So small stylish and something that is a little bit different slightly sort of biomorphic and form.\n\n0:18:03\tSPEAKER_03\n Which it would need to be to sort of conform for the shape of the hand more efficiently anyway.\n\n0:18:08\tSPEAKER_02\n Okay, that's definitely something that we should be able to do quite easily.\n\n0:18:12\tSPEAKER_02\n I would hope so anyway.\n\n0:18:15\tSPEAKER_02\n Right.\n\n0:18:19\tSPEAKER_02\n I'd say we finish this one up, we'll get started. I'll write up what we've kind of quickly done.\n\n0:18:27\tSPEAKER_02\n And I'll get it out to everybody.\n\n0:18:30\tSPEAKER_02\n Yeah.\n\n0:18:32\tNone\n Okay.\n\n0:18:36\tSPEAKER_01\n Very good.\n\n0:18:38\tSPEAKER_02\n As far as I'm aware, we leave the microphones here.\n\n0:18:43\tSPEAKER_02\n So we're going to talk about why we need to stick a laptop for this.\n\n", "summary": [{"summary_text": "Adnjogged, Ebenezer, Ademisoye, Dave Kachren and Speaker are meeting today to discuss the design of a new remote control. Speaker is going to draw a picture of an animal on the white board. The agenda for today's meeting is opening acquaintance, tool training, project plan, discussion, and closing."}]}