{"filename": "./data/ES2015a.txt", "transcript": "0:00:30\tSPEAKER_03\n OK.\n\n0:01:00\tSPEAKER_03\n I thought I did nothing.\n\n0:01:03\tSPEAKER_03\n Okay.\n\n0:01:04\tSPEAKER_03\n Welcome to the meeting everyone.\n\n0:01:07\tSPEAKER_03\n I'm just going to attempt to make this into a slideshow.\n\n0:01:11\tNone\n Sorry guys.\n\n0:01:18\tSPEAKER_03\n I need to be a professor.\n\n0:01:33\tSPEAKER_03\n I did twice.\n\n0:01:38\tSPEAKER_03\n Why it won't?\n\n0:02:03\tSPEAKER_03\n Okay.\n\n0:02:08\tSPEAKER_03\n This is the first meeting for developing a new product.\n\n0:02:15\tSPEAKER_03\n I'm Heather.\n\n0:02:16\tSPEAKER_03\n I'm your project manager.\n\n0:02:21\tSPEAKER_03\n So that was the opening.\n\n0:02:23\tSPEAKER_03\n The first thing we'll do is get acquainted with one another.\n\n0:02:26\tSPEAKER_03\n Everyone can go around and explain their role and their name.\n\n0:02:32\tSPEAKER_00\n Okay.\n\n0:02:33\tSPEAKER_00\n My name is Poppy.\n\n0:02:34\tSPEAKER_00\n I'm the industrial designer's project.\n\n0:02:36\tSPEAKER_00\n I'm going to be responsible for the functional design phase.\n\n0:02:40\tSPEAKER_00\n Also the conceptual design and the detailed design for the final product.\n\n0:02:46\tSPEAKER_03\n Nice to meet you Poppy.\n\n0:02:49\tSPEAKER_02\n My name is Ty.\n\n0:02:50\tSPEAKER_02\n I'm a major intervacier designer.\n\n0:02:53\tSPEAKER_02\n I will also be responsible for the functional design phase, the conceptual design phase and the detailed design phase.\n\n0:03:00\tSPEAKER_02\n I'm a user interface designer.\n\n0:03:03\tSPEAKER_02\n Hi.\n\n0:03:04\tSPEAKER_01\n I'm Jen and I'm the marketing expert.\n\n0:03:07\tSPEAKER_01\n I'm an expert at marketing.\n\n0:03:10\tSPEAKER_01\n I'll be telling you guys about the user requirements specifications for a new product.\n\n0:03:15\tSPEAKER_01\n I'll be doing some trend watching in the conceptual design and product evaluation for the design phase.\n\n0:03:23\tSPEAKER_03\n I'm Heather.\n\n0:03:30\tSPEAKER_03\n Well, you can pretty much read what it is what I'm doing.\n\n0:03:41\tSPEAKER_03\n The tool training is one thing we're going to be doing today as well as planning the project, how we're going to create this product and discuss our aims objectives.\n\n0:03:59\tSPEAKER_03\n Which means I'm starting next subject.\n\n0:04:03\tSPEAKER_03\n As a team we're going to be designing and creating a new kind of remote control.\n\n0:04:10\tSPEAKER_03\n We want this to be a marketable product that can be trendy, completely new style so that it can really appeal to a generation that doesn't want a simple, plain channel changer.\n\n0:04:29\tSPEAKER_03\n It needs to be used or friendly for example for people that can't see the numbers as well or perhaps ergonomic design.\n\n0:04:43\tSPEAKER_00\n This is television remote control.\n\n0:04:45\tSPEAKER_00\n Yes.\n\n0:04:46\tSPEAKER_03\n It's a television remote control.\n\n0:04:53\tSPEAKER_03\n I believe I should be taking minutes on this right now.\n\n0:05:10\tSPEAKER_03\n The way that we're going to go about this is we'll have a time where we can come up with new ideas alone and work on the project and then after we've brainstormed and thought about we can come together in a meeting and discuss what kind of functional design we want to use, same with conceptual design and detailed design.\n\n0:05:36\tSPEAKER_03\n So I'm making sure that it's usable and that it's feasible to create and come up with a concept of what we want it to look like.\n\n0:05:53\tSPEAKER_03\n Tool training.\n\n0:05:54\tSPEAKER_03\n One thing that we're going to do is become more acquainted with the tools that we have access to for our project.\n\n0:06:11\tSPEAKER_03\n One of them is our whiteboard and as a sort of team building moment, I'd like us to try out the whiteboard by expressing our favorite animal and the characteristics of that animal.\n\n0:06:28\tSPEAKER_03\n Why that should be your favorite animal.\n\n0:06:32\tSPEAKER_03\n So I'm assuming that we should do that now.\n\n0:06:42\tSPEAKER_03\n Okay, let's make sure you're that animal.\n\n0:07:03\tSPEAKER_03\n Okay, cool.\n\n0:07:13\tSPEAKER_03\n Right now it is an elk.\n\n0:07:42\tSPEAKER_03\n All you growing out of its head.\n\n0:07:47\tSPEAKER_00\n Do you have elk?\n\n0:07:50\tSPEAKER_00\n Yes.\n\n0:07:51\tSPEAKER_03\n You have moose.\n\n0:07:52\tSPEAKER_03\n You have moose?\n\n0:07:53\tSPEAKER_03\n I mean a deer?\n\n0:07:55\tSPEAKER_03\n Do you have sheep?\n\n0:07:57\tSPEAKER_00\n Yeah, cows.\n\n0:08:04\tSPEAKER_00\n Oh, you have a good artist.\n\n0:08:07\tSPEAKER_03\n This is my very shape.\n\n0:08:14\tSPEAKER_03\n Okay, that's the sketching of my elk.\n\n0:08:17\tSPEAKER_03\n And it is my favorite animal right now because it is a large, beautiful, majestic creature that in a way it looks kind of awkward because it's on spin the legs and it can really overcome harsh terrain.\n\n0:08:34\tSPEAKER_03\n And although it's gorgeous, it's also very dangerous because it has strong antlers and it can really combat its enemies even if it's an herbivore but it can really defend itself.\n\n0:08:54\tSPEAKER_00\n Okay, good.\n\n0:09:10\tSPEAKER_03\n I'm going to take minutes while you guys express your favorite animals.\n\n0:09:17\tSPEAKER_00\n I think animal ever had like all sorts of animals but the moment I'm going to draw a cat in memory of my cat that died in the sun.\n\n0:09:31\tSPEAKER_00\n And it is a strange thing.\n\n0:09:51\tSPEAKER_00\n Not as artistic as Heather's, but I like cats because they're so independent and they always seem to be doing what they want to be doing.\n\n0:10:02\tSPEAKER_00\n But that doesn't mean they're completely not sociable because they enjoy interacting with humans as well and they seem to enjoy the good things like sunshine and running around outside as well as the inside and enjoying the food.\n\n0:10:18\tSPEAKER_00\n Generally, they just seem so cool and they just know what they're doing.\n\n0:10:25\tSPEAKER_00\n I recognize they've got it sorted. They know what they want.\n\n0:10:29\tSPEAKER_00\n They see us like, cat.\n\n0:10:33\tSPEAKER_02\n Yeah. Okay, I think my favorite animal would be a dog but I'm not really sure how he'd draw one.\n\n0:10:50\tSPEAKER_02\n I've never drawn a dog so much.\n\n0:10:53\tSPEAKER_02\n I'm tempted to draw a snail because I draw them. It's going to be a really funny dog because I'm not sure how to draw a dog.\n\n0:11:07\tSPEAKER_00\n Well, they're loads of different types of dogs. Sure, a representative one kind of dog.\n\n0:11:11\tSPEAKER_02\n It's a certain dog.\n\n0:11:15\tSPEAKER_02\n I think it's a scary character.\n\n0:11:25\tSPEAKER_02\n That is not a good dog.\n\n0:11:28\tSPEAKER_02\n We can treat it like a person.\n\n0:11:32\tSPEAKER_02\n Panacchio.\n\n0:11:35\tSPEAKER_02\n He draw a dog. That's supposed to be a dog.\n\n0:11:38\tSPEAKER_02\n Oh my god.\n\n0:11:40\tSPEAKER_02\n I know what it's supposed to be.\n\n0:11:45\tSPEAKER_02\n It's a dog.\n\n0:11:47\tSPEAKER_02\n Okay.\n\n0:11:48\tSPEAKER_02\n I like dogs because they're so good to human.\n\n0:11:53\tSPEAKER_02\n They can be trained to be pretty dogs and see an eye dogs.\n\n0:11:58\tSPEAKER_02\n They're just such friendly animals.\n\n0:12:01\tSPEAKER_02\n They're more of a companion than cats.\n\n0:12:05\tSPEAKER_02\n Cats, cats, cats don't really like me so they can't like me.\n\n0:12:10\tSPEAKER_02\n But they're just so friendly and warm and nice.\n\n0:12:15\tSPEAKER_02\n But don't look like that.\n\n0:12:19\tSPEAKER_01\n Alrighty.\n\n0:12:28\tSPEAKER_01\n I feel like a robot.\n\n0:12:32\tSPEAKER_01\n Well, I guess I had the most time to think about it.\n\n0:12:35\tSPEAKER_01\n I'm going to draw a butterfly.\n\n0:12:37\tSPEAKER_01\n I saw a butterfly yesterday that seemed to be the symbol of spring arriving.\n\n0:12:41\tSPEAKER_01\n It was the prettiest butterfly I've ever seen out in the wild.\n\n0:12:44\tSPEAKER_01\n I thought it was a little pointier than that.\n\n0:12:50\tSPEAKER_01\n At first I thought it was a dead leaf.\n\n0:12:53\tSPEAKER_01\n Then it landed on the wall next to me.\n\n0:12:56\tSPEAKER_01\n This part was all brown and had these big blue dots like this.\n\n0:13:01\tSPEAKER_01\n It was green and red going out like this.\n\n0:13:04\tSPEAKER_01\n It was kind of like a peacock.\n\n0:13:07\tSPEAKER_01\n Yeah, it was actually because this part of the body was really dull.\n\n0:13:10\tSPEAKER_01\n Then it was the most colorful, exotic butterfly ever.\n\n0:13:13\tSPEAKER_01\n I'm like, wow, this is a little Scotland in the marsh.\n\n0:13:16\tSPEAKER_01\n I thought that was pretty cool.\n\n0:13:18\tSPEAKER_01\n I landed by a wall and let me look at it for about two minutes.\n\n0:13:21\tSPEAKER_01\n That's going to be my favorite animal.\n\n0:13:23\tSPEAKER_01\n After all the snow, it seems to say that spring is finally here.\n\n0:13:28\tSPEAKER_01\n Great.\n\n0:13:31\tSPEAKER_03\n Do you hear the eraser buzzing while you do that?\n\n0:13:39\tSPEAKER_03\n Yes, I do.\n\n0:13:42\tSPEAKER_03\n Right.\n\n0:13:46\tSPEAKER_03\n Now that we know how to use the whiteboard.\n\n0:13:52\tSPEAKER_03\n The next thing we need to address is our financial department to meet our budget.\n\n0:14:01\tSPEAKER_03\n We're not meet our budget, but more like what kind of selling range we'll be looking at.\n\n0:14:09\tSPEAKER_03\n I want to make this as a selling price of 25 euros.\n\n0:14:15\tSPEAKER_03\n I want to come up with a way to create a remote control where we can, like the price to create it will be significant.\n\n0:14:29\tSPEAKER_03\n We'd like to make 50 million euro, I'm assuming that's what the end means, and make it for an international market.\n\n0:14:40\tSPEAKER_03\n One thing we'd have to think about internationally is in the design of different kinds of VCRs, things like that, depending on which country you are, another thing for the design team to think about.\n\n0:14:53\tSPEAKER_03\n We want it to cost absolute maximum of 12 euro and 50 cents.\n\n0:15:04\tSPEAKER_01\n We'll have 100% profit then.\n\n0:15:11\tSPEAKER_03\n I'm bad at math.\n\n0:15:15\tSPEAKER_03\n Now that is underway, it is discussion time.\n\n0:15:22\tSPEAKER_03\n This is time for us to bring our initial ideas.\n\n0:15:28\tSPEAKER_03\n I would suggest that you may have so far and your personal experiences with remote controls and areas you see that could be improved in your experience with them.\n\n0:15:42\tSPEAKER_03\n Does anyone have any initial thoughts?\n\n0:15:45\tSPEAKER_01\n I find it in the dark, it's often hard to know what button you're pushing.\n\n0:15:50\tSPEAKER_03\n So it's something we could do to remedy that.\n\n0:15:55\tSPEAKER_00\n I find that in our house, there's no remote control always goes in.\n\n0:16:01\tSPEAKER_00\n It's always worried there's no remote control.\n\n0:16:04\tSPEAKER_00\n So maybe if you could have some kind of tracking device with remote control, or a signal that you could find out where it was, then some kind of alarm you can press a button on your wall.\n\n0:16:16\tSPEAKER_00\n It's a great idea.\n\n0:16:19\tSPEAKER_02\n Do you not find that there's a lot of buttons on your look?\n\n0:16:28\tSPEAKER_00\n Yeah, they don't use hot pads.\n\n0:16:36\tSPEAKER_01\n There's some remote controls where there's kind of a hidden panel.\n\n0:16:39\tSPEAKER_01\n So all those buttons that you don't really use unless you're programming or something, that's useful.\n\n0:16:44\tSPEAKER_01\n So you just have the number buttons, power button, TV video button.\n\n0:16:50\tSPEAKER_03\n Anything about the look of the remote control that you might have ideas about, maybe it could be instead of like a standard rectangular shape, it could be something more interesting.\n\n0:17:06\tSPEAKER_03\n Any ideas we'll do that you have at this point?\n\n0:17:08\tSPEAKER_01\n It could be shaped like a cauch.\n\n0:17:14\tSPEAKER_00\n I could hold it.\n\n0:17:16\tSPEAKER_00\n I would go into a novelty fact, I could say.\n\n0:17:19\tSPEAKER_03\n Well, if it's a trendy original aspect we're going for, you're the designer to decide what kind of direction you want to go in, but at this point in the first meeting you can be any ideas that we just throw out there.\n\n0:17:32\tSPEAKER_00\n So if we're heading to have a huge profit out of this, it needs to be quite a university accepted thing.\n\n0:17:41\tSPEAKER_00\n A novelty thing on my own is sell a few things rather than a general kind of more acceptable.\n\n0:17:48\tSPEAKER_00\n But we don't want to go to a boring place, that one is all right.\n\n0:17:52\tSPEAKER_03\n And key issue here is being trendy and original.\n\n0:17:56\tSPEAKER_03\n That does not necessarily mean it needs to be outrageous.\n\n0:18:01\tSPEAKER_03\n We have five minutes left.\n\n0:18:04\tSPEAKER_03\n So just to cover, we have one more thing, like you can go over your ideas, of course, in your own personal times.\n\n0:18:13\tSPEAKER_03\n Our next meeting will be in half an hour, so you have half an hour to think about what you want to present, or not present, but bring to the meeting.\n\n0:18:24\tSPEAKER_03\n What if that stands for? Industrial designer? Industrial designer? You have to remember these things.\n\n0:18:31\tSPEAKER_03\n You'll be beginning your working design.\n\n0:18:35\tSPEAKER_03\n UID, the technical functions design, will be worked on the next 30 minutes.\n\n0:18:41\tSPEAKER_03\n Let me be how this can be achieved.\n\n0:18:44\tSPEAKER_03\n And we need the user requirements from the marketing expert.\n\n0:18:50\tSPEAKER_03\n You will get specific instructions of what to do in the next half an hour, and I'll see you in half an hour, okay?\n\n0:18:59\tSPEAKER_00\n Thank you.\n\n", "summary": [{"summary_text": "This is the first meeting for developing a new product. Speaker's team is going to create a new TV remote control. Everyone explains their role and their name. They discuss the product specifications and discuss their aims objectives. The tool training is one thing they are going to be doing today."}]}