{"filename": "./data/ES2012d.txt", "transcript": "0:00:00\tSPEAKER_00\n Welcome to the, should be the last of these meetings and it looks like we've done a good job here and we'll just go through the final details.\n\n0:00:25\tSPEAKER_00\n Okay, all the minutes are last meeting and we'll take those as red.\n\n0:00:36\tSPEAKER_00\n Okay, the next thing we'll have a look at the prototype and look at the evaluation criteria and finance and then just tidy up with production and then we can close.\n\n0:00:59\tSPEAKER_00\n So if you'd like to present your proposals.\n\n0:01:05\tSPEAKER_03\n Okay, we basically have the same kind of layout here, it's just you hold it like this and it gets kind of molded to the shape of your hand basically.\n\n0:01:13\tSPEAKER_03\n On the left we've got the scroll for the volume on the right we have buttons for the channels up and down and that kind of so you can hold it and scroll, you can hold it and push.\n\n0:01:25\tSPEAKER_03\n This is the power key, it's kind of like the biggest you know how to turn it on.\n\n0:01:30\tSPEAKER_03\n That's the little menu key.\n\n0:01:32\tSPEAKER_03\n This is the infrared section so you can, it'll be sending rays and if you're you know pointing it like that you can send it or if you hold it up like that it will send it.\n\n0:01:40\tSPEAKER_03\n We've got a microphone there which for all the voice commands you can you know talk to it like that and it will still send.\n\n0:01:48\tSPEAKER_03\n The logo is down there and hers has the cover on it and you can see like it just kind of goes, the red bits, the current kind of goes over everything and then there's holes for the buttons to come through.\n\n0:02:00\tSPEAKER_02\n And so we figured it would be kind of you know a light weight plastic just kind of a light non-descript gray so the people want to buy the covers and then the coverage would be that sort of rubbery material like they make iPod covers so they kind of just struct over.\n\n0:02:14\tSPEAKER_00\n Show me age of it and then we'll like.\n\n0:02:16\tSPEAKER_00\n Yeah, I'll try.\n\n0:02:19\tSPEAKER_02\n But yeah, they're kind of, it's just kind of a rubbery and that way you know spongy like is something that people wanted and it just sort of stretches over and that way I think probably helps protect a little bit too as well.\n\n0:02:30\tSPEAKER_03\n But it's also easier to put on versus like mobile covers you actually have to screw them on and stuff and you kind of sometimes would get someone to do that for you.\n\n0:02:35\tSPEAKER_03\n This is very much easier to stretch over to yourself and it'll be fine.\n\n0:02:39\tSPEAKER_02\n Okay, good.\n\n0:02:40\tSPEAKER_02\n And then the buttons come through and so and then each one of them on the very end will have the logo with a yellow circle on the right.\n\n0:02:49\tSPEAKER_03\n And that'll be the covers as well.\n\n0:02:51\tSPEAKER_00\n Yeah, yeah.\n\n0:02:52\tSPEAKER_00\n I mean it's a detail point.\n\n0:02:54\tSPEAKER_00\n I just want to, I mean, how will people put these down?\n\n0:02:57\tSPEAKER_00\n I wonder.\n\n0:02:58\tSPEAKER_00\n Right.\n\n0:02:59\tSPEAKER_00\n Okay.\n\n0:03:00\tSPEAKER_00\n I decided to just put some strange in the reason I did my mind and they put them down vertically.\n\n0:03:08\tSPEAKER_03\n And we could broaden the, broaden it out a bit so it would stand.\n\n0:03:12\tSPEAKER_00\n You know, because if it's a particular thing, if they're going to have it as a, there was a fashion item.\n\n0:03:16\tSPEAKER_00\n Yeah, standing.\n\n0:03:17\tSPEAKER_00\n I mean, it's just, I mean, it's just a minor detail point.\n\n0:03:21\tSPEAKER_00\n As you say, it's made the base a little bit bigger.\n\n0:03:24\tSPEAKER_00\n Yeah, we just widened out.\n\n0:03:26\tSPEAKER_00\n And they just need another, another logo somewhere.\n\n0:03:28\tSPEAKER_00\n It's all, it just gives people the option and if they've got them, it's basically going to be like, what's the difference?\n\n0:03:38\tSPEAKER_01\n Yeah, yeah.\n\n0:03:39\tSPEAKER_00\n Yeah.\n\n0:03:40\tSPEAKER_00\n Yeah.\n\n0:03:41\tSPEAKER_00\n Yeah.\n\n0:03:42\tSPEAKER_00\n Yeah, I mean, yeah.\n\n0:03:43\tSPEAKER_00\n That's, but that's, but no, the overall, the overall, yeah.\n\n0:03:47\tSPEAKER_00\n Yeah.\n\n0:03:48\tSPEAKER_00\n No, no, no, no.\n\n0:03:49\tSPEAKER_00\n So it's just like, we're right.\n\n0:03:50\tSPEAKER_00\n Yeah.\n\n0:03:51\tSPEAKER_00\n You have to lengthen it so it kind of, your hands still hold it.\n\n0:03:52\tSPEAKER_00\n That's a natural kind of idea.\n\n0:03:53\tSPEAKER_00\n Yeah.\n\n0:03:54\tSPEAKER_03\n Yeah.\n\n0:03:55\tSPEAKER_01\n Or it's like, yeah.\n\n0:03:56\tSPEAKER_01\n Or kind of, like, maybe slightly thinner, yeah, that kind of moves more like, like a, like a floor or a plant.\n\n0:04:03\tSPEAKER_01\n Yeah.\n\n0:04:04\tSPEAKER_01\n Yeah.\n\n0:04:05\tSPEAKER_02\n Yeah.\n\n0:04:06\tSPEAKER_02\n But, so would be balanced.\n\n0:04:07\tSPEAKER_00\n Yeah.\n\n0:04:08\tSPEAKER_00\n Yeah.\n\n0:04:09\tSPEAKER_00\n I mean, it's a final product would actually stand up.\n\n0:04:11\tSPEAKER_00\n Yeah.\n\n0:04:12\tSPEAKER_00\n But, yeah.\n\n0:04:13\tSPEAKER_00\n These were all minor, minor, minor details.\n\n0:04:15\tSPEAKER_00\n I think the basic concept is absolutely bang on.\n\n0:04:20\tSPEAKER_00\n And it certainly meets our criteria of being, you know, looking different.\n\n0:04:24\tSPEAKER_00\n Yeah.\n\n0:04:25\tSPEAKER_00\n So good.\n\n0:04:26\tSPEAKER_00\n That's excellent.\n\n0:04:28\tSPEAKER_00\n Right.\n\n0:04:29\tSPEAKER_00\n Let us, what's on the next one?\n\n0:04:36\tSPEAKER_00\n Oh, right.\n\n0:04:37\tSPEAKER_00\n Yes.\n\n0:04:38\tSPEAKER_00\n Let's have a look at the, the fine ends.\n\n0:04:44\tSPEAKER_00\n Now, we're giving a clear design brief.\n\n0:04:58\tSPEAKER_00\n If I don't get the spreadsheet up.\n\n0:05:05\tNone\n Yeah, yeah.\n\n0:05:08\tSPEAKER_01\n Just click there.\n\n0:05:10\tSPEAKER_01\n Just click there.\n\n0:05:11\tSPEAKER_00\n Yeah, the maximates one.\n\n0:05:12\tSPEAKER_01\n Oh, right.\n\n0:05:13\tSPEAKER_01\n Good.\n\n0:05:14\tSPEAKER_00\n This is why we need to make these things simple.\n\n0:05:18\tSPEAKER_00\n So, yeah.\n\n0:05:19\tSPEAKER_00\n The boss can understand.\n\n0:05:21\tSPEAKER_00\n Now, I've, this is a company's costing for various aspects of design.\n\n0:05:35\tSPEAKER_00\n And I've treated some of these slightly liberally given the constraints placed on us.\n\n0:05:43\tSPEAKER_00\n I've never, for instance, if they require us to have it in the corporate colours, then that is not a special colour.\n\n0:05:51\tSPEAKER_00\n That's a standard colour.\n\n0:05:53\tSPEAKER_00\n So, we're just simply on batteries.\n\n0:05:56\tSPEAKER_00\n The one, the one decision I've had to make is that we, we will have to find a regular standard chip to do this with.\n\n0:06:07\tSPEAKER_00\n And I, I, I'm certain that they, they are around.\n\n0:06:11\tSPEAKER_00\n So, that, I don't think is a serious problem.\n\n0:06:16\tSPEAKER_00\n The, the voice sensor is, is expensive, but we made a basic decision that I was absolutely fundamental to the design.\n\n0:06:25\tSPEAKER_00\n So, that, that has to stay.\n\n0:06:29\tSPEAKER_00\n And again, the, the, the shape of the case means that it's expensive to, to make, because the, the, the double curves, but on the other hand, because of our overall fashion concept, we, we should exceed the, the sales targets.\n\n0:06:48\tSPEAKER_00\n It's simply made of plastic, so that's, that's no problem.\n\n0:06:53\tSPEAKER_00\n And just because the whole, you know, they're the colour of the, the whole thing.\n\n0:06:59\tSPEAKER_00\n That's, there's some cost there.\n\n0:07:04\tSPEAKER_00\n And, where I'm actually going to scroll wheel, we've, we've got push buttons and, and the simple, and, and, and, and, and the, and, and, and the buttons are.\n\n0:07:24\tSPEAKER_00\n Well, I don't know the special colour.\n\n0:07:26\tSPEAKER_00\n Anyway, the, the costings are coming at exactly on target at 12.5.\n\n0:07:31\tSPEAKER_00\n But I think we have a, a very strong case to argue that's, what, what we've got is, is so, and, and, and, and difference that's, um, any, any slight compromise we have to make on, on cost, is offset by the, you know, the, you know, the concept of it being a, a fashion accessory and having to be interchangeable, covers, so, you know, the, if, if, if, if, the management expectors to be technically, I'm going to say that, yeah, again, that's sort of, well, fairly again, technologically innovative, that they, they have to accept that we, we can't operate absolutely within the constraints that they give.\n\n0:08:13\tSPEAKER_00\n So, we, we present this as the, the companies, the companies way forward.\n\n0:08:20\tSPEAKER_00\n And, I think we can argue that we, we have, coming on, on budget.\n\n0:08:31\tSPEAKER_00\n Okay.\n\n0:08:34\tSPEAKER_00\n Uh, so, um, does anybody want to, uh, Andrew, what, what do you want to say about, um, the evaluation, the evaluation, where, where, where, where, where, where, where we're at?\n\n0:08:53\tSPEAKER_01\n The, the, the product, or the project.\n\n0:08:55\tSPEAKER_01\n The, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the product.\n\n0:09:03\tSPEAKER_00\n Um, well, well, my presentation just now.\n\n0:09:07\tSPEAKER_01\n Yep.\n\n0:09:08\tSPEAKER_01\n Sure.\n\n0:09:09\tNone\n Can I get there?\n\n0:09:10\tSPEAKER_01\n Oh, sorry.\n\n0:09:11\tSPEAKER_00\n More of a clicks in the long run.\n\n0:09:29\tSPEAKER_01\n There we go.\n\n0:09:30\tSPEAKER_01\n Oh.\n\n0:09:32\tSPEAKER_01\n Better evaluation.\n\n0:09:42\tSPEAKER_01\n Sounds to solve, from the point that you have the, uh, the consumer and the management.\n\n0:09:45\tSPEAKER_01\n So, what I've been asked to do is on the whiteboard, engage.\n\n0:09:53\tSPEAKER_01\n Our team response.\n\n0:09:55\tSPEAKER_01\n Zoomist questions.\n\n0:10:00\tSPEAKER_01\n On a skill 1-7, 1 being true and 7 being false, 7 being a nice round number to work.\n\n0:10:08\tSPEAKER_01\n Yeah.\n\n0:10:09\tSPEAKER_00\n And then at the end it's taking average 1 foot, true and 7 foot for Flays.\n\n0:10:15\tSPEAKER_01\n Yes.\n\n0:10:16\tSPEAKER_01\n So look at these questions.\n\n0:10:39\tSPEAKER_01\n Is the device flashy and fashionable?\n\n0:10:43\tSPEAKER_03\n Yeah, definitely a 1.\n\n0:10:48\tSPEAKER_01\n So also a technological innovative?\n\n0:10:52\tSPEAKER_01\n Yes, the voice technology indeed.\n\n0:10:59\tSPEAKER_00\n Easy tease.\n\n0:11:00\tSPEAKER_00\n Well, sometimes they may be made it any easier.\n\n0:11:03\tSPEAKER_01\n Suitable for the consumer.\n\n0:11:07\tSPEAKER_01\n How does that mean totally?\n\n0:11:09\tSPEAKER_02\n Yeah, I think it made me mad all of the consumer.\n\n0:11:13\tSPEAKER_03\n Yeah.\n\n0:11:14\tSPEAKER_02\n And ones.\n\n0:11:15\tSPEAKER_01\n Is it complicated?\n\n0:11:18\tSPEAKER_01\n No.\n\n0:11:19\tSPEAKER_01\n Do you have a pretty fast overcome?\n\n0:11:23\tSPEAKER_01\n Functional?\n\n0:11:24\tSPEAKER_03\n Yeah, definitely.\n\n0:11:25\tSPEAKER_00\n Well, I can be with family easily.\n\n0:11:32\tSPEAKER_00\n Yeah, I'm built in the speech class.\n\n0:11:36\tSPEAKER_00\n Where are you?\n\n0:11:37\tSPEAKER_01\n Yeah.\n\n0:11:38\tSPEAKER_00\n Take long to learn to use, shouldn't?\n\n0:11:47\tSPEAKER_01\n And what was the RSI compared to the current standards?\n\n0:11:52\tSPEAKER_01\n Less buttons, sorry, but it was a made it actually.\n\n0:11:56\tSPEAKER_03\n It is.\n\n0:11:57\tSPEAKER_03\n The handle more economically correct as well.\n\n0:11:59\tSPEAKER_00\n Yeah.\n\n0:12:00\tSPEAKER_00\n Oh, yeah.\n\n0:12:01\tSPEAKER_01\n Well, the device is built at all age groups.\n\n0:12:06\tSPEAKER_00\n I think it will, because older people who can't manage the buttons anyway will actually probably like the voice.\n\n0:12:13\tSPEAKER_01\n Yeah, we had the data at the start saying that older people will be less likely to pay extra money, but the increased functionality, the ease of use of the device, make me comfortable.\n\n0:12:25\tSPEAKER_00\n I don't think we're actually charging a particular premium anyway in the end.\n\n0:12:32\tSPEAKER_03\n We will tend to appeal more to younger age groups, because we have gone with the fashion focus and the older people tend to be more conscious of that aspect of it.\n\n0:12:40\tSPEAKER_03\n But I think it's still appeal on a certain level.\n\n0:12:42\tSPEAKER_00\n For different reasons.\n\n0:12:43\tSPEAKER_00\n Yeah, I think it's just simplicity.\n\n0:12:46\tSPEAKER_00\n Yeah.\n\n0:12:47\tSPEAKER_00\n Yeah.\n\n0:12:48\tSPEAKER_00\n So I, yeah.\n\n0:12:49\tSPEAKER_02\n Not having to learn to program and not having a million buzz.\n\n0:12:53\tSPEAKER_00\n I think we can reason we say it's another one.\n\n0:12:56\tSPEAKER_00\n Why not?\n\n0:12:57\tSPEAKER_01\n Can you just click my mouse button to move on to the next page?\n\n0:13:01\tSPEAKER_01\n Yeah.\n\n0:13:02\tSPEAKER_01\n And what?\n\n0:13:03\tSPEAKER_00\n It did we meet the main?\n\n0:13:05\tSPEAKER_00\n In my interpretation of management instructions is, yes, it meets requirements.\n\n0:13:11\tSPEAKER_00\n It's television only.\n\n0:13:12\tSPEAKER_00\n It's simple to use.\n\n0:13:13\tSPEAKER_00\n It's within budget.\n\n0:13:16\tSPEAKER_00\n It's, yes, and any minor points we argue.\n\n0:13:27\tSPEAKER_00\n So I think we've done an amazing job in this.\n\n0:13:33\tSPEAKER_00\n Well done, ask.\n\n0:13:34\tSPEAKER_01\n Come here with a flop.\n\n0:13:35\tSPEAKER_01\n So one, two, three, four, five, six, seven, eight, nine, ten, eleven.\n\n0:13:40\tSPEAKER_01\n Eleven divided by eleven is one.\n\n0:13:43\tSPEAKER_01\n Of course, average of one.\n\n0:13:46\tSPEAKER_00\n We need to calculate it for that.\n\n0:13:57\tSPEAKER_01\n And that roughly concludes my other interpretation of the...\n\n0:14:01\tSPEAKER_01\n Okay.\n\n0:14:02\tSPEAKER_00\n The product.\n\n0:14:03\tSPEAKER_00\n The table.\n\n0:14:04\tSPEAKER_00\n That's it.\n\n0:14:05\tSPEAKER_00\n Right.\n\n0:14:07\tSPEAKER_00\n Do either of you want to say anything?\n\n0:14:19\tSPEAKER_02\n I don't think so.\n\n0:14:20\tSPEAKER_02\n I mean, we worked well together and looked really at what the consumers wanted and what we're trying to make.\n\n0:14:26\tSPEAKER_02\n And, you know, seemed to discuss things pretty well and come to a group consensus.\n\n0:14:33\tSPEAKER_00\n Well, that's right.\n\n0:14:37\tSPEAKER_00\n I mean, this slide here, I mean, the satisfaction with the room for creativity.\n\n0:14:41\tSPEAKER_00\n I mean, I think we've allowed ourselves as much creativity as the product allows.\n\n0:14:47\tSPEAKER_00\n I'm coming on leadership teamwork.\n\n0:14:50\tSPEAKER_00\n I think we've, I think everybody's worked pretty well together.\n\n0:14:56\tSPEAKER_00\n We've just met code with a white board and digital pens.\n\n0:14:59\tSPEAKER_00\n I think the results speak for itself.\n\n0:15:02\tSPEAKER_00\n And the new ideas found, again, you know, given relatively everyday product.\n\n0:15:10\tSPEAKER_00\n Yeah.\n\n0:15:11\tSPEAKER_00\n I think we've very, very effectively come up with a new approach.\n\n0:15:19\tSPEAKER_00\n Of course, within budget, yes, is a project evaluated.\n\n0:15:22\tSPEAKER_00\n We're all happy that it meets all the criteria.\n\n0:15:31\tSPEAKER_00\n Thank you very much indeed.\n\n0:15:33\tSPEAKER_00\n Thank you.\n\n0:15:34\tSPEAKER_00\n I think that's, I think we can go for an early bath.\n\n0:15:40\tSPEAKER_00\n So why call the meeting closed?\n\n0:15:43\tSPEAKER_03\n Okay.\n\n0:15:45\tSPEAKER_00\n Not sure how far ahead of schedule will go over.\n\n", "summary": [{"summary_text": "The last meeting of the project is taking place. Speaker is going to present the final details of the product to the team. They are going to have a look at the prototype, evaluate the evaluation criteria and finance, tidy up with production and then close the project."}]}