{"filename": "./data/ES2014b.txt", "transcript": "0:00:30\tNone\n from the Right.\n\n0:01:02\tSPEAKER_00\n So, where's that PowerPoint presentation?\n\n0:01:16\tSPEAKER_00\n Sorry?\n\n0:01:28\tSPEAKER_00\n Right.\n\n0:01:31\tSPEAKER_00\n So.\n\n0:01:40\tSPEAKER_00\n Okay.\n\n0:01:47\tSPEAKER_00\n So, we've got new project requirements.\n\n0:01:55\tSPEAKER_00\n So, basically we've got three things. We've got 40 minutes in which to, uh, for this meeting to discuss the videos options. Um, three presentations.\n\n0:02:10\tSPEAKER_02\n We have a, I guess we have a presentation. So, I've got one. Yeah.\n\n0:02:14\tSPEAKER_00\n I see. Right. That's nice to know. One from each of you. Um, new project requirements.\n\n0:02:19\tSPEAKER_00\n And so, do we want to do the presentation first or do we want to, um, I got, um, we've used our three things, basically, um, relating to, remote being only for TV. We discussed that last time.\n\n0:02:38\tSPEAKER_00\n And in actual fact, I was pretty, pretty well, but we came up with any way.\n\n0:02:43\tSPEAKER_00\n So, in fact, actually, we'll be full storm in our sense.\n\n0:02:48\tSPEAKER_00\n Um, we've got, uh, teletext outdated. Um, did you get any information on that?\n\n0:02:55\tSPEAKER_00\n Uh, we didn't, uh, right. And the corporate image was the, uh, final thing.\n\n0:03:01\tSPEAKER_00\n So, I got that in email form. Um, right. Okay.\n\n0:03:10\tSPEAKER_00\n So, I guess if we go ahead with the, uh, with the three presentations.\n\n0:03:17\tSPEAKER_00\n So, we'll start with yourself on the basis that, uh,\n\n0:03:23\tSPEAKER_02\n I'll just, um, I'll go up there. Sorry. Yep.\n\n0:03:30\tNone\n Oh. Oh.\n\n0:03:42\tNone\n Oh.\n\n0:03:49\tSPEAKER_03\n Oh.\n\n0:04:02\tSPEAKER_02\n Um, oh.\n\n0:04:21\tSPEAKER_01\n Oh.\n\n0:04:28\tSPEAKER_02\n Okay.\n\n0:04:58\tNone\n Okay.\n\n0:05:05\tSPEAKER_02\n Okay. Um, let's go again.\n\n0:05:14\tSPEAKER_00\n Where's it going?\n\n0:05:19\tSPEAKER_02\n Okay.\n\n0:05:29\tSPEAKER_02\n Okay.\n\n0:05:39\tSPEAKER_02\n Okay. I'm going to be looking at the working design.\n\n0:05:44\tSPEAKER_02\n Um, I've just got three sections. First is the research I made on, uh, and the remote control itself. Um, and then I involves the components required in the, and the systems that design of the actual, uh, actual, um, So, having research, these existing models within the market, um, I've established what the components required for the remote control function, actually, are, and then also the methods in which these components interact together for the remote to actually do what you want to do and how it connects with the television.\n\n0:06:22\tSPEAKER_02\n Um, the basic components are an energy source, which I guess, um, in most of these models will be a battery supply, where that will be sort of two batteries for batteries, um, it may vary.\n\n0:06:35\tSPEAKER_02\n We then have the user interface, which is basically the, like, the, the bussens on the actual remote, um, the various functions is all changing channel, uh, channel up and down one, and then, um, there's also a chip inside the remote, which there's all the computer type things, and then a sender, which, um, is usually, I've found an infrared device, which sends a signal to the actual television.\n\n0:07:06\tSPEAKER_02\n Um, the last part is receiver, which is important in the system, there's not actually part of the remote itself, because that's obviously found in the television.\n\n0:07:15\tSPEAKER_02\n Um, and I've actually drawn the board, because it was a little tricky on PowerPoint to get this work, and so, let's go see there.\n\n0:07:25\tSPEAKER_02\n Do I have a class to wipe the stand with, or?\n\n0:07:29\tSPEAKER_00\n There's the rubber on the right, I think.\n\n0:07:34\tSPEAKER_00\n Okay, we just have magic.\n\n0:07:37\tSPEAKER_02\n Okay, so we start off with a, um, batch, uh, no, a power supply, which probably, it's probably going to be the batch.\n\n0:07:56\tSPEAKER_02\n Um, we then have a particular button, which maybe, we know that it's obviously, there's lots and lots of different buttons, and this is how the basic system works.\n\n0:08:06\tSPEAKER_02\n Um, that sends, if it asks you press out a sensor message to the chip, which, um, then sends, it's sort of in turn, which by new press, then sends the appropriate message to the sender.\n\n0:08:22\tSPEAKER_02\n Um, so that's, um, that's the remote in the self, that's the components of the moan, hand, we're together.\n\n0:08:40\tSPEAKER_02\n So this is the user interface.\n\n0:08:48\tSPEAKER_02\n Um, this is the chip itself, which then sends the sender to us, the, that's the infrared, and then on the set, putting we have on the television, we have a, let's see there.\n\n0:09:09\tSPEAKER_02\n And the sender sends a message to the receiver.\n\n0:09:17\tSPEAKER_00\n So the, the top is the power source, yes.\n\n0:09:20\tSPEAKER_00\n Oh, yes, it's the power source.\n\n0:09:22\tSPEAKER_02\n Okay.\n\n0:09:23\tSPEAKER_02\n Um, screwing on to personal preferences, as I've said, the batch, seems the best option for the actual mode, just because of the size you don't have a cable attached to the remote, otherwise it's not really remote.\n\n0:09:36\tSPEAKER_02\n Um, and then the sender, the infrared, um, has been used quite successfully, if the batch is on, reasonable power, they will seem to work for anyway.\n\n0:09:44\tSPEAKER_02\n They'll have to be pointed directly at the television itself.\n\n0:09:47\tSPEAKER_00\n So the battery is the, in the sender.\n\n0:09:50\tSPEAKER_02\n Okay, and that's it for the moment.\n\n0:09:53\tSPEAKER_02\n Okay.\n\n0:09:54\tNone\n Okay.\n\n0:09:55\tSPEAKER_00\n So, now more design.\n\n0:10:02\tSPEAKER_03\n Thank you.\n\n0:10:06\tSPEAKER_03\n Mine's not quite as complicated as it was last.\n\n0:10:11\tSPEAKER_00\n So, what would I do here?\n\n0:10:14\tSPEAKER_03\n Uh.\n\n0:10:21\tSPEAKER_00\n Control function.\n\n0:10:31\tSPEAKER_00\n Oh.\n\n0:10:32\tSPEAKER_03\n Um, there you go.\n\n0:10:34\tSPEAKER_03\n Okay.\n\n0:10:35\tSPEAKER_03\n So I'm going to talk a bit about the technical functions design.\n\n0:10:38\tSPEAKER_03\n And Louisa, the user interface designer, as you know.\n\n0:10:41\tSPEAKER_03\n Um, so the basic method of this is to send a signal from the remote to the television set, so that the desired function is performed.\n\n0:10:51\tSPEAKER_03\n Um, an example of the function could be to change the volume up or down.\n\n0:10:56\tSPEAKER_03\n Uh, so obviously we need two different buttons for that.\n\n0:10:59\tSPEAKER_03\n Um, to change the channel, either by pressing the number that you want or by channel up or down, um, to switch the television on or off, maybe a standby button.\n\n0:11:09\tSPEAKER_03\n Um, here are two example of the notes.\n\n0:11:12\tSPEAKER_03\n Um, by the look of it, the both have, um, kind of play and fast forward rewind functions.\n\n0:11:18\tSPEAKER_03\n So I think the, in court, we're going to kind of video function, which we won't have to worry about.\n\n0:11:24\tSPEAKER_03\n Um, but as you can see, the left remote is quite, um, quite busy looking, quite complicated, um, where the right remote is much simpler.\n\n0:11:35\tSPEAKER_03\n It looks much more user friendly.\n\n0:11:38\tSPEAKER_03\n Um, so my personal preference would be the right remote.\n\n0:11:42\tSPEAKER_03\n So it's got nice big buttons, it's got a very limited number of buttons.\n\n0:11:46\tSPEAKER_03\n Um, the nice, kind of clearly labeled.\n\n0:11:49\tSPEAKER_03\n Um, I like the use of the kind of, um, symbols, like the triangles and the squares, and the arrows, as well as the words on the, um, kind of play functions and all that.\n\n0:12:00\tSPEAKER_03\n So it's very, very user friendly.\n\n0:12:02\tSPEAKER_03\n And it's got a little splash of colour.\n\n0:12:04\tSPEAKER_03\n Could maybe do a swore colour.\n\n0:12:06\tSPEAKER_00\n Um, well, there's a couple of things there.\n\n0:12:10\tSPEAKER_00\n Um, we have to remember that we have our own, um, nougal and colour scheme.\n\n0:12:18\tSPEAKER_00\n So basically we'd have to, uh, we'd have to be putting that on, um, the, the product.\n\n0:12:27\tSPEAKER_03\n Um, do we get to see that?\n\n0:12:30\tSPEAKER_00\n I haven't as yet.\n\n0:12:33\tSPEAKER_00\n But, uh, I got, uh, I got an email, uh, that basically said to, uh, make sure that, uh, whatever device we come up with at the end of the day had to incorporate, um, the corporate colour and slogan.\n\n0:12:47\tSPEAKER_00\n So, uh, I'm guessing that, uh, I noticed on the bottom there has got, uh, what's that, ap, or, g, e, e, that might be the corporate colour scheme, although we only, we only colour I can see in that as the red.\n\n0:13:09\tSPEAKER_02\n Would you be able to get rid of the, the expense here, the sort of circular section, I'm starting to see for a video as well, we could dispense with that a little bit as well, and just get it down to just the numbers in the volume.\n\n0:13:21\tSPEAKER_02\n What's the basic section like, or a gap of this, yeah, just a little bit, is that, I think that's still in my video, yeah, and I'll pass from there, we could go with that as well.\n\n0:13:29\tSPEAKER_03\n Yeah, and I don't really know, but, um, my numbers, I mean, how often do you use that, no, I think just one six and then channel up and down should be enough.\n\n0:13:39\tSPEAKER_00\n Well, the, the, well, for, for general television purposes, obviously you have channels one to five, at this point in time, and we'd have to have some room for, uh, future such channels.\n\n0:13:53\tSPEAKER_00\n So people used to see us, if we didn't have them, that might have been good.\n\n0:13:57\tSPEAKER_00\n Well, possibly, but the, the other thing is that with them, the current expansion of channels, and the process of taking place, certainly the button up and down, but, I mean, how many channels do we have to, actual television channels? Do we have to prepare for?\n\n0:14:17\tSPEAKER_00\n I would have thought that, uh, the thing is, forever expanding, and, in the moment we've got, although you've got the five standard, you've got the BBC have come up with a further six, and there's, I don't know exactly how many channels there are on, uh, when you take into account, uh, Sky and Vellia Souther, um, Vellia Souther, so I would have thought that we wouldn't, you know, rather than, okay, if the time of flicking from one to other, but presumably it'll take a second, because you have to be able to stop it, maybe you could have a fast forward on the, on the channels that, and then you could dispense with more otherwise.\n\n0:14:57\tSPEAKER_00\n You want, you want to get fairly quickly to the channel that you wanted.\n\n0:15:02\tSPEAKER_03\n Um, some remote tap kind of favourite options, where if you always flick from channel one to channel six, um, if that's a favourite, you just, like, bypass, to the five.\n\n0:15:13\tSPEAKER_00\n Yeah, I suppose in essence you could have, um, if you've got a hundred channels, then if you had sort of an easy way of getting, rather than, I'd go one to a hundred, you could go one to, one to ten, ten to twenty, and then have a certain button to get you, to the actual channel you want, and that would cut down your tone.\n\n0:15:34\tSPEAKER_03\n You know me?\n\n0:15:35\tSPEAKER_03\n But I think a lot of them, like, keep on skydiving stuff, that'll be tuned into one channel, and then you'd have another remote for all of those channels, to get a fifty-five and the higher number.\n\n0:15:45\tSPEAKER_00\n Whatever.\n\n0:15:47\tSPEAKER_00\n Okay.\n\n0:15:48\tSPEAKER_00\n Okay, number to number of buttons, user friendly.\n\n0:15:52\tSPEAKER_03\n Fast forward nine is not really excessive.\n\n0:15:54\tSPEAKER_02\n As a Zoonanian, you've got the, the last one which makes a ten, it's like a multiple times you put them together so you can make any number.\n\n0:16:01\tSPEAKER_02\n So with that, we can bypass any poppers with.\n\n0:16:03\tSPEAKER_00\n Well, that's true, yeah, you could get fifty by five and a zero or whatever, that makes sense.\n\n0:16:07\tSPEAKER_02\n So that facilitates having all of them as good as any.\n\n0:16:10\tSPEAKER_02\n Yeah.\n\n0:16:11\tSPEAKER_00\n That's...\n\n0:16:13\tSPEAKER_00\n So what was the circular thing that you were...\n\n0:16:16\tSPEAKER_03\n I think that's just for a video, so we wouldn't need any battle.\n\n0:16:20\tSPEAKER_03\n So we can get a...\n\n0:16:22\tSPEAKER_00\n If it's just for TV, which is what it is at the moment.\n\n0:16:26\tSPEAKER_02\n So we get a hundred buttons that we got, it's got ten, eleven.\n\n0:16:30\tSPEAKER_02\n We got fourteen that we need, I guess.\n\n0:16:34\tSPEAKER_02\n Which isn't really too many, I'd be quite easy to make any of these guys for a four-week battle.\n\n0:16:39\tSPEAKER_00\n Well, we've got...\n\n0:16:42\tSPEAKER_00\n There's remote for TV only, otherwise project.\n\n0:16:46\tSPEAKER_00\n We've become too complex with which we didn't danger the time to market.\n\n0:16:52\tSPEAKER_00\n It was one of the considerations, I don't know, did you have that information being the marketing?\n\n0:16:57\tSPEAKER_01\n Or was I meant to give you that information?\n\n0:16:59\tSPEAKER_01\n I'm not sure, I had some market information.\n\n0:17:02\tSPEAKER_01\n Right, no, from the company.\n\n0:17:04\tSPEAKER_00\n Right, okay, so basically time to market seems to be important.\n\n0:17:08\tSPEAKER_00\n Therefore, speed of delivery.\n\n0:17:11\tSPEAKER_00\n We've only got about another four hours left.\n\n0:17:16\tSPEAKER_03\n Okay, so is everyone happy with that?\n\n0:17:19\tSPEAKER_03\n I will ask that end of my presentation.\n\n0:17:49\tNone\n I think it was going to happen too.\n\n0:17:56\tNone\n Yeah, I think she said twenty seconds to...\n\n0:18:01\tSPEAKER_02\n I'm sure I'll have my ends to pay.\n\n0:18:06\tSPEAKER_00\n Okay, let me go.\n\n0:18:11\tSPEAKER_01\n Yeah, there we go.\n\n0:18:35\tSPEAKER_01\n Right, we've done some research into the functional requirements that people want out of their remote control.\n\n0:18:42\tSPEAKER_01\n And first of all, we should state that the remote controls were controlling the TV.\n\n0:18:48\tSPEAKER_01\n And how do people use it?\n\n0:18:51\tSPEAKER_01\n We ask them sort of which buttons were useful for them.\n\n0:18:54\tSPEAKER_01\n How does their remote control look and feel for them and what improvements would they like to remote control?\n\n0:19:02\tSPEAKER_01\n And we did that by sort of giving them a questionnaire that we prepared and asking them to fill in the answers.\n\n0:19:09\tSPEAKER_01\n And three quarters of them found that the remote controls were ugly.\n\n0:19:14\tSPEAKER_01\n And that a sort of even higher proportion would spend more or sort of a fancier remote control.\n\n0:19:22\tSPEAKER_01\n And that of all the buttons on the remote control, the sort of setting buttons for sort of the picture and brightness and the audio settings.\n\n0:19:34\tSPEAKER_01\n They weren't used very often at all.\n\n0:19:36\tSPEAKER_01\n People concentrated on the channel buttons and the volume buttons and the power buttons.\n\n0:19:42\tSPEAKER_01\n We also asked them about speech recognition for remote control.\n\n0:19:47\tSPEAKER_01\n And young people were quite receptive to this. But as soon as we got sort of over about into a 35 to 40 age, 45 age group and older, people were quite so keen on speech recognition.\n\n0:20:00\tSPEAKER_01\n There's a lot more older people who didn't know whether they wanted it or not as well.\n\n0:20:07\tSPEAKER_01\n We also asked what frustrated people about remote controls.\n\n0:20:10\tSPEAKER_01\n And the number one frustration was that the remote was lost somewhere else in the room.\n\n0:20:17\tSPEAKER_01\n And they couldn't find it. And the second biggest frustration was that if they got a new remote control, it was difficult to learn all the buttons and all the functions and to find your way around it.\n\n0:20:30\tSPEAKER_01\n So the first one of the references from the marketing is that we need to call it some sort of sleek, sort of good looking, high tech, the design which looks high tech basically.\n\n0:20:45\tSPEAKER_01\n And that we should call it with fewer buttons than most of the controls on the market.\n\n0:20:49\tSPEAKER_01\n And we should sort of concentrate on the channels and the power and also volume.\n\n0:20:55\tSPEAKER_01\n And that's the thing, as Louisa said, we could maybe come up with a menu, sort of an LCD menu for other functions on the remote control, as worth thinking about.\n\n0:21:08\tSPEAKER_01\n And maybe we could think about speech recognition as well because so young people are perhaps the ones that are going to buy our new products if we aim it.\n\n0:21:19\tSPEAKER_01\n And so, you know, sort of a high tech design. That might be the market that we're looking for.\n\n0:21:26\tSPEAKER_01\n And we could maybe think about using speech recognition as always assigned to the control if it was lost in a room rather than sort of having it to just be recognition to change the channel.\n\n0:21:39\tSPEAKER_01\n Because there's a problem with that in that the television makes noise, so it could end up talking to itself and changing its channels.\n\n0:21:51\tSPEAKER_00\n Was that an last wee bit there?\n\n0:21:54\tSPEAKER_01\n About speech recognition. But that was only for young people that preferred that older people didn't...\n\n0:22:09\tSPEAKER_02\n So, you know, you know, you could have a remote control that you can't look to.\n\n0:22:27\tSPEAKER_02\n And then you know, you know, you know, you know, you know, you know, you know, you know, you know, you can use that, you can ring it, maybe you can have some kind of sense, which is kept somewhere where you can just get a buzzer system between the two.\n\n0:22:42\tSPEAKER_01\n Yeah, so you can pass a bell, which is always kept in one place and then it buzzes to you.\n\n0:22:47\tSPEAKER_03\n Yeah, some else. Where if there's no cashiness?\n\n0:22:49\tSPEAKER_03\n Yeah, we'd have to put two products together as well, which is...\n\n0:22:52\tSPEAKER_03\n So, that's what we saw back with something like that.\n\n0:22:57\tSPEAKER_02\n Sounds reasonable.\n\n0:22:58\tSPEAKER_02\n I guess it's an old task to the... or like the same technology could be put inside there.\n\n0:23:03\tSPEAKER_00\n Well, you're trying to avoid having a second product because obviously you could have a second product that gave you the wrong pitch, which we set the remote off to see here and sort of like, you know, without sound recognition.\n\n0:23:14\tSPEAKER_00\n But if you... I know, I'm just going to see a sharp noise, clapping of hand or whatever.\n\n0:23:25\tSPEAKER_00\n You want to try and just have the one product that...\n\n0:23:29\tSPEAKER_02\n Yeah, if we can have it in the actual mode, everything in one...\n\n0:23:36\tSPEAKER_00\n Yeah, I don't know. I mean, obviously, if you've got voice recognition, then you can do it in that way because it will recognize the voice and you can give it a command, a set command, whatever that happened to be.\n\n0:23:51\tSPEAKER_00\n But you think of the point if you're not going with voice recognition then...\n\n0:23:55\tSPEAKER_02\n This is an option to turn it off or...\n\n0:24:00\tSPEAKER_02\n Yeah.\n\n0:24:02\tSPEAKER_02\n So, I've always saw it with problems with the TV because it's because of the remote and the changing of sound.\n\n0:24:07\tSPEAKER_00\n So, any suggestion? Well, any conclusions?\n\n0:24:13\tSPEAKER_01\n Would it take quite a while to sort of develop this feature recognition software in the remote control?\n\n0:24:20\tSPEAKER_00\n If it does, then we can't. It's that simple because we've got three primary requisites from an email that was sent to me whereby we had...\n\n0:24:36\tSPEAKER_00\n The design logo was one, which we've already mentioned.\n\n0:24:39\tSPEAKER_00\n We've got... The remote was only for the television and not for... because that would make it too complex and we have to get it market quickly. And the third thing was that tele-text, as far as the management is concerned, has become outdated due to the popularity of the internet.\n\n0:24:59\tSPEAKER_00\n So, that means that... So, these are the sort of three extra parameters that have been put on this project.\n\n0:25:10\tSPEAKER_00\n So, we're being focused effectively directly at a television and it seems to me that the management is wanting us to go down a narrow path and not opening out.\n\n0:25:22\tSPEAKER_00\n So, anything that is to be added such as voice recognition, etc. has to be very simple and has to be very quick because time to market is critical.\n\n0:25:37\tSPEAKER_02\n But, as we could guess something in which was quite quick and simple, I would give us an advantage of other modes.\n\n0:25:42\tSPEAKER_00\n It would, but probably quick and simple is primary rather than added extras. Added extras would be nice.\n\n0:25:52\tSPEAKER_00\n But, the primary considerations to get the project finished within this short time window, which in fact, when now is sort of four hours.\n\n0:26:02\tSPEAKER_00\n So, and we're going to get to the end. I think first and foremost, we're going to get to the end and then get to the end with some added extras if possible.\n\n0:26:14\tSPEAKER_00\n Okay. One screws this. So, I need to...\n\n0:26:26\tSPEAKER_00\n Right. So, I don't know how long we have left over time. But we have to make the decisions on the remote control functions and how we're planning to proceed so that at the next meeting each person that's got a task to do is clear from this meeting what that task is.\n\n0:26:55\tSPEAKER_00\n And also, when the next meeting is I... so we'll know how long we've got to complete that task.\n\n0:27:02\tSPEAKER_00\n And then we can report back at the next meeting and say, right, okay, yes, we've achieved this or we haven't achieved this. This is how far we've progressed.\n\n0:27:09\tSPEAKER_00\n Does that make reasonable sense?\n\n0:27:13\tSPEAKER_00\n Yeah.\n\n0:27:14\tSPEAKER_00\n So, we have to come effectively to the decision on the remote function so that you can decide what you're going to be doing.\n\n0:27:23\tSPEAKER_00\n And if between the time of this meeting finishing and the next meeting starting, if you get any additional information that only you have at that point in time, you think we'll be relevant to other people in terms of their decision making process then we should communicate that as quickly as possible and not wait until the next meeting.\n\n0:27:46\tSPEAKER_00\n Do it via the email so that rather than coming in on wood.\n\n0:27:51\tSPEAKER_00\n If you get the information just before the next meeting, that's fine. Come along with the next meeting, we can discuss it then and take whatever actions appropriate.\n\n0:27:58\tSPEAKER_00\n But if you get it well before the next meeting, let everybody else know because that might have an impact on what they come up with effectively at that next meeting.\n\n0:28:10\tNone\n Okay.\n\n0:28:11\tSPEAKER_00\n All right, as I...\n\n0:28:13\tSPEAKER_01\n So, do we need to decide on the functions?\n\n0:28:16\tSPEAKER_00\n I would guess so.\n\n0:28:19\tSPEAKER_03\n I think it would be really easy, a big advantage if we did have some sort of kind of whistle-bath and kind of function.\n\n0:28:28\tSPEAKER_03\n Yeah.\n\n0:28:29\tSPEAKER_03\n Because I also kind of... the frustration of losing it.\n\n0:28:31\tSPEAKER_01\n Yeah, that was the number one sort of frustration people said.\n\n0:28:34\tSPEAKER_01\n So, I don't think there's anything else on the market that does that.\n\n0:28:38\tSPEAKER_03\n Yeah.\n\n0:28:40\tSPEAKER_03\n I don't really know about the voice recognition thing.\n\n0:28:44\tSPEAKER_02\n Well, we should concentrate just in the whistle-bath.\n\n0:28:50\tSPEAKER_00\n Something simple.\n\n0:28:51\tSPEAKER_00\n If the primary consideration is to get it there in time, time short, you want something to meet the major concerns of the consumer so that we can have it as a selling point for the product.\n\n0:29:03\tSPEAKER_00\n Something that's quick and simple.\n\n0:29:06\tSPEAKER_00\n Yeah.\n\n0:29:07\tSPEAKER_03\n And that won't be cut off the kind of older generation either because several good whistle-baths and they wouldn't have to be kind of scared of this, we tend to be too strong.\n\n0:29:13\tSPEAKER_00\n So, maybe a clap rather than a whistle would be on the basis that if we've got...\n\n0:29:21\tSPEAKER_00\n If we're catering to the whole age range, you want something that's easy to do.\n\n0:29:25\tSPEAKER_00\n You know, something that...\n\n0:29:26\tSPEAKER_00\n Well, I don't know.\n\n0:29:29\tSPEAKER_00\n Well, if you think that more people can whistle than clap, then that's fine.\n\n0:29:32\tSPEAKER_00\n Then go for that option.\n\n0:29:33\tSPEAKER_00\n But if I would have put that more people could clap rather than whistle.\n\n0:29:37\tSPEAKER_00\n So, clap option.\n\n0:29:39\tSPEAKER_00\n Yeah.\n\n0:29:49\tSPEAKER_00\n Okay.\n\n0:29:50\tSPEAKER_03\n We already decided that we don't need a teletext, but we haven't yet.\n\n0:29:54\tSPEAKER_00\n Effectively, that's what they're saying.\n\n0:29:57\tSPEAKER_00\n If people are now using the internet, then you don't need teletext.\n\n0:30:01\tSPEAKER_00\n So, take out teletext.\n\n0:30:04\tSPEAKER_02\n Can we decide on having the 10 numbers and then...\n\n0:30:09\tSPEAKER_02\n Yeah, thanks.\n\n0:30:10\tSPEAKER_02\n...and we'll get you next year, which can enable to put things down.\n\n0:30:13\tSPEAKER_01\n I think nowadays you can just get ones where it gives you a sort of a second or two to press another number.\n\n0:30:19\tNone\n Yeah.\n\n0:30:19\tSPEAKER_01\n So, you can press any two and it all sort of put them together.\n\n0:30:23\tSPEAKER_02\n Okay, 10 numbers and then some kind of device to...\n\n0:30:26\tSPEAKER_02\n Yeah.\n\n0:30:27\tSPEAKER_02\n I'll put delay to...\n\n0:30:29\tSPEAKER_02\n Yeah.\n\n0:30:30\tSPEAKER_02\n More for them.\n\n0:30:32\tSPEAKER_02\n More for future.\n\n0:30:34\tSPEAKER_04\n Yeah.\n\n0:30:35\tSPEAKER_02\n Do we decide anything about the other functions?\n\n0:30:41\tSPEAKER_02\n It's in setting the audio and tuning it and stuff like that.\n\n0:30:46\tSPEAKER_02\n You had an idea about the menu?\n\n0:30:48\tSPEAKER_01\n We could possibly put it out there, sort of, the LCD menu in, but that again is probably an expense that...\n\n0:30:56\tSPEAKER_02\n We're just thinking people probably...\n\n0:30:58\tSPEAKER_02\n I mean, you don't have to put the two to the UE1s, but you have to be able to tune it that once.\n\n0:31:01\tSPEAKER_02\n Yeah.\n\n0:31:02\tSPEAKER_02\n So, in a TV break, you're only going to have to be able to tune it.\n\n0:31:06\tSPEAKER_02\n You can't really avoid that.\n\n0:31:07\tSPEAKER_02\n No.\n\n0:31:08\tSPEAKER_02\n You decide when you dish the markets which do it by themselves.\n\n0:31:11\tSPEAKER_00\n But that's relying on the television market changing to an automatic.\n\n0:31:17\tSPEAKER_00\n And if it is at the moment, that's fine, but at the moment it's not.\n\n0:31:21\tSPEAKER_00\n So, it seems to me that you have to have a device that caters, because otherwise it would make it...\n\n0:31:27\tSPEAKER_00\n Your device would become, you know, prouble or only operable in certain circumstances.\n\n0:31:32\tSPEAKER_00\n And the idea is to have an international market, which is...\n\n0:31:36\tSPEAKER_00\n And it's also...\n\n0:31:38\tSPEAKER_00\n The product we've got is something that's the...\n\n0:31:41\tSPEAKER_00\n I would have said the lower end of the cost scale, so we're not really going for something that's...\n\n0:31:48\tSPEAKER_00\n I suppose...\n\n0:31:49\tSPEAKER_01\n To have a high tick.\n\n0:31:50\tSPEAKER_01\n If people are buying remotes, then they're probably buying it through a place.\n\n0:31:54\tSPEAKER_01\n Another remote.\n\n0:31:55\tSPEAKER_01\n Possibly. Most tellies come with remotes.\n\n0:31:57\tSPEAKER_01\n That's right.\n\n0:31:58\tSPEAKER_01\n I mean, we're maybe talking about replacing remotes for slightly older television.\n\n0:32:02\tSPEAKER_01\n So, we maybe need to keep the tuning functioning.\n\n0:32:06\tSPEAKER_02\n Yeah.\n\n0:32:07\tSPEAKER_02\n So, how does manufacturing work with you?\n\n0:32:08\tSPEAKER_02\n Maybe you have like one menu person, then you use the other buttons.\n\n0:32:11\tSPEAKER_02\n And then the buttons, to actually use that function.\n\n0:32:14\tSPEAKER_02\n Yeah.\n\n0:32:15\tSPEAKER_03\n That's a big good idea.\n\n0:32:16\tSPEAKER_03\n Yeah.\n\n0:32:17\tSPEAKER_03\n Because you do need a kind of brightness and contrast, everything as well.\n\n0:32:21\tSPEAKER_03\n My dad's watching the film the other week, when it was too dark.\n\n0:32:24\tSPEAKER_03\n So, I had to go through it to the right myself.\n\n0:32:27\tSPEAKER_02\n So, usually we're going to have the individual numbers, then the menu function, and maybe sort of slightly more advanced instruction booklets, with it to guide.\n\n0:32:36\tSPEAKER_02\n I think it'd be quite hard just for people to grasp.\n\n0:32:40\tSPEAKER_02\n Just stuff like the menu that you use, the different buttons, really have to have some better instructions.\n\n0:32:45\tSPEAKER_01\n Yeah, that's the way it.\n\n0:32:47\tSPEAKER_01\n I'm not sure whether sort of having people have a booklet.\n\n0:32:50\tSPEAKER_01\n Because the second most annoying thing that people found was to learn.\n\n0:32:53\tSPEAKER_01\n The new one.\n\n0:32:54\tSPEAKER_01\n Right, okay.\n\n0:32:55\tSPEAKER_01\n So, maybe next to each of the buttons, each of them could have a number, and then also a function that next to it.\n\n0:33:02\tSPEAKER_01\n So, you're basically messing.\n\n0:33:04\tSPEAKER_02\n But that also goes back to the original design of sort of those two.\n\n0:33:07\tSPEAKER_02\n And it was all in the left hand side, which had a way to double function and stuff, which kind of looked too busy.\n\n0:33:12\tSPEAKER_02\n And I'm trying to show it, so.\n\n0:33:14\tSPEAKER_02\n Well, okay.\n\n0:33:15\tSPEAKER_03\n Well.\n\n0:33:16\tSPEAKER_03\n It's a bit sweet and sexy as well.\n\n0:33:18\tSPEAKER_03\n Have you seen the little portrait of kind of, um, that's a very good idea.\n\n0:33:23\tSPEAKER_03\n So, it's so sad.\n\n0:33:24\tSPEAKER_02\n So, you keep, um, we've got five minutes before we wind up.\n\n0:33:29\tSPEAKER_00\n There's meetings, so I've been told.\n\n0:33:31\tSPEAKER_00\n I don't know if you've got the same.\n\n0:33:33\tSPEAKER_00\n I don't quite know.\n\n0:33:34\tSPEAKER_00\n Okay.\n\n0:33:35\tSPEAKER_00\n So, so keep, um, keep detailed functions.\n\n0:33:44\tSPEAKER_00\n Um, hidden at the back.\n\n0:33:51\tSPEAKER_03\n And that would be better for all the generations as well, because.\n\n0:33:55\tSPEAKER_03\n Well, my dad doesn't like anybody kind of picture it, but it's pretty much read a button.\n\n0:34:01\tSPEAKER_03\n So, it's a weird problem.\n\n0:34:03\tSPEAKER_02\n So, um, we're going to have to have to work out what's going to be on these other functions as well.\n\n0:34:08\tSPEAKER_02\n So, we're going to have like two separate.\n\n0:34:10\tSPEAKER_02\n That's right.\n\n0:34:11\tSPEAKER_02\n Two separate lists.\n\n0:34:12\tSPEAKER_02\n Yeah.\n\n0:34:14\tSPEAKER_00\n You do have functions hidden at back.\n\n0:34:16\tSPEAKER_00\n Can bring out when needed.\n\n0:34:18\tSPEAKER_01\n The detailed ones will be sort of brightness.\n\n0:34:23\tSPEAKER_00\n Oh, that's right.\n\n0:34:24\tSPEAKER_00\n So, we're, this, so you've got which ones are going to be on the front?\n\n0:34:27\tSPEAKER_00\n Which ones are going to be at the back?\n\n0:34:29\tSPEAKER_02\n So, we have to decide.\n\n0:34:30\tSPEAKER_02\n Which one's the next couple of minutes?\n\n0:34:32\tSPEAKER_02\n Yeah.\n\n0:34:33\tSPEAKER_00\n Yeah, so.\n\n0:34:34\tSPEAKER_00\n So, on the front.\n\n0:34:38\tSPEAKER_02\n The numbers.\n\n0:34:42\tSPEAKER_02\n And the volume.\n\n0:34:44\tSPEAKER_02\n Oh, the volume.\n\n0:34:46\tSPEAKER_02\n If you have a mute button as well.\n\n0:34:48\tSPEAKER_02\n Sorry?\n\n0:34:49\tSPEAKER_02\n A mute button as well.\n\n0:34:51\tSPEAKER_04\n Yeah.\n\n0:34:52\tSPEAKER_04\n Yeah.\n\n0:34:53\tSPEAKER_04\n Oh.\n\n0:34:54\tSPEAKER_01\n And it's probably power as well.\n\n0:35:02\tSPEAKER_03\n I don't really like, um, not an issue to me.\n\n0:35:06\tSPEAKER_03\n Yeah.\n\n0:35:08\tSPEAKER_03\n But, um, the whole thing about not using standby.\n\n0:35:10\tSPEAKER_03\n Uh, because of, uh, like, with electricity.\n\n0:35:12\tSPEAKER_03\n And it hasn't even been added.\n\n0:35:14\tSPEAKER_03\n Like, if you boil the kettle, that's for us.\n\n0:35:16\tSPEAKER_03\n Yeah.\n\n0:35:17\tSPEAKER_03\n Because it's standby.\n\n0:35:18\tSPEAKER_03\n It powers black door for us to get a lot of cash.\n\n0:35:20\tSPEAKER_03\n So, should we really try to discourage people from standby?\n\n0:35:22\tSPEAKER_02\n But then the minor biop thing haven't gone.\n\n0:35:24\tSPEAKER_02\n Yeah.\n\n0:35:25\tSPEAKER_03\n Yeah.\n\n0:35:26\tSPEAKER_03\n Maybe two or two big issues for us.\n\n0:35:27\tSPEAKER_03\n Yeah.\n\n0:35:28\tSPEAKER_00\n So, so you're having to stand by on the front, then?\n\n0:35:32\tSPEAKER_03\n I think you probably should.\n\n0:35:33\tSPEAKER_03\n Yeah.\n\n0:35:34\tSPEAKER_03\n Yeah.\n\n0:35:36\tSPEAKER_03\n Well.\n\n0:35:37\tSPEAKER_02\n And we're going to have a channel up and down as well as a number of letters.\n\n0:35:42\tSPEAKER_01\n Um, because, yeah, the market research said there was quite a lot of people do just zap around.\n\n0:35:48\tSPEAKER_01\n Yeah.\n\n0:35:49\tSPEAKER_03\n Flicks.\n\n0:35:50\tSPEAKER_02\n So you've got 10, 10, 10, 10.\n\n0:35:54\tSPEAKER_02\n So, you've got 16.\n\n0:35:56\tSPEAKER_00\n Uh, channel down.\n\n0:35:58\tSPEAKER_00\n What else we got?\n\n0:35:59\tSPEAKER_00\n What was that?\n\n0:36:00\tSPEAKER_01\n Sixth number.\n\n0:36:01\tSPEAKER_01\n Volume is volume button.\n\n0:36:05\tSPEAKER_01\n How many volumes?\n\n0:36:07\tSPEAKER_01\n One up, one down.\n\n0:36:09\tSPEAKER_00\n Okay.\n\n0:36:10\tSPEAKER_03\n On you.\n\n0:36:12\tSPEAKER_01\n That's 16.\n\n0:36:14\tSPEAKER_01\n Anything else?\n\n0:36:15\tSPEAKER_02\n Um, I don't think so.\n\n0:36:19\tSPEAKER_00\n Probably what I'm standing by.\n\n0:36:22\tSPEAKER_00\n Channel up and down.\n\n0:36:24\tSPEAKER_00\n So, is that it?\n\n0:36:25\tSPEAKER_00\n Yeah, she's saying.\n\n0:36:26\tSPEAKER_00\n Okay.\n\n0:36:27\tSPEAKER_00\n And it's 16 button, Jurek and.\n\n0:36:29\tSPEAKER_00\n And then in the back.\n\n0:36:32\tSPEAKER_01\n You've got brightness and contrast.\n\n0:36:37\tSPEAKER_02\n Maybe we're going to run out of time, one of Ishikmo, the list of these and then get back.\n\n0:36:42\tSPEAKER_02\n And the next meeting, just at the start.\n\n0:36:44\tSPEAKER_02\n Okay.\n\n0:36:45\tSPEAKER_00\n So on the back.\n\n0:36:47\tSPEAKER_00\n I love brightness contrast.\n\n0:36:50\tSPEAKER_00\n Anything else?\n\n0:36:51\tSPEAKER_00\n You're also going to have the channel tuner in her.\n\n0:36:54\tSPEAKER_00\n How's it where?\n\n0:36:55\tSPEAKER_02\n She, uh, up and down.\n\n0:36:57\tSPEAKER_00\n Tuner with that.\n\n0:37:00\tSPEAKER_02\n I'm down.\n\n0:37:03\tSPEAKER_02\n Okay.\n\n0:37:04\tSPEAKER_02\n Okay.\n\n0:37:06\tSPEAKER_01\n And then maybe sort of an end to the button.\n\n0:37:11\tSPEAKER_01\n Sort of, you know, saying that you want that particular thing tuned in.\n\n0:37:17\tSPEAKER_01\n So you go up and down and then it.\n\n0:37:19\tSPEAKER_01\n Oh, yeah.\n\n0:37:20\tSPEAKER_01\n And then you want to just select.\n\n0:37:23\tSPEAKER_02\n Okay.\n\n0:37:28\tSPEAKER_02\n I guess the keeping is important.\n\n0:37:30\tSPEAKER_02\n And the other one, you know, function, because it's just.\n\n0:37:33\tSPEAKER_02\n Oh, yeah, I would have.\n\n0:37:36\tSPEAKER_03\n Yeah.\n\n0:37:37\tSPEAKER_03\n So I think there.\n\n0:37:40\tSPEAKER_03\n There's quite a lot of like doggies around.\n\n0:37:42\tSPEAKER_03\n So do you.\n\n0:37:43\tSPEAKER_03\n So there's sort of things.\n\n0:37:44\tSPEAKER_02\n Yeah.\n\n0:37:45\tSPEAKER_02\n So they have their own controls on their actual products.\n\n0:37:48\tSPEAKER_02\n Or do you have to do a via the.\n\n0:37:51\tSPEAKER_03\n Um, I think we've got the whole country in this kind of like hidden panel.\n\n0:37:55\tSPEAKER_02\n As we've got the, I think, other own controls and we've been avoided.\n\n0:37:58\tSPEAKER_02\n Yeah.\n\n0:37:59\tSPEAKER_02\n Yeah.\n\n0:38:00\tSPEAKER_03\n Oh, no, I mean, um, like this kind of individual.\n\n0:38:03\tSPEAKER_03\n Okay.\n\n0:38:04\tSPEAKER_03\n Like on TV.\n\n0:38:06\tSPEAKER_03\n But I don't know.\n\n0:38:07\tSPEAKER_03\n I don't know.\n\n0:38:08\tSPEAKER_03\n Maybe unless.\n\n0:38:10\tSPEAKER_02\n Maybe unless.\n\n0:38:11\tSPEAKER_00\n Well, you might get some research.\n\n0:38:16\tSPEAKER_02\n We should look into that.\n\n0:38:18\tSPEAKER_02\n And then.\n\n0:38:19\tSPEAKER_00\n Okay. Right.\n\n0:38:21\tSPEAKER_00\n So I'll do the minutes of this meeting.\n\n0:38:24\tSPEAKER_00\n And we'll meet back.\n\n0:38:27\tSPEAKER_00\n I'm not sure.\n\n0:38:29\tSPEAKER_00\n 40 minutes.\n\n0:38:30\tSPEAKER_00\n I believe is the time.\n\n0:38:34\tSPEAKER_01\n Okay.\n\n0:38:36\tSPEAKER_00\n Okay.\n\n", "summary": [{"summary_text": "There are new project requirements for Speaker's project. They have to prepare three presentations. Speaker is going to start with the presentations and then he will look at the working design of the remote control. He will then go up to the stage and introduce himself. "}]}