{"filename": "./data/ES2013d.txt", "transcript": "0:00:00\tSPEAKER_04\n I'm almost, there's one more thing I have to get out of the, I have to make sure that this attachment will open. Okay, we'll open that one times right in the meantime, closing things down. Okay, let's see what this thing does. Let's see what this thing does. Let's do one of them. What? We came up together. We're good. Okay, are we ready to start? Okay, it's now quarter of four. This is another 40 minute one, so it will end at 425. Okay. Right, our agenda is as before, from you to open the meeting for us to go over the previous minutes, then for the two of you to present your prototype and for you to, um, Sarah present the evaluation criteria. We then have a finance aspect, which is a spreadsheet, an Excel spreadsheet. And I know what you're all thinking of, oh my, um, because we're only given a 40 minute time period to get it all in, including the production evaluation. So we're going to make a very fast track. Okay. Um, and as you can see, that's what we do next on this thing. So the first thing I have to do is close this so that I can get to where is it? Right. I need to open the mind. Not the agenda. Agenda three. No, that I want the minutes from the previous minutes. That should be the minutes. Yeah. Okay. Um, from meeting three, is it all right with you if I don't switch it to show, just use it as is, because this way I can more easily flip it. Okay. Um, obviously all of us were here for the last meeting. We reviewed the previous minutes before that. Um, each of you major presentations. Um, we discussed the various possibilities based on what was presented in those presentations. The market trend of fruit and veg, um, spongy, uh, fancy and elegant more than technologically innovative and that more than easy. Um, we decided chip one print would be used. Um, we would use plastic with a rubber casing, I think was the consensus powered by kinetic energy.\n\n0:04:10\tSPEAKER_04\n There was no decision made on a curvature or double curvature or straight. Um, perhaps the prototype will give us an inkling of that. Um, looking like a scroll, but it's really a push button technology. Excuse my spelling. Um, that was actually in use. That is behind the scenes is push button, which we, uh, according to Kate have a very good, uh, grasp on doing that in production. Um, we decided that separate fashionable covers covering your fruit and veg might be a separate product that could be suggested to management. Um, and as suggested, um, yellow with black buttons with a company logo, a slogan and image might be a good idea based on the requirements that have been provided to us. Um, we did have a few products and production issues and coordination of the various bits. And we had some conflict of ideas and cost constraints and we ran out of time. Um, we had to follow that up and prepare for the last one and I, we closed as it ran out of time. Is that a fair presentation of what happened? Okay, back to this meeting. Um, we're down to the prototype presentation.\n\n0:05:43\tSPEAKER_04\n Alright, over to you. Well, two. Yeah, well, we see we made one. We didn't have enough\n\n0:05:54\tSPEAKER_00\n yellow dough. This is one that I made. Uh-huh. It says, uh, curved, easy to hold, handheld, nice and small with big, easy buttons. This is like a scroll, but they are push buttons and the enter takes you into the different menus. Of course, we need someone who's experienced with the television satellite. I mean, this is an infrared thing that's going to zap at the television. Uh, I'm not quite sure how to make that, but I'm sure it will work.\n\n0:06:29\tSPEAKER_00\n Uh, this is on of switch because I think we do need that. I think it gives it a nice balance and it's going to have the logo imprinted on it. Um, as for what it's actually made of, well, the function of these buttons is up down left and right in the different menus. Okay. Uh, position, as you may just mean, right, right on it, easy to see. The main feature of it is just a simple design, simple lack of, uh, buttons all over the place.\n\n0:07:06\tSPEAKER_00\n Right? Forum, curved, kind of smooth, handheld, makes it feel nice to hold, uh, material.\n\n0:07:18\tSPEAKER_00\n I think Kate's going to tackle that quite a bit, but I think we have two different options because we did make another one, which, uh, is in the shape of bananas. If you can imagine this as yellow with black buttons, like just like this, but in the shape of a banana, which is also nice and easy to hold and feels good. And as a similar sort of scroll, push, button, technology, just slight difference sign. So on off switch and infrared. Uh, I hit an envision that in hard smooth plastic. So like, uh, like, I guess like an existing remote control, but molded and smooth. Whereas, whereas we thought like with this one, or mix and match, just we were going to see what you thought that a more spongy rubber cover with spongy buttons. So we have the two options we can follow either the smooth hard plastic or the spongy rubber, depending on cost your strengths and what we, well, what conclusion we reach when we discuss it. Uh, material, yeah, that's what I have to say about material. Can I scroll down on that to us? Well, color, I think I definitely have a preference towards bright yellow with black buttons because that's the company colors. But if anybody's got any other suggestions and quite willing to consider them as well.\n\n0:08:57\tSPEAKER_00\n So just depends what you think about these ideas. And if I may, maybe, can you better\n\n0:09:04\tSPEAKER_03\n say what you think about them? Well, I don't know very much to add. Um, the, the case ups on our button just come off our first night. The case can be either spongy rubber or hard plastic, but not absolutely sure about a combination of the two, but it can be either of those. We have a technology to do that. Um, and as for the actual components, um, as Steph just said, this is a quite a cheap device to manufacture. We have simple rubber push buttons, which provide all the functionality we need. Um, the, um, the diode that actually does the, um, infrared is at the end. It's the stalk of the banana. It's just the end of this version. Um, so that's for material color. Well, Steph said it's weird on color.\n\n0:09:59\tSPEAKER_03\n Um, we don't have any particular restrictions on that. Yeah. I think that's what we've\n\n0:10:06\tSPEAKER_00\n got to do. As for as for the fruit or organic theme, I guess this one is obviously fruit shaped. This one has, yeah, this one has no obvious connections to fruit, but because it's round and molded, it kind of makes you think sort of organic touchy feeling kitty.\n\n0:10:28\tSPEAKER_00\n It's more like, yeah, you'd expect it to be like a child's sort of tie remote control instead of a real one, which I quite like that sort of image. It's very big and chunky\n\n0:10:40\tSPEAKER_03\n and child friendly. Did you care to examine the pros types? Now they feel the amount. Hold\n\n0:10:45\tSPEAKER_00\n them. You see, you know, the curvature is at two. You're liking. I see the on-off and\n\n0:10:53\tSPEAKER_03\n back. Yes. So that your index finger automatically straight to it. If you don't want to tirate your thumbs after thumb, and it was partly with all the design looked better.\n\n0:11:03\tSPEAKER_03\n Yeah, but it could be moved if marketing for you, it's important to have the on-off\n\n0:11:07\tSPEAKER_04\n button in a different place. I could see this thing unless it's reinforced having a\n\n0:11:13\tSPEAKER_00\n problem with the brake arm. Yeah. We see that's why hard plastic would be quite a good\n\n0:11:20\tSPEAKER_02\n thing for it because it would just be rigid. I like the fact that on both of them, the\n\n0:11:29\tSPEAKER_00\n keys are just prominent. Yeah, we really like that design. I mean, it looks just like a logo that arrangement of the keys. Like a compass point, you know, just up, down, left and right. And we think we could make quite a good feature. It's like the iPod screw wheel. Yeah. It's also like a text. Yeah, yeah. I mean, that's what it makes me think of. More powerful, and I was thinking, if you thumb like this, what does that remind me\n\n0:11:57\tSPEAKER_03\n of? Yeah. And it's a very simple design. There's not a lot to go wrong. The components\n\n0:12:01\tSPEAKER_02\n are cheap to make. It's also in terms of being last. It's quite, it looks quite different. You know, I have several forum remotes, and they all look the same until you get a close to it. Yeah. Yeah. This is really identifying them. I mean, the thing is, we do need to develop\n\n0:12:20\tSPEAKER_00\n our technology of, I mean, actually how to program the menus. And what sort of your text box is going to appear at the bottom of the screen. But we do definitely think that\n\n0:12:32\tSPEAKER_04\n it's a viable option. Okay. The next item is evaluation. Okay. If that's, if you finish\n\n0:12:43\tSPEAKER_02\n it, should I take the power? Sorry. Okay. This is going to be a heavily interactive evaluation. And the method here is to evaluate the new remote control in terms of the user requirements and the hot trends introduced by the marketing department. So this means we're going to go over the priorities that were raised by the consumers, as well as incorporate all of our insight into this evaluation exercise.\n\n0:13:52\tSPEAKER_02\n So I'm going to go and use the whiteboard. And I've made a list of criteria to look at.\n\n0:14:01\tSPEAKER_02\n And so I'm going to, I'm going to leave this up as the last thing. But for the evaluation, it's going to be one is true and seven is false going over these different criteria.\n\n0:14:12\tSPEAKER_02\n So one true seven false. And I'm going to now use the board.\n\n0:14:41\tSPEAKER_02\n So fancy, technologically innovative, easy to use, trendy, buttons, access buttons, good buttons, ugly, sellable, and other. And in fact, I hope that you all introduce some additional terms because these are things that have been brought up. Some of them seem\n\n0:15:24\tSPEAKER_00\n rather close. Yeah, what about Trice? Is that going to go on there as well? Yeah, it's going to be a bit of a serious. And I like we actually know anything about\n\n0:15:34\tSPEAKER_04\n that. We can pretend. What we will soon, unfortunately.\n\n0:15:40\tSPEAKER_01\n Okay. So, come on.\n\n0:15:46\tSPEAKER_02\n Is your sense? No. Okay. So, what, how do we feel in terms of is this fancy? It depends\n\n0:15:58\tSPEAKER_00\n what you mean by fancy, really, because when I think of fancy, I think if it's got lots of extra sort of frippies and, you know, like, baroque caroliness, which I call these quite minimalist, plain, super clean, simple and plain, but I mean, I do see what it is heavily reliant on appearance instead of pure functionality. So, never expect fancy.\n\n0:16:27\tSPEAKER_00\n I think we'll go with that. I think just maybe we need a different word other than fancy.\n\n0:16:30\tSPEAKER_03\n I'd say maybe we have a separate gift for the down, but elegant.\n\n0:16:35\tSPEAKER_02\n I don't know if I call them elegant. Now, these aren't the exact terms that the style\n\n0:16:42\tSPEAKER_00\n is very aesthetic. Yeah.\n\n0:16:44\tSPEAKER_02\n Stylish. Yeah. Elegant. Let's use elegant. The word on the street is fancy.\n\n0:16:52\tSPEAKER_02\n Do you just break the pen? Yeah. The is fancy. So, let's take it to the next example. It would just call it fancy. Well, okay. So, in terms of elegant fancy, what we call EF. Do we think that perhaps, and maybe we should say the yellow, should we go with the yellow in terms of, I think that's a really superior.\n\n0:17:21\tSPEAKER_00\n Yeah, I think we need to, they're both yellow with black buttons, just so we didn't have any more dots that represent that. I think we can just imagine banana shape with these bits as black.\n\n0:17:31\tSPEAKER_00\n So, what we really need to decide is whether we want the actual banana shape or just a purely blob or some sort of abstraction in between the two. That is more curved, like a banana, but that isn't actually recognizable as a banana. You know, with the grooves of the\n\n0:17:49\tSPEAKER_02\n stalk and stuff. So, many of us are abstract enough to look at the yellow one and say, we'll call it the banana. Yeah. Of the two, I really like the banana, but I do like the\n\n0:18:00\tSPEAKER_00\n chunk. So, that's maybe not something we have to decide just right now. But, I mean,\n\n0:18:07\tSPEAKER_02\n we have to evaluate one of them. Unless you guys want to evaluate them.\n\n0:18:12\tSPEAKER_04\n I think between the two, somewhere between the two is true. It's more true than false\n\n0:18:18\tSPEAKER_02\n about a two. So, the same true. Technologically innovative. I don't think that's what we're\n\n0:18:28\tSPEAKER_03\n doing with this concept. I think we're using simple components that are going to be robust,\n\n0:18:35\tSPEAKER_02\n but not particularly innovative. Easy to use. Yes. One, is that an improvement? Yeah. Okay. Trendy. Trendy. And I say specifically spongy fruity. Well, maybe only a two or a three\n\n0:18:53\tSPEAKER_00\n then, because we still haven't decided about specific spongy this or specifically about\n\n0:18:58\tSPEAKER_03\n how robust it will be if it's as curved as a banana, but spongy. Yeah. I don't really\n\n0:19:04\tSPEAKER_02\n think that's going to work. So, two. Yeah. Are there excess buttons? No. No. Those are false. Those are false. Good, well designed buttons, intuitive, better, more intuitive buttons. Yes. Agui. No. No. People don't respond well to Agui.\n\n0:19:32\tSPEAKER_02\n Celebel, quirky. You know, something people, like a disordered, like quirky. I like it.\n\n0:19:39\tSPEAKER_00\n Yeah, I do too. It could be quite a good brand, like a good little object.\n\n0:19:45\tSPEAKER_02\n And I was thinking of other things in terms of, could we say it's cost saving?\n\n0:19:52\tSPEAKER_00\n Oh, you also need to think about the energy. Is it the kinetic energy? Yeah. With the energy.\n\n0:19:57\tSPEAKER_02\n It is going to be environmentally friendly. Yeah. We'll say it's a cost saving in viral.\n\n0:20:05\tSPEAKER_00\n So, yes. Yeah, but we haven't completely developed that side of it yet. So, we're not\n\n0:20:14\tSPEAKER_02\n completely sure about that. We're still in the play-doh steak. Anything else? Including price. Do you have any idea about price or other features?\n\n0:20:23\tSPEAKER_03\n Well, I think our instinct is that it should be pretty cheap to develop. We haven't got a lot of\n\n0:20:26\tSPEAKER_02\n spices to compose the instinct. It's not. It's just a good thing. So true one or should I go to two or three?\n\n0:20:31\tSPEAKER_00\n I would say maybe two, because we still, we need to get somebody in who's good with the programming for the menus. Yeah, I mean, it's not cheap. It's not like every...\n\n0:20:44\tSPEAKER_00\n You know, on a normal junky remote, every button risk, I mean, means something different.\n\n0:20:49\tSPEAKER_00\n Whereas this one has only got the four buttons and they are, they mean everything, depending on what menu you're sure.\n\n0:20:56\tSPEAKER_00\n Yeah, at a point, we need somebody to develop that.\n\n0:21:01\tSPEAKER_02\n Other? Anything else you guys can think of?\n\n0:21:08\tSPEAKER_02\n I'm going to actually change a couple of these. Instead of, I'm going to say it's attractive and then make that true so that, because I have to do an average. Right.\n\n0:21:19\tSPEAKER_02\n And then, excess buttons. Just put no excess buttons.\n\n0:21:23\tSPEAKER_02\n Exactly. Wow, we're doing really well.\n\n0:21:30\tSPEAKER_02\n Yeah. You know, so it doesn't really relate.\n\n0:21:32\tSPEAKER_00\n I see it is quite innovative, because there aren't really many that have this menu instead of all the extra buttons. I mean, I know we're not doing anything involving internet or speech recognition. But we are the upper end of the push button market.\n\n0:21:52\tSPEAKER_02\n Well, if you let me know if any of these, if you all can think of any other thing to change here, if you think I should change the internet or add other features, if not, I'll average those.\n\n0:22:12\tSPEAKER_01\n I think we're good.\n\n0:22:25\tSPEAKER_04\n Okay. We're a little over halfway through the meeting and the next big thing is the finance.\n\n0:22:40\tSPEAKER_02\n Okay. How about if I pass this back to you?\n\n0:22:44\tSPEAKER_02\n Yep. And I'll figure out the average here.\n\n0:22:47\tSPEAKER_02\n Right.\n\n0:22:55\tSPEAKER_02\n Thank you for everyone's help with that.\n\n0:23:00\tSPEAKER_04\n Right.\n\n0:23:03\tSPEAKER_04\n And as you can see, it says the same thing. It had not lost itself. Thank goodness.\n\n0:23:12\tSPEAKER_04\n And we're going to raise what's called a spread sheet that they provided to me.\n\n0:23:20\tSPEAKER_04\n And it says, fill in the number of components you plan to use in your device.\n\n0:23:31\tSPEAKER_04\n Hand, dynamo, battery, kinetic, solar cells.\n\n0:23:38\tSPEAKER_00\n Yeah.\n\n0:23:45\tSPEAKER_04\n What's a hand dynamo?\n\n0:23:48\tSPEAKER_03\n That was the cranking.\n\n0:23:49\tSPEAKER_04\n Oh, cranking.\n\n0:23:52\tSPEAKER_04\n And how many of those will we need per? Just really need one.\n\n0:24:02\tSPEAKER_04\n Okay. Electronic, simple chip on print.\n\n0:24:06\tSPEAKER_04\n Need one of those.\n\n0:24:08\tSPEAKER_03\n Yeah. We can do it all with simple.\n\n0:24:11\tSPEAKER_03\n Just checking that.\n\n0:24:30\tSPEAKER_03\n Yeah. Simple because we just got push buttons so we can do it all with simple.\n\n0:24:33\tSPEAKER_03\n Which is the strip of the cheapest.\n\n0:24:35\tSPEAKER_04\n Okay. I only need one of those.\n\n0:24:37\tSPEAKER_04\n Okay. The case will be uncurved or flat or a single curve or a double curve.\n\n0:24:43\tSPEAKER_04\n It looks like it's what? A single curve.\n\n0:24:46\tSPEAKER_04\n Because of the tronkiness.\n\n0:24:48\tSPEAKER_03\n Yeah. That one is single.\n\n0:24:50\tSPEAKER_03\n One.\n\n0:24:51\tSPEAKER_00\n Well, that's double-carved.\n\n0:24:54\tSPEAKER_04\n That's the one that goes like this.\n\n0:24:56\tSPEAKER_03\n Oh, we don't need that.\n\n0:24:57\tSPEAKER_03\n Right.\n\n0:24:58\tSPEAKER_03\n We need that for either the single curve.\n\n0:25:06\tSPEAKER_04\n Okay. Case material supplements.\n\n0:25:09\tSPEAKER_04\n Plastic wood, rubber, titanium, specials, color.\n\n0:25:13\tSPEAKER_04\n Plastic.\n\n0:25:14\tSPEAKER_04\n We have the special color.\n\n0:25:17\tSPEAKER_04\n And do we say plastic?\n\n0:25:19\tSPEAKER_03\n Yeah. Can we do some water ifs?\n\n0:25:21\tSPEAKER_03\n Because you may know that I still quite like the idea of combining plastic and rubber myself.\n\n0:25:25\tSPEAKER_03\n But it depends on the cost, I guess.\n\n0:25:27\tSPEAKER_04\n Okay.\n\n0:25:28\tSPEAKER_04\n We'll come back if we can to the rubber being added at the moment.\n\n0:25:34\tSPEAKER_04\n That's where we are.\n\n0:25:36\tSPEAKER_04\n Interface button.\n\n0:25:38\tSPEAKER_04\n Push button interface.\n\n0:25:40\tSPEAKER_04\n Yeah.\n\n0:25:41\tSPEAKER_04\n That's what we're using, isn't it?\n\n0:25:42\tSPEAKER_03\n Yeah.\n\n0:25:43\tSPEAKER_03\n Do we need to say how many buttons?\n\n0:25:45\tSPEAKER_04\n Whoops.\n\n0:25:46\tSPEAKER_04\n Don't want that.\n\n0:25:47\tSPEAKER_04\n Is it just not yet?\n\n0:25:48\tSPEAKER_04\n No.\n\n0:25:52\tSPEAKER_04\n It just says push button interface.\n\n0:25:55\tSPEAKER_04\n Button supplements.\n\n0:25:57\tSPEAKER_04\n There'll be a special color of black.\n\n0:26:01\tSPEAKER_04\n And the buttons.\n\n0:26:04\tSPEAKER_04\n What is the buttons made of?\n\n0:26:06\tSPEAKER_04\n Rubber.\n\n0:26:07\tSPEAKER_04\n That'll be rubber.\n\n0:26:08\tSPEAKER_04\n Yep.\n\n0:26:09\tSPEAKER_04\n So we need one of them.\n\n0:26:12\tSPEAKER_04\n And are they any special form?\n\n0:26:15\tSPEAKER_00\n Well, yeah.\n\n0:26:17\tSPEAKER_00\n Like the compass point one.\n\n0:26:20\tSPEAKER_03\n Actually, the special material mean that plastic is not a special material, because I think they can be plastic.\n\n0:26:29\tSPEAKER_04\n Because the rate we're going, we can put the rubber on top.\n\n0:26:39\tSPEAKER_04\n They could be plastic.\n\n0:26:40\tSPEAKER_03\n We don't have to have rubber buttons.\n\n0:26:44\tSPEAKER_03\n Because we haven't got a double-code case.\n\n0:26:48\tSPEAKER_00\n Yeah, they could be plastic.\n\n0:26:51\tSPEAKER_04\n Okay.\n\n0:26:56\tSPEAKER_04\n Let's put that rubber in then of the case material supplement.\n\n0:27:01\tSPEAKER_04\n It's just one, isn't it?\n\n0:27:03\tSPEAKER_04\n I'm going to need one of them.\n\n0:27:10\tSPEAKER_04\n And the total cost has been calculated as nine pounds twenty out of the twelve and a half we were allowed.\n\n0:27:17\tSPEAKER_04\n What we're in.\n\n0:27:18\tSPEAKER_04\n Yeah.\n\n0:27:19\tSPEAKER_04\n We're in.\n\n0:27:22\tSPEAKER_03\n That's us.\n\n0:27:23\tSPEAKER_03\n Okay.\n\n0:27:26\tSPEAKER_04\n Okay.\n\n0:27:27\tSPEAKER_04\n I'm going to save this into our desktop project documents.\n\n0:27:37\tSPEAKER_04\n Okay.\n\n0:27:40\tSPEAKER_04\n As our project document.\n\n0:27:42\tSPEAKER_03\n We need to double-click.\n\n0:27:43\tSPEAKER_03\n I'll let you open it.\n\n0:27:44\tSPEAKER_04\n Yeah.\n\n0:27:49\tSPEAKER_04\n There we are.\n\n0:27:52\tSPEAKER_04\n That's the only Excel document that will be in there.\n\n0:27:55\tSPEAKER_04\n So it's there for all of us.\n\n0:27:59\tSPEAKER_04\n Okay.\n\n0:28:00\tSPEAKER_04\n So are they under twelve fifty?\n\n0:28:03\tSPEAKER_04\n Yes.\n\n0:28:04\tSPEAKER_04\n Give it the project evaluation.\n\n0:28:06\tSPEAKER_04\n Next slide.\n\n0:28:07\tSPEAKER_04\n Right.\n\n0:28:08\tSPEAKER_04\n The project process satisfaction with, for example, the room for creativity.\n\n0:28:16\tSPEAKER_04\n Yeah.\n\n0:28:17\tSPEAKER_04\n Leadership.\n\n0:28:18\tSPEAKER_04\n Yeah.\n\n0:28:19\tSPEAKER_04\n Teamwork.\n\n0:28:20\tSPEAKER_04\n Yes.\n\n0:28:22\tSPEAKER_04\n Means of having whiteboard, digital pens and all that kind of good things.\n\n0:28:26\tSPEAKER_03\n And Play Do.\n\n0:28:27\tSPEAKER_03\n Uh-huh.\n\n0:28:28\tSPEAKER_03\n Yeah.\n\n0:28:29\tSPEAKER_03\n Yeah.\n\n0:28:30\tSPEAKER_03\n The Play Do was best, I thought.\n\n0:28:31\tSPEAKER_00\n Yeah.\n\n0:28:32\tSPEAKER_00\n Well, because I mean it's so hard to describe what you mean just with words and pointing at photographs and saying, well, we quite want this but imagine it round out so much better just to go and, you know, this is it.\n\n0:28:43\tSPEAKER_00\n This is what we want.\n\n0:28:45\tSPEAKER_00\n Okay.\n\n0:28:53\tSPEAKER_04\n Okay.\n\n0:28:56\tSPEAKER_04\n So we went over all those things and we're satisfied with all the above.\n\n0:29:02\tSPEAKER_03\n Yeah.\n\n0:29:07\tSPEAKER_04\n Did we find any new ideas?\n\n0:29:11\tSPEAKER_02\n I think with the marketing element of, uh, fruit shaped, I mean, I really opened my eyes.\n\n0:29:19\tSPEAKER_00\n Yeah.\n\n0:29:20\tSPEAKER_00\n Splungy.\n\n0:29:21\tSPEAKER_02\n I always be for myself.\n\n0:29:28\tSPEAKER_00\n And I'd never heard of the kinetic energy look on.\n\n0:29:31\tSPEAKER_00\n Yeah.\n\n0:29:32\tSPEAKER_00\n Good work as a design team.\n\n0:29:33\tSPEAKER_00\n Yeah.\n\n0:29:34\tSPEAKER_03\n Because we're good too much.\n\n0:29:36\tSPEAKER_03\n I'm not sure what it was.\n\n0:29:47\tSPEAKER_04\n So we actually worked well as a group.\n\n0:29:53\tSPEAKER_04\n Right.\n\n0:29:54\tSPEAKER_04\n Are the costs within the budget?\n\n0:29:56\tSPEAKER_04\n Yes.\n\n0:29:57\tSPEAKER_04\n Yes.\n\n0:29:58\tSPEAKER_04\n Yes.\n\n0:29:59\tSPEAKER_02\n Yes.\n\n0:30:00\tSPEAKER_02\n Oh, we have a number.\n\n0:30:01\tSPEAKER_02\n Uh-huh.\n\n0:30:02\tSPEAKER_02\n So the average evaluation score is 1.88.\n\n0:30:06\tSPEAKER_02\n So it means, you know, I can spell out there were six true or ones for, um, pardon me, two almost true or close to true.\n\n0:30:21\tSPEAKER_02\n So that was four points and then one false seven points.\n\n0:30:24\tSPEAKER_02\n So 17 divided by nine, where between one and two, I would say that's excellent.\n\n0:30:31\tSPEAKER_02\n So how much we're here to the ideals of the marketplace?\n\n0:30:36\tSPEAKER_00\n And the only false one is because we've chosen to maintain a simple technology, which if it works perfectly well, I see no point in improving on it.\n\n0:30:48\tSPEAKER_00\n It works.\n\n0:30:49\tSPEAKER_03\n Absolutely.\n\n0:30:50\tSPEAKER_03\n And it's kept us within budget.\n\n0:30:51\tSPEAKER_03\n Yes.\n\n0:30:52\tSPEAKER_00\n So we do count as I think, excellent.\n\n0:30:54\tSPEAKER_00\n One.\n\n0:30:55\tSPEAKER_04\n So we're going to do a final questionnaire and do the meeting summary.\n\n0:31:02\tSPEAKER_04\n I have a final report to present.\n\n0:31:05\tSPEAKER_04\n Um, and then we're done.\n\n0:31:08\tSPEAKER_04\n Okay.\n\n0:31:09\tSPEAKER_04\n We done.\n\n0:31:10\tSPEAKER_04\n And we're finished in time.\n\n0:31:12\tSPEAKER_04\n Nice.\n\n0:31:13\tSPEAKER_04\n So we might have to wait.\n\n0:31:14\tSPEAKER_03\n Productage party.\n\n0:31:15\tSPEAKER_03\n Yeah.\n\n0:31:16\tSPEAKER_03\n Productage party.\n\n0:31:17\tSPEAKER_03\n Yeah.\n\n0:31:18\tSPEAKER_03\n Ice sculptures.\n\n0:31:19\tSPEAKER_03\n Absolutely.\n\n0:31:20\tSPEAKER_02\n Um, I, one thing I want to do is, I think the meeting's done.\n\n0:31:24\tSPEAKER_02\n I believe that is the end of our meeting.\n\n0:31:26\tSPEAKER_04\n Thank you, Melissa.\n\n0:31:27\tSPEAKER_02\n Um, one thing I want to do is save everything on the right piles because I don't think everything is safe.\n\n0:31:34\tSPEAKER_02\n Right.\n\n0:31:35\tSPEAKER_02\n Final.\n\n0:31:36\tSPEAKER_02\n Final.\n\n0:31:37\tSPEAKER_02\n Final.\n\n", "summary": [{"summary_text": "Sarah and Speaker are going to present a prototype of their product to the meeting. The meeting is going to last for 40 minutes. Speaker is not showing the agenda, but the minutes from the previous meeting. They discuss the market trend of fruit and veg covers covering your fruit and vegetables and the design of the product. "}]}