{"filename": "./data/ES2002c.txt", "transcript": "0:00:00\tSPEAKER_02\n to know is decide what a fulfill what yourself is.\n\n0:00:04\tSPEAKER_02\n Okay.\n\n0:00:05\tSPEAKER_01\n Sure.\n\n0:00:06\tSPEAKER_01\n Okay.\n\n0:00:07\tSPEAKER_01\n It kind of does make sense doesn't it?\n\n0:00:08\tSPEAKER_01\n Because when we get into the end of meeting, we're kind of talking about action and design as opposed to background.\n\n0:00:13\tSPEAKER_01\n Yes, I agree.\n\n0:00:14\tSPEAKER_05\n Everything I have is kind of background.\n\n0:00:15\tSPEAKER_05\n Okay, we're all ready to do.\n\n0:00:16\tSPEAKER_05\n We'll have it in this meeting then.\n\n0:00:19\tSPEAKER_05\n If we, well, just recap on the minutes from the last meeting.\n\n0:00:26\tSPEAKER_05\n We decided on our target group being 15 to 35.\n\n0:00:35\tSPEAKER_05\n We decided that it was going to be normally a chargeable battery part that we're going to group our audio, visual and other functions into these categories.\n\n0:00:47\tSPEAKER_05\n And I told you guys about the three new requirements about ignoring teletext, ignoring everything except the TV and trying to incorporate the corporate color and slogan.\n\n0:00:59\tSPEAKER_05\n Start with the last meeting.\n\n0:01:00\tSPEAKER_05\n Is there anything I've ever gotten anything?\n\n0:01:02\tSPEAKER_04\n No.\n\n0:01:03\tSPEAKER_05\n Everything's okay.\n\n0:01:06\tSPEAKER_05\n So if we have these three presentations and then if we have anything to kind of know you're going to want to discuss, maybe just make a note of it and then we'll have all the discussion at the end.\n\n0:01:15\tSPEAKER_05\n I want you to have that idea this time.\n\n0:01:17\tSPEAKER_05\n So if we start off with Andrew and then Craig and then Davis, is that all right?\n\n0:01:25\tSPEAKER_05\n And then after that we'll have to make some decisions.\n\n0:01:27\tSPEAKER_05\n I'll like stop.\n\n0:01:28\tSPEAKER_05\n Yeah.\n\n0:01:29\tSPEAKER_05\n Right.\n\n0:01:30\tSPEAKER_05\n So I don't know how to get that.\n\n0:01:33\tSPEAKER_05\n Take this.\n\n0:01:34\tSPEAKER_05\n What would it be like to speak to our international?\n\n0:01:50\tSPEAKER_05\n Should we say we're going to try maybe incorporate it but we haven't made it up in the decision on that.\n\n0:01:56\tSPEAKER_05\n Right.\n\n0:01:57\tSPEAKER_05\n Or should also point out that the kind of the final objective of this meeting is to reach a decision on the concepts of the product.\n\n0:02:06\tSPEAKER_05\n Okay.\n\n0:02:07\tSPEAKER_05\n So that's kind of the end result.\n\n0:02:11\tSPEAKER_04\n Okay.\n\n0:02:12\tNone\n All right.\n\n0:02:13\tSPEAKER_01\n So could it function F8?\n\n0:02:14\tSPEAKER_01\n Uh-huh.\n\n0:02:15\tSPEAKER_01\n Can you pair me with that one?\n\n0:02:16\tSPEAKER_01\n Come on.\n\n0:02:17\tNone\n I think it's working.\n\n0:02:18\tSPEAKER_04\n Oh, there we go.\n\n0:02:19\tNone\n Okay, great.\n\n0:02:20\tSPEAKER_05\n So we just start now.\n\n0:02:21\tSPEAKER_01\n Okay, great.\n\n0:02:37\tSPEAKER_01\n So, um, let's move on.\n\n0:02:41\tSPEAKER_04\n Uh-huh.\n\n0:02:42\tSPEAKER_01\n Oh, where did I go?\n\n0:02:44\tSPEAKER_01\n It's not good.\n\n0:02:45\tSPEAKER_01\n Okay, let me just see where I find it.\n\n0:02:48\tSPEAKER_01\n I think I just opened up the template.\n\n0:02:55\tNone\n Okay.\n\n0:02:56\tNone\n All right.\n\n0:02:57\tNone\n So let's have a look here.\n\n0:02:58\tSPEAKER_01\n Okay.\n\n0:02:59\tSPEAKER_01\n So this is the method that I've taken.\n\n0:03:09\tSPEAKER_01\n Basically what I want to do here before we get into it too far.\n\n0:03:12\tSPEAKER_01\n I want to show you all the background information I have that I think we need to acknowledge if we want this to be successful.\n\n0:03:18\tSPEAKER_01\n Okay.\n\n0:03:19\tSPEAKER_01\n And then sort of go through some other way that I've dealt with that information and then sort of bring us all together and do it to see how this fits in with the overall vision.\n\n0:03:29\tSPEAKER_01\n Um, so I've tried to take a whole lot of market research and summarize it for us.\n\n0:03:35\tSPEAKER_01\n And then I identify trends that are sort of in sync and are important to our, our, uh, project plan that we have so far.\n\n0:03:43\tSPEAKER_01\n And then initiate a kind of discussion on design options so that it sort of helps us to to narrow in on aspects that will inform other, uh, other elements of the project.\n\n0:03:54\tSPEAKER_01\n Does that make sense?\n\n0:03:55\tSPEAKER_01\n Yeah.\n\n0:03:56\tSPEAKER_01\n That sort of strategy.\n\n0:03:57\tSPEAKER_01\n I thought that that will impact on the rest of what we do.\n\n0:03:59\tSPEAKER_01\n So that's why I suggest we get in.\n\n0:04:00\tSPEAKER_01\n Okay.\n\n0:04:01\tSPEAKER_01\n So out of different figures and ratings of people in general, um, consumers in general, the number one thing that was found was that, uh, the television remote control of a fancy look and feel, okay, and not specify not a functional look or feel, um, fancy.\n\n0:04:20\tSPEAKER_01\n Um, however, this is where we kind of have to be very, I think creative about it.\n\n0:04:25\tSPEAKER_01\n Number two was that it'd be innovative.\n\n0:04:27\tSPEAKER_01\n Okay.\n\n0:04:28\tSPEAKER_01\n So that tells me that we have to find a way to be innovative without adding just unnecessary, um, sort of functional bits to it.\n\n0:04:36\tSPEAKER_01\n Uh, and third priority, uh, ease of use.\n\n0:04:39\tSPEAKER_01\n So again, that kind of gives us a general picture of how it has to be, um, quite user friendly while still having technology.\n\n0:04:48\tSPEAKER_01\n So I'll just say right away as a bit of a foreshadowing and how we proceed with this in terms of marketing is that I think, um, what we should think about is how the, um, about how the innovation, uh, contributes to the look and feel and not so much to the functionality of it.\n\n0:05:07\tSPEAKER_01\n For example, like when you pick it up and push it like it all lights up or something, you know what I mean?\n\n0:05:12\tSPEAKER_01\n Like, or it's got something else to it that just seems innovative because obviously the thing that the message here is ease of use.\n\n0:05:19\tSPEAKER_01\n So how do you make innovation makes it more, more easy to use?\n\n0:05:23\tSPEAKER_01\n Well, that's, I guess, where we're going to go with this.\n\n0:05:25\tSPEAKER_01\n Okay.\n\n0:05:26\tSPEAKER_01\n Then there's the other aspect of the back, the, the market, um, research I have here is on fashion style, okay, which as we've agreed as a priority, um, top European fashion trend, um, that I read about, it says there's this emerging theme of fruit and vegetables.\n\n0:05:44\tSPEAKER_01\n Okay.\n\n0:05:45\tSPEAKER_01\n Especially in clothes and furniture.\n\n0:05:46\tSPEAKER_01\n And when I first saw that, I thought, well, do we want to actually try and think about this trend and how we add something to it or we get right into it or we completely steer away from it?\n\n0:05:55\tSPEAKER_01\n You know what I mean?\n\n0:05:56\tSPEAKER_01\n Okay.\n\n0:05:57\tSPEAKER_01\n Okay.\n\n0:05:58\tSPEAKER_01\n I don't know if you can describe this trend, but we want to think also about the fact that it sort of has to fit in with something which is not specifically electronics, um, because I think what we're in, what we're in is partly sort of home decor, partly something like a computer.\n\n0:06:14\tSPEAKER_01\n Um, so I think we might want to be careful about how, you know, how quickly we create like our remote control in the shape of an apple or something.\n\n0:06:21\tSPEAKER_01\n I think that would be pushing it.\n\n0:06:22\tSPEAKER_01\n And then in terms of material trends are for things to be soft and spongy and sort of might say ergonomic or friendly to handle, which is, which also indicated that last year this was, this was not the case.\n\n0:06:35\tSPEAKER_01\n So, um, probably a lot of the competition on the market will be still in last year's mode.\n\n0:06:42\tSPEAKER_01\n So if we try and really capitalize on that, I think that'll be in our favor.\n\n0:06:49\tSPEAKER_01\n So this is the summary of everything.\n\n0:06:51\tSPEAKER_01\n Um, style is number one thing in the, in the market of who we're selling to.\n\n0:06:57\tSPEAKER_01\n Active design technology is also a must in that it seemed to be seen to be, uh, cutting edge, uh, but ease of use has to be insured throughout.\n\n0:07:05\tSPEAKER_01\n That was like the number three thing.\n\n0:07:07\tSPEAKER_01\n And then that then there are vibrant natural colors.\n\n0:07:10\tSPEAKER_01\n Um, that's the way I interpreted it anyway.\n\n0:07:14\tSPEAKER_01\n Softness and material shape and function.\n\n0:07:16\tSPEAKER_01\n And so I wrote, written at the bottom to give us sort of a context of discussion, Mac iPods, something which is, I'd have to say very high tech, 10 gigabytes, whatever.\n\n0:07:27\tSPEAKER_01\n But when you hold it in your hand, there's like no buttons.\n\n0:07:29\tSPEAKER_01\n You know what a Mac iPod is?\n\n0:07:31\tSPEAKER_01\n I'm thinking however Mac iPod is sort of last year's because it's very hard and sort of glassy and glossy.\n\n0:07:36\tSPEAKER_01\n So I'm thinking if we imagine that we're taking some of the features of a Mac iPod and we're then making it more of like a, more of like a comfortable type of, more of like a, maybe more vibrant, friendly thing to have.\n\n0:07:51\tSPEAKER_01\n Um, and then so this is with all that information, what I, what I'm suggesting in this slide here is that we, we take these ideas and as we get into more, the more, um, technical like sort of production side of things that we think about shape, materials and themes or series that go throughout sort of like, uh, I don't know, like, um, we think of some kind of a thing, a theme that unifies it all that we agree on, uh, sort of like a marketing identity.\n\n0:08:21\tSPEAKER_01\n Um, does that make sense?\n\n0:08:24\tSPEAKER_01\n Yeah. So, so like I threw out a few ideas there just to kind of get us thinking along those lines like lemon, lime, I don't know, green colors, whatever, just, I do, because I'm thinking that some of these ideas will seem quite coherent if we use them in terms of their, what people associate them with in terms of texture, shape, colors, things like\n\n0:08:44\tSPEAKER_04\n that. Okay.\n\n0:08:46\tSPEAKER_01\n Like, um, the ones, the ones which I'm most fond of in terms of giving like a theme to it would be like, um, like lemon or something like that, you know, something which is like you see a lot in, in other areas, like, I see lots of websites and things that seem to associate with like lemon and lime.\n\n0:09:05\tSPEAKER_01\n Okay.\n\n0:09:06\tSPEAKER_01\n So, you know, it's just, just an idea.\n\n0:09:08\tSPEAKER_01\n Yeah.\n\n0:09:09\tSPEAKER_01\n I'm thinking maybe we could incorporate some of these features into a fairly, um, into something which is, which seems to have something to, which is almost gimmicky because like, um, something to do with like lighting within it, like, you know, just, just in the simple sense when you pick up a phone and touch a button, it lights up, usually the buttons light up.\n\n0:09:30\tSPEAKER_01\n How can we build on that?\n\n0:09:31\tSPEAKER_01\n Maybe like it could light up in different colors or something or people could buy the, buy the control and then it comes with different like covers or something.\n\n0:09:40\tSPEAKER_01\n Okay.\n\n0:09:41\tSPEAKER_01\n Anyway, those are, that's all I have, but hopefully we can, we can revisit those ideas when we get into.\n\n0:09:47\tSPEAKER_01\n Okay.\n\n0:09:48\tSPEAKER_05\n Great.\n\n0:09:50\tSPEAKER_05\n Thank you for that.\n\n0:09:52\tSPEAKER_05\n Um, Craig, do you want to plug yours in?\n\n0:10:20\tNone\n Is there anything that's already available?\n\n0:10:39\tSPEAKER_04\n Yes.\n\n0:10:41\tSPEAKER_04\n Did you prefer?\n\n0:10:47\tSPEAKER_02\n It's probably not sending.\n\n0:10:50\tSPEAKER_05\n Oh, something coming up.\n\n0:10:58\tSPEAKER_03\n Yeah, it is.\n\n0:11:04\tSPEAKER_00\n So, link of this concept.\n\n0:11:11\tSPEAKER_00\n To research here, I have had the company the home pitch again.\n\n0:11:15\tSPEAKER_00\n It's a provided me with one example of previous existing call of controls.\n\n0:11:20\tSPEAKER_00\n There's a wee bit of discussion about the existing ones there.\n\n0:11:24\tSPEAKER_00\n So I'm taking the suggestion from them, I think I'll put them into this.\n\n0:11:29\tSPEAKER_00\n I'm taking the suggestion on size and size of the control and the buttons.\n\n0:11:34\tSPEAKER_00\n The shape of the control and where about the buttons should be located on the control.\n\n0:11:43\tSPEAKER_00\n My final research is that most of the current controls are just big bricks with lots of buttons all over them.\n\n0:11:50\tSPEAKER_00\n They're not very attractive to look at.\n\n0:11:52\tSPEAKER_00\n They're not very comfortable to hold.\n\n0:11:54\tSPEAKER_00\n I just hold them like big bricks and they're very easy to lost.\n\n0:11:57\tSPEAKER_00\n They tend to be very dark colors.\n\n0:12:00\tSPEAKER_00\n So if the shadow places don't say the captures, you can't do it even.\n\n0:12:05\tSPEAKER_00\n The...\n\n0:12:06\tSPEAKER_00\n We can close themselves, tend to use a very inconsistent color scheme.\n\n0:12:10\tSPEAKER_00\n For instance, the standby button isn't always red, it really should be.\n\n0:12:14\tSPEAKER_00\n It's something that you can then identify with.\n\n0:12:17\tSPEAKER_00\n This is a red switch off, that's how it should be.\n\n0:12:20\tSPEAKER_00\n I'm not sure if there's any other examples of that.\n\n0:12:25\tSPEAKER_00\n So from that, I've got a couple of references for the end control.\n\n0:12:30\tSPEAKER_00\n Again, with the red color button, the standby and the other examples of that.\n\n0:12:36\tSPEAKER_00\n The buttons should be large.\n\n0:12:38\tSPEAKER_00\n They should be tiny little things like you get onto mobile phones.\n\n0:12:40\tSPEAKER_00\n They should be easy to press, very comfortable.\n\n0:12:44\tSPEAKER_00\n One of the examples given on the home page was there's an up and down volume button.\n\n0:12:50\tSPEAKER_00\n They both have a B on them.\n\n0:12:51\tSPEAKER_00\n So the up volume button, it should be a down volume button, not skin-to-concusing.\n\n0:12:56\tSPEAKER_00\n It should avoid things like that.\n\n0:12:59\tSPEAKER_00\n If the corporate color scheme was it, we should have a very bright color so that it can be identified anywhere.\n\n0:13:07\tSPEAKER_00\n Obviously trying to avoid being tacky there, but it could find very easily with your fear of lying on the bottom.\n\n0:13:12\tSPEAKER_01\n Do we have a corporate color scheme?\n\n0:13:14\tSPEAKER_05\n I think it's yellow because the website is yellow and there's the banner of the bottom yellow.\n\n0:13:19\tSPEAKER_05\n The play-dose yellow.\n\n0:13:21\tSPEAKER_05\n Definitely food for the lot there, I'm not quite sure.\n\n0:13:28\tSPEAKER_00\n Any extra features we add, the only basic one should be hidden.\n\n0:13:31\tSPEAKER_00\n There shouldn't be any visible without something to be open or something special.\n\n0:13:36\tSPEAKER_00\n If we do decide to go for voice activation, there should be a button that's alternative, possibly hidden in the open-to-up section, or something that's wrong with it, I can use voice to get a bit of a call.\n\n0:13:50\tSPEAKER_00\n We should definitely avoid the big square block, that's just wrong.\n\n0:13:56\tSPEAKER_00\n We've got an email from the research department, and they've said the voice control can now talk back if you ask a question.\n\n0:14:05\tSPEAKER_00\n It could be good to have them confirm any action you take.\n\n0:14:09\tSPEAKER_04\n That's a possibility.\n\n0:14:12\tSPEAKER_00\n I need the problems of either of it.\n\n0:14:15\tSPEAKER_00\n We don't know where this boogincugel is, I think it's a fashion and tailed frontings.\n\n0:14:21\tSPEAKER_00\n We don't know how far to pull the color scheme is.\n\n0:14:24\tSPEAKER_00\n You can see that you want the corporate colors, but you don't see if you can use any other color at all.\n\n0:14:30\tSPEAKER_04\n Okay.\n\n0:14:33\tSPEAKER_01\n Great.\n\n0:14:36\tSPEAKER_01\n Lots of good information there.\n\n0:14:38\tSPEAKER_05\n Yeah, that was very good.\n\n0:14:59\tSPEAKER_01\n It's a shame the cable wasn't just in the middle.\n\n0:15:02\tSPEAKER_01\n I think it's a good idea to have a cable.\n\n0:15:09\tSPEAKER_05\n Do you want to sit in the line of sight of this?\n\n0:15:17\tSPEAKER_02\n Okay, let me just get this.\n\n0:15:22\tSPEAKER_02\n There it is.\n\n0:15:32\tSPEAKER_02\n Okay, that should be it.\n\n0:15:59\tSPEAKER_02\n I guess the same thing again, I started with something very basic.\n\n0:16:02\tSPEAKER_02\n So just so you guys have some idea of what's involved in my process.\n\n0:16:06\tSPEAKER_02\n And then you can just work through it and well either modify it or start from scratch.\n\n0:16:11\tSPEAKER_02\n Depending on what your needs are.\n\n0:16:13\tSPEAKER_02\n The components are exactly the same.\n\n0:16:16\tSPEAKER_02\n I think like what you guys said, the most input that's needed is basically in the user interface.\n\n0:16:21\tSPEAKER_02\n The rest of the components, they do have an impact in terms of cost and complexity.\n\n0:16:26\tSPEAKER_02\n Like you said, time to market was a problem.\n\n0:16:29\tSPEAKER_02\n And how many components are physically in their own cost.\n\n0:16:31\tSPEAKER_02\n And the power is basically a factor of that.\n\n0:16:34\tSPEAKER_02\n And the lower components, the power, the logic, the transmitter, and infrared, they affect you in terms of the size of your device.\n\n0:16:41\tSPEAKER_02\n And that would have some impact on how, I think more how you hold rather than the actual use using the remote control because like we said, we've defined like we only want the basic things that to be visible on the rest of the image right at height.\n\n0:16:57\tSPEAKER_02\n So you know, it's just a matter of working out space.\n\n0:17:00\tSPEAKER_02\n So I guess three things, cost, complexity, and the size.\n\n0:17:05\tSPEAKER_02\n These are the three things that will have an impact on you.\n\n0:17:08\tSPEAKER_02\n So just go through the components.\n\n0:17:11\tSPEAKER_02\n These are the options that are available to you.\n\n0:17:13\tSPEAKER_02\n I'm not very sure about the voice thing because I've got another email and it was quite sketchy on what the voice options are.\n\n0:17:20\tSPEAKER_02\n It could talk to you, but I never said anything about being able to listen.\n\n0:17:24\tSPEAKER_02\n It said something about a sensor, but I never clarified that.\n\n0:17:27\tSPEAKER_02\n So maybe if you, well, I could see the other email that makes sense to you because they got back to me in the flight, different requirements.\n\n0:17:35\tSPEAKER_02\n Or different offerings of what components are available.\n\n0:17:37\tSPEAKER_02\n Okay, so your basic components are buttons.\n\n0:17:39\tSPEAKER_02\n Okay, and you have a wheel available, like a mouse scroll wheel.\n\n0:17:42\tSPEAKER_02\n Okay, there's an LCD display.\n\n0:17:45\tSPEAKER_02\n I think these are quite standard things.\n\n0:17:47\tSPEAKER_02\n They're standard, are they?\n\n0:17:49\tSPEAKER_02\n No, they're, well, in a sense that these are all the options available for you. I explained to you the complexity and the cost thing again a bit later.\n\n0:17:56\tSPEAKER_02\n Okay, then there's how the case actually looks.\n\n0:18:00\tSPEAKER_02\n It can actually be flat or it can be curved.\n\n0:18:03\tSPEAKER_02\n And then the different types of materials that you can use.\n\n0:18:06\tSPEAKER_02\n I don't think you can use them in a combination.\n\n0:18:09\tSPEAKER_02\n But I could check back for you, but I don't think you can actually use them in a combination.\n\n0:18:14\tSPEAKER_05\n I think plastic and rubber.\n\n0:18:17\tSPEAKER_02\n I think plastic and rubber would be fine, but plastic, rubber and wood, I wasn't, I'm not very sure about the titanium.\n\n0:18:24\tSPEAKER_02\n They had some restrictions on using the rubber and the titanium.\n\n0:18:27\tSPEAKER_02\n The rubber was a restriction on the kind of power source you could use, but the titanium had a different kind of things on the shape of the thing.\n\n0:18:35\tSPEAKER_02\n So I think that there is some restriction on, I think you could probably group plastic and rubber together wood and titanium, but you know, it might be easier from a cost perspective and a complexity just to use one, you know, as opposed to two.\n\n0:18:49\tSPEAKER_02\n And the other components are logic chips.\n\n0:18:52\tSPEAKER_02\n Again, I'll go back to the component chips.\n\n0:18:55\tSPEAKER_02\n How complex or how easy the logic is, it depends on how many functions you have on the unit.\n\n0:19:01\tSPEAKER_02\n And that impacts cost.\n\n0:19:03\tSPEAKER_02\n I don't think the logic chip has an issue about size because they should be about the same size.\n\n0:19:07\tSPEAKER_02\n Power consumption should be about the same.\n\n0:19:09\tSPEAKER_02\n I think the main impact is complexity.\n\n0:19:13\tSPEAKER_02\n And the other thing is the power options.\n\n0:19:16\tSPEAKER_02\n The first one is the standard battery.\n\n0:19:18\tSPEAKER_02\n The second one, I think, is more of a gimmick than actually a usable thing.\n\n0:19:23\tSPEAKER_02\n It's a wind up.\n\n0:19:26\tSPEAKER_02\n You know, a crank.\n\n0:19:28\tSPEAKER_02\n Just by amazing.\n\n0:19:30\tSPEAKER_02\n But that might be something, I think that's more of a look and field decision, because I don't think you can have one power source if you're using the alternative power sources.\n\n0:19:39\tSPEAKER_02\n I think whatever it is, you still need a battery because I don't think anybody wants to keep doing one thing.\n\n0:19:44\tSPEAKER_02\n Okay, the other ones are a solar power cell, which may not be a great idea in Europe or any country that has seasons, because half the year you be dead.\n\n0:19:53\tSPEAKER_02\n So like what I said, you probably need like a battery and something else.\n\n0:19:57\tSPEAKER_02\n And the kinetic one, I guess for me, is the most interesting one because it's movement and people like to fiddle with there.\n\n0:20:03\tSPEAKER_02\n And it's a nice sales gimmick, I think, from a marketing gimmick.\n\n0:20:06\tSPEAKER_02\n It's a technology thing. It's a shake it.\n\n0:20:09\tSPEAKER_02\n It doesn't work. Shake it. Knock it or something.\n\n0:20:12\tSPEAKER_02\n Yeah.\n\n0:20:13\tSPEAKER_02\n You know, you have, you have those balls, you know, those stress balls where you bounce the ball.\n\n0:20:17\tSPEAKER_02\n And it lights up and it goes, you know, that might be a gimmick combined with rubber.\n\n0:20:22\tSPEAKER_02\n You know, just to, if you get frustrated with remote control, you can throw it kind of, you know, just the...\n\n0:20:27\tSPEAKER_02\n I know you.\n\n0:20:29\tSPEAKER_02\n So, okay, from my role, I don't think there are personal preferences, but role preferences, I think, something comfortable to hold.\n\n0:20:40\tSPEAKER_02\n Small and slim, I guess that's more in the sense of, small and slim in terms of comfortable, not so small you can't, you know, like a phone or some too small phone.\n\n0:20:49\tSPEAKER_02\n And the other thing is from a production point of view, the less components we use and the simpler the components, means you reduce your cost and you increase your profit.\n\n0:21:00\tSPEAKER_02\n And also the time to market and the complexity of developing, designing and debugging it.\n\n0:21:05\tSPEAKER_02\n So, okay, let me just go back and talk about some of the restrictions.\n\n0:21:12\tSPEAKER_02\n The user interface restrictions basically means that if you use more complicated features, like the buttons are standard.\n\n0:21:18\tSPEAKER_02\n Okay, the LCD panel and this grow wheel, you need more complicated logic.\n\n0:21:23\tSPEAKER_02\n The case, okay, with a rubber case, you can't have the solar panels.\n\n0:21:28\tSPEAKER_02\n Okay, with the titanium case, let me just check that.\n\n0:21:37\tSPEAKER_02\n Titanium case can't be curved, it has to be square.\n\n0:21:40\tSPEAKER_02\n Okay, there's no restriction on the plastic.\n\n0:21:43\tSPEAKER_01\n It can't be curved.\n\n0:21:44\tSPEAKER_02\n It can't be curved on the wood.\n\n0:21:45\tSPEAKER_02\n So, that's, again, I don't think you can use them in a combination.\n\n0:21:48\tSPEAKER_02\n Okay, especially the titanium, I suspect they're very fixed to a particular need.\n\n0:21:53\tSPEAKER_02\n So, mixing them may not be a good idea.\n\n0:21:56\tSPEAKER_02\n Okay.\n\n0:21:57\tSPEAKER_02\n Yeah.\n\n0:21:58\tSPEAKER_01\n Question on, can I ask questions?\n\n0:22:01\tSPEAKER_05\n Yeah, well, yeah, it's just quite keen to get the discussion going with the time we've left.\n\n0:22:06\tSPEAKER_01\n But yeah, ask questions.\n\n0:22:07\tSPEAKER_01\n Can we power a light in this?\n\n0:22:10\tSPEAKER_01\n Can we get a strong battery to power a light?\n\n0:22:13\tSPEAKER_02\n I think we could because the LCD panel requires power and the LCD is a form of a light.\n\n0:22:19\tSPEAKER_01\n Okay, so that...\n\n0:22:20\tSPEAKER_01\n So maybe one of the things we can just try and include is a really good battery.\n\n0:22:24\tSPEAKER_05\n Why, what kind of light do you want?\n\n0:22:27\tSPEAKER_01\n Well, I mean, I'm thinking it might be that for this to be a high-tech thing, it's going to have to have something high-tech about it.\n\n0:22:36\tSPEAKER_01\n It's going to take battery power and to make that a realistic goal, I think one of the issues that will come up later is...\n\n0:22:44\tSPEAKER_02\n Are you thinking of a light in the sense of...\n\n0:22:48\tSPEAKER_02\n A light or a light in the sense of...\n\n0:22:51\tSPEAKER_02\n A laminate of color.\n\n0:22:52\tSPEAKER_01\n It was kind of...\n\n0:22:53\tSPEAKER_01\n A laminate of color.\n\n0:22:54\tSPEAKER_01\n A laminate of color.\n\n0:22:55\tSPEAKER_01\n I'm thinking along the lines of your...\n\n0:22:57\tSPEAKER_01\n You're in the dark watching a DVD, then you find the thing in the dark and you go like this.\n\n0:23:02\tSPEAKER_01\n And that's what everybody does.\n\n0:23:03\tSPEAKER_01\n Always the volume button in the dark.\n\n0:23:06\tSPEAKER_01\n And you just touch it or you just pick it up and it lights up or something.\n\n0:23:10\tSPEAKER_01\n Like a phone.\n\n0:23:11\tSPEAKER_01\n Like a backlight.\n\n0:23:12\tSPEAKER_01\n Yeah.\n\n0:23:13\tSPEAKER_01\n Okay.\n\n0:23:14\tSPEAKER_01\n Whereas with phones, people charge them once a week.\n\n0:23:16\tSPEAKER_01\n Yeah.\n\n0:23:17\tSPEAKER_01\n We're going to need to put in a really good battery so people don't have to charge their remote control every few days.\n\n0:23:24\tSPEAKER_02\n That's why I think the option of the kinetic thing, which basically means as long as you shake it like a watch,\n\n0:23:29\tSPEAKER_01\n like an object. But are people going to want to shake their movie control?\n\n0:23:31\tSPEAKER_02\n It's probably sensitive enough when you fiddle it.\n\n0:23:34\tSPEAKER_02\n Right.\n\n0:23:35\tSPEAKER_02\n So you could trigger that to a light.\n\n0:23:37\tSPEAKER_02\n Like I said, the bouncing ball thing.\n\n0:23:38\tSPEAKER_02\n Okay.\n\n0:23:39\tSPEAKER_02\n So you can use that to power the light as opposed to, so when they pick it up right.\n\n0:23:43\tSPEAKER_02\n And then that sort of triggers the.\n\n0:23:45\tSPEAKER_02\n Right.\n\n0:23:46\tSPEAKER_02\n Okay.\n\n0:23:47\tSPEAKER_05\n Okay.\n\n0:23:48\tSPEAKER_05\n Well, let's just go back to the marketing ideas for a start.\n\n0:23:53\tSPEAKER_05\n And it's giving an idea on the time we've got about 15 minutes to play with at most.\n\n0:23:57\tSPEAKER_05\n Okay.\n\n0:23:58\tSPEAKER_05\n So, yeah.\n\n0:24:00\tSPEAKER_05\n So just to bear in mind that the ultimate goal of this meeting is to reach an absolute decision on the concepts of the product.\n\n0:24:08\tSPEAKER_05\n So back to your idea about incorporating the idea of like fruit and veg and the corporate color and things like that.\n\n0:24:17\tSPEAKER_05\n I mean, what does everybody think about?\n\n0:24:21\tSPEAKER_05\n Does anybody have any ideas about how we can fit all that in together?\n\n0:24:25\tSPEAKER_05\n I mean, that's kind of the easier interface type of thing.\n\n0:24:27\tSPEAKER_05\n What are your thoughts on that?\n\n0:24:29\tSPEAKER_00\n I have a couple of very, maybe not a lot of fruit shapes.\n\n0:24:33\tSPEAKER_00\n They're very sort of curvy type shapes, then you can have the same type of texture and color as soft food.\n\n0:24:39\tSPEAKER_05\n So maybe do it.\n\n0:24:40\tSPEAKER_05\n Are we thinking something that like, could sit in your hand comfortably or you told on to comfortably or.\n\n0:24:46\tSPEAKER_00\n I'm supposed to sit in your hand comfortably.\n\n0:24:48\tSPEAKER_05\n So, something quite curvy.\n\n0:24:50\tSPEAKER_05\n Okay.\n\n0:24:51\tSPEAKER_05\n And right.\n\n0:24:53\tSPEAKER_05\n Okay.\n\n0:24:54\tSPEAKER_05\n Color wise.\n\n0:24:55\tSPEAKER_05\n I mean, you may have, it was a year.\n\n0:24:56\tSPEAKER_05\n I kind of remember him at the point about how if you have a nice bright color, you'll not lose it.\n\n0:25:00\tSPEAKER_05\n Is that.\n\n0:25:01\tSPEAKER_05\n What's on you?\n\n0:25:03\tSPEAKER_05\n About how if you have a bright color, you'll not lose it so much.\n\n0:25:06\tSPEAKER_05\n And when the corporate color is yellow, I mean, maybe we could think about.\n\n0:25:10\tSPEAKER_05\n About the color of the whole product being yellow, I don't know.\n\n0:25:15\tSPEAKER_05\n And then obviously the materials.\n\n0:25:19\tSPEAKER_05\n But as anybody got like an overall picture in their mind about what might work.\n\n0:25:24\tSPEAKER_01\n Well, I mean, I'm thinking that what we need to do is have something that kind of unifies a lot of the different concepts.\n\n0:25:30\tSPEAKER_01\n And we think that what we are, what our number one marketing motive is the look and feel.\n\n0:25:37\tSPEAKER_01\n So, for the look and feel to seem coherent and not just sort of bits and pieces of concept and technology or whatever or fashion.\n\n0:25:46\tSPEAKER_01\n Then we should have it kind of come back to one thing that we kind of all sort of can visualize.\n\n0:25:52\tSPEAKER_01\n Maybe what we could do is think about a concept which touches back to the color, the company color, yellow.\n\n0:26:02\tSPEAKER_01\n I mean, if we think of something like I was saying also lime and lemon, you know, what can we come up with something where we try and associate it with with like the series.\n\n0:26:09\tSPEAKER_01\n We just come up with something like that we kind of use it as a theme to inspire the shapes and.\n\n0:26:17\tSPEAKER_02\n Right. Is there a particular shape that you're interested in like is marketing every new research on?\n\n0:26:25\tSPEAKER_02\n Does it need to be long? Does it need square things?\n\n0:26:28\tSPEAKER_05\n I think circular and shape or.\n\n0:26:30\tSPEAKER_02\n Yeah, because that will help narrow down the choice of.\n\n0:26:33\tSPEAKER_05\n The choice of material.\n\n0:26:35\tSPEAKER_05\n Because I was kind of thinking about as well. You know how you get these shop-resistant mobile phones.\n\n0:26:40\tSPEAKER_05\n And they're plastic, but they're also like rubber on the outside. It kind of feels kind of warmer to the touch feels more comfortable.\n\n0:26:47\tSPEAKER_05\n Maybe you could incorporate plastic and rubber into it and then then we could have curved shapes.\n\n0:26:53\tSPEAKER_05\n Because what are titanium yet? It's going to have to be.\n\n0:26:57\tSPEAKER_05\n Boxy and rectangular and I think we might be moving away from that.\n\n0:27:01\tSPEAKER_05\n So.\n\n0:27:05\tSPEAKER_05\n Do you want it in like the shape of a lemon? No, no, no, no, no.\n\n0:27:10\tSPEAKER_01\n It's more just that we think about like what it is we're trying to achieve.\n\n0:27:17\tSPEAKER_01\n And then we have one sort of theme.\n\n0:27:20\tSPEAKER_05\n Okay. Right. Well.\n\n0:27:23\tSPEAKER_05\n So thoughts about the actual shape as a thing.\n\n0:27:27\tSPEAKER_00\n I'm quite like a sort of snowman type here. That's a new one, too. So larger bits. It's new hands.\n\n0:27:35\tSPEAKER_00\n And then you've got the other bulb at the top for just any other phone can be.\n\n0:27:38\tSPEAKER_05\n That's quite a distinct shape.\n\n0:27:41\tSPEAKER_05\n So yeah, should we go with that?\n\n0:27:45\tSPEAKER_01\n Yeah, like two and what?\n\n0:27:48\tSPEAKER_01\n Like do you have a.\n\n0:27:50\tSPEAKER_01\n Do you want to draw it on the board?\n\n0:27:52\tSPEAKER_01\n Yeah, just.\n\n0:27:53\tNone\n I'm.\n\n0:28:03\tSPEAKER_00\n Some of them. You got two groups there. Maybe it could fall open. You got to start with inside.\n\n0:28:16\tSPEAKER_00\n That's cool.\n\n0:28:26\tSPEAKER_05\n And I mean, color wise, which is everything. I think it is quite important to get yellow in there somewhere.\n\n0:28:38\tSPEAKER_05\n I mean, do you want the whole thing yellow?\n\n0:28:42\tSPEAKER_00\n Quite nice. I've just had this around here. They start background yellow.\n\n0:28:47\tSPEAKER_00\n And then I have a nice pooled color for the buttons.\n\n0:28:49\tSPEAKER_05\n Okay.\n\n0:28:51\tSPEAKER_05\n And also, I mean, how are we going to incorporate this slogan in the fact that it talks to you?\n\n0:28:56\tSPEAKER_05\n I mean, it might be quite cool if when you first start using it, it says, what is it putting fashion until electronics or something?\n\n0:29:03\tSPEAKER_05\n I don't know.\n\n0:29:04\tSPEAKER_05\n Or when you like, if you turn it off or something, if it can speak, if you could actually say this slogan, it might be a bit more powerful than just having written on it somewhere.\n\n0:29:12\tSPEAKER_05\n Any thoughts on that at all?\n\n0:29:15\tSPEAKER_00\n I think that will be skirming. Turn on your.\n\n0:29:18\tSPEAKER_05\n I know.\n\n0:29:21\tSPEAKER_05\n Unless, I mean, if you also, like, where if we wanted to incorporate an LCD display, where we would have put that, we would put that on the inside.\n\n0:29:32\tSPEAKER_02\n Do we need an LCD display? What's the functionality of it?\n\n0:29:36\tSPEAKER_05\n Is it the spline to increase the cost of it a lot?\n\n0:29:39\tSPEAKER_02\n Yeah, but the question is, what are we using it?\n\n0:29:41\tSPEAKER_02\n What would we achieve from it?\n\n0:29:43\tSPEAKER_02\n Putting in lights is cheap, but putting in LCD panel just making glow is...\n\n0:29:46\tSPEAKER_01\n When you mention LCDs, I don't know what that would be about.\n\n0:29:49\tSPEAKER_01\n And the thing I could see it helping with, if it was somehow connected with listings.\n\n0:29:54\tSPEAKER_01\n So as you scroll through, because we said we might have a jog dial, as you scroll through your stations, you can...\n\n0:30:00\tSPEAKER_01\n You actually tell us what it is.\n\n0:30:02\tSPEAKER_02\n That will be a problem because we don't have an input device to get the listings into it.\n\n0:30:07\tSPEAKER_02\n So it's a bit nuts to get the unit in one day, Tuesday, Wednesday.\n\n0:30:11\tSPEAKER_02\n So no need for an LCD display?\n\n0:30:13\tSPEAKER_02\n I'm not saying there's no need for an LCD display, but...\n\n0:30:16\tSPEAKER_02\n Let's see if that would make it work.\n\n0:30:18\tSPEAKER_02\n What would it tell the user?\n\n0:30:19\tSPEAKER_02\n Because the LCD tends to be an output, as opposed to an input.\n\n0:30:22\tSPEAKER_02\n So there's a remote control need to talk back to the user.\n\n0:30:28\tSPEAKER_02\n We have the option of the speaker as well. The same thing goes for the speaker. Is there a need for a remote controller?\n\n0:30:33\tSPEAKER_02\n Why don't I... there is really a...\n\n0:30:35\tSPEAKER_05\n Talk back.\n\n0:30:36\tSPEAKER_05\n No.\n\n0:30:37\tSPEAKER_05\n I would say no need for a talk back. Does anybody disagree with that?\n\n0:30:43\tSPEAKER_02\n You could put a game on it.\n\n0:30:46\tSPEAKER_02\n Easy.\n\n0:30:47\tSPEAKER_02\n When the TV dies, you can play with the remote control.\n\n0:30:51\tSPEAKER_05\n Right, so you're going to have the three different sets of functionalities.\n\n0:30:57\tSPEAKER_05\n Do you want to group them into the head of the new man?\n\n0:31:00\tSPEAKER_05\n Bolly the new man inside the new man? Is that what you're thinking?\n\n0:31:05\tSPEAKER_00\n I think the advanced ones, the ones you don't usually use, can be hidden inside.\n\n0:31:09\tSPEAKER_00\n I think they're the three different kinds of basic ones that have to go on there.\n\n0:31:13\tSPEAKER_00\n They're fun somewhere.\n\n0:31:14\tSPEAKER_05\n Okay. Right.\n\n0:31:17\tSPEAKER_05\n What else do you need to talk back to?\n\n0:31:20\tSPEAKER_02\n Where would you physically position the buttons?\n\n0:31:23\tSPEAKER_02\n I think that that has some impact on many things.\n\n0:31:28\tSPEAKER_02\n Maybe you want to draw into that.\n\n0:31:31\tSPEAKER_05\n So I'm just going to pop this in here because I have a slider butt decision making.\n\n0:31:36\tSPEAKER_05\n Yep.\n\n0:31:37\tSPEAKER_05\n I'll try it for you on the butt.\n\n0:31:41\tSPEAKER_05\n Oh, go five minutes.\n\n0:31:52\tSPEAKER_05\n Okay.\n\n0:31:55\tSPEAKER_05\n Back of you.\n\n0:31:57\tSPEAKER_05\n Energy.\n\n0:31:58\tSPEAKER_05\n Do you think that suggesting we're harporing the thing?\n\n0:32:02\tSPEAKER_05\n I really like the idea of this kinetic thing where you'd have the backup of the battery but have kinetic power.\n\n0:32:08\tSPEAKER_01\n I've had kinetic things before and the one issue we need to keep in mind with them is that you're committing the user to moving it.\n\n0:32:16\tSPEAKER_02\n No, like I said, we have a hybrid kind of thing.\n\n0:32:19\tSPEAKER_02\n So it's not going to charge the battery.\n\n0:32:21\tSPEAKER_02\n Right.\n\n0:32:22\tSPEAKER_02\n It's just.\n\n0:32:23\tSPEAKER_01\n Okay.\n\n0:32:24\tSPEAKER_01\n I mean, just it's just worth pointing out because like I've known, I've known people to have kinetic watches that they wear all the time and it's just like magic because it's always powered and there's no battery.\n\n0:32:33\tSPEAKER_01\n Also, known people to have things like like a jewelry watch they wear from time to time and they eventually just say it's just too much of a nuisance because I don't wear it all the time.\n\n0:32:43\tSPEAKER_01\n Look, remote control is similar.\n\n0:32:45\tSPEAKER_01\n Your way on vacation, I don't know, whatever, you, something, and it just starts to get worn down.\n\n0:32:51\tSPEAKER_05\n For the space that if you're, if you're away and you're not using it, then you're not using any power either.\n\n0:32:55\tSPEAKER_05\n So you'd have the battery as the kind of to keep it ticking over idea.\n\n0:33:00\tSPEAKER_05\n I'm really sorry, we're going to have to wrap up quite quickly.\n\n0:33:03\tSPEAKER_05\n I don't know as much time as I thought.\n\n0:33:05\tSPEAKER_05\n So I think that's what energy is referring to here.\n\n0:33:07\tSPEAKER_05\n Chip on print.\n\n0:33:09\tSPEAKER_05\n Is that that's an industrial design thing?\n\n0:33:11\tSPEAKER_05\n Is that David?\n\n0:33:12\tSPEAKER_05\n Yes.\n\n0:33:13\tSPEAKER_05\n Okay.\n\n0:33:14\tSPEAKER_05\n As for the case, kind of discuss that.\n\n0:33:17\tSPEAKER_01\n And this size here, I'd suggest this be small.\n\n0:33:20\tSPEAKER_01\n Yeah.\n\n0:33:21\tSPEAKER_05\n And we're going to have like rubber buttons that feel kind of.\n\n0:33:25\tSPEAKER_01\n Okay.\n\n0:33:26\tSPEAKER_01\n Just a lot of, I mean, one of the things running through my mind right now, I realized we're being efficient to wrap up the meeting and have lots of decisions made.\n\n0:33:36\tSPEAKER_01\n But we are leaning quite a bit to the side of being low tech rubber buttons, plastic frame.\n\n0:33:41\tSPEAKER_01\n It's almost like we're reproducing the same old remote control that's out there.\n\n0:33:45\tSPEAKER_01\n Should we think about how we are actually getting this high tech user friendly theme?\n\n0:33:53\tSPEAKER_01\n Like what is it that we're using to achieve those goals?\n\n0:33:57\tSPEAKER_05\n I think that backlighting the buttons and stuff like that.\n\n0:34:01\tSPEAKER_02\n Or even a clearer case.\n\n0:34:04\tSPEAKER_02\n Yeah.\n\n0:34:05\tSPEAKER_02\n A glowing yellow type case where the yellow showble, but in the dark, it's sort of.\n\n0:34:12\tSPEAKER_02\n It's light.\n\n0:34:13\tSPEAKER_02\n So it's slightly transparent.\n\n0:34:18\tSPEAKER_02\n Yeah.\n\n0:34:19\tSPEAKER_05\n So it's yellow, like tinted yellow, but you can maybe see through it.\n\n0:34:22\tSPEAKER_02\n Or there might be a light running through it like a mouse.\n\n0:34:25\tSPEAKER_02\n Sure.\n\n0:34:26\tSPEAKER_02\n You know, you have colors mice and they don't eat that much power.\n\n0:34:28\tSPEAKER_02\n Yeah.\n\n0:34:29\tSPEAKER_02\n So the battery in that sense, we have one or two strategically placed lights.\n\n0:34:33\tSPEAKER_02\n Sure.\n\n0:34:34\tSPEAKER_02\n That sort of.\n\n0:34:35\tSPEAKER_02\n Yeah, they emanate a light through it.\n\n0:34:37\tSPEAKER_02\n Yeah, but because the case is transparent, so it gives it a little bit of a glow.\n\n0:34:41\tSPEAKER_02\n Yeah.\n\n0:34:42\tSPEAKER_01\n Doesn't make it freaky.\n\n0:34:43\tSPEAKER_01\n And then the other thing that we were, we committed ourselves achieving is simplicity.\n\n0:34:48\tSPEAKER_01\n And so I'm thinking maybe should we try and think about having something like some kind of an innovative concept about how the volume and the channels are controlled?\n\n0:34:58\tSPEAKER_01\n Because that's the main thing people want to do.\n\n0:35:00\tSPEAKER_01\n Could we use like a jog dial, like a nice sort of round somewhere on it where you just roll it?\n\n0:35:05\tSPEAKER_02\n The question is when you're rolling it, how do you want to roll it?\n\n0:35:07\tSPEAKER_02\n Do you want them to roll it like that?\n\n0:35:09\tSPEAKER_02\n Do you want them to roll it like that?\n\n0:35:10\tSPEAKER_02\n Because in a mouse, your hands in a position to roll it.\n\n0:35:14\tSPEAKER_02\n Whereas the other thing about having a jog dial this way, it tends to get moved accidentally.\n\n0:35:20\tSPEAKER_02\n Yeah, you can do that.\n\n0:35:21\tSPEAKER_05\n If you're holding it in your hand.\n\n0:35:25\tSPEAKER_02\n That's a very unnatural motion to, yeah.\n\n0:35:29\tSPEAKER_02\n Okay.\n\n0:35:30\tSPEAKER_02\n Can you imagine you have to scroll a lot?\n\n0:35:32\tSPEAKER_02\n We might work for volume.\n\n0:35:34\tSPEAKER_02\n Yeah.\n\n0:35:35\tSPEAKER_02\n And maybe some of the brightness controls and stuff like that.\n\n0:35:37\tSPEAKER_02\n But not for channels, right?\n\n0:35:38\tSPEAKER_02\n If you have a telewisp box, you've got like, you don't have to buy all the channels.\n\n0:35:42\tSPEAKER_02\n You imagine trying to...\n\n0:35:45\tSPEAKER_02\n Okay.\n\n0:35:46\tSPEAKER_02\n And I don't think having that, you know, too quick, too slow, it's confusing to the...\n\n0:35:51\tSPEAKER_00\n I don't know.\n\n0:35:52\tSPEAKER_00\n For skipping watch, watch my channel.\n\n0:35:53\tSPEAKER_00\n She used to have to skip the channel button.\n\n0:35:55\tSPEAKER_02\n Yeah.\n\n0:35:56\tSPEAKER_02\n But users tend to want to use that.\n\n0:35:57\tSPEAKER_02\n And once they lose out and they use it, experience it like...\n\n0:36:00\tSPEAKER_02\n Okay.\n\n0:36:01\tSPEAKER_02\n Because that becomes the most accessible...\n\n0:36:02\tSPEAKER_02\n Okay.\n\n0:36:03\tSPEAKER_01\n But that's not a bad thing, is it?\n\n0:36:04\tSPEAKER_01\n Just.\n\n0:36:05\tSPEAKER_01\n Because if you think about it, the alternative is to go push the button.\n\n0:36:08\tSPEAKER_01\n Yeah.\n\n0:36:09\tSPEAKER_01\n And it's not much easier than that.\n\n0:36:12\tSPEAKER_05\n Okay.\n\n0:36:13\tSPEAKER_05\n Right.\n\n0:36:14\tSPEAKER_05\n Well, we do need to make a decision on whether we want to incorporate a job dial in nice and quickly.\n\n0:36:18\tSPEAKER_05\n I will afford them actually.\n\n0:36:19\tSPEAKER_05\n I think they're quite unique, very quick to use.\n\n0:36:22\tSPEAKER_05\n So does anybody oppose the idea of incorporating one into the design at all?\n\n0:36:27\tSPEAKER_05\n No.\n\n0:36:28\tSPEAKER_05\n And the other thing was, can we think of anyway getting the slogan into this thing?\n\n0:36:33\tSPEAKER_01\n Yeah.\n\n0:36:34\tSPEAKER_01\n I mean, if we...\n\n0:36:35\tSPEAKER_01\n If we keep coming back to this board here, it wouldn't be surprised if we could take this idea.\n\n0:36:40\tSPEAKER_01\n Imagine that, I don't know, that it's within the shape of the hand, it's quite small.\n\n0:36:45\tSPEAKER_05\n Oh, okay.\n\n0:36:46\tSPEAKER_05\n I don't know.\n\n0:36:47\tSPEAKER_01\n We really got to wrap up.\n\n0:36:48\tSPEAKER_01\n Yeah.\n\n0:36:49\tSPEAKER_01\n Yeah.\n\n0:36:50\tSPEAKER_01\n It's small.\n\n0:36:51\tSPEAKER_01\n And that we've got like the slogan, somewhere like on the casing, at the side.\n\n0:36:55\tSPEAKER_01\n Well, if we can do that, great.\n\n0:36:56\tSPEAKER_01\n Yeah.\n\n0:36:57\tSPEAKER_01\n Yeah.\n\n0:36:58\tSPEAKER_01\n Well, I mean, isn't that what we just said, said we just have to decide now?\n\n0:37:02\tSPEAKER_05\n Yeah.\n\n0:37:03\tSPEAKER_05\n Let's try and get the slogan on there.\n\n0:37:05\tSPEAKER_02\n And then like a jog, a band, a shape of the...\n\n0:37:08\tSPEAKER_01\n And then like a jog dial, somewhere that fits in with the shape of it, like, I don't know, like, here, in with that.\n\n0:37:15\tSPEAKER_02\n That might have one problem in terms of...\n\n0:37:17\tSPEAKER_02\n In terms of whether you're left-handed or you're right-handed, you might be locking yourself in.\n\n0:37:22\tSPEAKER_02\n Or maybe just fitting in, like, down the middle here.\n\n0:37:24\tSPEAKER_02\n Okay.\n\n0:37:25\tSPEAKER_02\n Can I just jump in and suggest I'm not going to answer that?\n\n0:37:27\tSPEAKER_05\n I'm really going to have to hurry on here, because we're actually over time.\n\n0:37:30\tSPEAKER_05\n It's kind of...\n\n0:37:31\tSPEAKER_05\n Is there anything anybody's unsure about just for enclosing?\n\n0:37:35\tSPEAKER_05\n The next meeting is going to be in 30 minutes, and so you can see in the screen here, what each of you are going to hopefully be doing.\n\n0:37:40\tSPEAKER_05\n And I know that the designer is going to be working with PlayDoh and that.\n\n0:37:44\tSPEAKER_05\n So that will be...\n\n0:37:46\tSPEAKER_05\n That will be good.\n\n0:37:47\tSPEAKER_05\n And I'll get the minutes to have the scene as possible.\n\n0:37:51\tSPEAKER_05\n Anything at all, you think we haven't discussed that we need to?\n\n0:37:54\tSPEAKER_05\n Everybody kind of happy about what they're going to be doing?\n\n0:37:57\tSPEAKER_02\n I think one thing would be the jog dial, because that's going to have quite a big impact on the same...\n\n0:38:03\tSPEAKER_01\n Yeah, I think the jog dial, you know it just after you do that?\n\n0:38:05\tSPEAKER_01\n What if it was flat and you just...\n\n0:38:06\tSPEAKER_01\n Yeah, that's what I was thinking.\n\n0:38:07\tSPEAKER_02\n That would be great.\n\n0:38:08\tSPEAKER_02\n A slide, because then you don't have to put the hand.\n\n0:38:10\tSPEAKER_02\n Yeah.\n\n0:38:11\tSPEAKER_02\n I think incorporating your logo is quite straightforward.\n\n0:38:12\tSPEAKER_02\n There's lots of space for it.\n\n0:38:14\tSPEAKER_02\n That's kind of a design thing that you guys can just...\n\n0:38:16\tSPEAKER_02\n Yeah.\n\n0:38:17\tSPEAKER_02\n...but it's also a marketing and a function...\n\n0:38:19\tSPEAKER_01\n Okay.\n\n0:38:20\tSPEAKER_01\n And materials, we sort of said we do plastic and rubber to my hand.\n\n0:38:23\tSPEAKER_01\n Yeah.\n\n0:38:24\tSPEAKER_01\n I think maybe we should try and stay away from just the big protruding rubber buttons, because that'll just be so standard.\n\n0:38:29\tSPEAKER_05\n Do we have something flush with the case?\n\n0:38:31\tSPEAKER_01\n Something a bit more flush.\n\n0:38:32\tSPEAKER_01\n Yeah.\n\n0:38:33\tSPEAKER_01\n Maybe we have rubber incorporated into the case as well, so that it has...\n\n0:38:36\tSPEAKER_01\n And also plastic, I've seen, can get really textured.\n\n0:38:39\tSPEAKER_01\n So you can get plastics that actually feel soft in your hand.\n\n0:38:42\tSPEAKER_01\n It feels like fruit.\n\n0:38:43\tSPEAKER_01\n It's kind of like...\n\n0:38:46\tSPEAKER_01\n No, no.\n\n0:38:47\tSPEAKER_01\n You'd think that they were rubber, but they're not.\n\n0:38:49\tSPEAKER_01\n They're actually just plastic that's textured.\n\n0:38:51\tSPEAKER_01\n Kind of like that.\n\n0:38:52\tSPEAKER_05\n Kind of like that, yeah.\n\n0:38:54\tSPEAKER_05\n I'm going to have to call this to your close, because we're away every time.\n\n0:38:56\tSPEAKER_05\n So that's really good.\n\n0:38:58\tSPEAKER_05\n Like we've had so much to talk about, that's pretty much run out of time to do so.\n\n0:39:03\tSPEAKER_05\n So what do you do?\n\n0:39:05\tSPEAKER_05\n And design stuff.\n\n0:39:07\tSPEAKER_05\n Ooh.\n\n0:39:08\tSPEAKER_05\n Played all day.\n\n0:39:10\tSPEAKER_05\n Yeah, quite jealous actually.\n\n0:39:12\tSPEAKER_05\n You got to choose first.\n\n0:39:16\tSPEAKER_02\n Yeah, we're kidding.\n\n0:39:18\tSPEAKER_02\n Okay.\n\n0:39:25\tSPEAKER_02\n Can I just swipe your power cable and don't think it matters?\n\n0:39:35\tSPEAKER_02\n Okay.\n\n0:39:36\tSPEAKER_02\n I'm going to pull everybody out first, and then put in whatever needs to be left.\n\n0:39:42\tSPEAKER_02\n That's you.\n\n0:39:49\tNone\n Yeah.\n\n0:39:52\tSPEAKER_04\n This is real.\n\n0:39:55\tSPEAKER_02\n That's all there.\n\n0:39:57\tSPEAKER_02\n Oops.\n\n0:39:59\tSPEAKER_02\n I'm going to take the microphone, because it's too lazy to take the mouth away.\n\n0:40:05\tSPEAKER_03\n Cool.\n\n0:40:08\tNone\n Okay.\n\n0:40:15\tNone\n Okay.\n\n0:40:22\tNone\n Okay.\n\n0:40:32\tNone\n Okay.\n\n0:40:39\tNone\n Okay.\n\n", "summary": [{"summary_text": "At the last meeting, the target group was 15 to 35 and the battery part was going to be normally a chargeable battery part. There were three new requirements about ignoring teletext, ignoring everything except the TV and trying to incorporate the corporate color and slogan. The final objective of the meeting is to reach a decision on the concepts of the product."}]}