{"filename": "./data/ES2005b.txt", "transcript": "0:00:00\tSPEAKER_03\n It's from the last meeting which were essentially that we had decided on rules for each of you.\n\n0:00:12\tSPEAKER_03\n However, there are some changes that I've got from on high that are a bit there.\n\n0:00:21\tSPEAKER_03\n What I didn't actually realize was that this is for a specific television.\n\n0:00:28\tSPEAKER_03\n So they're all in one idea because I don't know.\n\n0:00:31\tSPEAKER_03\n And they require that they...\n\n0:00:36\tSPEAKER_03\n I'll get to that as you see it's point number four.\n\n0:00:40\tSPEAKER_03\n And we'll get what you've got and then we can see what we're going to do from it.\n\n0:00:45\tSPEAKER_03\n So presentations, were you...\n\n0:00:49\tSPEAKER_03\n Anybody got?\n\n0:00:51\tSPEAKER_03\n Yeah.\n\n0:00:52\tSPEAKER_03\n Wearing to go?\n\n0:00:53\tSPEAKER_03\n Okay.\n\n0:00:54\tSPEAKER_03\n I need to plug you in.\n\n0:01:04\tSPEAKER_03\n I'm not just a...\n\n0:01:11\tSPEAKER_03\n It's a...\n\n0:01:19\tSPEAKER_02\n A inspired design.\n\n0:01:26\tSPEAKER_03\n Do you want me to move?\n\n0:01:29\tSPEAKER_03\n I'm just going to screw it in.\n\n0:01:31\tSPEAKER_03\n I'm going to swap it in.\n\n0:01:36\tSPEAKER_03\n With function F8.\n\n0:01:40\tSPEAKER_03\n Let's see, we blew one of the hearts out of the F8.\n\n0:01:46\tSPEAKER_03\n Yeah.\n\n0:01:53\tNone\n Yeah.\n\n0:01:56\tSPEAKER_00\n Me again, Raj as a marketing expert.\n\n0:02:03\tSPEAKER_00\n As we have decided in the last meeting that I have to find out.\n\n0:02:07\tSPEAKER_03\n Someone's fine.\n\n0:02:10\tSPEAKER_00\n I'm sorry.\n\n0:02:17\tSPEAKER_00\n I have to look at the market potential for this product.\n\n0:02:28\tSPEAKER_00\n Consumer likings and everything.\n\n0:02:31\tSPEAKER_00\n What is the potential for this product?\n\n0:02:33\tSPEAKER_00\n Are we able to achieve this our net profit or our aim?\n\n0:02:38\tSPEAKER_03\n Then...\n\n0:02:45\tSPEAKER_00\n Press F5 to start.\n\n0:02:52\tSPEAKER_00\n Then the methodology I adopted to find out all this was market survey.\n\n0:02:58\tSPEAKER_00\n A detailed market survey on consumers was done to find out their likings and dislikings.\n\n0:03:03\tSPEAKER_00\n But they prefer, but they not prefer, but what problems they do encounter in all these types of things.\n\n0:03:09\tSPEAKER_00\n And what we got first, we found that...\n\n0:03:15\tSPEAKER_00\n But they...\n\n0:03:16\tSPEAKER_00\n What problems they are having with the grant remote controls available in the market?\n\n0:03:22\tSPEAKER_00\n 75% of users, they find that the remote controls available in the market are ugly.\n\n0:03:27\tSPEAKER_00\n They are not so good looking.\n\n0:03:29\tSPEAKER_00\n So we have to put stress on this.\n\n0:03:34\tSPEAKER_00\n We have to take care of this factor also like our design should be appropriate, should be good looking for the consumers.\n\n0:03:40\tSPEAKER_00\n And yes, this will definitely...\n\n0:03:44\tSPEAKER_00\n This can definitely put in house our sales.\n\n0:03:50\tSPEAKER_00\n And even the good thing about this is that 80% of users, they are willing to pay more for this good looking remote controls also.\n\n0:03:58\tSPEAKER_00\n So even if the available market cost for the available remote control is less, even then we can sell it at 25 euros, which may seem quite high.\n\n0:04:12\tSPEAKER_00\n But if our looks are...\n\n0:04:14\tSPEAKER_00\n If the remote control we design have a better look, better designs, then we can hope that consumers will prefer these remote controls.\n\n0:04:24\tSPEAKER_00\n And the second thing, some companies think that they should have more and more functions of the users in their remote controls.\n\n0:04:41\tSPEAKER_00\n But rather than those having more functions in the remote controls, we should emphasize what actually consumers want, what they operate, rather than making it too complicated.\n\n0:04:51\tSPEAKER_00\n Because mostly it has been found that 50% of the users, they use only 10% of the buttons.\n\n0:04:56\tSPEAKER_00\n So there is no fund of having 90% buttons making the remote controls too bulky, too complicated, too expensive.\n\n0:05:04\tSPEAKER_00\n And because I think I believe that technologies use will only if the consumers they want to use it.\n\n0:05:11\tSPEAKER_00\n Otherwise there is no fund of having all this type of thing.\n\n0:05:14\tSPEAKER_00\n So this will not only reduce the cost of our remote controls, but it will increase our profit also.\n\n0:05:21\tSPEAKER_00\n So we have to take care of this factor also.\n\n0:05:24\tSPEAKER_00\n It was function I want to go.\n\n0:05:28\tSPEAKER_03\n Oh, you are going to go back just to escape.\n\n0:05:32\tSPEAKER_00\n Then if we look at this slide, these are your shared documents.\n\n0:05:39\tSPEAKER_00\n You can see.\n\n0:05:44\tSPEAKER_01\n I was just going to say what was the question for us.\n\n0:05:46\tSPEAKER_01\n Are you coming onto that?\n\n0:05:49\tSPEAKER_00\n Look at the market potential.\n\n0:05:51\tSPEAKER_00\n But how we should design our remote controls, what it should be there.\n\n0:05:55\tSPEAKER_00\n So as to enhance our profit.\n\n0:05:59\tSPEAKER_00\n So these are different age group persons.\n\n0:06:03\tSPEAKER_00\n Like sorry, I can open it in another way.\n\n0:06:10\tSPEAKER_03\n Speechwork here.\n\n0:06:12\tSPEAKER_00\n If we look at the cost, whether the consumers they are willing to pay more for speech recognition in their remote control or not, we can find that the up to a 35 year age group, we have a very good disliking for this point like for speech recognition in their remote control.\n\n0:06:31\tSPEAKER_00\n So we can emphasize on this point also.\n\n0:06:34\tSPEAKER_00\n Because it will definitely enhance our sales in this particular age group from 15 to 35.\n\n0:06:42\tSPEAKER_00\n And I think that most of the users of the TV are belong to this age group.\n\n0:06:48\tSPEAKER_00\n So we should look at who buys it as well.\n\n0:06:52\tSPEAKER_00\n Yeah, we can look at that factor also.\n\n0:06:56\tSPEAKER_03\n Which other 25 to 35 is usually.\n\n0:07:02\tSPEAKER_00\n Yeah.\n\n0:07:05\tSPEAKER_00\n And...\n\n0:07:09\tSPEAKER_00\n Yes.\n\n0:07:14\tSPEAKER_00\n If we look at this data, how what are the problems because the consumers are facing with the existing remote controls in the market?\n\n0:07:25\tSPEAKER_00\n They find that 35% of the consumers find too difficult to operate in remote control.\n\n0:07:32\tSPEAKER_00\n So it should be in such a way that it should be easy to learn how to operate these remote controls.\n\n0:07:39\tSPEAKER_00\n And we should provide proper manuals, files, use also.\n\n0:07:43\tSPEAKER_00\n So as that consumers could easily learn and need not to have any much technical knowledge to see to know how to operate these remote controls.\n\n0:07:52\tSPEAKER_00\n So this is also a very major factor to take into consideration to enhance our profits and sales.\n\n0:08:00\tSPEAKER_00\n So this is all about market potential by me.\n\n0:08:07\tSPEAKER_03\n Yes.\n\n0:08:10\tSPEAKER_03\n Okay, thank you.\n\n0:08:13\tSPEAKER_03\n Oh, that's cool.\n\n0:08:22\tSPEAKER_03\n Oh, so we do.\n\n0:08:26\tSPEAKER_00\n I don't know if the cable's going to be long.\n\n0:08:30\tSPEAKER_01\n I just can't get over whatever runs or underneath.\n\n0:08:35\tSPEAKER_01\n Okay, and then what do I press F8?\n\n0:08:46\tSPEAKER_00\n F8.\n\n0:08:47\tSPEAKER_01\n Function F8.\n\n0:08:52\tSPEAKER_00\n Okay, cool.\n\n0:08:53\tSPEAKER_00\n It's not coming up.\n\n0:08:54\tSPEAKER_00\n Function F8, again.\n\n0:09:00\tSPEAKER_01\n Yeah.\n\n0:09:01\tSPEAKER_01\n Yeah, no signal.\n\n0:09:04\tSPEAKER_00\n There you go.\n\n0:09:08\tSPEAKER_00\n Computer.\n\n0:09:09\tSPEAKER_00\n Okay.\n\n0:09:14\tSPEAKER_01\n Okay, and then how do I press the big one to get it off to the F5?\n\n0:09:18\tSPEAKER_01\n F5, and I press that again to get it all.\n\n0:09:21\tSPEAKER_03\n F5, and the cable bring it back and just the left button for advancing.\n\n0:09:28\tSPEAKER_01\n Okay, so I'm the interface designer user interface designer.\n\n0:09:35\tSPEAKER_01\n I'm concerned with what effect the operator should have on the user.\n\n0:09:43\tSPEAKER_01\n I'm also, I want to point out that our motto put the fashion in electronics.\n\n0:09:51\tSPEAKER_01\n And then we're going to make a product that's trendy and fashionable.\n\n0:09:58\tSPEAKER_01\n And how do I press the next button?\n\n0:10:01\tSPEAKER_01\n Just a left there.\n\n0:10:04\tSPEAKER_01\n So I looked at existing designs and also the information that Raj gave us was very useful about what people like, what people dislike.\n\n0:10:15\tSPEAKER_01\n What people fashionable because we said people between 25 and 35 were the main buyers of our TV, I think.\n\n0:10:25\tSPEAKER_01\n So what they like and what they find fashionable and ergonomics research.\n\n0:10:32\tSPEAKER_01\n I don't know, I haven't actually been able to do any of this myself, but maybe that comes up, I don't know.\n\n0:10:40\tSPEAKER_01\n And the findings, well, that was a basic function, send messages to the television set.\n\n0:10:48\tSPEAKER_01\n That's what people want to do.\n\n0:10:51\tSPEAKER_01\n So they need to be included.\n\n0:10:54\tSPEAKER_01\n But I've got some pictures here of some leading ones.\n\n0:10:58\tSPEAKER_01\n I don't know how to get some.\n\n0:11:00\tSPEAKER_03\n If you're a scape, then you can see your bar.\n\n0:11:04\tSPEAKER_01\n Oh, okay, cool.\n\n0:11:06\tSPEAKER_01\n I've got the glasses.\n\n0:11:07\tSPEAKER_01\n I hope it fits.\n\n0:11:10\tSPEAKER_01\n These are two leading remote controls at the moment.\n\n0:11:13\tSPEAKER_01\n You know, they're gray.\n\n0:11:15\tSPEAKER_01\n I mean, this one's got loads of buttons.\n\n0:11:17\tSPEAKER_01\n It's hard to tell from here what they actually do.\n\n0:11:21\tSPEAKER_01\n And they're doing very exciting at all.\n\n0:11:24\tSPEAKER_01\n Personally, I prefer this one just because it's no easier to use.\n\n0:11:28\tSPEAKER_01\n It's a bit more sleek with more of this silver stuff.\n\n0:11:33\tSPEAKER_01\n But there you go.\n\n0:11:35\tSPEAKER_01\n I think we can do much better than that.\n\n0:11:38\tSPEAKER_01\n I hope so.\n\n0:11:41\tSPEAKER_01\n Hang on.\n\n0:11:44\tSPEAKER_01\n F5.\n\n0:11:45\tSPEAKER_01\n Okay, sorry.\n\n0:11:48\tSPEAKER_01\n Personal preferences.\n\n0:11:51\tSPEAKER_01\n Well, I think we need to, I think the ergonomics is quite important.\n\n0:11:58\tSPEAKER_03\n Particularly, yeah.\n\n0:12:00\tSPEAKER_03\n There was a bit in the RSI and things as well.\n\n0:12:04\tSPEAKER_01\n And I thought not too edgy and like a box, more kind of handheld, more.\n\n0:12:12\tSPEAKER_01\n Not as a computer and organic.\n\n0:12:16\tSPEAKER_01\n Organic, yeah, more organic shape, I think.\n\n0:12:19\tSPEAKER_01\n Simple designs.\n\n0:12:20\tSPEAKER_01\n Like the last one we just saw, not too many buttons.\n\n0:12:23\tSPEAKER_01\n And as a Raj point out, only 10%, 50% of people only use 10% of the buttons.\n\n0:12:29\tSPEAKER_01\n So I think what we can miss out on the buttons we can make up for in design and how nice it is.\n\n0:12:38\tSPEAKER_01\n Handheld and portable, I think, is important.\n\n0:12:42\tSPEAKER_01\n Because TFT have just released, I think, is it a remote control for presentations or a big screen?\n\n0:12:53\tSPEAKER_01\n Yeah, not so many, anyway.\n\n0:13:00\tSPEAKER_01\n So handheld and portable.\n\n0:13:05\tSPEAKER_01\n I thought about other functions for TV, but as you pointed out, people don't actually want that.\n\n0:13:10\tSPEAKER_03\n And also the company wants to keep it stuck to the TV for, to keep them stuck to the TV.\n\n0:13:16\tSPEAKER_01\n It's the one TV.\n\n0:13:18\tSPEAKER_01\n And so the last thing I thought, which I quickly mentioned in the other one, was maybe a bit of a gimmick to set us apart from other people, like blowing the dark.\n\n0:13:28\tSPEAKER_01\n Which does already exist, but it's not very widely used.\n\n0:13:33\tSPEAKER_01\n I don't think easy finder with a whistle function or something or rechargeable station because it's pain when you run out of batteries.\n\n0:13:42\tSPEAKER_01\n And I think that, yeah, that's it.\n\n0:13:45\tSPEAKER_02\n So I noticed we talked about speech recognition and whistling.\n\n0:13:51\tSPEAKER_02\n And I just curious now, have we done any research on how many people can whistle?\n\n0:13:57\tSPEAKER_02\n Or is that a function we want in the remote?\n\n0:14:01\tSPEAKER_02\n Do you have trouble whistling?\n\n0:14:03\tSPEAKER_02\n I don't, but I know a lot of people do, really?\n\n0:14:06\tSPEAKER_02\n Yeah, it just, I mean, it has to be a certain kind of whistling, too.\n\n0:14:09\tSPEAKER_02\n Yeah, it's whistling, too.\n\n0:14:11\tSPEAKER_03\n So you could have the, you could have the basically instead of a whistle, if it's got the voice recognition, you could have it just, you know, where are you?\n\n0:14:19\tSPEAKER_02\n Yeah, it's costly though.\n\n0:14:21\tSPEAKER_02\n Much easier thing is just any loud noise, like clapping, shouting, you know, that's good.\n\n0:14:28\tSPEAKER_02\n And then would the response be a beep's back, or something?\n\n0:14:31\tSPEAKER_01\n Yeah, something.\n\n0:14:33\tSPEAKER_02\n Okay.\n\n0:14:35\tSPEAKER_02\n Well, I said this up, so plug it in, press F5, function F5, function F8 for the function F8.\n\n0:14:47\tSPEAKER_02\n Yeah.\n\n0:14:49\tSPEAKER_01\n I need to twit on the thing, you got to think?\n\n0:14:53\tSPEAKER_02\n I think it's just lacking in.\n\n0:14:57\tSPEAKER_02\n It's good.\n\n0:14:58\tSPEAKER_02\n Okay.\n\n0:15:00\tNone\n Yeah.\n\n0:15:02\tSPEAKER_02\n Okay.\n\n0:15:07\tSPEAKER_02\n So as the industrial designer, my job is to take an input from you guys.\n\n0:15:15\tSPEAKER_02\n So it's good you went first.\n\n0:15:17\tSPEAKER_02\n And I shot it down some notes as to what are the needs.\n\n0:15:21\tSPEAKER_02\n And what kind of novel features we can add to differentiate our product from the others.\n\n0:15:26\tSPEAKER_02\n So Raj told us that consumers are going to spend more for fancy products.\n\n0:15:34\tSPEAKER_02\n And we also mentioned that the current products don't always match users operating behavior.\n\n0:15:43\tSPEAKER_02\n A lot of the buttons aren't used.\n\n0:15:45\tSPEAKER_02\n And mention that they're not fun to use.\n\n0:15:51\tSPEAKER_02\n And a novel feature, which you just brought up with this automatic speech recognition feature, or noise detection feature for when you lose your remote, there could be a little microphone on it.\n\n0:16:04\tSPEAKER_02\n And any noise over a certain threshold, it'll pick up as a distress signal from you.\n\n0:16:11\tSPEAKER_02\n And I'll beep back and say, no, here I am.\n\n0:16:14\tSPEAKER_03\n Sure, surely that would have to be sort of specific, rather, above a threshold.\n\n0:16:19\tSPEAKER_03\n Because if you had a live movie on you, likely you could get it back at you.\n\n0:16:23\tSPEAKER_02\n Well, maybe you could have a...\n\n0:16:27\tSPEAKER_02\n That would be a consideration to take into account this.\n\n0:16:32\tSPEAKER_03\n Sorry, didn't mean to do really either.\n\n0:16:34\tSPEAKER_02\n Yeah, well, that's for later down the road.\n\n0:16:37\tSPEAKER_02\n And then as for the user interface, it should be trendy.\n\n0:16:42\tSPEAKER_02\n I am not computer-y.\n\n0:16:44\tSPEAKER_02\n So more low tech.\n\n0:16:46\tSPEAKER_02\n And not too many buttons.\n\n0:16:48\tSPEAKER_02\n So I took these onto consideration.\n\n0:16:51\tSPEAKER_02\n And also I have some limitations from the boss.\n\n0:16:56\tSPEAKER_02\n And practical limitations, which I kind of threw out the window.\n\n0:17:02\tSPEAKER_02\n And so I did a little research.\n\n0:17:05\tSPEAKER_02\n And unfortunately, all I had to work on was our corporate archives of the great products we've made before, which include spacecraft, coffee makers, and boat trains.\n\n0:17:19\tSPEAKER_02\n Oh, is that what they're...\n\n0:17:21\tSPEAKER_02\n Or high speed trains.\n\n0:17:22\tSPEAKER_02\n Right, and having personally worked with all these products, I have a great deal of experience with the industrial design.\n\n0:17:29\tSPEAKER_03\n If you can build spacecraft, you'll have no problem with our control.\n\n0:17:33\tSPEAKER_02\n So I figured, just put them all together.\n\n0:17:38\tSPEAKER_02\n We had a caffeine-powered space shuttle train transport to your TV.\n\n0:17:45\tSPEAKER_02\n And as for the user interface problem, too many buttons.\n\n0:17:51\tSPEAKER_02\n Give it one button.\n\n0:17:54\tSPEAKER_02\n And it's for the cowboy and all of us.\n\n0:18:00\tSPEAKER_02\n I'm not quite sure what the function is there.\n\n0:18:03\tSPEAKER_01\n Well, I like that design.\n\n0:18:05\tSPEAKER_02\n I mean, you could have a...\n\n0:18:08\tSPEAKER_03\n Is that just switches on the speed recognition that it's entirely speech-operated?\n\n0:18:12\tSPEAKER_02\n So I think I missed the budget thing.\n\n0:18:14\tSPEAKER_02\n It was 15 million euros.\n\n0:18:16\tSPEAKER_02\n And we got a sold 25 of them.\n\n0:18:19\tSPEAKER_01\n Not a problem.\n\n0:18:20\tSPEAKER_03\n OK, no, it's after 9 euros.\n\n0:18:23\tSPEAKER_03\n We've got a...\n\n0:18:24\tSPEAKER_03\n We've got a profit.\n\n0:18:26\tSPEAKER_03\n We've got a profit.\n\n0:18:27\tSPEAKER_03\n So we're making that at 12.5 euros a time.\n\n0:18:30\tSPEAKER_02\n Well, I guess more realistically than.\n\n0:18:32\tSPEAKER_02\n We need a product that's got some kind of nifty outer casing, cheap plastic.\n\n0:18:38\tSPEAKER_02\n That should be just like a 10 to the price maybe or less.\n\n0:18:42\tSPEAKER_02\n An energy source, which would probably just be your regular batteries.\n\n0:18:47\tSPEAKER_03\n Would it be possible to have the rechargeable idea?\n\n0:18:51\tSPEAKER_02\n It's like a little bit stationary.\n\n0:18:54\tSPEAKER_02\n Yeah, we could do that too.\n\n0:18:56\tSPEAKER_02\n I hadn't thought of that.\n\n0:18:58\tSPEAKER_01\n That might cost more though, because obviously with batteries, we don't need to provide...\n\n0:19:02\tSPEAKER_01\n Or we provide the first batteries, but...\n\n0:19:04\tSPEAKER_01\n Yeah, yeah.\n\n0:19:05\tSPEAKER_01\n It's more...\n\n0:19:06\tSPEAKER_01\n It does cheaper.\n\n0:19:07\tSPEAKER_03\n I mean, if you think about these base stations though, it's essentially just a lead with a...\n\n0:19:11\tSPEAKER_03\n Self-connecting brake.\n\n0:19:13\tSPEAKER_03\n So...\n\n0:19:14\tSPEAKER_03\n Right, I don't think I'd be able to...\n\n0:19:16\tSPEAKER_02\n I'll price that one.\n\n0:19:17\tSPEAKER_02\n The user interface, the canonical user interface for these would be just a bunch of buttons.\n\n0:19:22\tSPEAKER_02\n But since we're a cutting-edge company, we of course will have alternatives.\n\n0:19:27\tSPEAKER_02\n Like speech recognition, whistling recognition, then rocket power.\n\n0:19:33\tSPEAKER_02\n Okay.\n\n0:19:34\tSPEAKER_02\n And lastly, the transmission interface is just some engineering thing.\n\n0:19:41\tSPEAKER_02\n You don't have to worry about that.\n\n0:19:43\tSPEAKER_02\n So here's a great schematic that my apprentice designer gave me.\n\n0:19:50\tSPEAKER_02\n As you can see, the remote control have parts and those parts, like that.\n\n0:19:55\tSPEAKER_02\n And, you know, it's got a...\n\n0:19:59\tSPEAKER_02\n Well, operating procedure.\n\n0:20:01\tSPEAKER_02\n It looks something like that.\n\n0:20:04\tSPEAKER_02\n And I suppose you all know how it works, because we've all used it.\n\n0:20:08\tSPEAKER_02\n And we wouldn't be in a company designing remote controls if we didn't know what they were.\n\n0:20:13\tSPEAKER_02\n Personal preferences, I think, programmable options, which just require a small amount of memory, non-volatile memory, just...\n\n0:20:25\tSPEAKER_02\n So the user can put in their favorite channels and maybe their preferred volume settings that would turn it on.\n\n0:20:31\tSPEAKER_02\n It's not blasting.\n\n0:20:32\tSPEAKER_01\n That's a good idea, actually.\n\n0:20:33\tSPEAKER_01\n I like the performance of the options.\n\n0:20:35\tSPEAKER_02\n Yeah, you do.\n\n0:20:36\tSPEAKER_02\n And the bells and whistles that we mentioned, you know, take more budgeting, more technical expenditure of effort.\n\n0:20:46\tSPEAKER_02\n And it's also much more likely to not work if we add these bells and whistles.\n\n0:20:51\tSPEAKER_03\n So I got...\n\n0:20:54\tSPEAKER_03\n Okay, thank you so much.\n\n0:20:56\tSPEAKER_03\n I'll take that back.\n\n0:21:04\tSPEAKER_03\n Right, also, so, you know what I said, got not very long before we think so.\n\n0:21:09\tSPEAKER_03\n Didn't manage to forward it onto you, is...\n\n0:21:12\tSPEAKER_03\n I'm just going to say I'll find it for some...\n\n0:21:22\tSPEAKER_02\n Oh, I think it needs to go in there.\n\n0:21:25\tSPEAKER_02\n Just...\n\n0:21:32\tSPEAKER_03\n We had that to disinclute telltext because it's become outdated, nobody uses it in any way.\n\n0:21:44\tSPEAKER_03\n Oracle would have to say with that, but no, but...\n\n0:21:47\tSPEAKER_03\n It's only for the television, which I'm presuming means it's for a specific television.\n\n0:21:52\tSPEAKER_03\n Okay.\n\n0:21:53\tSPEAKER_03\n And instead of colors and...\n\n0:21:56\tSPEAKER_03\n sort of color options, they want corporate color and slogan somehow implemented a new design.\n\n0:22:03\tSPEAKER_01\n Corporate color.\n\n0:22:04\tSPEAKER_03\n Yellow.\n\n0:22:05\tSPEAKER_03\n I presume.\n\n0:22:10\tSPEAKER_03\n Everything, all this sort of, you know, the corporate website and everything's yellow.\n\n0:22:17\tSPEAKER_03\n And the local...\n\n0:22:21\tSPEAKER_03\n So it's Logan, we put the fashion and electronics.\n\n0:22:25\tSPEAKER_03\n I don't know exactly how to incorporate...\n\n0:22:31\tSPEAKER_03\n I mean, I guess if you're going for a sort of globular shape, you could kind of have it working as way around it or something.\n\n0:22:39\tSPEAKER_03\n Where are my...\n\n0:22:43\tSPEAKER_03\n Okay.\n\n0:22:47\tSPEAKER_03\n So we have to decide on which functions we're going to actually have.\n\n0:22:55\tSPEAKER_03\n Now, we had, as listed options, we had speech recognition, potentially, flat screen interface, LCD interface.\n\n0:23:09\tSPEAKER_03\n We also want to limit their number of buttons.\n\n0:23:13\tSPEAKER_03\n So we'll pretty much take that one as red.\n\n0:23:15\tSPEAKER_03\n We'll use the basic functions for our television.\n\n0:23:18\tSPEAKER_03\n No teletext.\n\n0:23:21\tSPEAKER_01\n Although the danger with that is it could look a bit cheap.\n\n0:23:26\tSPEAKER_03\n Not enough buttons, you mean the hair.\n\n0:23:29\tSPEAKER_03\n Well...\n\n0:23:30\tSPEAKER_03\n So it's a striker balance between a few and a...\n\n0:23:32\tSPEAKER_03\n Or it looks like we're just cutting on the...\n\n0:23:35\tSPEAKER_01\n On number of buttons, can I...\n\n0:23:37\tSPEAKER_03\n I do, however, have this from over my head.\n\n0:23:40\tSPEAKER_03\n Okay.\n\n0:23:41\tSPEAKER_03\n They don't want teletext on it.\n\n0:23:43\tSPEAKER_03\n Okay, cool.\n\n0:23:44\tSPEAKER_03\n Maybe, Raj, you could find out what people would think about that on the little thing.\n\n0:23:51\tSPEAKER_03\n About the...\n\n0:23:52\tSPEAKER_03\n What people...\n\n0:23:53\tSPEAKER_03\n Other people would require teletext.\n\n0:23:56\tSPEAKER_03\n In the teletext option, in the remote control.\n\n0:23:59\tSPEAKER_03\n Attached.\n\n0:24:02\tSPEAKER_03\n Okay.\n\n0:24:06\tSPEAKER_03\n So I take it your position now, always, that...\n\n0:24:10\tSPEAKER_03\n The bells and whistles we've got to come up with a gimmick, but not too complicated to gimmick it.\n\n0:24:16\tSPEAKER_03\n Yeah.\n\n0:24:18\tSPEAKER_03\n So...\n\n0:24:19\tSPEAKER_03\n I mean, the sort of inkling I'm getting from a little bit of web chanel I'm getting sent is that they're quite interested in a TFT display, interactive display.\n\n0:24:30\tSPEAKER_03\n However, that does say in a bit like the...\n\n0:24:34\tSPEAKER_03\n More complicated design that Raj...\n\n0:24:37\tSPEAKER_03\n Sorry, Raj.\n\n0:24:39\tSPEAKER_03\n I said people didn't like it.\n\n0:24:43\tSPEAKER_03\n Although, I guess, if there's a sort of thing about standard interfaces that people use already, sort of windows style, drop down menus, or whatever, I think maybe that's a bit...\n\n0:24:54\tSPEAKER_03\n Yeah.\n\n0:24:55\tSPEAKER_03\n Going a bit far, but, you know, like in a basic sense that you could have your basic selection of buttons, and if you hit that sort of menu at the top, you have...\n\n0:25:06\tSPEAKER_03\n It goes to a different selection of buttons, so it keeps it simple.\n\n0:25:10\tSPEAKER_03\n Okay.\n\n0:25:11\tSPEAKER_03\n Going the dark, is that sort of with a light inside it, or is it...\n\n0:25:16\tSPEAKER_03\n Going the dark material.\n\n0:25:18\tSPEAKER_01\n Going the dark material, and I was thinking.\n\n0:25:20\tSPEAKER_01\n So...\n\n0:25:21\tSPEAKER_01\n I guess that would be cheap kind of.\n\n0:25:23\tSPEAKER_00\n I'll be able to see something about this.\n\n0:25:25\tSPEAKER_00\n Yeah.\n\n0:25:26\tSPEAKER_00\n I think it's really, really very important point, is if we look at the market, because people, 50% people, they find that the mode controls are often lost somewhere in the room.\n\n0:25:37\tSPEAKER_00\n In the room.\n\n0:25:38\tSPEAKER_00\n But from last.\n\n0:25:39\tSPEAKER_00\n Yeah, are lost.\n\n0:25:41\tSPEAKER_00\n And means they forget where they have kept the mode control last time.\n\n0:25:44\tSPEAKER_00\n But if we add speech recognition, as well as glowing the dark, and both these factors will help them locating their mode control.\n\n0:25:52\tSPEAKER_00\n Like, if they come and speak something, and the mode control replies to something, something, and it glows in the dark.\n\n0:26:00\tSPEAKER_00\n Both these factors, both these points will help them to locate where they have kept this remote control.\n\n0:26:06\tSPEAKER_00\n And this will definitely enhance our market sales.\n\n0:26:10\tSPEAKER_00\n So we should take it into consideration also.\n\n0:26:13\tSPEAKER_00\n Okay.\n\n0:26:14\tSPEAKER_03\n So...\n\n0:26:16\tSPEAKER_03\n Speech recognition.\n\n0:26:17\tSPEAKER_03\n Take it.\n\n0:26:19\tSPEAKER_03\n I don't have no products.\n\n0:26:23\tSPEAKER_03\n There was a much...\n\n0:26:24\tSPEAKER_02\n There was a much...\n\n0:26:25\tSPEAKER_02\n Well, that cannot two years ago, they had some basic speech recognition on it.\n\n0:26:29\tSPEAKER_02\n You could program it with your channels, and then say, you know, the BBC One, and it goes to that channel.\n\n0:26:36\tSPEAKER_02\n Yeah, it didn't work very well though, because of this noise and interference problem.\n\n0:26:40\tSPEAKER_02\n They mentioned, you know, if the television says you are listening to the BBC One.\n\n0:26:43\tSPEAKER_02\n Yeah.\n\n0:26:44\tSPEAKER_03\n Or, yeah, an advert for BBC Two or the BBC One will switch the channel for you, kind of.\n\n0:26:49\tSPEAKER_02\n Right, right.\n\n0:26:50\tSPEAKER_02\n And so there's a lot of this.\n\n0:26:51\tSPEAKER_02\n You'd be watching the TV and then all of a sudden it pick up a noise and turn it off, or turn the volume off or something.\n\n0:26:56\tSPEAKER_02\n But if you can work around that noise problem.\n\n0:27:00\tSPEAKER_01\n Well, what about this might get a big too expensive actually, but what about something was built into the TV that you can press and it'll send out a little signal.\n\n0:27:12\tSPEAKER_01\n You know, like the ones that we can't hear.\n\n0:27:14\tSPEAKER_01\n Or something.\n\n0:27:15\tSPEAKER_01\n I don't know, you can do that, yeah.\n\n0:27:17\tSPEAKER_01\n That will activate the remote control start to beat.\n\n0:27:21\tSPEAKER_03\n So like I kind of backwards remote control.\n\n0:27:24\tSPEAKER_02\n Yeah.\n\n0:27:25\tSPEAKER_02\n And then I do just, you know, subtractive kind of cancellation of the noise.\n\n0:27:29\tSPEAKER_02\n Well, you could do then would be you have a remote control by the TV speaker.\n\n0:27:34\tSPEAKER_02\n Or not remote, I'm sorry, a microphone by the TV speaker and the transmitter there.\n\n0:27:38\tSPEAKER_02\n It sends back to your mode because you can't expect the television manufacturers to put that feature into the device.\n\n0:27:45\tSPEAKER_01\n Yeah, that's the only thing.\n\n0:27:47\tSPEAKER_02\n Yeah.\n\n0:27:48\tSPEAKER_02\n Yeah, then you have like a little separate module by the TV stick.\n\n0:27:51\tSPEAKER_01\n Yeah.\n\n0:27:52\tSPEAKER_01\n That comes with our remote control.\n\n0:27:53\tSPEAKER_02\n Right.\n\n0:27:54\tSPEAKER_02\n And then the remote control will know what's being produced by the TV.\n\n0:27:57\tSPEAKER_03\n And then the speaker will be the speaker.\n\n0:28:00\tSPEAKER_03\n Yeah, that's certainly possible.\n\n0:28:02\tSPEAKER_02\n And another thing is about this losing your mode and trying to find it again.\n\n0:28:06\tSPEAKER_02\n If you do have this sort of speech interface to it, you don't even need to find it.\n\n0:28:09\tSPEAKER_02\n You just say, you know, whatever you want the remote for, you know, to change a channel.\n\n0:28:14\tSPEAKER_02\n Or to turn the TV on and off.\n\n0:28:17\tSPEAKER_02\n You just shout your command to it and do it for you.\n\n0:28:20\tSPEAKER_02\n If it's within, you know, within hearing range.\n\n0:28:23\tSPEAKER_02\n And I, you know, could be somewhere in the room, you know, if no idea where it is.\n\n0:28:28\tSPEAKER_02\n And it still does jump.\n\n0:28:29\tSPEAKER_02\n That could also be built into the TV.\n\n0:28:31\tSPEAKER_01\n There is might make our network a bit obsolete.\n\n0:28:33\tSPEAKER_01\n Yeah.\n\n0:28:34\tSPEAKER_03\n Hopefully we'll do it as a joke or head up the earth.\n\n0:28:37\tSPEAKER_03\n Okay.\n\n0:28:38\tSPEAKER_03\n Okay.\n\n0:28:41\tSPEAKER_03\n I like the whole sort of remote feedback thing.\n\n0:28:50\tSPEAKER_03\n So I think rather than, and that also kind of takes out the speech recognition in terms of the interference and not working very well and things are there.\n\n0:29:03\tSPEAKER_03\n And the expense of the time.\n\n0:29:04\tSPEAKER_03\n So I think if we're going to go well, I mean, like to think about the problem with the TFT or the LCD kind of thing is if you're also wanting the kind of.\n\n0:29:17\tSPEAKER_03\n Organic globbies are feeling to it.\n\n0:29:20\tSPEAKER_03\n Then you might have trouble incorporating screen.\n\n0:29:27\tSPEAKER_03\n But I guess not.\n\n0:29:29\tSPEAKER_03\n I just pretend that's not the problem.\n\n0:29:37\tSPEAKER_03\n And how are you about the blue and the dark and the old?\n\n0:29:41\tSPEAKER_01\n Maybe not even all of it because we said colors and fashion were important. So maybe just like a little line that's kind of around the outside and then you can make the rest.\n\n0:29:51\tSPEAKER_02\n The materials cheap, but it's just the the ground and the dark material needs some light to charge it.\n\n0:29:59\tSPEAKER_02\n Yeah.\n\n0:30:00\tSPEAKER_03\n If you're sitting in the dark for too long or if it's done under the coach cushions.\n\n0:30:06\tSPEAKER_03\n We're using the same mind.\n\n0:30:11\tSPEAKER_03\n Okay, well, we can use we can still use the glow in the dark as a gimmick.\n\n0:30:14\tSPEAKER_03\n Yeah, because what I thought maybe we're going to have to we're going to have a logo on as well.\n\n0:30:19\tSPEAKER_03\n Bright yellow logo in a.\n\n0:30:24\tSPEAKER_03\n It's looking.\n\n0:30:27\tSPEAKER_03\n Then, you know, they're going to be fairly bright and colored anyway.\n\n0:30:30\tSPEAKER_03\n And you can have sort of a trimming as well.\n\n0:30:34\tSPEAKER_01\n And then you can have a dark and the dark and the dark.\n\n0:30:37\tSPEAKER_01\n Yeah, that more than finding it that was more like you know, if you're watching a film in the dark.\n\n0:30:43\tSPEAKER_01\n You can still see the red.\n\n0:30:46\tSPEAKER_03\n That was more of a.\n\n0:30:48\tSPEAKER_03\n If we're going to go with the idea of a feedback.\n\n0:30:55\tSPEAKER_03\n The more finder then that kind of stuff.\n\n0:31:02\tSPEAKER_03\n It makes it fairly unnecessary.\n\n0:31:05\tSPEAKER_03\n Yeah.\n\n0:31:08\tSPEAKER_03\n Okay, so we've got do we want to go with the TFT idea.\n\n0:31:16\tSPEAKER_03\n Is there a getting.\n\n0:31:19\tSPEAKER_03\n I mean, I think I think they're sort of find the finder things.\n\n0:31:23\tSPEAKER_03\n I mean, it's a good pull.\n\n0:31:26\tSPEAKER_02\n We're right.\n\n0:31:29\tSPEAKER_02\n I think a consideration to is that these are remote get abused a lot.\n\n0:31:33\tSPEAKER_02\n You know, you get thrown around.\n\n0:31:35\tSPEAKER_02\n There's a good chance that the TFT screen would break or get damaged.\n\n0:31:39\tSPEAKER_02\n They're pretty fragile.\n\n0:31:40\tSPEAKER_01\n So is that one of our definite requirements that they were.\n\n0:31:44\tSPEAKER_03\n And no, I mean, we were not was going on rough.\n\n0:31:47\tSPEAKER_03\n I just sort of.\n\n0:31:50\tSPEAKER_03\n Marking research, I guess.\n\n0:31:53\tSPEAKER_03\n And.\n\n0:31:58\tSPEAKER_03\n So stick with sort of programmability.\n\n0:32:01\tSPEAKER_03\n For the buttons that we do have.\n\n0:32:05\tSPEAKER_03\n And.\n\n0:32:12\tSPEAKER_03\n So that's sort of included in your sub module kind of stuff.\n\n0:32:21\tSPEAKER_03\n You're finding out by tell text.\n\n0:32:26\tSPEAKER_03\n If you could find that.\n\n0:32:29\tSPEAKER_00\n Speed to go.\n\n0:32:32\tSPEAKER_03\n I think we're going to scratch the speech recognition is a bit of a.\n\n0:32:38\tSPEAKER_03\n Expensive.\n\n0:32:39\tSPEAKER_02\n No, no, it's much cheaper than TFT.\n\n0:32:42\tSPEAKER_02\n It's just a mic.\n\n0:32:43\tSPEAKER_02\n Okay.\n\n0:32:44\tSPEAKER_02\n Some integrated circuits.\n\n0:32:46\tSPEAKER_02\n It'd be a small vocabulary speech recognition system.\n\n0:32:50\tSPEAKER_03\n Okay.\n\n0:32:53\tSPEAKER_03\n Well, that kind of takes back the RF.\n\n0:32:56\tSPEAKER_03\n The RF remote sort of ideas.\n\n0:32:59\tSPEAKER_03\n Um.\n\n0:33:03\tSPEAKER_03\n Five minutes.\n\n0:33:04\tSPEAKER_03\n Okay.\n\n0:33:05\tSPEAKER_03\n Decisions.\n\n0:33:07\tSPEAKER_03\n Folks.\n\n0:33:08\tSPEAKER_03\n It's vote.\n\n0:33:09\tSPEAKER_03\n Who wants TFT?\n\n0:33:11\tSPEAKER_03\n No one does.\n\n0:33:12\tSPEAKER_03\n Excellent.\n\n0:33:13\tSPEAKER_03\n So we've got with speech recognition.\n\n0:33:15\tSPEAKER_03\n Yeah.\n\n0:33:16\tSPEAKER_03\n Yes.\n\n0:33:17\tSPEAKER_03\n The speech recognition limited buttons, organic design.\n\n0:33:23\tSPEAKER_03\n And what else was I thinking of that I haven't written down enough.\n\n0:33:26\tSPEAKER_03\n I've fallen at my head.\n\n0:33:27\tSPEAKER_03\n Program ability.\n\n0:33:32\tSPEAKER_00\n Glow in dark.\n\n0:33:35\tSPEAKER_01\n If it's not a text message, I think it's good to get it.\n\n0:33:37\tSPEAKER_01\n Okay.\n\n0:33:38\tSPEAKER_03\n And also integrating the member to integrate the logo and the slogan.\n\n0:33:44\tSPEAKER_03\n Okay.\n\n0:33:45\tSPEAKER_03\n So, um, can you put all these reports in the project documents folder?\n\n0:33:50\tSPEAKER_03\n If not already in there as well.\n\n0:33:52\tSPEAKER_03\n So it just helps me.\n\n0:33:53\tSPEAKER_03\n Yes.\n\n0:33:54\tSPEAKER_03\n Some where I say here.\n\n0:33:55\tSPEAKER_03\n And, um, I'll put anything I'm putting anything I do in there anyway.\n\n0:34:00\tSPEAKER_03\n So, uh.\n\n0:34:01\tSPEAKER_01\n And where is it?\n\n0:34:03\tSPEAKER_03\n Sorry.\n\n0:34:04\tSPEAKER_03\n Project documents.\n\n0:34:06\tSPEAKER_03\n On.\n\n0:34:07\tSPEAKER_02\n So it should be when you say my scenario controller.\n\n0:34:11\tSPEAKER_02\n I had desktop.\n\n0:34:12\tSPEAKER_02\n So I'm going to say that.\n\n0:34:13\tSPEAKER_00\n Oh.\n\n0:34:15\tSPEAKER_00\n Is it in shared document?\n\n0:34:16\tSPEAKER_02\n And then, uh, with that little folder up thing.\n\n0:34:19\tSPEAKER_03\n Um, I'll put your project documents here.\n\n0:34:22\tSPEAKER_03\n It's on your desktop.\n\n0:34:23\tSPEAKER_04\n So I'll put that.\n\n0:34:24\tSPEAKER_02\n Yes.\n\n0:34:25\tSPEAKER_02\n That's desktop.\n\n0:34:26\tSPEAKER_02\n That's the project documents.\n\n0:34:30\tSPEAKER_02\n I can't.\n\n0:34:31\tSPEAKER_02\n Hmm.\n\n0:34:32\tSPEAKER_00\n It just won't give me anything.\n\n0:34:35\tNone\n Just that.\n\n0:34:36\tSPEAKER_03\n And I'm getting strings of, uh, information.\n\n0:34:42\tSPEAKER_03\n I'll try and forward any specific to anybody in particular, as soon as I get them out of them.\n\n0:34:49\tSPEAKER_03\n I was about to sort of tell you about the changes before the meeting.\n\n0:34:52\tSPEAKER_03\n And then meeting turned up.\n\n0:34:53\tSPEAKER_03\n So.\n\n0:34:54\tSPEAKER_02\n Did you get my email?\n\n0:34:57\tSPEAKER_02\n I did.\n\n0:34:58\tSPEAKER_02\n Thank you.\n\n0:34:59\tSPEAKER_02\n Okay.\n\n0:35:14\tSPEAKER_01\n What I thought was about the material is, um, maybe not this kind of material, maybe more like, um, this kind of rubbering materials, a bit more bouncy.\n\n0:35:25\tSPEAKER_01\n Like he said, they get chucked around a lot.\n\n0:35:27\tSPEAKER_01\n Um, a bit more durable.\n\n0:35:30\tSPEAKER_01\n And that can also be ergonomic.\n\n0:35:33\tSPEAKER_01\n And it kind of feels a bit different from all other American trials.\n\n0:35:38\tSPEAKER_01\n The REPA.\n\n0:35:39\tSPEAKER_03\n More surf.\n\n0:35:40\tSPEAKER_03\n Um, flash like the plastic.\n\n0:35:44\tSPEAKER_04\n Mm hmm.\n\n0:35:45\tSPEAKER_04\n Wow.\n\n0:35:47\tSPEAKER_00\n But we have to take care of it.\n\n0:35:50\tSPEAKER_00\n But we have to take care about children also.\n\n0:35:54\tSPEAKER_00\n And that means if children catch out of here, if they choose, it shouldn't be too harmful.\n\n0:36:01\tSPEAKER_00\n So whatever material we use.\n\n0:36:03\tSPEAKER_00\n Oh, no.\n\n0:36:04\tSPEAKER_00\n Yeah.\n\n0:36:05\tSPEAKER_00\n It's funny.\n\n0:36:06\tSPEAKER_00\n Yeah.\n\n0:36:07\tSPEAKER_00\n We have to safety point of view also.\n\n0:36:09\tSPEAKER_00\n We have to take care.\n\n0:36:10\tSPEAKER_01\n I think with, with the more organic shape, it won't be as, what is it, how many sharp corners is that?\n\n0:36:18\tSPEAKER_01\n So that's something good.\n\n0:36:20\tSPEAKER_01\n Um, I don't know.\n\n0:36:23\tSPEAKER_01\n Oh my god, it smells good for children.\n\n0:36:25\tSPEAKER_02\n We have to fleece out of the box and make the thing, a big red ball, foam ball.\n\n0:36:30\tSPEAKER_02\n So I think they need some.\n\n0:36:32\tSPEAKER_02\n There's no buttons at all.\n\n0:36:34\tSPEAKER_02\n It's always on and just yell at it.\n\n0:36:36\tSPEAKER_01\n That's a good idea.\n\n0:36:38\tSPEAKER_01\n Yeah.\n\n0:36:39\tSPEAKER_03\n Chosen up.\n\n0:36:40\tSPEAKER_03\n It's going to be a big yellow.\n\n0:36:42\tSPEAKER_03\n Oh, yellow.\n\n0:36:43\tSPEAKER_01\n Yeah.\n\n0:36:44\tSPEAKER_01\n With the color, does it have to be all yellow?\n\n0:36:47\tSPEAKER_03\n Please God, no.\n\n0:36:49\tSPEAKER_03\n Um, well, I wouldn't, I mean, the reaction to an all yellow and what control wouldn't be anything other than horror.\n\n0:36:56\tSPEAKER_03\n So I think just having it.\n\n0:36:58\tSPEAKER_00\n Small yellow.\n\n0:36:59\tSPEAKER_00\n It's a red in a logo.\n\n0:37:00\tSPEAKER_00\n It's small yellow strip or yellow square.\n\n0:37:03\tSPEAKER_00\n Is it a logo in it?\n\n0:37:05\tSPEAKER_01\n Yeah.\n\n0:37:06\tNone\n Okay.\n\n0:37:07\tSPEAKER_03\n Oh, I'll see if I can argue with the boss about putting the, what is it?\n\n0:37:12\tSPEAKER_03\n We put, we put the fashion into, oops, I'm not working.\n\n0:37:19\tSPEAKER_03\n I can't believe I forgot the wrong, you put the fashion into electronics.\n\n0:37:23\tSPEAKER_03\n Oh, yeah, it's a good one though.\n\n0:37:25\tSPEAKER_03\n Yeah.\n\n0:37:26\tSPEAKER_03\n I bet that'll catch on a while.\n\n0:37:28\tSPEAKER_03\n Okay, any last.\n\n0:37:31\tSPEAKER_03\n Where are you speedy?\n\n0:37:33\tSPEAKER_03\n Top 30.\n\n0:37:34\tSPEAKER_02\n Okay.\n\n0:37:35\tSPEAKER_02\n It's the last one.\n\n0:37:37\tSPEAKER_04\n Sorry.\n\n0:37:38\tSPEAKER_04\n Sorry.\n\n0:37:39\tSPEAKER_03\n I know what you're thinking.\n\n0:37:42\tSPEAKER_03\n Okay, that's lunchtime.\n\n0:37:45\tSPEAKER_00\n That's great.\n\n0:37:47\tSPEAKER_03\n Okay, that felt a bit more like something that you're the older and the reason to it than the last one.\n\n0:37:56\tSPEAKER_03\n It's quite fun actually.\n\n0:37:57\tSPEAKER_01\n Wow.\n\n0:37:58\tSPEAKER_01\n Does anybody press the K?\n\n0:38:01\tSPEAKER_01\n It's my break.\n\n0:38:03\tSPEAKER_01\n Yeah.\n\n0:38:04\tSPEAKER_01\n Pretty cool.\n\n0:38:05\tSPEAKER_03\n Why are you for the very first page?\n\n0:38:07\tSPEAKER_01\n Yeah, I was just writing on the page.\n\n0:38:09\tSPEAKER_02\n I've got more, I think.\n\n0:38:10\tSPEAKER_02\n Yeah, I've been using up pages.\n\n0:38:12\tSPEAKER_01\n I don't want to wait for it.\n\n0:38:13\tSPEAKER_03\n Finish the meeting now.\n\n0:38:16\tSPEAKER_03\n Oh, never mind.\n\n0:38:17\tSPEAKER_03\n I have a question.\n\n0:38:23\tNone\n Did you do?\n\n", "summary": [{"summary_text": "At the last meeting, the rules for each of the participants were decided. There are some changes to the rules. The changes are for a specific TV remote control. The market survey on consumers was done to find out their likings and dislikings of the product. Spokeer is going to screw in the F8 function. "}]}