{"filename": "./data/ES2007d.txt", "transcript": "0:00:00\tSPEAKER_02\n Played out. Played out as edible. Did you know that? It's definitely because kids. I\n\n0:00:08\tSPEAKER_03\n just do. Definitely eating it before I had it not less. Yeah. But it's it's my edible because\n\n0:00:15\tSPEAKER_01\n yeah it's my edible because kids eat it. Yeah. If it wasn't edible then well no more\n\n0:00:22\tSPEAKER_03\n better. I still make sense because I remember like I don't know if my mom ever did it. I remember other people's mom's making I come in and played over. You just like make the baby's coloring and mix. Oh yeah it is. Yeah.\n\n0:00:44\tSPEAKER_02\n But everybody everybody ready? Yep. Okay let's have your um. Let's get guys have the\n\n0:00:53\tSPEAKER_03\n presentation. Pretty exciting. So everything that we wanted we wanted it to be ergonomic and to be made out of rubber. Very simple and easy to use. Double curved. Yeah double curved. But also something that was going to jump out at people or something that would be different uh separate it from the other. Remote's out on the market. So uh I think if you put this in the palm of your hand you'll see what a nice thing we have going here. That is cool. So basically if you hold it like that the one on your thumb. Yeah the thumb button is the power button.\n\n0:01:40\tSPEAKER_03\n Index finger is channel up. Middle finger is channel down. Ring finger is volume up.\n\n0:01:46\tSPEAKER_03\n The pinky is volume down. What's the big blue thing? That's the lock button.\n\n0:01:51\tSPEAKER_03\n Oh cool. And then the M is a mute button. And then it also has plus I said what button M for muting. Oh mute. And also there's an numeric keypad on the top so you can key directly to the channel if you want. So it's really basic functionalities as far as what keys are available but we think it's very comfortable and very innovative and it looks different that's what it does. So all the I mean the important keys are right at your you know right at a convenient place for you to access them. So you don't keep empty R S O. Yeah it should be and it's also conformable to the size of your hand. I mean if that's too big it's a rubber rubber you can. It's great. It's so cute. Is that what mesh with what you guys are hoping\n\n0:02:46\tSPEAKER_02\n with and for expecting one. I have one thing about it but it's a small thing but it means we'd have to make a white handed one and a left handed one. I like it. That's good thinking.\n\n0:03:00\tSPEAKER_02\n But I don't see why that's not possible. If we build rocket ships I can't even build a\n\n0:03:06\tSPEAKER_03\n left handed one. Yeah. I might left handed scissors. Yeah I didn't think about that but yeah.\n\n0:03:17\tSPEAKER_01\n But then you can learn to use your right hand. Like I was thinking there's left handers and right handers in the family. What do they have to remote? I know people who have left handed and right\n\n0:03:28\tSPEAKER_00\n handers. People in the family and they all use the computer for the same computer for the first\n\n0:03:34\tSPEAKER_01\n family and they have an X. Sure. Everybody using right handed. Yeah. I'm sure they'll be able to. I mean it's only pressing buttons. You don't have to do anything you know, extraordinary. I think everybody can press a button with their left hand or right hand. So imagine are you right handers?\n\n0:03:50\tSPEAKER_00\n Yeah. Imagine doing it with your left hand. I don't think it's too big.\n\n0:03:54\tSPEAKER_01\n Yeah. But we can have both. Yeah. Have them in stock. Yeah. Yeah. Make them more appealing.\n\n0:04:08\tSPEAKER_02\n But I'm other than that. I only know and that's something you know, that's just something I think.\n\n0:04:13\tSPEAKER_02\n I think it's great. Yeah. Great idea. Do you think it says all right? I think it says.\n\n0:04:18\tSPEAKER_02\n I think it's well if the RR motto is we bring fashion to electronics. I'd say that could be quite\n\n0:04:27\tSPEAKER_03\n fashionable. Yeah. And it's got the black and yellow and blue plus red which is sort of a fruit and vegetable.\n\n0:04:40\tSPEAKER_02\n So that's our inner things. Yeah. Yeah. It's come up with what you know, the thing that's what we were looking at doing, isn't it? And it all seems to be there. Well done.\n\n0:04:54\tSPEAKER_01\n We're all playing around. Before we move on. Yeah. I'm just doing a bugging. I need that cable.\n\n0:05:03\tSPEAKER_02\n Thank you. Yeah. One thing I do need to look at is the costs.\n\n0:05:11\tSPEAKER_02\n The costs, isn't it? The costs. Well, yeah. I don't want to last very long. Everybody will go like,\n\n0:05:23\tSPEAKER_01\n oops, it's gone. But it's edible. Cheap. Well, buy more than the heat. That was the main criteria\n\n0:05:34\tSPEAKER_02\n for my last meeting. It had to be cheap proof. Yeah. Right. Okay. Now I think we'll do this. I could do, you know, I can do this. Oh, oh. Oh, man. I could do it with you. But it's just easy enough to go through it with you. So we're going for the kinesic power. And the electronics we decided on it being just a simple, the easiest thing that's inside it.\n\n0:06:10\tSPEAKER_02\n The case we've gone for the double curved.\n\n0:06:17\tSPEAKER_02\n And it's made out of rubber. The interface is push buttons.\n\n0:06:24\tSPEAKER_02\n And buttons, supplements. Well, they're special colors, aren't they? Yeah.\n\n0:06:33\tSPEAKER_02\n So special colors. Special form. Yeah, they're special form. They're in shapes and stuff.\n\n0:06:41\tSPEAKER_02\n Yeah. These ones on the side are curved to kind of stuff.\n\n0:06:44\tSPEAKER_02\n They're made out of any special material. No, they're not made out of wood or titanium or rubber anything. They're just simple. Well, they're rubber. Okay.\n\n0:07:02\tSPEAKER_02\n So let's see if that comes within budget. And it does. That's going to cost. Yeah, that's going to cost 10, 10 euro, 70 cents a unit. And I'll tell you it was it has come in\n\n0:07:18\tSPEAKER_03\n at under 1250. Yeah. So I'm actually making a better profit when I'm expecting this is all\n\n0:07:25\tSPEAKER_02\n very, very good. The bosses will be very pleased. Okay, let's just say this so I can imagine. So it's very tiny. No, at least say any other, my documents.\n\n0:08:00\tSPEAKER_02\n Splendid. Okay.\n\n0:08:02\tSPEAKER_02\n So that's messed me down with this, with this do that.\n\n0:08:12\tSPEAKER_02\n Go and do what you were going to do.\n\n0:08:19\tSPEAKER_01\n No evaluation. Oh yeah. This is where we all get to.\n\n0:08:24\tSPEAKER_01\n I get to write them. Oops. Right. Oh.\n\n0:08:36\tSPEAKER_01\n Okay.\n\n0:08:41\tSPEAKER_02\n I love this, my player. I can't, I can't spell it.\n\n0:08:47\tSPEAKER_01\n Okay. So evaluation. We're going to do it all together. So we evaluate it each criteria.\n\n0:08:55\tSPEAKER_01\n I've got the criteria. And we have to do it on a scale of 1 to 7, 1 being true. So it's, it's more like it fits the criteria and 7 being as in it doesn't fit the criteria.\n\n0:09:08\tSPEAKER_01\n And the criteria is lower and I'll draw this up on the board. So we have a box.\n\n0:09:28\tSPEAKER_01\n Just so we know true. And this is false. This is just like keep you informed. So 7 is here.\n\n0:09:36\tSPEAKER_01\n And once here and then you've got in the middle. So the first criteria, do you all get what we're doing?\n\n0:09:44\tSPEAKER_01\n Okay. Okay. First criteria, look and feel. So it does remote look and feel fashionable to what we talked about as it is it color wise and is it spongy. So what mark should we give it?\n\n0:09:57\tSPEAKER_01\n I would give it a 7. Yeah. As in it's not. Oh, sorry. Oh, sorry. One. Yeah. So I'll just write criteria.\n\n0:10:11\tSPEAKER_01\n Second criteria, new technology. How we implemented new technology was in the new high tech.\n\n0:10:20\tSPEAKER_03\n Yeah. That was our main technological innovation.\n\n0:10:24\tSPEAKER_03\n It's really simple but the fact that we use the kinetic energy.\n\n0:10:28\tSPEAKER_03\n So the, um, it's ergonomic. Yeah, but that's not a technical thing. That's another thing.\n\n0:10:34\tSPEAKER_02\n That's another marketing thing. So on the technical side of it, I'll say it's about a twist.\n\n0:10:39\tSPEAKER_03\n In the middle somewhere maybe. Yeah.\n\n0:10:42\tSPEAKER_01\n Yeah. Yeah. Yeah. Yeah. So criteria three is easy to use. I think it's the one I'd say it's,\n\n0:10:53\tSPEAKER_02\n I've not, if you're left handed, it's not. I would give it a, I would give it a two. Two. Two. Six. Because it is, it is more geared for right handed people than left handed people.\n\n0:11:05\tSPEAKER_01\n But if we make a right handed and left handed, then\n\n0:11:07\tSPEAKER_03\n if we're going to have one left handed, one right handed, then I would give it a one.\n\n0:11:13\tSPEAKER_01\n Yeah. Give it a two. Yeah. Okay. Okay. Criteria four is costs.\n\n0:11:23\tSPEAKER_02\n I mean, under budget. Yeah. It's a definite one. That was great. Mount the buttons. Like the amount of buttons because people like\n\n0:11:34\tSPEAKER_01\n only the necessary buttons. So it's one. Yeah. Yeah. Criteria six. Isis are good against. Yes.\n\n0:11:44\tSPEAKER_01\n N-T-R-S-I. It's one.\n\n0:11:48\tSPEAKER_01\n And Criteria seven, which is the last one, does it get lost? Is it easy to get lost?\n\n0:11:52\tSPEAKER_01\n I don't think it's going to get lost very easily. No, but it is small.\n\n0:11:57\tSPEAKER_03\n It's not the kind of thing that's going to slip like between a couch cushion or something.\n\n0:12:01\tSPEAKER_03\n I think it would get lost.\n\n0:12:10\tSPEAKER_01\n We were two. Yeah. I mean, it's not fully like, can't say, I mean, it's not a one.\n\n0:12:17\tSPEAKER_02\n I mean, you can still flush it down a toilet theoretically.\n\n0:12:20\tSPEAKER_03\n Yeah. I mean, it's bigger than the average mobile, I guess.\n\n0:12:23\tSPEAKER_01\n Yeah. But yeah, it can be lost. The mobiles get lost all the time.\n\n0:12:28\tSPEAKER_01\n But then you ring them.\n\n0:12:30\tSPEAKER_01\n Find them.\n\n0:12:32\tSPEAKER_01\n Okay. Yeah. So that's that.\n\n0:12:36\tSPEAKER_01\n That's the evaluation. So I'd say.\n\n0:12:41\tSPEAKER_02\n Yeah. All right. It's like an old system.\n\n0:12:44\tSPEAKER_01\n Like a number one.\n\n0:12:48\tSPEAKER_01\n Number one product.\n\n0:12:50\tSPEAKER_02\n I mean, we can't fail.\n\n0:12:52\tSPEAKER_01\n We've fitted all the criteria.\n\n0:12:54\tSPEAKER_01\n Yes.\n\n0:12:57\tSPEAKER_01\n Yeah. Okay. Yeah.\n\n0:13:02\tSPEAKER_02\n Well done, Risa.\n\n0:13:04\tSPEAKER_02\n That's that one. Okay. I think I just want to put in as project manager.\n\n0:13:13\tSPEAKER_02\n There's, you know, a little bit of praise for everybody here.\n\n0:13:16\tSPEAKER_02\n They had a work, don't they? You know, both individually and as a team.\n\n0:13:20\tSPEAKER_02\n You know, everyone's come up with their own individual ideas and their own different departments.\n\n0:13:27\tSPEAKER_02\n And then come together and works in, you know, integrity, you know, at the right times, you know, especially you too.\n\n0:13:37\tSPEAKER_02\n That's all, you know, gone very, very well and and, and, you know, it's been good communication going on.\n\n0:13:44\tSPEAKER_03\n Yeah, during our design and there was some, some heated, heated discussion, but we kept, we tried to keep it cool.\n\n0:13:54\tSPEAKER_02\n Did you have to go down to the corporate squash court and bash a few bills about?\n\n0:13:59\tSPEAKER_03\n We just had to, we just had to squeeze our product a little bit.\n\n0:14:04\tSPEAKER_03\n Fantastic. Now, you guys have been a great team.\n\n0:14:08\tSPEAKER_03\n I think we're the, we're the envy of all the other teams.\n\n0:14:11\tSPEAKER_02\n I think so, I, you know, I think we've got, we have, we've come up with something new.\n\n0:14:16\tSPEAKER_02\n Something that hasn't been done before. We're not just rehashing in our design.\n\n0:14:21\tSPEAKER_01\n In four, and four meetings.\n\n0:14:23\tSPEAKER_01\n Yeah.\n\n0:14:24\tSPEAKER_01\n From your design and meetings could be this quick.\n\n0:14:27\tSPEAKER_02\n You know, maybe this isn't a simulation.\n\n0:14:30\tSPEAKER_02\n Maybe this is actually a, it's like, I think they're so neat or someone like that.\n\n0:14:35\tSPEAKER_02\n They're just, yeah.\n\n0:14:39\tSPEAKER_02\n Yeah, well, two years time, this will be on the market.\n\n0:14:43\tSPEAKER_02\n Exactly that product.\n\n0:14:48\tSPEAKER_02\n We'll go, yeah, we design that. I know I'm a believer.\n\n0:14:55\tSPEAKER_03\n So at this stage, I mean, is this the last meeting of the project?\n\n0:14:58\tSPEAKER_03\n We don't have another one after it's gone.\n\n0:15:01\tSPEAKER_02\n No, I think when this meeting's finished, like officially, they'll get a question there.\n\n0:15:06\tSPEAKER_02\n Oh, really?\n\n0:15:07\tSPEAKER_02\n To fill in.\n\n0:15:09\tSPEAKER_02\n Or six.\n\n0:15:09\tSPEAKER_01\n Just not summarizing now.\n\n0:15:12\tSPEAKER_01\n I couldn't apply to the same list.\n\n0:15:17\tSPEAKER_02\n I've got the message.\n\n0:15:19\tSPEAKER_01\n See some way.\n\n0:15:20\tSPEAKER_01\n We just reported that.\n\n0:15:27\tSPEAKER_03\n So there's no way to like predict what our, because we had it, we originally had it as far as our financial goals.\n\n0:15:35\tSPEAKER_03\n We had a specific number for profits that we wanted.\n\n0:15:37\tSPEAKER_03\n It was 50, no, 15, was it 50 or five?\n\n0:15:42\tSPEAKER_03\n I don't remember, but there's not a way to compete that.\n\n0:15:45\tSPEAKER_03\n I mean, since we saved on that production cast, do we know how much we're making on profit?\n\n0:15:51\tSPEAKER_02\n It gets handed over to another department.\n\n0:15:54\tSPEAKER_02\n Well, what our project was was to come up with the product, basically.\n\n0:16:00\tSPEAKER_02\n And just basically is it can, is it within budget?\n\n0:16:04\tSPEAKER_02\n When it comes to all the other things of how to sell it and the profits and all that, that's other departments.\n\n0:16:11\tSPEAKER_02\n It's another team that actually work out the mate that we have invested in.\n\n0:16:18\tSPEAKER_02\n Oh yeah, the old one goes in the profit sharing.\n\n0:16:27\tSPEAKER_02\n Yeah, that's it.\n\n0:16:28\tSPEAKER_02\n You know, we've made, we've designed the product.\n\n0:16:32\tSPEAKER_02\n We've got the prototype.\n\n0:16:34\tSPEAKER_02\n It's within budget.\n\n0:16:36\tSPEAKER_02\n It does everything that we wanted it to do.\n\n0:16:40\tSPEAKER_02\n It's new.\n\n0:16:43\tSPEAKER_02\n It's something that is now there already.\n\n0:16:46\tSPEAKER_03\n I think actually in one advantage of this is that after this bad of fruit and vegetables passes, this will still be a cool remote.\n\n0:16:56\tSPEAKER_03\n We're not tying our card to that one more.\n\n0:17:03\tSPEAKER_02\n But this is very remarkable.\n\n0:17:04\tSPEAKER_02\n And that it is, it's something that's kind of new and looks a bit quirky for people to want that.\n\n0:17:09\tSPEAKER_02\n It's, it's, I'm going to write it down here somewhere.\n\n0:17:17\tSPEAKER_02\n Oh, I put it in one of my emails that I've sent off.\n\n0:17:21\tSPEAKER_02\n It's remarkable in the sense that it's whilst all these other emotes actually do give you a Pestus strain injury.\n\n0:17:31\tSPEAKER_02\n Our one does the complete opposite.\n\n0:17:34\tSPEAKER_02\n So that's something that's new, which is one of the criteria they ask just to come up with something new.\n\n0:17:40\tSPEAKER_03\n It makes watching TV healthy.\n\n0:17:42\tSPEAKER_02\n Yeah, and if you're not having a good time with a TV, you can throw it about.\n\n0:17:46\tSPEAKER_02\n It's fine.\n\n0:17:47\tSPEAKER_02\n It's kid proof.\n\n0:17:48\tSPEAKER_01\n Just, just throw it at any of the ornaments and break them.\n\n0:17:51\tSPEAKER_02\n Well, you can break the ornaments, but you won't break that.\n\n0:17:54\tSPEAKER_02\n No.\n\n0:17:59\tSPEAKER_02\n So all in all, I think we've done very well.\n\n0:18:02\tSPEAKER_02\n Well done, everybody.\n\n0:18:06\tSPEAKER_02\n Drinks are on the company.\n\n0:18:09\tSPEAKER_02\n In the corporate bar that's next to the corporate swimming pool, on the top floor that we've all just gained access to.\n\n0:18:16\tSPEAKER_02\n That's a good idea, that.\n\n0:18:18\tSPEAKER_02\n Yeah.\n\n0:18:24\tNone\n That's it.\n\n0:18:24\tSPEAKER_02\n Well, as far as I know.\n\n0:18:32\tSPEAKER_01\n We haven't got the five minutes left thing yet.\n\n0:18:34\tSPEAKER_01\n No.\n\n0:18:35\tSPEAKER_02\n You want to play ice-bye?\n\n0:18:38\tSPEAKER_02\n Yeah.\n\n0:18:40\tSPEAKER_03\n I guess it's probably better that we wrap it up in half, five minutes of silence.\n\n0:18:51\tSPEAKER_03\n Should we call it a day now?\n\n0:18:54\tSPEAKER_02\n Yeah, I guess.\n\n0:18:55\tSPEAKER_02\n I mean, we're going to get asked to fill out another question there.\n\n0:19:01\tSPEAKER_02\n It's probably going to be the same as one we've done before.\n\n0:19:04\tSPEAKER_02\n I'm not the authority to say that it is.\n\n0:19:17\tSPEAKER_02\n How does everyone feel about the technology that's been used in this?\n\n0:19:22\tSPEAKER_02\n Using the pens and writing on these special pads and all that?\n\n0:19:27\tSPEAKER_02\n I love it.\n\n0:19:28\tSPEAKER_01\n I love it.\n\n0:19:31\tSPEAKER_01\n I think it's cool.\n\n0:19:32\tSPEAKER_01\n I'm not wired up.\n\n0:19:34\tSPEAKER_01\n I don't know, vibrating pen.\n\n0:19:36\tSPEAKER_01\n Cool.\n\n0:19:38\tSPEAKER_01\n Being watched.\n\n0:19:44\tSPEAKER_03\n Your moment to show you.\n\n0:19:46\tSPEAKER_00\n Yeah.\n\n0:19:48\tSPEAKER_02\n Well.\n\n0:19:52\tSPEAKER_02\n I'd, you know, I'd, yeah, as we said earlier, I've not never seen that before.\n\n0:19:58\tSPEAKER_02\n Yeah, something that's whiteboard.\n\n0:20:02\tSPEAKER_02\n Yeah.\n\n0:20:04\tSPEAKER_02\n Thingy.\n\n0:20:06\tNone\n That's great.\n\n0:20:08\tSPEAKER_02\n But a pen with a camera on it, I don't think it's such a new thing.\n\n0:20:14\tSPEAKER_02\n Or it's such a new idea.\n\n0:20:16\tSPEAKER_02\n It would be different if it was sort of, and writing, recognising stuff.\n\n0:20:22\tSPEAKER_02\n But as it's not, it's literally that will come up on a computer screen as a picture file rather than a actual text.\n\n0:20:30\tSPEAKER_03\n Right. I think they do want to get in there.\n\n0:20:32\tSPEAKER_03\n Yeah.\n\n0:20:34\tSPEAKER_01\n It's just the first step.\n\n0:20:36\tSPEAKER_03\n The most important step.\n\n0:20:38\tSPEAKER_03\n I guess we should end this as well.\n\n0:20:40\tSPEAKER_03\n Ah, public.\n\n0:20:42\tSPEAKER_03\n Yeah.\n\n0:20:44\tSPEAKER_03\n Yeah.\n\n", "summary": [{"summary_text": "The presentation of the new remote control is ready. It's ergonomic, easy to use, double curved and made of rubber. The thumb button is the power button, the index finger is channel up, the pinky is volume down, the big blue thing is the lock button, M is mute, and there's an numeric keypad on the top."}]}