{"filename": "./data/ES2004c.txt", "transcript": "0:00:00\tSPEAKER_03\n I'll wait until you're all in.\n\n0:00:30\tNone\n I'll wait until you're all in.\n\n0:01:00\tNone\n Welcome back everybody.\n\n0:01:07\tNone\n You had fun.\n\n0:01:19\tSPEAKER_03\n Right.\n\n0:01:22\tSPEAKER_03\n You had fun.\n\n0:01:25\tSPEAKER_03\n Right.\n\n0:01:26\tSPEAKER_03\n This is our conceptual development team.\n\n0:01:31\tSPEAKER_03\n I think we're starting to head over ourselves from the last meeting.\n\n0:01:36\tSPEAKER_01\n Yeah.\n\n0:01:36\tSPEAKER_01\n I was getting the question as well.\n\n0:01:38\tSPEAKER_03\n I think, yeah.\n\n0:01:41\tSPEAKER_03\n This is where we talk about Prov2's materials, user interface, and trend watching.\n\n0:01:51\tSPEAKER_03\n So, I think we've touched on a few things already, but we'll just go over it.\n\n0:01:58\tSPEAKER_03\n The minutes from last time, we had a couple of changes in our plans in that we couldn't use teletext.\n\n0:02:13\tSPEAKER_03\n It wasn't going to be a control for everything.\n\n0:02:18\tSPEAKER_03\n We had to incorporate the image of the company into it.\n\n0:02:24\tSPEAKER_03\n We have decided on leaving out the voice recognition.\n\n0:02:30\tSPEAKER_03\n We've decided on there being a flip design and a different shape from what's normal.\n\n0:02:39\tSPEAKER_03\n We were thinking a shell, but something along the sides, just different shape from what normal.\n\n0:02:44\tSPEAKER_03\n We were thinking, you were going to look into the rechargeable batteries, and we were going to think about the port and alarm for getting it off, things like that.\n\n0:03:02\tSPEAKER_03\n Our market was going to be young business, kind of, range.\n\n0:03:07\tSPEAKER_03\n Okay.\n\n0:03:08\tSPEAKER_03\n So, she was starting with the presentation.\n\n0:03:11\tSPEAKER_04\n Yes, maybe.\n\n0:03:18\tSPEAKER_04\n Just connect up.\n\n0:03:21\tSPEAKER_04\n Thank you.\n\n0:03:29\tSPEAKER_04\n Okay, so we decided on our market, and so this feedback from the marketing department is really about trend watching.\n\n0:03:49\tSPEAKER_04\n The methods we used to decide on current trends and so on, market trends, were that we did our traditional, our usual market research study with our 100 subjects.\n\n0:04:03\tSPEAKER_04\n The general feedback from them is that the most, I'm sorry, I'm slightly tongue tied after lunch, sorry, I'm sorry.\n\n0:04:11\tSPEAKER_04\n We decided on the most important aspect required in an remote control device and we'll come to that later.\n\n0:04:16\tSPEAKER_04\n That was one of the first things we did.\n\n0:04:18\tSPEAKER_04\n Also with our company being full-runners in putting fashion into technology, we also looked at a fashion update using our consultants on fashion and design in Paris and Milan.\n\n0:04:30\tSPEAKER_04\n So the general findings from that was that in the market trends, the most important aspects for remote controls were people want a fancy look and feel rather than the current functional look and feel of remote controls.\n\n0:04:46\tSPEAKER_04\n They also want a remote control to be technologically innovative and of course as you predicted that it should be easy to use.\n\n0:04:54\tSPEAKER_04\n Now I should point out that the first of those findings, fancy look and feel, is the most important, as twice as important as the second, technologically innovative, which is in turn twice as important as being easy to use.\n\n0:05:07\tSPEAKER_04\n So possibly the feature that we put first is actually third.\n\n0:05:11\tSPEAKER_04\n It's still important but it's third in order of preference for the subject that we looked at.\n\n0:05:16\tSPEAKER_04\n Okay, now the fashion update which relates to very personal preferences among our subject group.\n\n0:05:24\tSPEAKER_04\n We found from our consultants in Paris and Milan who attended all the designing fashion fears then, but fruit and vegetables are going to be the theme for clothes, shoes and furniture.\n\n0:05:35\tSPEAKER_04\n So should we be thinking of using something like that in our remote control design too?\n\n0:05:40\tSPEAKER_04\n There also seems to be a trend towards a spongy field to materials again in contrast to last year.\n\n0:05:47\tSPEAKER_04\n So a lot of interesting feedback, they're both from a market research department and from our people in Paris and Milan.\n\n0:05:53\tSPEAKER_04\n We're interesting to see what our design people make of that.\n\n0:05:56\tSPEAKER_03\n Okay, thank you very much.\n\n0:06:01\tSPEAKER_03\n Let's start from inside and work our way out.\n\n0:06:04\tSPEAKER_04\n Yep, okay.\n\n0:06:05\tSPEAKER_04\n Unless anyone has any questions about that?\n\n0:06:07\tSPEAKER_04\n Not yet.\n\n0:06:08\tSPEAKER_04\n Okay.\n\n0:06:09\tSPEAKER_04\n Yes.\n\n0:06:10\tSPEAKER_03\n Thank you.\n\n0:06:11\tSPEAKER_03\n I hope you did the one too tight and you can't get the new page on it.\n\n0:06:35\tSPEAKER_01\n Okay.\n\n0:06:52\tSPEAKER_01\n This is all about the design of the edge components and the availability of the components we have in stock at the moment.\n\n0:07:03\tSPEAKER_01\n Just into the method, the main idea of the whole thing is just so you just press buttons and it should activate things on the TV and we discussed last meeting it should be easy to find.\n\n0:07:20\tSPEAKER_01\n Also in this study I've looked into the availability of some of the materials because some of the things that we looked at last time unfortunately aren't available.\n\n0:07:33\tSPEAKER_01\n Findings, I've got my nice little picture there.\n\n0:07:36\tSPEAKER_01\n This is the chip called the TA-W1A35 which is what's used in pretty much every remote control because it sends out standard signals based on your input and it's pretty much used for all TV remotes at the moment.\n\n0:07:56\tSPEAKER_01\n And then we're looking into battery options.\n\n0:08:00\tSPEAKER_01\n There's actually no rechargeable option available.\n\n0:08:04\tSPEAKER_01\n So I saw the standard AA and AAA which we thought were a bit too bulky and then dynamo charging.\n\n0:08:15\tSPEAKER_01\n I thought that might be the silly to be honest, it's basically like wind up radio.\n\n0:08:22\tSPEAKER_01\n So you wind up your remote control before you use it.\n\n0:08:26\tSPEAKER_03\n What kind of long can you get out of that?\n\n0:08:28\tSPEAKER_03\n Can you pick it up and then wind it for two minutes and then that's it for the night?\n\n0:08:32\tSPEAKER_01\n Yeah, I presume you wouldn't have to wind it for very long but I don't think it's really sort of necessary when you think of the next two options like the solar charging because most people have the light on in the room anyway so they could get when you got to\n\n0:08:52\tSPEAKER_04\n the room. So the light charges as sunlight does?\n\n0:08:54\tSPEAKER_03\n Is that right?\n\n0:08:55\tSPEAKER_01\n Is that right?\n\n0:08:56\tSPEAKER_04\n It has to be so many.\n\n0:09:00\tSPEAKER_02\n Regarding the sizes, which one you think will be like because we have to take into the solar charging size also so maybe standard triple in might take less space or dynamo might take more space?\n\n0:09:11\tSPEAKER_01\n Yeah, it would.\n\n0:09:12\tSPEAKER_01\n Yeah, the dynamo would take more space because you actually need a physical, so it would handle to wind up.\n\n0:09:17\tSPEAKER_03\n I'm pretty sure that solar is from the sun.\n\n0:09:20\tSPEAKER_03\n Yeah, I don't think it can.\n\n0:09:22\tSPEAKER_00\n Artificial light.\n\n0:09:23\tSPEAKER_03\n But I mean, that's not many.\n\n0:09:27\tSPEAKER_03\n You don't want to limit your market.\n\n0:09:28\tSPEAKER_03\n I mean, people who live in basement like there's not that many people.\n\n0:09:31\tSPEAKER_03\n I know, different parts of the world.\n\n0:09:33\tSPEAKER_04\n People are at the marketing internationally.\n\n0:09:35\tSPEAKER_01\n Yeah, most people, most people also watch TV in the night anyway.\n\n0:09:41\tSPEAKER_03\n But then it would be charging to the day.\n\n0:09:42\tSPEAKER_03\n I think the point is they charge us through the day and then you've got it charged.\n\n0:09:47\tSPEAKER_01\n But I think the next one's the best anyway.\n\n0:09:51\tSPEAKER_01\n The kinetic charging, which is like you get it in wristwatches and you don't even notice it.\n\n0:09:59\tSPEAKER_01\n And the amount of probably moving around you'd be doing all the time would charge it up.\n\n0:10:03\tSPEAKER_01\n I don't think you'd ever need to actually physically start shaking it up to make it work.\n\n0:10:08\tSPEAKER_02\n And are this like a, what is the life of the kinetic battery?\n\n0:10:11\tSPEAKER_02\n It's like it runs for a long time.\n\n0:10:13\tSPEAKER_01\n Yeah, it charges into some form of, it's a smaller cell, which it charges into and the size of a watch battery because they use them quite frequently and watch it.\n\n0:10:28\tSPEAKER_01\n And that would last for, well, I don't, I'm not entirely sure how long it would last, but I've never seen one run out.\n\n0:10:40\tSPEAKER_03\n But then if you think about watch, it's on your wrist, but it's on your body the whole time.\n\n0:10:45\tSPEAKER_03\n Yeah.\n\n0:10:46\tSPEAKER_03\n So you're walking around you doing things.\n\n0:10:48\tSPEAKER_03\n It is moving a lot of the time.\n\n0:10:50\tSPEAKER_03\n Yeah.\n\n0:10:51\tSPEAKER_03\n And you switch the TV on and put it on the side, then you pick it up to change it and put it on the side.\n\n0:10:55\tSPEAKER_01\n Yeah, but then again, I think it is because if you think about it, watch, although it's only a tiny amount, it's, it's always moving for the whole day.\n\n0:11:09\tSPEAKER_01\n And they don't run out overnight when you leave them on the side.\n\n0:11:13\tSPEAKER_01\n And for the same reason, you're only using it for an incredibly short amount of time, so you send the signal and then you finish with it.\n\n0:11:21\tSPEAKER_01\n And you put it on it.\n\n0:11:22\tSPEAKER_01\n No, no, I don't think the drone will see.\n\n0:11:26\tSPEAKER_04\n Referring back to solar charging, is that compatible with standard batteries?\n\n0:11:31\tSPEAKER_04\n I mean, could people put standard batteries in, but with us, you know, they could leave it in the sunlight for solar charging?\n\n0:11:35\tSPEAKER_04\n Or the two things not compatible?\n\n0:11:37\tSPEAKER_01\n Yeah, I think you could have a dual power thing, but the thing with the solar cells is you would need to put them on the case, and they, because if you, like, on a calculator, they're quite big and they all look identical.\n\n0:11:54\tSPEAKER_03\n No, I expect that they were looking at through a presumed, normal battery for the cheapest.\n\n0:12:03\tSPEAKER_01\n Yeah, the normal batteries would be the cheapest.\n\n0:12:05\tSPEAKER_01\n I presume that then it would actually be the solar charging ones, but the, I think they're not very resistant to dropping, because if you drop stuff, yeah, if you have the size you'd need to charge a remote, wouldn't be that big, but I mean, if, remote always get thrown around and stuff, so I think, yeah, practically, I mean, calculators, you don't really throw around a lot, whereas, remote's do, they can't.\n\n0:12:39\tSPEAKER_01\n Yeah, they do, they've got dual things, but the battery is smaller, I think.\n\n0:12:46\tSPEAKER_02\n I think that's, which one would last the longest, because we don't want customers to be like charging like a mobile phone every day, or remote control, so.\n\n0:12:57\tSPEAKER_01\n Yeah, so this, look at the life, also.\n\n0:12:59\tSPEAKER_01\n Yeah, the, if you had something, using the standard battery's anticylic charging, I don't think you'd, I think the, it would, well, you know how long the standard double A's would last in, or it could last a long time.\n\n0:13:17\tSPEAKER_04\n It would just discharge from the attractiveness of the whole feature.\n\n0:13:19\tSPEAKER_04\n Yeah, I think it would.\n\n0:13:20\tSPEAKER_03\n It would, yeah.\n\n0:13:21\tSPEAKER_03\n Okay, can we add in an attachment to clothing feature?\n\n0:13:26\tSPEAKER_04\n Okay.\n\n0:13:27\tSPEAKER_03\n Can we think about that?\n\n0:13:28\tSPEAKER_03\n Because if we're doing the kinetic thing, shouldn't we do some market research on that\n\n0:13:34\tSPEAKER_04\n first before we add it in, because I, I've got to say.\n\n0:13:36\tSPEAKER_03\n I didn't think about it, right? Okay.\n\n0:13:42\tSPEAKER_03\n Because, if it is the kinetic thing, and it is small and it is portable and it is a different shape, now the kinetic is something people don't do, kind of, we're doing something original and different, but if you wore it, if it's something you could just click on the pocket, then you would have that less, you wouldn't lose it so much.\n\n0:14:08\tSPEAKER_03\n But then maybe that's looking at someone who's just sitting on their own rather than the eternal battle for control of it.\n\n0:14:17\tSPEAKER_04\n It's not something that's come up in any of our focus groups and market research, it's not a thing that people are looking for.\n\n0:14:24\tSPEAKER_04\n Okay.\n\n0:14:25\tSPEAKER_04\n Let me throw it open to the field.\n\n0:14:27\tSPEAKER_04\n Okay.\n\n0:14:28\tSPEAKER_04\n I'm going to put on the side to think about it.\n\n0:14:32\tSPEAKER_01\n Okay, well I'll move on.\n\n0:14:35\tSPEAKER_01\n My second part of my findings, the most current remates use this silicon PCB board, which printed circuit board, which basically has these contacts that are really close together and then when you press down on the rubber button, it'll connect the circuit and each switch is connected to different legs on the chip and so sends a different message.\n\n0:15:05\tSPEAKER_01\n And that then gets translated by the chip into a code and then it's fired out of this LED and the sequence of on and off bursts.\n\n0:15:18\tSPEAKER_03\n What kind of things do we have to consider there?\n\n0:15:22\tSPEAKER_03\n What kind of slides does it come in varying sizes or is it just one size?\n\n0:15:25\tSPEAKER_01\n Well, the thing about it is that they can be as big or as small as you want them to be because you can print a circuit board like that.\n\n0:15:38\tSPEAKER_01\n It's simply space-like that so you can fit the size of the nine buttons in.\n\n0:15:43\tSPEAKER_01\n If you see how thin the tracks are, you could put them virtually right next to each other and have a much smaller switch on each one if you wanted to.\n\n0:15:54\tSPEAKER_01\n But there is an option to do it like that or you could have some sort of array of switches which I'll speak about in the next bit.\n\n0:16:09\tSPEAKER_01\n And then to conserve battery life, we're making a stand by mode, while not being used.\n\n0:16:16\tSPEAKER_01\n What I was thinking about that was because sometimes when you have these things, they've got little lights on behind the buttons so you can see what all the buttons are.\n\n0:16:26\tSPEAKER_01\n Like on a mobile phone, they do it more often than on a TV remote.\n\n0:16:32\tSPEAKER_01\n But you could have lights behind the buttons and after like five or ten seconds and not being used, I'd have that turned off if we decided to go for buttons that could light up.\n\n0:16:45\tSPEAKER_01\n The case material I've been sent, what the factory can actually give us.\n\n0:16:55\tSPEAKER_01\n There's the plastic which I think we were going to go for anyway as the main case housing.\n\n0:17:03\tSPEAKER_01\n The main problems with the, well you could go for wood but I think it would be a bit impractical.\n\n0:17:12\tSPEAKER_01\n Titanium, very expensive, just the process which to make it is expensive.\n\n0:17:21\tSPEAKER_01\n And rubber, well you're saying that people like this spongy feel this year so perhaps something made of rubber but I was thinking more of the buttons because the buttons which they've said that they've put across are what is used in some stressful manufacture and it's meant to be anti-RSI.\n\n0:17:50\tSPEAKER_01\n I'm not sure how that would work because surely your fingers would still be moving over the short distances but that's what they said.\n\n0:17:59\tSPEAKER_01\n And the problem with the casing is that there's quite a few design restrictions that they've got on the shape of the case.\n\n0:18:14\tSPEAKER_01\n If you go for titanium they can only do a standard box shape whereas if you come to plastic they can be a little more, they can do curved shapes but whether or not because we'd have it in two separate units.\n\n0:18:29\tSPEAKER_02\n For the flip phone.\n\n0:18:33\tSPEAKER_02\n And second question is mobile you can change the cover, call it a skin or whatever.\n\n0:18:37\tSPEAKER_02\n So in this case you'll be looking at a custom-made change of color from green, parrot, green to chili red or something like that.\n\n0:18:43\tSPEAKER_02\n Is that feature available in titanium or it's only specific to plastic?\n\n0:18:48\tSPEAKER_01\n Yeah, in titanium I don't think it would be available at all really.\n\n0:18:54\tSPEAKER_01\n Well, you could make it available in the titanium.\n\n0:18:57\tSPEAKER_01\n It would be so expensive to buy a new case for it because of the expensive, how much titanium is light and strong but I think it should be left for aircraft design rather than for it.\n\n0:19:12\tSPEAKER_01\n It does not quite easily do.\n\n0:19:13\tSPEAKER_04\n If you let it fall I've got a mobile phone myself which is titanium and it does mark very easily.\n\n0:19:18\tSPEAKER_04\n I'm just wondering if we make the basic mold out of plastic but have a rubber cover.\n\n0:19:23\tSPEAKER_04\n So that you give the spongy feel that also allows us to kind of have different parts\n\n0:19:28\tSPEAKER_03\n of it. And you can peel them off.\n\n0:19:30\tSPEAKER_03\n So instead of the fascia that comes off being plastic the fascia that comes with the rubber sleeve that we've removed.\n\n0:19:35\tSPEAKER_03\n Like those pens that you get with the grip.\n\n0:19:38\tSPEAKER_03\n That could be good.\n\n0:19:39\tSPEAKER_02\n That could be good.\n\n0:19:40\tSPEAKER_02\n It could be comfortable to hold on.\n\n0:19:44\tSPEAKER_04\n Very cheap way of changing the look of it and people can just buy a new one.\n\n0:19:47\tSPEAKER_03\n Well that's been really popular with mobile phones so I don't think why not.\n\n0:19:53\tSPEAKER_01\n Also just going back to the interface size with the buttons.\n\n0:20:00\tSPEAKER_01\n We were planning to do some sort of touch screen.\n\n0:20:04\tSPEAKER_01\n Now what I was saying before about instead of having you could have just a bare PCB circuit board and I'm sure you could probably get it in different colours and say just by touching it with your finger it would make the connection.\n\n0:20:20\tSPEAKER_01\n Over if you had them close enough that would be one option.\n\n0:20:25\tSPEAKER_01\n The second option they offer rubber buttons but I thought that an LCD type of screen because one they're incredibly thin and don't take on much space.\n\n0:20:38\tSPEAKER_01\n Two they you can have them in a sort of a rain you could arrange the buttons on the screen and it's all sat thing you could have them like a touch.\n\n0:20:50\tSPEAKER_02\n Just what you said I didn't get the meaning of it completely.\n\n0:20:59\tSPEAKER_01\n Oh on the LCD screen you could fit it the problem with it basically is that it's flat and so you can't do lots of curved things with it.\n\n0:21:10\tSPEAKER_01\n But you wouldn't have with the LCD you'd have the wires coming off.\n\n0:21:16\tSPEAKER_01\n You wouldn't have that with the LCD you'd only have that with the printed circuit board.\n\n0:21:23\tSPEAKER_01\n Also it's a problem.\n\n0:21:25\tSPEAKER_04\n Sorry to interrupt I don't see why the curved thing is a problem if we for example had a shell.\n\n0:21:31\tSPEAKER_04\n Yeah.\n\n0:21:32\tSPEAKER_01\n Once we open that.\n\n0:21:33\tSPEAKER_01\n You can have a flat screen inside.\n\n0:21:35\tSPEAKER_00\n Yeah.\n\n0:21:36\tSPEAKER_01\n I'm just wondering whether we want an LCD screen inside it wouldn't be like full color.\n\n0:21:40\tSPEAKER_01\n It would just be black and white but they'd be touch buttons so you wouldn't be pressing down on them.\n\n0:21:47\tSPEAKER_01\n Or we could have rubber buttons which are made of this material which is anti-ISON.\n\n0:21:52\tSPEAKER_03\n I think it would be good to have a contrast between if the whole thing is rubber saying it would be good to open it up and see something quite fancy.\n\n0:22:01\tSPEAKER_03\n Yeah.\n\n0:22:02\tSPEAKER_03\n Now how would you distinguish if you had it bare.\n\n0:22:05\tSPEAKER_03\n How would you distinguish where you had to press me?\n\n0:22:08\tSPEAKER_01\n Yeah I hadn't really thought that.\n\n0:22:09\tSPEAKER_01\n It's just another idea.\n\n0:22:10\tSPEAKER_04\n I don't know if it helps with that but just to do with the RSI.\n\n0:22:14\tSPEAKER_04\n Is it possible just as an option when we open it up people can use their fingers to press the button or we have inside like a small pointer thing.\n\n0:22:21\tSPEAKER_01\n Yeah you could have some sort of stylus that you could pull out but I think they could get a bit easily lost.\n\n0:22:29\tSPEAKER_04\n Yeah.\n\n0:22:30\tSPEAKER_02\n It's easy to replace as well.\n\n0:22:31\tSPEAKER_02\n It's a person who switches channels very often and does use a particular function very often.\n\n0:22:38\tSPEAKER_02\n Yeah.\n\n0:22:39\tSPEAKER_02\n You'll find it very irritating to use earlier.\n\n0:22:40\tSPEAKER_02\n Yeah.\n\n0:22:41\tSPEAKER_02\n And he might spoil the touchpad very fast compared to a button like.\n\n0:22:44\tSPEAKER_02\n Yeah.\n\n0:22:45\tSPEAKER_02\n It'd be keep punching with an point over it.\n\n0:22:47\tSPEAKER_04\n Yeah.\n\n0:22:48\tSPEAKER_04\n Yeah.\n\n0:22:49\tSPEAKER_04\n Okay.\n\n0:22:50\tSPEAKER_04\n Just stuff though.\n\n0:22:51\tSPEAKER_04\n They wouldn't actually need one in the key.\n\n0:22:52\tSPEAKER_04\n Anything they've got.\n\n0:22:53\tSPEAKER_04\n Couldn't they have pancilled a pan.\n\n0:22:54\tSPEAKER_03\n So they wouldn't really need a.\n\n0:22:55\tSPEAKER_03\n Okay.\n\n0:22:56\tSPEAKER_03\n We'll talk about that.\n\n0:22:57\tSPEAKER_01\n So if you finish here.\n\n0:22:58\tSPEAKER_01\n Yeah that's fine.\n\n0:22:59\tSPEAKER_01\n Yeah that's the end.\n\n0:23:00\tSPEAKER_02\n I've never seen before like you're listening regarding the circuit since we have having a flip top.\n\n0:23:05\tSPEAKER_02\n Yeah.\n\n0:23:06\tSPEAKER_02\n We can customize the two circuits for different type of buttons like we are keeping the standard buttons on the top.\n\n0:23:09\tSPEAKER_02\n Oh yeah.\n\n0:23:10\tSPEAKER_02\n It's a complex button in the distance so we can divide the circuit like that.\n\n0:23:13\tSPEAKER_01\n Yeah.\n\n0:23:14\tSPEAKER_01\n Yeah that would be fairly simple.\n\n0:23:15\tSPEAKER_01\n I mean you'd actually have two separate.\n\n0:23:18\tSPEAKER_01\n You'd have two separate circuit boards but they'd be joined by wires or like some cabling between them because in the actual flip that you'd have some linking.\n\n0:23:31\tSPEAKER_04\n I'll just raise another point.\n\n0:23:34\tSPEAKER_04\n Well it occurs to me.\n\n0:23:35\tSPEAKER_04\n It kind of applies to both our designers here.\n\n0:23:37\tSPEAKER_04\n I'm not sure how it would fit in.\n\n0:23:39\tSPEAKER_04\n If we flip open.\n\n0:23:40\tSPEAKER_04\n Now you know how you've got some mirrors in nightclubs.\n\n0:23:43\tSPEAKER_04\n There are mirrors when you turn to them and you turn away and it gives like an advertising display.\n\n0:23:47\tSPEAKER_04\n You see those?\n\n0:23:48\tSPEAKER_04\n And they kind of respond to the turn of your body.\n\n0:23:51\tSPEAKER_04\n Is it possible that when we open our flip top shell.\n\n0:23:54\tSPEAKER_04\n It's a little compact mirror and when you press a button it then goes on to the phone display.\n\n0:23:59\tSPEAKER_04\n They're remote control display thing.\n\n0:24:01\tSPEAKER_03\n We're marketing to guys as much as we are to women.\n\n0:24:05\tSPEAKER_04\n They don't look at themselves.\n\n0:24:07\tSPEAKER_04\n Just a thought.\n\n0:24:08\tSPEAKER_03\n Well it's remote control you were sitting watching TV.\n\n0:24:11\tSPEAKER_03\n Yeah.\n\n0:24:12\tSPEAKER_03\n Are you going to want to sort of open it in the evening?\n\n0:24:13\tSPEAKER_03\n I know what you mean.\n\n0:24:14\tSPEAKER_03\n It's like I'm just using the idea of mobile.\n\n0:24:15\tSPEAKER_04\n So they're using the idea of mobile phones and kind of got slightly on to that I think.\n\n0:24:21\tSPEAKER_04\n Okay.\n\n0:24:22\tSPEAKER_04\n I'm trying to think of other features we can build in that wouldn't cost too much but one of the things that we'll understand.\n\n0:24:26\tSPEAKER_04\n Yeah.\n\n0:24:27\tSPEAKER_04\n Okay.\n\n0:24:28\tSPEAKER_01\n I mean you can't.\n\n0:24:30\tSPEAKER_01\n You could do it.\n\n0:24:31\tSPEAKER_01\n You could have a, because if you, if you just put the full charge through an LCD display or completely blank it out.\n\n0:24:38\tSPEAKER_01\n I don't know if you can get any mirror effect on that.\n\n0:24:41\tSPEAKER_01\n I think I'll be forget about the mirror.\n\n0:24:42\tSPEAKER_04\n That was just a very quick passing thought.\n\n0:24:45\tSPEAKER_02\n Okay.\n\n0:24:46\tSPEAKER_02\n I'd like to share something which I did here.\n\n0:24:52\tSPEAKER_02\n First thing is basically on design we just took the input from the previous meeting, especially from the marketing and industrial design to check on the customer needs and feasibility.\n\n0:25:02\tSPEAKER_02\n Second is we checked into competitors.\n\n0:25:04\tSPEAKER_02\n The picture here shows what are the standard models offered by competitors here.\n\n0:25:08\tSPEAKER_02\n So you generally see there is not much of variety and like marketing teams said people need 20.\n\n0:25:14\tSPEAKER_02\n They are both of black and white.\n\n0:25:15\tSPEAKER_02\n So you generally see rectangular shape, very monotonous kind of designs here.\n\n0:25:23\tSPEAKER_02\n And second thing is there is too much of confusion here.\n\n0:25:27\tSPEAKER_02\n No particular remote is standard.\n\n0:25:31\tSPEAKER_02\n Like some, some people have here you see this.\n\n0:25:36\tSPEAKER_02\n This is all I found out that only common feature is the channel control and the volume control.\n\n0:25:43\tSPEAKER_02\n There's other buttons there in a very disorganized and they are not consistent with other models.\n\n0:25:47\tSPEAKER_02\n Okay.\n\n0:25:48\tSPEAKER_02\n And second, as already discussed with William, we are going to have maybe a GUI interface in the middle of the flip top.\n\n0:25:57\tSPEAKER_02\n Sorry, what is that?\n\n0:25:58\tSPEAKER_02\n Graphic user interface.\n\n0:25:59\tSPEAKER_02\n Basically, which is what we do in computer.\n\n0:26:01\tSPEAKER_02\n Have icons or touchpad over to.\n\n0:26:04\tSPEAKER_01\n If you have like buttons appear on the screen and the cell CD screen.\n\n0:26:08\tSPEAKER_02\n Like you have an all icons or something you have is a good example of GUI, graphic user interface.\n\n0:26:15\tSPEAKER_02\n So basically a person need not point or click or press any particular device.\n\n0:26:21\tSPEAKER_02\n He just has to click on that particular icon to simplify.\n\n0:26:24\tSPEAKER_02\n And on the top repetitive buttons which are like volume or channel changing and all could be on the pointing device.\n\n0:26:31\tSPEAKER_02\n That means user button.\n\n0:26:32\tSPEAKER_02\n So he need not use a pointer to keep changing the channel if a person is frequent.\n\n0:26:38\tSPEAKER_02\n So we are having a combination of both.\n\n0:26:40\tSPEAKER_02\n So on this simpler board on the top, we have this button, rubber buttons to keep frequently changing the channels.\n\n0:26:47\tNone\n Can we swap that round?\n\n0:26:48\tSPEAKER_03\n So the one that we use all the time on the bottom part.\n\n0:26:52\tSPEAKER_03\n In fact, if you think about holding it, you would be using your thumbs to press.\n\n0:27:00\tSPEAKER_03\n Just like a mobile phone.\n\n0:27:02\tSPEAKER_04\n And you could flip it open and you would be, wouldn't you?\n\n0:27:11\tSPEAKER_04\n If we just use the shell as an example again, you open that, you have your LCD display there and you have the buttons there.\n\n0:27:14\tSPEAKER_04\n She holds it on the bottom.\n\n0:27:15\tSPEAKER_03\n That is what I was saying.\n\n0:27:16\tSPEAKER_03\n But you can do it with the thumb.\n\n0:27:18\tSPEAKER_03\n And then have the LCD at the top.\n\n0:27:21\tSPEAKER_03\n And then be able to touch that for the other.\n\n0:27:24\tSPEAKER_03\n And you will have the volume and the program, things like that.\n\n0:27:29\tSPEAKER_03\n And the lower.\n\n0:27:30\tSPEAKER_02\n So the findings are too many clouded buttons.\n\n0:27:38\tSPEAKER_02\n Repetition of certain buttons which I already explained.\n\n0:27:41\tSPEAKER_02\n Example the volume and channel control buttons.\n\n0:27:44\tSPEAKER_02\n All are confusing and inconsistent.\n\n0:27:45\tSPEAKER_02\n Okay, we had a latest finding of voice recognition.\n\n0:27:48\tSPEAKER_02\n There was a mail which mentioned that our division has developed a new speech recognition feature.\n\n0:27:55\tSPEAKER_02\n We have to check into the financial feasibility whether we can incorporate this at a low cost.\n\n0:28:02\tSPEAKER_02\n But for like we had response from the customer that they would like to have the feature of finding it.\n\n0:28:10\tSPEAKER_02\n So it could be like, where is the remote and the remote answers, I am here.\n\n0:28:15\tSPEAKER_02\n Some kind of thing or it gives a blip sound or some kind of sound.\n\n0:28:20\tSPEAKER_02\n And if this can be incorporated, this would be more, you can say trendy also and technologically innovative also.\n\n0:28:29\tSPEAKER_02\n So we can check into the financial feasibility of incorporating this.\n\n0:28:36\tSPEAKER_02\n My personal preferences would be like, I already highlighted my marketing department.\n\n0:28:41\tSPEAKER_02\n They want something to do with fruit.\n\n0:28:43\tSPEAKER_02\n So I wouldn't say the design should be like a fruit.\n\n0:28:45\tSPEAKER_02\n Yeah, we can take inspiration from fruit colors like the vibrant colors are red chili.\n\n0:28:53\tSPEAKER_02\n Two might have read over and second thing is certain certain standard buttons we should have.\n\n0:28:58\tSPEAKER_02\n Like for example, if you see the previous slide.\n\n0:29:03\tSPEAKER_02\n Wow.\n\n0:29:06\tSPEAKER_02\n I think most of the users would now be well acquainted with this certain central pattern.\n\n0:29:10\tSPEAKER_02\n Here.\n\n0:29:11\tSPEAKER_02\n So we will not change that particular pattern because this is the most consistent thing in all remote controls.\n\n0:29:17\tSPEAKER_03\n I can't see that.\n\n0:29:18\tSPEAKER_03\n That play and stop.\n\n0:29:19\tSPEAKER_03\n This is central one.\n\n0:29:20\tSPEAKER_02\n The one you have volume and channel.\n\n0:29:24\tSPEAKER_02\n So keep that standardize because that's the most common feature across all models.\n\n0:29:28\tSPEAKER_02\n If you look at all the models, it's here.\n\n0:29:33\tSPEAKER_02\n This.\n\n0:29:37\tSPEAKER_02\n Voice recognition.\n\n0:29:44\tSPEAKER_03\n Right.\n\n0:29:48\tSPEAKER_03\n Okay.\n\n0:29:49\tSPEAKER_03\n I'm not sure how long we've got left, but we need to make a decision about things we've discussed.\n\n0:30:02\tSPEAKER_03\n So we agree on.\n\n0:30:07\tSPEAKER_03\n Do we agree on the battery?\n\n0:30:09\tSPEAKER_04\n Kind of.\n\n0:30:10\tSPEAKER_04\n Kind of.\n\n0:30:11\tSPEAKER_03\n Yeah.\n\n0:30:12\tSPEAKER_03\n That means that there's no function for the port.\n\n0:30:18\tSPEAKER_03\n You know that it sits in the impression button and having.\n\n0:30:21\tSPEAKER_03\n So we could incorporate voice recognition.\n\n0:30:23\tSPEAKER_03\n Yeah, I think it's like a gadget.\n\n0:30:26\tSPEAKER_03\n It's a.\n\n0:30:27\tSPEAKER_01\n Yeah, it is.\n\n0:30:28\tSPEAKER_01\n It is quite a cool feature tab.\n\n0:30:30\tSPEAKER_01\n And also if they've got it, if they've got these parts already in stock, then it won't be cheap to remanufacturing.\n\n0:30:38\tSPEAKER_01\n It will be cheap, so to remanufacturing.\n\n0:30:41\tSPEAKER_01\n So do you recommend to get idea that where's the remote I'm here thing?\n\n0:30:46\tSPEAKER_01\n I think that would be quite fun.\n\n0:30:48\tSPEAKER_03\n I think the only.\n\n0:30:49\tSPEAKER_03\n I think the only pitfall that we would have would be how much it can cost.\n\n0:30:55\tSPEAKER_03\n That means we have to cut down somewhere else.\n\n0:30:57\tSPEAKER_03\n But I think pretty much we use cheap.\n\n0:31:02\tSPEAKER_03\n Yeah.\n\n0:31:03\tSPEAKER_03\n Well, to be cheap and simple thing.\n\n0:31:05\tSPEAKER_01\n Yeah.\n\n0:31:06\tSPEAKER_01\n The LCD is not cheap.\n\n0:31:07\tSPEAKER_01\n Well, it's not as expensive as it would be if it was full color because if we just got black and white one, I mean they use them in calculators.\n\n0:31:15\tSPEAKER_02\n Maybe we could start with the black and white.\n\n0:31:20\tSPEAKER_00\n Yeah.\n\n0:31:21\tSPEAKER_02\n That would be good.\n\n0:31:22\tSPEAKER_02\n Yeah.\n\n0:31:23\tSPEAKER_02\n Upgrade later on.\n\n0:31:24\tSPEAKER_04\n Yeah.\n\n0:31:25\tSPEAKER_04\n We talked about kinetic charging.\n\n0:31:26\tSPEAKER_04\n Did we decide on doubly or triple e batteries?\n\n0:31:30\tSPEAKER_01\n Wait.\n\n0:31:31\tSPEAKER_03\n Do you want a backup?\n\n0:31:33\tSPEAKER_04\n No.\n\n0:31:34\tSPEAKER_04\n One of the decisions we had to make was whether we had doubly or triple e batteries because they still got to be charged this way, haven't they?\n\n0:31:39\tSPEAKER_01\n No, the kinetic ones come with the sort of battery that goes in the watch.\n\n0:31:44\tSPEAKER_01\n Right.\n\n0:31:45\tSPEAKER_01\n OK.\n\n0:31:46\tSPEAKER_01\n So it's a lot smaller than that.\n\n0:31:47\tSPEAKER_01\n So it would.\n\n0:31:48\tSPEAKER_04\n Got you on that, OK.\n\n0:31:49\tSPEAKER_03\n Got battery.\n\n0:31:56\tSPEAKER_03\n The inside component is pretty standardised across the board, isn't it?\n\n0:32:01\tSPEAKER_03\n Yeah.\n\n0:32:02\tSPEAKER_03\n So there's not really a decision to be made there.\n\n0:32:08\tSPEAKER_03\n The buttons.\n\n0:32:09\tSPEAKER_03\n What did you give us as a zone?\n\n0:32:14\tSPEAKER_03\n The bareboard LCD.\n\n0:32:15\tSPEAKER_01\n Yeah, the, I think we were going to the LCD on that one.\n\n0:32:19\tSPEAKER_01\n On the buttons.\n\n0:32:20\tSPEAKER_01\n On the, on the, on the top one.\n\n0:32:24\tSPEAKER_03\n On the top one, OK.\n\n0:32:25\tSPEAKER_03\n You've got the touch.\n\n0:32:26\tSPEAKER_03\n Yeah.\n\n0:32:27\tSPEAKER_03\n OK.\n\n0:32:28\tSPEAKER_01\n And then on the bottom, we were going to have to rub a rub once the anti-ISI ones.\n\n0:32:36\tSPEAKER_03\n OK.\n\n0:32:37\tSPEAKER_03\n OK.\n\n0:32:38\tNone\n Sorry.\n\n0:32:39\tSPEAKER_04\n Could you repeat that last part?\n\n0:32:41\tSPEAKER_01\n OK.\n\n0:32:42\tSPEAKER_01\n On the flip screen.\n\n0:32:43\tSPEAKER_01\n The flip screen.\n\n0:32:44\tSPEAKER_01\n The top one is going to be the LCD.\n\n0:32:47\tSPEAKER_01\n And the bottom one is going to be the rubberized plastic.\n\n0:32:50\tSPEAKER_01\n OK.\n\n0:32:51\tSPEAKER_02\n And for the, you know it's for the body design, I think, plastic.\n\n0:32:59\tSPEAKER_02\n Plastic.\n\n0:33:00\tSPEAKER_01\n Yeah.\n\n0:33:01\tSPEAKER_01\n OK.\n\n0:33:02\tSPEAKER_01\n If it's inside, for the inside end.\n\n0:33:03\tSPEAKER_02\n Yeah.\n\n0:33:04\tSPEAKER_02\n Rubber as a padding or for the crypt something like to add to the design.\n\n0:33:08\tSPEAKER_04\n So we decided on a rubber casing for the plastic shell and the right two designs.\n\n0:33:13\tSPEAKER_04\n OK.\n\n0:33:14\tSPEAKER_04\n And it is just a, although it's rubberized and spongy, apart from that, we're just going to go for sort of vegetable and fruit colors.\n\n0:33:21\tSPEAKER_04\n We're not going to try and make it actually a vegetable or fruit design or anything else\n\n0:33:26\tSPEAKER_03\n in the shell. No, I think it kind of is.\n\n0:33:28\tSPEAKER_03\n We don't want to be tacky if we've got a different shape anyway.\n\n0:33:32\tSPEAKER_03\n OK.\n\n0:33:33\tSPEAKER_03\n The fact, the material that we would be using would be cheap.\n\n0:33:38\tSPEAKER_03\n So we could make it red, we could make it psychedelic.\n\n0:33:44\tSPEAKER_03\n You know, we could make it black and white, there for stripes.\n\n0:33:47\tSPEAKER_03\n But that's not really what we're focusing on, what we're focusing on.\n\n0:33:51\tSPEAKER_03\n The feel.\n\n0:33:52\tSPEAKER_03\n Yes.\n\n0:33:53\tSPEAKER_03\n So you can just pick anything.\n\n0:33:57\tSPEAKER_04\n Is that going to be the image I've got in my head of something kind of shaped like that, maybe about that size, made of plastic fits into the palm of the hand, rubberized cover that's spongy.\n\n0:34:09\tSPEAKER_04\n Is that really going to fit fancy looking feel, which was the major thing that people wanted to market research?\n\n0:34:15\tSPEAKER_03\n Is that slightly different?\n\n0:34:16\tSPEAKER_03\n It's just different.\n\n0:34:17\tSPEAKER_03\n It's just different from everything else.\n\n0:34:19\tSPEAKER_03\n And I mean, I'm trying to imagine clean looking houses sort of beige and black.\n\n0:34:28\tSPEAKER_03\n Do you either want something that goes with that, which is what's on the market anyway, or you want something that contrasts as you get clocks now that are more of a talking point than an actual clock.\n\n0:34:40\tSPEAKER_03\n Yeah.\n\n0:34:41\tSPEAKER_03\n Because they're so in there.\n\n0:34:42\tSPEAKER_04\n I'm just kind of pushing it like to see if you came out with anything else.\n\n0:34:45\tSPEAKER_04\n But I totally agree.\n\n0:34:46\tSPEAKER_04\n We looked at those emotes.\n\n0:34:47\tSPEAKER_04\n I mean, there are kind of anonymous, very similar looking things.\n\n0:34:50\tSPEAKER_04\n This would definitely be different enough.\n\n0:34:51\tSPEAKER_04\n I just wanted if anybody could come up with something.\n\n0:34:53\tSPEAKER_03\n And you would just have a cross that you would have so many different options you could do.\n\n0:35:00\tSPEAKER_03\n You could have a plain black one.\n\n0:35:02\tSPEAKER_03\n You could have sparkly pink.\n\n0:35:04\tSPEAKER_03\n Literally.\n\n0:35:05\tSPEAKER_04\n The things that the rubberized covers are going to be serratively cheap to produce.\n\n0:35:08\tSPEAKER_04\n If in a year's time we get feedback from the design fears that show something else is coming out, it's so easy to produce that that can be slipped on.\n\n0:35:16\tSPEAKER_03\n And what is another beauty of it?\n\n0:35:17\tSPEAKER_03\n The ones that have rubbery spikes.\n\n0:35:20\tSPEAKER_03\n You know, you just go so far with it.\n\n0:35:24\tSPEAKER_00\n Like a puffer face.\n\n0:35:25\tSPEAKER_03\n You could just, you could take it wherever.\n\n0:35:27\tSPEAKER_03\n So I think that's quite a flexible.\n\n0:35:29\tSPEAKER_02\n And finally, the body should be detachable.\n\n0:35:32\tSPEAKER_02\n Maybe you can change the body of the case casing, the case outside.\n\n0:35:37\tSPEAKER_02\n It should be more loaded with the design in such a way you can change it every time.\n\n0:35:41\tSPEAKER_01\n Yeah, yeah, with these rubberized, not the actual plastic outside case, just the rubber.\n\n0:35:48\tSPEAKER_01\n Yeah.\n\n0:35:49\tSPEAKER_03\n Okay, we've got five minutes.\n\n0:35:53\tSPEAKER_03\n Or that might have been up for a while.\n\n0:35:57\tSPEAKER_04\n So can I just recap Sarah, the decisions that we've made, kinetic charging, the watch type batteries, LCD display, the top side of the flip top, rubberized buttons on the bottom side.\n\n0:36:11\tSPEAKER_04\n We're going to use fruit and vegetable colors for the rubber, cover the case itself as plastic.\n\n0:36:15\tSPEAKER_04\n That's how far we've got.\n\n0:36:16\tSPEAKER_04\n What else do we have to add to our decisions here?\n\n0:36:20\tSPEAKER_02\n Fine, we're talking of a voice recognition also.\n\n0:36:24\tSPEAKER_02\n Because we have not addressed the issue of how to locate remote control if it's lost.\n\n0:36:30\tSPEAKER_04\n Yeah, we're just a cost issue with that, but it's a good idea.\n\n0:36:34\tSPEAKER_04\n We just need to check on the cost.\n\n0:36:35\tSPEAKER_02\n Maybe like William was suggesting in the last thing some devices you put on key chains.\n\n0:36:40\tSPEAKER_02\n Oh, yeah, yeah, the whistle once.\n\n0:36:43\tSPEAKER_02\n The whistle.\n\n0:36:44\tSPEAKER_02\n So we can financially voice recognition is not feasible.\n\n0:36:47\tSPEAKER_02\n We could go for a whistle.\n\n0:36:50\tSPEAKER_04\n And incorporating the company logo.\n\n0:36:57\tSPEAKER_04\n Yep.\n\n0:36:58\tSPEAKER_02\n Have you been incorporating in the design?\n\n0:37:05\tSPEAKER_04\n Because I took it from the feedback you gave in the last meeting from your report.\n\n0:37:10\tSPEAKER_04\n It's not just a case of having a little RR hidden somewhere.\n\n0:37:13\tSPEAKER_04\n They do want it to be obvious that it's our product.\n\n0:37:15\tSPEAKER_03\n Well, they do, but I think we can.\n\n0:37:18\tSPEAKER_03\n It's the only one of its kind on the market.\n\n0:37:21\tSPEAKER_03\n I think you just addressed that with advertising.\n\n0:37:25\tSPEAKER_03\n You associate the name with the individual product that it is.\n\n0:37:28\tSPEAKER_03\n Okay.\n\n0:37:29\tSPEAKER_03\n And that doesn't work for you.\n\n0:37:30\tSPEAKER_03\n Obviously you'll have a logo on it, just like everything.\n\n0:37:32\tSPEAKER_03\n But everything else has a logo on it.\n\n0:37:34\tSPEAKER_03\n The point is that it's got to stand out somehow differently.\n\n0:37:37\tSPEAKER_03\n I think it does.\n\n0:37:38\tSPEAKER_03\n And that's why I find that.\n\n0:37:41\tSPEAKER_04\n Did we, I know at the last meeting we spoke about a beeper.\n\n0:37:44\tSPEAKER_04\n I think that was you talked about a beeper for a location.\n\n0:37:46\tSPEAKER_04\n Have we just rejected that beeper voice recognition?\n\n0:37:49\tSPEAKER_03\n Depending on how...\n\n0:37:50\tSPEAKER_01\n Yeah, depending on the expense of it.\n\n0:37:51\tSPEAKER_03\n I mean, we've got this memo saying that it's something that the company is looking into.\n\n0:37:56\tSPEAKER_03\n I've got in stocks.\n\n0:37:58\tSPEAKER_03\n That seems to make sense.\n\n0:37:59\tSPEAKER_03\n But if it turns out that it's hugely expensive, we'd have to cut down somewhere else.\n\n0:38:03\tSPEAKER_03\n Then it's worth thinking about.\n\n0:38:07\tSPEAKER_03\n But I think we'll find out more about the market afterwards.\n\n0:38:11\tSPEAKER_03\n Right.\n\n0:38:12\tSPEAKER_03\n I'm going to wrap it up saying.\n\n0:38:15\tSPEAKER_03\n I've got an end meeting now.\n\n0:38:17\tSPEAKER_03\n Right.\n\n0:38:18\tSPEAKER_02\n Did it?\n\n0:38:19\tSPEAKER_02\n Yeah.\n\n0:38:20\tSPEAKER_03\n Sorry.\n\n0:38:21\tSPEAKER_02\n I've been a bushing here, huh?\n\n0:38:24\tSPEAKER_03\n So I think we've probably got...\n\n0:38:26\tSPEAKER_03\n Instead of going to the same thing, we have 40 minutes.\n\n0:38:29\tSPEAKER_03\n So I think we've probably got about that time before we come back.\n\n0:38:33\tSPEAKER_03\n See that that, or we only had 40 minutes to discuss what we've discussed.\n\n0:38:39\tSPEAKER_03\n I don't know how long that took.\n\n0:38:41\tSPEAKER_02\n I think we're pretty going in a clear direction now.\n\n0:38:44\tSPEAKER_03\n Is everyone happy?\n\n0:38:46\tSPEAKER_03\n Left is good.\n\n0:38:48\tSPEAKER_03\n Left is good.\n\n0:38:50\tSPEAKER_03\n OK.\n\n0:38:51\tSPEAKER_03\n OK.\n\n", "summary": [{"summary_text": "SPEAKER and his team are going to talk about the design of the remote control device for young business customers. They discuss the materials, user interface, and trend watching. They also discuss the market trends and the general feedback from the marketing department. They decide to leave out the voice recognition."}]}