{"filename": "./data/ES2009c.txt", "transcript": "0:00:00\tSPEAKER_02\n That's great.\n\n0:00:07\tSPEAKER_02\n Okay. All right. Let me just PowerPoint this out.\n\n0:00:14\tSPEAKER_03\n All right. Let me just PowerPoint this out.\n\n0:00:31\tSPEAKER_03\n All right. So this meeting will be about the conceptual design. Don't ask me precisely what conceptual design is. It's just something important that we need to do.\n\n0:00:41\tSPEAKER_03\n I think it's kind of turning the abstract into slightly more concrete and this meeting ideally will come to some final decisions on what we're going to do for the prototype.\n\n0:00:51\tSPEAKER_03\n Right. So apologies for the last meeting. It was brought to my attention that I did not make the rules clear enough. So I will attempt to do so more accurately in this particular meeting.\n\n0:01:02\tSPEAKER_03\n Fair enough. Thanks for the input. It's always good.\n\n0:01:07\tSPEAKER_03\n So basically all we're going to do is have some presentations again much like last time. I'm going to go through you.\n\n0:01:13\tSPEAKER_03\n Whoever wants to go first is fine by me and we'll collate what we know about what we discussed in the last meeting possible directions.\n\n0:01:22\tSPEAKER_03\n And then we'll make some more decisions on basic firm up our idea how we want this remote control to look and work.\n\n0:01:31\tSPEAKER_03\n So perfect. So without further ado. Whoever wants to go first is free to go first. All right. Take it away.\n\n0:01:47\tSPEAKER_03\n It is Nathan. I'm not calling the wrong name over Nathan's fire. Good.\n\n0:01:52\tSPEAKER_00\n I'm going to go further Nathan or participant to Mr. participant to that is. Okay. Nice.\n\n0:02:03\tSPEAKER_00\n Basically what I'm going to have to talk to you about today is component design and it's been brought to my attention that we may be somewhat limited as to what we can do because of what our manufacturer offers.\n\n0:02:15\tSPEAKER_00\n Basically what I'm going to be doing is talking to you about that components of remote control. Okay. We've already kind of gone over this but we have to get into more detail and probably have to reach some conclusions sometimes soon.\n\n0:02:29\tSPEAKER_00\n Energy source. Our manufacturer offers a variety of energy sources. Your standard battery.\n\n0:02:36\tSPEAKER_00\n Solar cells. Our manufacturer didn't say anything about lithium. So we might have to look if we do go that route. We might have to look elsewhere.\n\n0:02:44\tSPEAKER_00\n And also there's a kinetic energy possibility. Basically it's like a idea of moving the remote would create enough energy to keep it running.\n\n0:02:53\tSPEAKER_00\n So that's one possible. But I don't know whether that would be powerful enough to illuminate a touchscreen. So we'll have to look into that.\n\n0:03:03\tSPEAKER_00\n The case we have a few options. Plastic rubber or wood. And then as far as the way it's shaped we can do standard born flat which we probably don't want to do curved or very sexy double curved.\n\n0:03:20\tSPEAKER_00\n What kind of thickness are we looking at? I imagine that we could specify.\n\n0:03:26\tSPEAKER_00\n I don't see any reason to go outside of the convention of three or four millimeters.\n\n0:03:35\tSPEAKER_00\n The buttons. There are multiple scope buttons available for manufacturer but to use those who would have to use more chips.\n\n0:03:45\tSPEAKER_00\n And that would cost us more. And if we do go with rubber double curved case.\n\n0:03:50\tSPEAKER_00\n We'll have to use rubber push buttons. Because the other buttons aren't compatible with that.\n\n0:03:57\tSPEAKER_00\n And just a little note there. Touch screen equals many chips which equals many heroes.\n\n0:04:07\tSPEAKER_00\n One thing that I noticed is that most remotes operate on the infrared part of the spectrum.\n\n0:04:15\tSPEAKER_00\n So you notice when you push a button on your remote you can't see anything coming out of it. But in fact there is light coming out of the remote and the television conduct.\n\n0:04:24\tSPEAKER_00\n And if you were to record, if you were to make a video recording you could actually see the light.\n\n0:04:29\tSPEAKER_00\n One thing that I thought might be interesting was to use part use visible light coming out of the mode just kind of as a fun gimmick.\n\n0:04:38\tSPEAKER_00\n You could actually see something coming out of the remote when you push it. Of course there have to be a part of the spectrum that wouldn't damage the human off.\n\n0:04:46\tSPEAKER_03\n Maybe is there an option that we could have that offer on so a person could select like.\n\n0:04:50\tSPEAKER_00\n Yeah, I'm sure that we could do that.\n\n0:04:55\tSPEAKER_00\n Yeah, that's a good idea.\n\n0:04:57\tSPEAKER_00\n Yeah, just as a fun gimmick. Just set us apart a little bit.\n\n0:05:03\tSPEAKER_00\n And then onto the circuit board that we're going to use also moves the chip. We really don't have any where around the TA 11835.\n\n0:05:14\tSPEAKER_00\n Findings. Okay, we're very limited by what our current manufacturers can offer.\n\n0:05:20\tSPEAKER_00\n And my question to all of you is should we look to other manufacturers which is making to you with what we have available.\n\n0:05:28\tSPEAKER_02\n That's a bit of a challenge question. Like say shop around but with our time constraints is that really a feasible option.\n\n0:05:34\tSPEAKER_00\n Right, that's my concern too.\n\n0:05:38\tSPEAKER_00\n If we do go to the lithium battery route then we'll have to go outside currently.\n\n0:05:44\tSPEAKER_00\n My personal preferences I'll just throw my cards on the table.\n\n0:05:47\tSPEAKER_00\n I think we should probably go to solar battery route just to kind of keep with the environmentally friendly theme that we have going on.\n\n0:05:56\tSPEAKER_00\n I like the idea of the visible light signaling is something to set us apart.\n\n0:06:01\tSPEAKER_00\n And I was thinking about was thinking of ways that we could produce the remote and a variety of different case materials to suit different tastes.\n\n0:06:10\tSPEAKER_00\n So we're not so confined by one style and say so you know say I the one if we just go with one and it doesn't go over well then we're in a bad situation.\n\n0:06:22\tSPEAKER_03\n Can we do marketing piloting to try to see what kind before we launch can we see how they received.\n\n0:06:30\tSPEAKER_02\n It's an option. Actually there's I've got some research already on like what we're looking at and trends in casing right now.\n\n0:06:37\tSPEAKER_02\n Okay, which actually might even come into play beforehand.\n\n0:06:40\tSPEAKER_02\n Okay perfect.\n\n0:06:41\tSPEAKER_02\n Great. Thank you very much.\n\n0:06:43\tSPEAKER_03\n It's perfect. So I guess that makes sense for you to take a perimeter.\n\n0:06:45\tSPEAKER_02\n I guess so.\n\n0:06:47\tSPEAKER_02\n Because I found some interesting things.\n\n0:06:52\tSPEAKER_02\n Fascinating.\n\n0:06:53\tSPEAKER_02\n I know. I wanted to hear.\n\n0:06:57\tSPEAKER_02\n Right.\n\n0:07:00\tSPEAKER_02\n So current market trends screen.\n\n0:07:05\tSPEAKER_02\n Basically I was looking at what's going on in the remote control market right now and what's going on in other design fields to see sort of what's what's trendy what's new what's happening.\n\n0:07:15\tSPEAKER_02\n Remote control right now basically everybody says they want newer fancier more exciting their sake of this boring normal functional that we need innovative design options and it needs to be an easy user interface.\n\n0:07:30\tSPEAKER_02\n The challenge is that current trends right now across the board in fashion in furniture in technology is a very organic.\n\n0:07:40\tSPEAKER_02\n A very comfortable kind of thing.\n\n0:07:45\tSPEAKER_02\n We should have you know tomato shaped remote controls or anything but I think it is possible maybe to use natural colors like if wood is an option that whole organic sleek clean.\n\n0:07:57\tSPEAKER_02\n So if you're seeing maybe something we can look into different skin options or if we can't afford this touch plate thing or touch face screen interface maybe having the images be specific like you could choose your menu bullets to be.\n\n0:08:16\tSPEAKER_02\n Okay not the example I would choose but you know what I mean to sort of and apparently the feel of the next couple of years is spongy not something I come up with a definitely a strand though if we can get around to getting piloting I thought maybe a casing option like\n\n0:08:37\tSPEAKER_00\n not like a skin but like a holder almost if you could do like leather options or wood options or something I should have mentioned this as far as the rubber that we can use we can use a rubber as part of the case it has a consistency of those\n\n0:08:53\tSPEAKER_02\n stress balls might be a way to go slick yeah so something to sit on for now so overall I think we should stick with what we're finding every is looking for easy use technology innovative and this fancy new I think perhaps the double curve thing and maybe this rubber option is our best way to go for right now.\n\n0:09:17\tSPEAKER_00\n Oh the interface graphics for the well I but then if touch screen thing is work out for us that's really no issue I like the idea of rubber it's here because it's 10 set be associated with being durable something that you can drop and it doesn't so many you go to so many houses these days and you see broken remote control.\n\n0:09:38\tSPEAKER_01\n Yeah it's like with duct tape. You would have a phone. You could have a duct tape. I think that goes against the whole fancy something.\n\n0:09:49\tSPEAKER_02\n Yeah that's what I know.\n\n0:09:58\tSPEAKER_03\n Great thanks for that Sarah. Run.\n\n0:10:08\tSPEAKER_01\n Here is just one moment. So interface concept by your faithful user interface.\n\n0:10:25\tSPEAKER_01\n So you don't use your interface guys is basically aspects of a computer system that we can see or here or otherwise perceive commands and mechanisms that basically user uses to control the operating operating system.\n\n0:10:43\tSPEAKER_01\n Here's a series of different controls that are out on the market today.\n\n0:10:47\tSPEAKER_01\n I think we're definitely trying to get away from this kind of a look. So the following are a bunch of different interface concepts voice recognition we actually have some new information from our research design team but get to that in a moment.\n\n0:11:09\tSPEAKER_01\n So current voice recognition starts up to about 80 speech samples and basically you record your own verbal labels and connect them to the remote control.\n\n0:11:19\tSPEAKER_01\n Now our design team research team has been able to set up a system in which you can teach the remote control voice recognition system to respond to you with standard responses like you could say good morning.\n\n0:11:38\tSPEAKER_01\n In fact we already have this for a copy maker line.\n\n0:11:48\tSPEAKER_01\n A lot of single people on the other. Another concept is what Apple has come up with is spinning wheel with LC display like on the iPods which I'm sure most you know.\n\n0:12:06\tSPEAKER_01\n We have this scroll button with indicator push button like a modern boss of embaldy a bit crazy. I don't think that's what we're necessarily going for.\n\n0:12:18\tSPEAKER_01\n So ideas like blocking having the ability to block channels from your for your children and dedicated buttons for commonly used channels and even ideas like secured or hidden programming but again if we go with that screen I don't think that's a big issue.\n\n0:12:41\tSPEAKER_01\n This is kind of the big daddy. The Jumbo universal remote control is almost impossible to miss places.\n\n0:12:53\tSPEAKER_01\n Again probably not what we're going for so I mean my ideas here and kind of where I think we're heading is something slightly larger than a regular iPod with a hard classic classic casing.\n\n0:13:12\tSPEAKER_01\n The team was possibly talking about including one extra faceplate with the package to kind of set the idea that you can change it and you can try changing and kind of get used to thinking about maybe buying another one which can add value to our bottom line touch screen interface possibly having go to buttons being stuck into the system so those don't move away from the screen.\n\n0:13:38\tSPEAKER_01\n So I think that's one of the things that I think is that you can use the same thing as the other ones like power volume and jump between channels.\n\n0:13:43\tSPEAKER_01\n And of course our voice commands is similar to what I've talked a little bit about already. And the use of recognizable colors in shape state recognition of the features that are around so red per power arrows for different volume ups and downs and channels ups and downs and whatnot.\n\n0:14:04\tSPEAKER_01\n So I love seeing you and adding in some super little jokes with the voice recognition idea like for instance my toasty maker that I got from my bank has jokes when it's ready.\n\n0:14:17\tSPEAKER_01\n Nice. Great and bad is about it.\n\n0:14:21\tSPEAKER_03\n Great wonderful run. Cool.\n\n0:14:24\tSPEAKER_03\n A lot of good ideas, good facts to have.\n\n0:14:35\tSPEAKER_03\n That's what they need is like a little dongle it just sticks up this further so you don't have to stand up every time.\n\n0:14:42\tSPEAKER_03\n Right so good to know all that stuff. Thanks guys.\n\n0:14:48\tSPEAKER_03\n We know we can have to come to some decisions figure we can just go to the line all three of us can have a chat about it.\n\n0:14:57\tSPEAKER_03\n Based on what Nathan presented as far as the various costs and benefits. I think I don't know what do you got to think about the touchscreen at this point.\n\n0:15:13\tSPEAKER_02\n I think it's our most marketable feature just because it's so new and it's something that is showing up in other places.\n\n0:15:20\tSPEAKER_02\n But can we really afford it because it looks like they would be that would be a really main cost source then right.\n\n0:15:30\tSPEAKER_00\n My estimate is that in order to incorporate touchscreen technology is going to cost us upwards of 1750 euro.\n\n0:15:39\tSPEAKER_01\n That's pretty much what it is. That's just an estimate.\n\n0:15:43\tSPEAKER_01\n You guys are always the dampers on these.\n\n0:15:46\tSPEAKER_01\n You're industrial design. I know.\n\n0:15:50\tSPEAKER_02\n And our goal was to be under 1250 or we have to be under 1250.\n\n0:15:54\tSPEAKER_00\n Well I thought there was some flexibility with that.\n\n0:15:57\tSPEAKER_03\n There is it's just it is a question of how much does that mean we're going to have to increase the price to make money.\n\n0:16:05\tSPEAKER_03\n From 1250 if we want to get a 100% profit margin that would mean selling it for 25.\n\n0:16:12\tSPEAKER_03\n If you multiply 1750 by 2 that's 35.\n\n0:16:16\tSPEAKER_01\n So where do you guys come up with these numbers?\n\n0:16:22\tSPEAKER_00\n I just have to talk my head.\n\n0:16:24\tSPEAKER_00\n It is pending for their emails from the board.\n\n0:16:29\tSPEAKER_02\n Well do I think that's what people would pay for.\n\n0:16:36\tSPEAKER_02\n If you're going to pay for an expensive high class remote you're going to expect to do something.\n\n0:16:39\tSPEAKER_00\n That's true. It would be in a class of a gem.\n\n0:16:45\tSPEAKER_03\n And to be fair the percent of the market we're not going for mass sales anyway.\n\n0:16:53\tSPEAKER_03\n We're not talking about selling eight zillion of these things.\n\n0:17:00\tSPEAKER_03\n We just couldn't not for 25 euros.\n\n0:17:03\tSPEAKER_03\n We could probably maybe shrink the profit margin rather than selling for 25, sell them for 30.\n\n0:17:08\tSPEAKER_03\n But that's something we can have finance deal with.\n\n0:17:12\tSPEAKER_03\n I say that we provisionally go with the tax screen.\n\n0:17:16\tSPEAKER_03\n What was your thought of the matter on?\n\n0:17:18\tSPEAKER_01\n I'm thinking that's definitely a good idea and I also think that we could probably come up with some sort of a cheaper means to go about this kind of production might.\n\n0:17:27\tSPEAKER_01\n My team and the on the third floor suggested that.\n\n0:17:31\tSPEAKER_02\n Well we can look into this other manufacturing option.\n\n0:17:34\tSPEAKER_02\n I mean we can get them somewhere else cheaper.\n\n0:17:36\tSPEAKER_00\n That's true.\n\n0:17:37\tSPEAKER_00\n We could initially go with what we have and we can find a shifter.\n\n0:17:42\tSPEAKER_03\n Starting point anyway.\n\n0:17:43\tSPEAKER_03\n We could have a simple touch screen.\n\n0:17:50\tSPEAKER_03\n I guess we can play around with it.\n\n0:17:52\tSPEAKER_03\n Let's say the touchscreen will be our main selling point here.\n\n0:18:01\tSPEAKER_01\n I think we have two main selling points.\n\n0:18:04\tSPEAKER_02\n I think that's what our case and the voice record.\n\n0:18:07\tSPEAKER_02\n This is pretty bells and whistles.\n\n0:18:10\tSPEAKER_03\n The voice rack thing, if we're looking at bottom line, now we're looking at the cost of 17 to get the touchscreen on.\n\n0:18:18\tSPEAKER_03\n I think we might have to drop the voice rack.\n\n0:18:20\tSPEAKER_02\n I think we have to decide between them definitely.\n\n0:18:22\tSPEAKER_01\n To be honest, we have the design in-house.\n\n0:18:26\tSPEAKER_01\n We've come up with this.\n\n0:18:28\tSPEAKER_01\n We're using a perikoppy machine already.\n\n0:18:32\tSPEAKER_01\n I can pass you on that email from my guy down the hall.\n\n0:18:39\tSPEAKER_03\n Sounds good.\n\n0:18:45\tSPEAKER_03\n What do you think about the voice rack?\n\n0:18:48\tSPEAKER_00\n I think if we do both, the production costs are going to go away up.\n\n0:18:54\tSPEAKER_00\n But it does put it into, it becomes the role's rise of remote control basically.\n\n0:19:02\tSPEAKER_01\n We have to reflect back on what our market research said.\n\n0:19:06\tSPEAKER_02\n They said they wanted voice recognition.\n\n0:19:09\tSPEAKER_02\n Maybe they hadn't thought of this little touchscreen option.\n\n0:19:12\tSPEAKER_02\n But definitely we know the market is there for voice recognition.\n\n0:19:15\tSPEAKER_02\n To say we have the technology and we're not going to use it even though we know it'll sell.\n\n0:19:20\tSPEAKER_02\n It's a call I don't think I can give the high-ups.\n\n0:19:23\tSPEAKER_02\n I can't go ahead and say no.\n\n0:19:25\tSPEAKER_02\n We're going to stick to everything we know.\n\n0:19:29\tSPEAKER_01\n Does having both really have our costs?\n\n0:19:33\tSPEAKER_03\n I can't see how it wouldn't.\n\n0:19:36\tSPEAKER_03\n There's the old aphorism.\n\n0:19:38\tSPEAKER_03\n You can have it fast.\n\n0:19:40\tSPEAKER_03\n You can have it cheap.\n\n0:19:42\tSPEAKER_03\n You can have it quality.\n\n0:19:45\tSPEAKER_00\n You can't have all three.\n\n0:19:48\tSPEAKER_00\n You need to deal with each different function.\n\n0:19:51\tSPEAKER_03\n If we're going to pick between one and two.\n\n0:19:58\tSPEAKER_03\n Otherwise, we just become cost prohibitive.\n\n0:20:01\tSPEAKER_03\n But which do we suspect we should hold on to?\n\n0:20:06\tSPEAKER_02\n We already have research backing voice recognition as basically solvent.\n\n0:20:13\tSPEAKER_02\n But I personally would tend to the other direction.\n\n0:20:19\tSPEAKER_02\n But if that's what's going to sell, I think that's what we need to go with.\n\n0:20:22\tSPEAKER_02\n Maybe we can table this touchscreen for our next model.\n\n0:20:28\tSPEAKER_00\n I would have to side with that.\n\n0:20:31\tSPEAKER_00\n The voice recognition is simple.\n\n0:20:33\tSPEAKER_00\n We already have all the technology in the house.\n\n0:20:36\tSPEAKER_00\n It's ready to go.\n\n0:20:37\tSPEAKER_00\n It's packaged.\n\n0:20:38\tSPEAKER_03\n What does the cost look like?\n\n0:20:40\tSPEAKER_03\n Is it cheaper to do the VR to do the touchscreen?\n\n0:20:44\tSPEAKER_00\n Well, it's just off the top of my head.\n\n0:20:49\tSPEAKER_00\n Keep in mind.\n\n0:20:50\tSPEAKER_00\n I think the voice recognition would...\n\n0:20:53\tSPEAKER_00\n They're both going to push the cost up.\n\n0:20:57\tSPEAKER_00\n But since we already have the technology in the house for the voice recognition, we're not going to have to do as much design work.\n\n0:21:06\tSPEAKER_00\n And sometimes design work is what push the cost up.\n\n0:21:09\tSPEAKER_00\n If you know what I mean.\n\n0:21:12\tSPEAKER_01\n I definitely have to agree with that.\n\n0:21:14\tSPEAKER_02\n And then we don't have to deal with this battery issue really as much either.\n\n0:21:17\tSPEAKER_02\n We can stick with what we've already got in a lot of other ways too.\n\n0:21:22\tSPEAKER_03\n So I'm getting more or less of the two of them in the voice recognition will be better.\n\n0:21:28\tSPEAKER_02\n I think it's our lower risk option.\n\n0:21:30\tSPEAKER_02\n We can have it on the market sooner, which is all in all our best option.\n\n0:21:34\tSPEAKER_03\n Okay.\n\n0:21:35\tSPEAKER_03\n Sort it.\n\n0:21:37\tSPEAKER_03\n We will omit the touchscreen in favor of voice recognition.\n\n0:21:42\tSPEAKER_02\n So when are we going to have basic prototypes coming up next?\n\n0:21:47\tSPEAKER_02\n That's you guys next step, right?\n\n0:21:49\tSPEAKER_03\n Well, sort of what else we're going to talk about for the prototype.\n\n0:21:54\tSPEAKER_03\n But yeah, that's our next step.\n\n0:21:55\tSPEAKER_00\n Are we going to talk now about the materials we're going to use for the case?\n\n0:22:00\tSPEAKER_03\n We'll just run through it.\n\n0:22:02\tSPEAKER_03\n Yeah.\n\n0:22:03\tSPEAKER_03\n We've discussed either a lithium or a solar power.\n\n0:22:07\tSPEAKER_03\n Would the solar power be enough to fuel a voice recognition?\n\n0:22:11\tSPEAKER_03\n Or this kinesthetic one?\n\n0:22:12\tSPEAKER_03\n Would that be enough to fuel a voice recognition removal?\n\n0:22:15\tSPEAKER_00\n The solar power definitely would be, but I think just to keep people from getting annoyed because sometimes solar power fails, there's no around that.\n\n0:22:23\tSPEAKER_00\n We should install a small backup battery just to cover those moments when whatever reason that remote has a box of it.\n\n0:22:31\tSPEAKER_00\n Well, it looks like TV in their basement.\n\n0:22:33\tSPEAKER_00\n Like, where?\n\n0:22:34\tSPEAKER_02\n Yeah.\n\n0:22:35\tSPEAKER_02\n We can't guarantee so many of it everywhere.\n\n0:22:36\tSPEAKER_02\n So having a factory source is probably what we're going to do.\n\n0:22:38\tSPEAKER_00\n Yeah, it works about the same as a solar powered calculator.\n\n0:22:41\tSPEAKER_00\n And you know how those, those don't really require that much light.\n\n0:22:44\tSPEAKER_00\n Sure.\n\n0:22:45\tSPEAKER_00\n Obviously, a little more light than a calculator, but we're not talking about a lot of light.\n\n0:22:49\tSPEAKER_00\n It doesn't have to be out taking a sun bath.\n\n0:22:52\tSPEAKER_00\n Right.\n\n0:22:53\tSPEAKER_00\n Right.\n\n0:22:54\tSPEAKER_00\n And everything.\n\n0:22:55\tSPEAKER_03\n Okay.\n\n0:22:56\tSPEAKER_01\n What do you think, Rob?\n\n0:22:57\tSPEAKER_01\n I'm willing to do a review of everything that's been said.\n\n0:22:59\tSPEAKER_01\n Okay.\n\n0:23:00\tSPEAKER_01\n I have to say, though, that another idea has come up in my head.\n\n0:23:04\tSPEAKER_01\n If we're really not handling the remote control to a great extent, you could possibly get away from the idea of having a handheld remote control and maybe kind of have around remote control that kind of looks like a paperweight or something like that.\n\n0:23:20\tSPEAKER_01\n Kind of a sweet little, uh, anything that sits on your table or something.\n\n0:23:25\tSPEAKER_02\n Interesting.\n\n0:23:26\tSPEAKER_02\n Why?\n\n0:23:27\tSPEAKER_01\n Just a thought.\n\n0:23:28\tSPEAKER_00\n Why moving away from handheld?\n\n0:23:30\tSPEAKER_00\n Why?\n\n0:23:31\tSPEAKER_00\n It's the end.\n\n0:23:32\tSPEAKER_01\n Well, if you don't need to pick it up, it could kind of be a selling point.\n\n0:23:35\tSPEAKER_02\n It's got voice recognition.\n\n0:23:36\tSPEAKER_02\n It can be technically anywhere in your room and still do its job.\n\n0:23:40\tSPEAKER_00\n Do you think people that are, people that buy your motor, they always want to use the voice recognition?\n\n0:23:44\tSPEAKER_00\n Is it just something that they do sometimes?\n\n0:23:46\tSPEAKER_02\n True.\n\n0:23:47\tSPEAKER_02\n And probably, I think we're bang on selling it to more than just voice recognition people.\n\n0:23:53\tSPEAKER_02\n Like, we want it to work fundamentally.\n\n0:23:55\tSPEAKER_03\n We have that button on it, too, as well.\n\n0:23:57\tSPEAKER_03\n But that's done.\n\n0:23:58\tSPEAKER_03\n That's no bother.\n\n0:23:59\tSPEAKER_03\n I mean, if you look at the catalog from places like the Sharper Image or whatever, you know, they might have.\n\n0:24:04\tSPEAKER_03\n Or like, um, who is it?\n\n0:24:06\tSPEAKER_03\n Apple makes these really pretentious speakers.\n\n0:24:09\tSPEAKER_03\n What the subwoofers, you know, like clear and glass and, you know, they got the little pyramidal type of speakers.\n\n0:24:15\tSPEAKER_03\n I mean, why not have a little rounded kind of thing?\n\n0:24:18\tSPEAKER_03\n It could still have the basic buttons on it.\n\n0:24:21\tSPEAKER_03\n Because we're going for basic functionality primarily as well.\n\n0:24:24\tSPEAKER_03\n It's about, yeah.\n\n0:24:25\tSPEAKER_03\n And maybe a menu button, so forth, you know, um, use the channel button to scroll through the menu if they want to record programs or whatever, you know, I think you're onto something.\n\n0:24:33\tSPEAKER_00\n Yeah.\n\n0:24:34\tSPEAKER_00\n We need to escape the traditional shape of remote.\n\n0:24:39\tSPEAKER_00\n Maybe something that looks nice on a table is, would be good, even though Anne handheld the same time.\n\n0:24:44\tSPEAKER_01\n I think it's all about following Apple's week.\n\n0:24:47\tSPEAKER_02\n Yeah, I'm thinking of the airport portal, you know, like that little pod-looking thing.\n\n0:24:52\tSPEAKER_02\n Yeah, that's right.\n\n0:24:53\tSPEAKER_03\n Yeah, I mean, I mean, although we do, um, we're calling that she mentioned, we need to get away from the surgical white kind of brush to the building and I'm thinking, get back to it.\n\n0:25:02\tSPEAKER_03\n But you could have a very tasteful, um, wood colored or earth tone kind of, um,\n\n0:25:10\tSPEAKER_02\n Terracotta bowl or something.\n\n0:25:13\tSPEAKER_03\n Still, I mean, yeah, along those lines. Yeah, I like that.\n\n0:25:16\tSPEAKER_03\n I like that idea a lot.\n\n0:25:17\tSPEAKER_03\n Let's see what we can do as far as that goes.\n\n0:25:20\tSPEAKER_03\n Okay.\n\n0:25:21\tSPEAKER_03\n And the, uh, the material, like the plastics and so forth, we were discussing that being, uh, using like a rubber kind of softer feel.\n\n0:25:28\tSPEAKER_03\n Um, you know, I, if you feel a, the tip on this pen is a bit, gives just a bit.\n\n0:25:34\tSPEAKER_03\n Yeah.\n\n0:25:35\tSPEAKER_03\n You know, something where it's a, a more advanced form of plastic that has some kind of a tactile response to it.\n\n0:25:41\tSPEAKER_00\n Right.\n\n0:25:42\tSPEAKER_00\n Just kind of the squishy feel.\n\n0:25:45\tSPEAKER_02\n Yeah.\n\n0:25:46\tSPEAKER_02\n Which is the next big thing.\n\n0:25:48\tSPEAKER_02\n So that's not going to hurt us either.\n\n0:25:50\tSPEAKER_03\n Yeah, let's see if we can do a squishy non-remote control looking remote control.\n\n0:25:56\tSPEAKER_03\n But to be fair, yeah, I mean, you just, you could just put it literally put it on the night, the coffee table next to the telly and say volume up.\n\n0:26:05\tSPEAKER_03\n I like it.\n\n0:26:06\tSPEAKER_03\n I like that.\n\n0:26:07\tSPEAKER_03\n Yeah.\n\n0:26:08\tSPEAKER_03\n That's good.\n\n0:26:09\tSPEAKER_03\n Um, and we've sort of discussed costs.\n\n0:26:11\tSPEAKER_03\n Um, I guess we'll, that's going to be, uh, I think if we run a bit over budget, it might be okay.\n\n0:26:17\tSPEAKER_00\n Sorry about the lack of information costs.\n\n0:26:21\tSPEAKER_00\n I just haven't been provided information by manufacturers.\n\n0:26:24\tSPEAKER_00\n We'll have more ideas.\n\n0:26:27\tSPEAKER_03\n We'll have more of that later on.\n\n0:26:31\tSPEAKER_03\n Yeah, we'll just go from there.\n\n0:26:35\tSPEAKER_03\n So we've revisited the touchscreen and more or less ruled that out.\n\n0:26:39\tSPEAKER_03\n I think so we're more or less can, we were more or less in agreement that we want to have a, um, a simple kind of function, you know, not too complex.\n\n0:26:51\tSPEAKER_02\n Right.\n\n0:26:54\tSPEAKER_02\n Well, when the majority of people are only using the most primary functions on a daily basis, although I'm not saying we should completely rule out major functions, they should be secondary.\n\n0:27:04\tSPEAKER_02\n At least if not functionally, then visually like those shouldn't be right.\n\n0:27:08\tSPEAKER_03\n Maybe we have many things.\n\n0:27:10\tSPEAKER_00\n If, if we're not going to touch screen root, then we can, um, just incorporate maybe something that folds out.\n\n0:27:16\tSPEAKER_00\n Like what you often see on these kinds of remotes is the most basic functions appear.\n\n0:27:21\tSPEAKER_00\n Something that slides down and to reveal, you know, the more complicated things.\n\n0:27:25\tSPEAKER_00\n Yeah.\n\n0:27:26\tSPEAKER_02\n Well, we want to consider like an iPod screen, which isn't a touch screen, but you're still scrolling through menu options.\n\n0:27:33\tSPEAKER_01\n Then we're hitting our cost issue again.\n\n0:27:35\tSPEAKER_03\n And we've also got the thing of, we're going to have a non-remote looking remote.\n\n0:27:40\tSPEAKER_03\n How do we, yeah.\n\n0:27:42\tSPEAKER_03\n You know, I mean, we could do a slide or a compartment, you know, like if it's say it's a little vaguely avoidable type of thing, it'd be easy to have a compartment in there.\n\n0:27:49\tSPEAKER_03\n Or, you know, a series of, you know, three or four buttons with a menu button and then a side and up and down type of thing like on a DVD player.\n\n0:27:58\tSPEAKER_03\n You know, you see the modern DVD players, they'll just have a menu button on the side and then four buttons around them.\n\n0:28:04\tSPEAKER_03\n And you can just kind of maneuver through the menu like that.\n\n0:28:07\tSPEAKER_00\n So are we going, are we talking, we need to figure out what kind of buttons we're going to use, are we going to use scroll buttons, rubber buttons.\n\n0:28:16\tSPEAKER_03\n Well, it seems like, no, no, it seems to me that we could just do the, um, stick with the rubber, because it's probably going to be using some kind of, um, rubber for the outside case, you might as well stick with that.\n\n0:28:30\tSPEAKER_01\n I think to a certain extent we have to stick with, uh, kind of a little bit traditional in terms of the buttons and then, and then make our unique future or chasing and whatnot.\n\n0:28:42\tSPEAKER_01\n And our place can that.\n\n0:28:43\tSPEAKER_02\n Well, those basic just like four directions that are that can use as menu or channel and volume or however you want to do it are really versatile and.\n\n0:28:52\tSPEAKER_02\n Every's already got them to some extent, I'm a most dirty owned so it's not like we're dealing with every re learning things because that's not something anybody's going to want to buy before.\n\n0:29:01\tSPEAKER_03\n Right.\n\n0:29:03\tSPEAKER_03\n Okay.\n\n0:29:05\tSPEAKER_03\n Um, we've already kind of covered this as well.\n\n0:29:11\tSPEAKER_03\n That seems to be selling.\n\n0:29:13\tSPEAKER_03\n Um, and we're more or less agree that we want to target this youth market.\n\n0:29:18\tSPEAKER_03\n Um, especially now with 18 of 35 year olds being so large quantity of the population, particularly in technological fields.\n\n0:29:27\tSPEAKER_02\n So, um, it's exactly what we're headed.\n\n0:29:29\tSPEAKER_03\n Okay.\n\n0:29:31\tSPEAKER_03\n Um, yeah, all right.\n\n0:29:34\tSPEAKER_03\n Well, more or less covered what we need to cover, I think, find, even you find the thoughts before we think about doing the product, moving out of the prototype.\n\n0:29:41\tSPEAKER_01\n Well, what are we actually doing?\n\n0:29:43\tSPEAKER_03\n Right. I was just going to step on to, um, uh, oh, it wasn't in the way, but it wasn't my bad.\n\n0:29:52\tSPEAKER_03\n Sorry.\n\n0:29:54\tSPEAKER_03\n No, no, no.\n\n0:29:56\tSPEAKER_03\n Yeah, okay.\n\n0:29:57\tSPEAKER_03\n I was just going to assign tasks in the next year.\n\n0:30:00\tSPEAKER_03\n Any other final thoughts before we go ahead and cool.\n\n0:30:05\tSPEAKER_00\n How do we decide that we are going to go with different style cases for different people? Or are we just going to go with one?\n\n0:30:17\tSPEAKER_00\n It's very, it's very hard thing to predict because you have different cases and that might open up your market.\n\n0:30:23\tSPEAKER_00\n Well, obviously, but you have just one case and it doesn't go over well.\n\n0:30:28\tSPEAKER_00\n Yeah, it's a situation, but obviously having more cases also costs more.\n\n0:30:32\tSPEAKER_03\n Well, then again, colors wouldn't be so hard to do. You could have a natural wood color like a stained wood.\n\n0:30:41\tSPEAKER_03\n I don't know, olive green or something.\n\n0:30:45\tSPEAKER_03\n That wouldn't be so much of a problem to incorporate into the color of the rubber.\n\n0:30:49\tSPEAKER_01\n And again, copying iMacs kind of for iPod Mac Apple's color scheme.\n\n0:30:55\tSPEAKER_02\n Yeah, totally.\n\n0:30:57\tSPEAKER_03\n Yeah, I think that's probably good. Okay, so let's work on multiple case colors.\n\n0:31:07\tSPEAKER_03\n But yes, it's with the same kind of kind of, yeah, the same basic non-remote kind of remote design.\n\n0:31:15\tSPEAKER_03\n Cool.\n\n0:31:18\tSPEAKER_03\n All right, so we'll have the next meeting about half an hour.\n\n0:31:24\tSPEAKER_03\n I want the, I'd like Nathan, I'd like you to work on just the basic look and feel.\n\n0:31:28\tSPEAKER_03\n What can we accomplish given these parameters that we sort of sorted out this kind of a non-remote remote?\n\n0:31:38\tSPEAKER_03\n What are our broad constraints before we design a prototype?\n\n0:31:42\tSPEAKER_03\n And Ron, if you can figure out how probably best to lay out this idea of the simple design with the voice recognition built in.\n\n0:31:53\tSPEAKER_03\n And also this kind of drop down or on the side kind of menu options simple.\n\n0:32:00\tSPEAKER_03\n Somehow work out how we can get this all in the same place.\n\n0:32:06\tSPEAKER_03\n And if you can check product evaluation with some pilots and stuff, I need you guys to work together making a prototype using prototype building materials.\n\n0:32:20\tSPEAKER_03\n And also specific instructions will be sent to you by your coaches as well.\n\n0:32:24\tSPEAKER_03\n So that's what to start with for now.\n\n0:32:26\tSPEAKER_03\n Is that all right?\n\n0:32:28\tSPEAKER_03\n Yes, that's so good.\n\n0:32:30\tSPEAKER_03\n All right, I guess we'll just hit the bricks.\n\n0:32:32\tSPEAKER_03\n Thanks guys.\n\n0:32:33\tSPEAKER_02\n Thank you.\n\n", "summary": [{"summary_text": "Today's meeting is about the conceptual design of the remote control. Speaker is going to talk to participants about the components of remote control, the case, the battery, the energy source, the buttons and kinetic energy. The meeting will come to some final decisions on what to do for the prototype."}]}