{"filename": "./data/ES2014c.txt", "transcript": "0:00:30\tNone\n Gastron ×\u0094×\u0097iezont exunkneï¿½ Volcanconich == Redron Van Nova\n\n0:00:53\tNone\n funded D.\n\n0:00:56\tSPEAKER_00\n plant de AtÑ\u0089Ñ\u0091 Janeone Allen Eheri watches kinda press check soft pat blrrz...\n\n0:01:16\tNone\n  witnessingseason o cosmos ok m m m m m Ok, so...\n\n0:02:08\tSPEAKER_03\n Right, well, from the last meeting, I was trying to send you the minutes, but it didn't work out too well.\n\n0:02:17\tSPEAKER_03\n So, maybe in sort of a quick summary of the last meeting, I can quickly give you what we had.\n\n0:02:37\tSPEAKER_03\n Right, so...\n\n0:02:44\tSPEAKER_03\n I should have had a close look at that.\n\n0:02:47\tSPEAKER_03\n Right, so we had the fact that we're going to have the level, the company level in its color scheme, cooperated on to the device, that I want device.\n\n0:02:57\tSPEAKER_03\n We had made our decisions about...\n\n0:03:01\tSPEAKER_03\n made our decisions about the device itself that was going to be simple to make it a little less complete project in time.\n\n0:03:14\tSPEAKER_03\n We're going to have effectively two pages, a front page, which had the features that the customers wanted, and then the backup features on the second page, so that it would meet the technical requirements and the customers wouldn't have to look at them too often, only as and when required.\n\n0:03:39\tSPEAKER_03\n So, basically what decisions have we made?\n\n0:03:48\tSPEAKER_03\n Have there been any changes?\n\n0:03:51\tSPEAKER_02\n I think we all have a presentation again, so we'll go ahead and give those.\n\n0:03:55\tSPEAKER_02\n Three presentations, yes.\n\n0:03:57\tSPEAKER_03\n So, to go physical.\n\n0:03:59\tSPEAKER_03\n Yep, fine.\n\n0:04:01\tSPEAKER_02\n I'll see if it's a little more smooth in the last one.\n\n0:04:32\tNone\n Okay, let's go.\n\n0:04:34\tNone\n Basically, before the components design, the way the remote is going to work is the same idea as before.\n\n0:05:03\tSPEAKER_02\n We still have the user interface, which is all the buttons we're going to incorporate.\n\n0:05:11\tSPEAKER_02\n Then there is a chip and still a sender.\n\n0:05:15\tSPEAKER_02\n So, yes, there's just this and that.\n\n0:05:17\tSPEAKER_02\n I think we've been the power supply as well.\n\n0:05:20\tSPEAKER_02\n I'll go into my findings in each of these areas.\n\n0:05:24\tSPEAKER_02\n First in the power supply, we have the option of just the standard battery.\n\n0:05:31\tSPEAKER_02\n There's a dynamo.\n\n0:05:34\tSPEAKER_02\n If you think of the old torches, which you wind up, there's a kinetic option, which is if you've seen those new watches, which you power up by waving around.\n\n0:05:48\tSPEAKER_02\n It just requires a small amount of movement.\n\n0:05:50\tSPEAKER_02\n Which would mean the batteries wouldn't have to be replaced.\n\n0:05:53\tSPEAKER_02\n That's one option, but I was going to cast a little more.\n\n0:05:55\tSPEAKER_02\n Then the solar cells, there's a final option.\n\n0:06:00\tSPEAKER_02\n For the buttons, we have an integrated push button.\n\n0:06:06\tSPEAKER_02\n Just to say all these are supplied by real reaction.\n\n0:06:10\tSPEAKER_02\n So, I guess for the ease of quickness needs, we should take them from at least one of these options.\n\n0:06:17\tSPEAKER_02\n So, for the buttons, there's an integrated push button.\n\n0:06:20\tSPEAKER_02\n I guess it's just the same as the stand ones.\n\n0:06:23\tSPEAKER_02\n It says it's similar to the button and mouse for normal, for like modern computer.\n\n0:06:31\tSPEAKER_02\n There's a scroll wheel, which is, you know, the new mouse, which is called the Santa section, which you can scroll up and down, which may be for the volume.\n\n0:06:40\tSPEAKER_02\n Do that.\n\n0:06:43\tSPEAKER_02\n One issue for the buttons is, depending on which material we use, if we use rubber buttons, then it requires a rubber case.\n\n0:06:50\tSPEAKER_02\n That's where we have to go into consideration.\n\n0:06:53\tSPEAKER_02\n Moving on to the...\n\n0:06:54\tSPEAKER_02\n What would be the cost to do, do we know?\n\n0:06:57\tSPEAKER_02\n That's on the neck.\n\n0:06:59\tSPEAKER_02\n I think there wasn't too much difference in the cost, but the relatively actual buttons, but it does affect the printer's circuit board.\n\n0:07:06\tSPEAKER_02\n Which is an excitation.\n\n0:07:08\tSPEAKER_02\n Basically for the circuit board, which is the middle, let's just see it down there for chips, like the workings of the actual remote.\n\n0:07:17\tSPEAKER_02\n The firm supplies a simple, irregular, and advanced circuit board.\n\n0:07:23\tSPEAKER_02\n And there's different prices according to each.\n\n0:07:25\tSPEAKER_02\n So if we've got a scroll wheel for one of the buttons, that would require us slightly more advanced circuit board, and if we just had a standard push button.\n\n0:07:36\tSPEAKER_02\n One final thing for camera for some information on the speech recognition, there's a small unit available through the company, which obviously would be an extra cost, but it wouldn't affect the size of the remote too much.\n\n0:07:50\tSPEAKER_02\n And I guess that would require more advanced circuit boards.\n\n0:07:53\tSPEAKER_02\n There is an extra price in that sense.\n\n0:07:56\tSPEAKER_02\n There isn't so many extra costs in that sense.\n\n0:07:58\tSPEAKER_02\n I'm going to my personal preferences.\n\n0:08:02\tSPEAKER_02\n I thought it was possible for power we could use kinetic, which is the idea of the watches.\n\n0:08:09\tSPEAKER_02\n You move the remote around to power that.\n\n0:08:12\tSPEAKER_02\n And this would avoid the batches running out, having to replace batches and such.\n\n0:08:18\tSPEAKER_02\n For the buttons, I thought we'd probably get away just having the standard push buttons, rather than the scroll wheel.\n\n0:08:27\tSPEAKER_02\n And for the circuit board, again depends on which features we want in the actual, in your note.\n\n0:08:33\tSPEAKER_02\n So if we wanted the scroll wheel and wanted the voice recognition, then we'd have to get a more costly circuit board.\n\n0:08:41\tSPEAKER_02\n So with the circuit board you were going for the...\n\n0:08:48\tNone\n It kind of depends.\n\n0:08:50\tSPEAKER_03\n If we're going to have a speech recognition, we'd have to probably get an advanced one and guessing.\n\n0:08:55\tSPEAKER_02\n But I don't know, so that was something we'd have to do.\n\n0:08:58\tSPEAKER_02\n But are we going for that?\n\n0:09:00\tSPEAKER_02\n That's the worst decision for us.\n\n0:09:04\tSPEAKER_02\n So we will do that.\n\n0:09:07\tSPEAKER_03\n So we will make that decision now, in a sense, that this is the point at which we're discussing that issue.\n\n0:09:17\tSPEAKER_03\n So we're not be best to...\n\n0:09:20\tSPEAKER_03\n Rather than, I mean, one way is to do each of the presentations and then make decisions going back to the various presentations, as they were, the other way would be to do the presentation and then make the decision at that point in time.\n\n0:09:33\tSPEAKER_00\n You have probably better ones, you're discussing it straight away.\n\n0:09:37\tSPEAKER_03\n Because at that point in, you've got the details up there.\n\n0:09:40\tSPEAKER_03\n So if we wanted to know, for instance, that the scroll wheel required the regular or what required advance, then if we were able to see that down and we could make the decision at that point in time, and then that would be the end of that issue.\n\n0:09:54\tSPEAKER_00\n Does that make sense?\n\n0:09:56\tSPEAKER_00\n I have a lot of information there, so I might not be very clear.\n\n0:10:01\tSPEAKER_00\n Unless you want to forget back in the years.\n\n0:10:04\tSPEAKER_02\n Pretty, yeah.\n\n0:10:18\tSPEAKER_02\n As I say, it only specified that we need more advance, or for the scroll wheel, and the voice recognition came as a piece of information.\n\n0:10:26\tSPEAKER_02\n Now the scroll wheel required the regular, so that...\n\n0:10:32\tSPEAKER_02\n Just a bit of a long way, if I like to, but the scroll requires a minimum likelihood chip, which is in a higher price range.\n\n0:10:40\tSPEAKER_03\n Okay.\n\n0:10:42\tSPEAKER_03\n The display requires an advance chip, the display required an advance chip,\n\n0:10:46\tSPEAKER_02\n which in turn is more expensive.\n\n0:10:53\tSPEAKER_03\n Okay.\n\n0:10:55\tSPEAKER_02\n So we can now do that push-button and just require the simple chip, so that we can get the price down.\n\n0:11:00\tSPEAKER_00\n Yeah, the progress of the click and sexy, I think the scroll wheel is maybe a bit kind of bulky. I've got the pictures, so I've seen the pictures, we have the sticker off the side of it.\n\n0:11:10\tSPEAKER_02\n Right.\n\n0:11:12\tSPEAKER_02\n Okay.\n\n0:11:14\tSPEAKER_03\n So we're going for...\n\n0:11:17\tSPEAKER_03\n Okay.\n\n0:11:19\tSPEAKER_03\n So, transfer word is...\n\n0:11:30\tSPEAKER_01\n So we go for the simple one, or...\n\n0:11:33\tSPEAKER_03\n Yeah, simple push-button.\n\n0:11:35\tSPEAKER_02\n We did everyone get this from the speech recognition.\n\n0:11:38\tSPEAKER_02\n There was basically what we said before, the idea that you were calling a sad message and then it picks up a message and it applies to you.\n\n0:11:47\tSPEAKER_02\n So it is basically the concept we discussed before.\n\n0:11:51\tSPEAKER_02\n But then we don't know for sure whether it would require more complicated circuit, or I guess it would, then I forgot the definite information.\n\n0:11:59\tSPEAKER_02\n Maybe we should go more with this, rather than...\n\n0:12:01\tSPEAKER_03\n So we go for the simple push-button.\n\n0:12:03\tSPEAKER_03\n So effectively we're going for the simple printed circuit board.\n\n0:12:06\tSPEAKER_03\n How are we going for the regular?\n\n0:12:09\tSPEAKER_02\n If it's just a patch button, then it just needs the simple circuit.\n\n0:12:13\tSPEAKER_03\n But is there any other...\n\n0:12:17\tSPEAKER_03\n I mean, okay, that's true for that element.\n\n0:12:21\tSPEAKER_03\n But we have to take all of them into consideration.\n\n0:12:25\tSPEAKER_03\n And so if there is one element that requires more expensive one, or say the regular one, or the more advanced, then that would have to be the same for all of them.\n\n0:12:36\tSPEAKER_01\n So I suppose we need to find out what circuit boards back requires, maybe we should really do this.\n\n0:12:44\tSPEAKER_00\n But we're not allowed to put that.\n\n0:12:46\tSPEAKER_00\n It doesn't seem to send out a signal to the tele, it's like a parent just reply in your message.\n\n0:12:53\tSPEAKER_02\n So maybe that would be something, so I don't think it would affect our circuit.\n\n0:12:56\tSPEAKER_02\n No.\n\n0:12:57\tSPEAKER_02\n Okay, so we have a simple circuit board and that would be an extra, that would be the decision.\n\n0:13:01\tSPEAKER_00\n And I don't think you could really perform any of the more functions with this.\n\n0:13:04\tSPEAKER_00\n Because the example that they've given me is good morning coffee machine, good morning dual.\n\n0:13:08\tSPEAKER_00\n And I'd be useful to see like, where are you in the mood?\n\n0:13:11\tSPEAKER_00\n Here I am.\n\n0:13:12\tSPEAKER_00\n Sure.\n\n0:13:13\tSPEAKER_00\n I think that's maybe as far as that one.\n\n0:13:15\tSPEAKER_00\n Could go.\n\n0:13:16\tSPEAKER_03\n Okay.\n\n0:13:17\tSPEAKER_02\n Yeah, that makes sense.\n\n0:13:18\tSPEAKER_02\n So we stick the simple circuit board and then think the speech recognition is nice, too.\n\n0:13:23\tSPEAKER_00\n Yeah, just as if I'm waiting to find it.\n\n0:13:27\tSPEAKER_03\n Simple circuit board, simple push button.\n\n0:13:33\tSPEAKER_03\n Okay.\n\n0:13:34\tSPEAKER_03\n Can you, you were wanting to go for the kinetic power supply?\n\n0:13:40\tSPEAKER_02\n Yeah, I thought so just for, just for ease of loving to replace the batteries.\n\n0:13:47\tSPEAKER_03\n And how does it get charged up?\n\n0:13:50\tSPEAKER_02\n I think it works on the basis they have some kind of ball bearings inside.\n\n0:13:54\tSPEAKER_02\n There's someone watching this which you kind of, you shape to power that.\n\n0:13:59\tSPEAKER_02\n Somehow the mechanism inside, the power's out for your movement.\n\n0:14:02\tSPEAKER_02\n So you use the metal and then that powers out to ease it.\n\n0:14:06\tSPEAKER_03\n Okay.\n\n0:14:07\tSPEAKER_03\n So the speech recognition was, are we going for a speech recognition?\n\n0:14:11\tSPEAKER_03\n No.\n\n0:14:12\tSPEAKER_03\n Was that required the advanced?\n\n0:14:14\tSPEAKER_00\n I think it would be helpful to find it.\n\n0:14:16\tSPEAKER_00\n I don't think it.\n\n0:14:17\tSPEAKER_00\n Yeah.\n\n0:14:18\tSPEAKER_02\n Which I didn't affect the circuit board, just to find it.\n\n0:14:21\tSPEAKER_02\n Just to the core.\n\n0:14:23\tSPEAKER_03\n I had speech recognition requires an advanced work.\n\n0:14:26\tSPEAKER_02\n Although that's where I thought, but maybe it doesn't know.\n\n0:14:30\tSPEAKER_02\n Oh.\n\n0:14:32\tSPEAKER_02\n Okay.\n\n0:14:33\tSPEAKER_03\n Speech recognition, you reckon then is, is just an efficient thing.\n\n0:14:38\tSPEAKER_03\n It's simple.\n\n0:14:39\tSPEAKER_03\n And so we would want it in as an extra because it doesn't appear to cost too much.\n\n0:14:43\tSPEAKER_03\n And that be.\n\n0:14:45\tSPEAKER_02\n Okay, shall I pass it in here?\n\n0:14:52\tSPEAKER_03\n That wouldn't really cost any more, would it?\n\n0:14:55\tSPEAKER_00\n Just check what it says.\n\n0:15:00\tSPEAKER_00\n Actually, I don't think it really says anything about the cost, but it says it's already in the coffee machines.\n\n0:15:06\tSPEAKER_00\n So I get already.\n\n0:15:09\tSPEAKER_02\n I see me with the cost, thanks for that.\n\n0:15:11\tSPEAKER_02\n Maybe we'll find out how much like this cost.\n\n0:15:14\tSPEAKER_03\n And then after change, change on everything at the last minute.\n\n0:15:21\tSPEAKER_03\n Okay.\n\n0:15:22\tSPEAKER_03\n Okay.\n\n0:15:25\tNone\n Okay.\n\n0:15:28\tNone\n Okay.\n\n0:15:29\tSPEAKER_00\n That was quick.\n\n0:15:32\tSPEAKER_00\n Okay.\n\n0:15:33\tSPEAKER_00\n Sort of.\n\n0:15:34\tSPEAKER_00\n Very brief presentation.\n\n0:15:35\tSPEAKER_00\n So I'm looking at the remodels out there at the minute, and on them are particularly sleek and sexy.\n\n0:15:43\tSPEAKER_00\n I haven't actually got the examples of this raw bottom there.\n\n0:15:47\tSPEAKER_00\n But there's some curve cases that you can see.\n\n0:15:52\tSPEAKER_00\n All in half, quite a lot of buttons there.\n\n0:15:55\tSPEAKER_00\n They seem to just have the number of buttons.\n\n0:15:59\tSPEAKER_01\n Is that more of this?\n\n0:16:01\tSPEAKER_00\n It just seems to be skipping on with that.\n\n0:16:05\tSPEAKER_02\n Yeah, I've found that, and then you just try and get it back.\n\n0:16:08\tSPEAKER_00\n Have you right clicked and then go into a previous one?\n\n0:16:11\tSPEAKER_00\n Oh, sorry.\n\n0:16:12\tSPEAKER_00\n There wasn't much more to say about that.\n\n0:16:14\tSPEAKER_00\n Another remodels I looked at, one of the models that did actually have voice recognition where it was connected to the remote control functions.\n\n0:16:23\tSPEAKER_00\n And it was quite a swish model where it can control forward devices to be able to start a live video, DVD, audio.\n\n0:16:33\tSPEAKER_00\n So that's a bit of competition there.\n\n0:16:36\tSPEAKER_00\n So, I mean, maybe it's better not to try and compete with that sort of thing.\n\n0:16:40\tSPEAKER_00\n And just to mark it, it is a completely different view point.\n\n0:16:45\tSPEAKER_00\n It's the kind of finely lost control of a lot of them trying to compete with the functions.\n\n0:16:51\tSPEAKER_00\n The scroll buttons, as I've already mentioned, there's examples of those, but they don't look as sleek as other models.\n\n0:17:00\tSPEAKER_00\n And there's no real advantage.\n\n0:17:02\tSPEAKER_00\n And because it impacts on other materials in the price, it's not great.\n\n0:17:07\tSPEAKER_03\n So, are you saying the scroll buttons?\n\n0:17:10\tSPEAKER_00\n Yeah.\n\n0:17:11\tSPEAKER_00\n There was a specialist type of remodeling that we could think about.\n\n0:17:16\tSPEAKER_00\n There was children's remodeling, they just had a very limited range of buttons in the world, bright and colorful, and you could program them so that they could only look at certain channels.\n\n0:17:29\tSPEAKER_00\n But I don't know if that's really an uphill.\n\n0:17:32\tSPEAKER_02\n I guess we're going for the biggest market and maybe not.\n\n0:17:37\tSPEAKER_02\n Was it specified that we went for the biggest?\n\n0:17:39\tSPEAKER_03\n Well, we're going for the international market rather than a local market, but that wouldn't necessarily preclude.\n\n0:17:45\tSPEAKER_03\n The one thing that you can often do with products is you can make small modifications.\n\n0:17:51\tSPEAKER_03\n You have your basic model, which you would sell at, whatever.\n\n0:17:55\tSPEAKER_03\n And then you could have additional features in, you know, like a, you know, model one, model two, a model three, and therefore you can subdivide your market up.\n\n0:18:05\tSPEAKER_03\n But that's really more in your fields.\n\n0:18:08\tSPEAKER_02\n It's more like a, a, a next step, maybe, a new for hours.\n\n0:18:12\tSPEAKER_03\n You know, you could add on for an extra package, but on this basic one, I'm reckoning that we're going for the basic model to be discussed here, and that you would have for future reference, the possibility of adding in extra features at extra cost, to take care of specialist market segments.\n\n0:18:32\tSPEAKER_00\n Okay.\n\n0:18:33\tSPEAKER_03\n So, so what are we deciding to do here?\n\n0:18:39\tSPEAKER_00\n I think because there's already a very good voice recognition technology out there, because hours might not cover the same functions that the media fans do.\n\n0:18:48\tSPEAKER_00\n They might have a good idea to market it as a, and find a function.\n\n0:18:53\tSPEAKER_03\n Yeah, find a function rather than as a speech function to find your remote.\n\n0:18:58\tSPEAKER_02\n Yeah.\n\n0:18:59\tSPEAKER_02\n So, okay.\n\n0:19:00\tSPEAKER_02\n So, they're going for the international market.\n\n0:19:02\tSPEAKER_02\n And some, so maybe all the people might not like speech recognition.\n\n0:19:06\tSPEAKER_02\n Oh yeah.\n\n0:19:07\tSPEAKER_00\n So, so, there's some languages, might not be compatible.\n\n0:19:10\tSPEAKER_02\n Yeah, it would make it quite complicated, where, as these keeps, they've had the same problem.\n\n0:19:17\tSPEAKER_00\n Yeah, because I think your program, this one, is a good idea to see whatever you want to your question.\n\n0:19:26\tSPEAKER_01\n Yeah, and as is quite a cheap device, I don't know how much we're going to put into it.\n\n0:19:31\tSPEAKER_03\n So, you'd have a finder feature rather than a voice recognition feature.\n\n0:19:36\tSPEAKER_03\n Yeah.\n\n0:19:37\tSPEAKER_03\n And you're talking about scroll buttons.\n\n0:19:41\tSPEAKER_00\n Yeah, I think we've decided that it's going to increase the cost in the everyday real, and it's going to be increased from the sleepness of it.\n\n0:19:52\tSPEAKER_03\n All right, so we're just going to have the rubber buttons, is that right?\n\n0:19:57\tSPEAKER_00\n And just to be aware that there are kind of specialist functions and specialist remote, but we probably don't want to focus on those, like, such as the digital.\n\n0:20:05\tSPEAKER_03\n Okay, so not to be focused on.\n\n0:20:08\tSPEAKER_00\n Yeah.\n\n0:20:09\tSPEAKER_00\n There was a mention, just as kind of a warning about button design, just to avoid ambiguity.\n\n0:20:19\tSPEAKER_00\n So, I'll give you the example of, say, your volume buttons were up and down, that might both have a V on for volume.\n\n0:20:27\tSPEAKER_00\n Let's think how they did this.\n\n0:20:30\tSPEAKER_03\n Good, in flip it around at 90 degrees, 180 degrees, and never up and down.\n\n0:20:36\tSPEAKER_03\n An upside down V.\n\n0:20:38\tSPEAKER_03\n So, that would show that volume was going up, whereas the one underneath it, see the volume going down.\n\n0:20:44\tSPEAKER_00\n I think the thing was that if you decide to do this, to have triangular buttons, somebody might look at this one and see, all this triangular button is pointing up, and that's the first thing that they see.\n\n0:20:58\tSPEAKER_00\n Right.\n\n0:20:59\tSPEAKER_00\n I will, no, they might see this pointing down.\n\n0:21:04\tSPEAKER_00\n I think, right, that's going to turn the volume down, whereas the actual buttons pointing up, so the function is going to turn the button up.\n\n0:21:13\tSPEAKER_00\n Be careful what you put on the buttons and be careful of the shape that you make them, because it might be kind of too contradictory and kind of shaped.\n\n0:21:22\tSPEAKER_02\n So, maybe we can have some volume written on the side, then up and down on the button design.\n\n0:21:27\tSPEAKER_03\n You could have volume up and volume up, down.\n\n0:21:35\tSPEAKER_03\n And because the idea was to have limited, it was to have sizable about of information on it, and limited number of buttons, because there were 16 buttons, wasn't there?\n\n0:21:48\tSPEAKER_02\n Yeah, that's a big one.\n\n0:21:51\tSPEAKER_00\n And I think that's all I had to see before.\n\n0:21:59\tSPEAKER_00\n So, what was the decision on the design of the volume button?\n\n0:22:07\tSPEAKER_02\n I'm going to go to the design of all the buttons at the moment, or we're going to...\n\n0:22:13\tSPEAKER_01\n I've got some things to say about possible design things.\n\n0:22:16\tNone\n Okay.\n\n0:22:17\tNone\n You're trying to do it too.\n\n0:22:24\tNone\n Right.\n\n0:22:32\tSPEAKER_01\n I've been looking at some trends in sort of this fashion on top of doing the research into the remote control market.\n\n0:22:46\tSPEAKER_01\n The one that's the one I talked about last time that we'd sort of asked people about remote controls, what was good about them, what was bad, what they used.\n\n0:22:57\tSPEAKER_01\n And we've also been looking at sort of fashion, what people are wanting out of, consumer goods at the moment.\n\n0:23:04\tSPEAKER_01\n So, we've had people in Paris and Milan watching via fashion trends.\n\n0:23:09\tSPEAKER_03\n You know where they're yourself.\n\n0:23:12\tSPEAKER_01\n Just to summarize, the most important things that came out of the remote control market investigation, the most important thing was that the things sort of lock and fell fancy rather than dysfunctional.\n\n0:23:23\tSPEAKER_01\n And second, there should be some technological innovation.\n\n0:23:27\tSPEAKER_01\n And then third and less important than the other two, there should be an ease of use as well.\n\n0:23:33\tSPEAKER_01\n And apparently, the fashion trends, other people want sort of clothes and shoes and things with fruit and vegetables.\n\n0:23:46\tSPEAKER_01\n But the field of the material should be spongy, which is country to last year, partly.\n\n0:23:51\tSPEAKER_01\n I'm sure it must have been not spooked last year.\n\n0:23:55\tSPEAKER_01\n So, we need to emphasize the fancy design on our remote control above all else.\n\n0:24:05\tSPEAKER_01\n And then also try and add in technological innovation, which could be our sort of find a thing with a hand clap.\n\n0:24:12\tSPEAKER_01\n And then we need to make it easy to use as a third priority.\n\n0:24:17\tSPEAKER_01\n So, perhaps, few of your buttons and functions as we've discussed.\n\n0:24:23\tSPEAKER_01\n And then maybe find a way to incorporate these trends so that we sort of capture people's imaginations.\n\n0:24:28\tSPEAKER_01\n So maybe we could make the buttons shaped like fruit and veg or the buttons could be spongy somehow.\n\n0:24:37\tSPEAKER_01\n Maybe we could make them out of rubber rather than sort of hard plastic.\n\n0:24:41\tSPEAKER_01\n And then, to even whacky than that, we could maybe have a fruit or vegetable shaped remote, say in the shape of a banana or something like that.\n\n0:24:49\tSPEAKER_01\n Right, so maybe a banana or a courgette or something.\n\n0:24:56\tSPEAKER_01\n How far we actually want to go along and sort of follow the trends?\n\n0:25:03\tSPEAKER_01\n Do you think the trends are particularly important for this type of gadget or do they not matter that much?\n\n0:25:11\tSPEAKER_00\n I think if you start making the buttons fruit shaped, it might make it more complicated to use.\n\n0:25:16\tSPEAKER_03\n Well, you were just talking about, you've got to be careful about how you shape your buttons because you're going to miss direct people.\n\n0:25:22\tSPEAKER_03\n I would have thought the functionality because the people get cheesed off by having to read instructions, etc.\n\n0:25:29\tSPEAKER_00\n So maybe just one button, say the standby button is quite kind of separate from all the other functions.\n\n0:25:36\tSPEAKER_00\n Maybe that could be a little apple.\n\n0:25:38\tSPEAKER_00\n I wouldn't get in the way of like kind of one nine and it wouldn't cook a number.\n\n0:25:42\tSPEAKER_03\n Stand by button.\n\n0:25:43\tSPEAKER_03\n No, that incorporates the trend both at the same time not confusing people.\n\n0:25:48\tSPEAKER_03\n If you're looking for functionality.\n\n0:25:51\tSPEAKER_02\n I guess maybe fruit vegetables, maybe pop in the moment.\n\n0:25:55\tSPEAKER_03\n But what are they going to be next year?\n\n0:25:58\tSPEAKER_03\n But okay, but you can incorporate that.\n\n0:26:03\tSPEAKER_03\n If you change all the buttons, then you've got the problem that this year's fruit and veg next year's I was going to see animals are elephants or whatever.\n\n0:26:13\tSPEAKER_03\n That means you're constantly changing your production schedule and you've got to make different molds and everything else.\n\n0:26:19\tSPEAKER_03\n Not a good idea.\n\n0:26:21\tSPEAKER_01\n I would suggest...\n\n0:26:23\tSPEAKER_01\n What were the timescare we're thinking of selling the product over?\n\n0:26:27\tSPEAKER_02\n The series we're listening to the remote control market is the kind of thing which takes those kinds of passion trends.\n\n0:26:33\tSPEAKER_02\n So it keeps us something which is maybe more universal.\n\n0:26:37\tSPEAKER_00\n As far as it's quite a subtle design.\n\n0:26:40\tSPEAKER_02\n We can make a little design of changes.\n\n0:26:44\tSPEAKER_02\n The spongy feel is...\n\n0:26:49\tSPEAKER_03\n Well, yeah.\n\n0:26:51\tSPEAKER_02\n Maybe saw the rabbit's design in the kid.\n\n0:26:53\tSPEAKER_03\n Was that in the sort of fashion sense?\n\n0:26:56\tSPEAKER_03\n The spongy feel was that sort of fashion it was, wasn't it?\n\n0:27:01\tSPEAKER_00\n So...\n\n0:27:02\tSPEAKER_00\n So you can have a couple of cases as well as buttons.\n\n0:27:07\tSPEAKER_00\n And that you can make them curved or double curved.\n\n0:27:12\tSPEAKER_02\n Oh yeah, one of the things that if you had rubber buttons and you had a rubber case.\n\n0:27:17\tSPEAKER_02\n Oh no, no, sorry.\n\n0:27:19\tSPEAKER_02\n So if you use a rubber double-cute case and you must use rubber buttons.\n\n0:27:23\tSPEAKER_02\n That's the only way.\n\n0:27:25\tSPEAKER_02\n If you have the rubber case and you have to have a rubber button, you need to get rid of it.\n\n0:27:30\tSPEAKER_03\n Rubber buttons require rubber case.\n\n0:27:33\tSPEAKER_00\n Scrolling.\n\n0:27:35\tSPEAKER_00\n Rubber buttons, whether it's spongy feel.\n\n0:27:37\tSPEAKER_03\n Have everything rubber.\n\n0:27:39\tSPEAKER_03\n The main problem is how frequently do the fashion change?\n\n0:27:43\tSPEAKER_03\n Because in essence, in the production, you want things to stay...\n\n0:27:47\tSPEAKER_03\n You want to basically mint them out.\n\n0:27:49\tSPEAKER_03\n Because if you've got fashion changes and that you're incorporating, then it means that your stock is...\n\n0:27:58\tSPEAKER_03\n It lasts your stock and therefore you're selling it or having to sell it at a discounted rate.\n\n0:28:02\tSPEAKER_03\n Which you wouldn't want to do, whereas if you kept the product the same.\n\n0:28:07\tSPEAKER_03\n But you could have a difference from year to year.\n\n0:28:10\tSPEAKER_03\n It seems to me that you could incorporate a fashion statement if you like, rather than changing the whole...\n\n0:28:17\tSPEAKER_03\n You're just changing one aspect, like this down by button or something like that.\n\n0:28:23\tSPEAKER_03\n And especially because then you could make it something that...\n\n0:28:26\tSPEAKER_02\n As soon as you may be unlimited, if I raise last put a logo on the edge.\n\n0:28:30\tSPEAKER_03\n Well, you might be limited in space.\n\n0:28:33\tSPEAKER_03\n Or you two are obviously going to find out fairly quickly when you move over to your kit modelling stage as to how much...\n\n0:28:42\tSPEAKER_03\n How pliable is plasticine?\n\n0:28:45\tSPEAKER_02\n The cases, like changing the fashion, like the Nokia phones, where you could take the case and off the outside.\n\n0:28:53\tSPEAKER_02\n Wherever that would be too much to incorporate in production.\n\n0:28:56\tSPEAKER_02\n Wherever that would just be...\n\n0:28:58\tSPEAKER_02\n That's making it more complicated.\n\n0:29:00\tSPEAKER_03\n So you're talking about changing the casing.\n\n0:29:06\tSPEAKER_02\n Yeah, the actual saw, the look from the outside, so the buttons were stay the same.\n\n0:29:11\tSPEAKER_02\n And the general function of the...\n\n0:29:13\tSPEAKER_02\n The motor stayed the same, but then you could change the way it would.\n\n0:29:16\tSPEAKER_00\n Yeah, and then you could have...\n\n0:29:17\tSPEAKER_00\n Or you still would have to have the logo on every new case.\n\n0:29:21\tSPEAKER_00\n But you could have like pink cases for the old ones.\n\n0:29:24\tSPEAKER_03\n Yeah, you could do a colour change, so that for you...\n\n0:29:27\tSPEAKER_03\n I mean, that's effectively what they did with the mobile phones, was to have some in blue, some in red, some in rather than all in black, which for you want as long as it's black.\n\n0:29:38\tSPEAKER_03\n So...\n\n0:29:41\tSPEAKER_00\n So they're supposed to use the company in classical...\n\n0:29:46\tSPEAKER_03\n Yes, oh, that's true, no, I don't mind.\n\n0:29:49\tSPEAKER_00\n I mean, why don't you both put it in like clash with anything?\n\n0:29:52\tSPEAKER_03\n Well, not necessarily, because you could have your company...\n\n0:29:57\tSPEAKER_03\n Or may be finishing up.\n\n0:29:59\tSPEAKER_03\n You could have your company badge, and I mean, a lot of computers, for instance, like when you've got there, it actually has a sort of stick-on badge.\n\n0:30:09\tSPEAKER_03\n So what you would all...\n\n0:30:10\tSPEAKER_03\n All you would really need, whether the casing be any colour, could be any colour, but that badge would then have to stick out top of it, so that, in a sense, with a logo like that, because it's on a white background, the only colour that it might not stick out some well on, would be a white casing, because you're sort of...\n\n0:30:34\tSPEAKER_03\n You're badging it, and in fact, a lot of companies get somebody else to make them, and literally just badge them themselves with their own badge over the top.\n\n0:30:42\tSPEAKER_03\n And in fact, the way they've got that there, even if you had that on a white, dominant colour of the windows badge, you'd still be able to see it clearly from, you know, a white casing product, so...\n\n0:30:56\tSPEAKER_02\n Where have we got the big and the market, how this can like, second-year market selling their cases?\n\n0:31:01\tSPEAKER_02\n It might be, since, you can see...\n\n0:31:03\tSPEAKER_00\n Well...\n\n0:31:04\tSPEAKER_00\n What if it's for younger people?\n\n0:31:06\tSPEAKER_00\n Like, with born generation.\n\n0:31:08\tSPEAKER_00\n That's what I think would probably go down well.\n\n0:31:10\tSPEAKER_00\n And the market, I say, a child's being on that side of it, isn't it?\n\n0:31:13\tSPEAKER_01\n I mean, if people say that it's the look, or the fancy looking thing around, yeah, I'm not convinced on whether having change would cover this would be something that people buy into.\n\n0:31:24\tSPEAKER_01\n I think with the mobiles, it's a communication device, people see you with it all about,\n\n0:31:30\tSPEAKER_02\n the spurs were a bit of a keep going over it. In the house, isn't it?\n\n0:31:34\tSPEAKER_01\n Yes, of course.\n\n0:31:35\tSPEAKER_00\n Okay, so if we just went for one colour, it looks like...\n\n0:31:39\tSPEAKER_03\n So don't change case.\n\n0:31:41\tSPEAKER_03\n Change case colour, and we're sort of saying no to that.\n\n0:31:47\tSPEAKER_00\n Did we decide on the other case?\n\n0:31:49\tSPEAKER_00\n Did the spongey feel odd?\n\n0:31:50\tSPEAKER_00\n Did we think that that might go as a trend?\n\n0:31:53\tSPEAKER_01\n Well, it was different last year.\n\n0:31:55\tSPEAKER_01\n The trend was different last year, partly.\n\n0:31:57\tSPEAKER_01\n It was not as much a film, but...\n\n0:32:01\tSPEAKER_01\n I don't know whether the trend would change.\n\n0:32:03\tSPEAKER_01\n I don't know whether it's one of those things that...\n\n0:32:06\tSPEAKER_01\n Like sort of having all group shaped keys that probably would go out very quickly.\n\n0:32:12\tSPEAKER_01\n Yeah.\n\n0:32:13\tSPEAKER_01\n Just the fact that it was a rubber case is probably less...\n\n0:32:17\tSPEAKER_01\n Less of a sort of...\n\n0:32:19\tSPEAKER_01\n...sensri-snold.\n\n0:32:21\tSPEAKER_03\n If you're going for a fashion trend like that, then you'd have to have interchangeable cases so that you could...\n\n0:32:29\tSPEAKER_03\n Or because otherwise someone's going to have to buy a complete new, rather than just a case.\n\n0:32:33\tSPEAKER_02\n This seems to make sense to me, which is maybe stick with a standard rubber case as well.\n\n0:32:39\tSPEAKER_02\n Okay.\n\n0:32:40\tSPEAKER_00\n Well, haven't we talked about the curvature of the case?\n\n0:32:43\tSPEAKER_00\n This flat, single-curve, and this double-curve?\n\n0:32:46\tSPEAKER_02\n I'm not exactly sure.\n\n0:32:49\tSPEAKER_02\n Maybe a case gives it like a more aesthetic feel.\n\n0:32:52\tSPEAKER_02\n A double-curve would require...\n\n0:32:54\tSPEAKER_02\n...to perform miracles for the past.\n\n0:32:56\tSPEAKER_02\n But it seems like...\n\n0:32:59\tSPEAKER_03\n When you say, when you say,\n\n0:33:02\tSPEAKER_01\n double-curve, what exactly does that mean?\n\n0:33:04\tSPEAKER_00\n I'm not exactly sure. I'll show you.\n\n0:33:09\tSPEAKER_00\n There's a more set up on.\n\n0:33:12\tSPEAKER_00\n See how...\n\n0:33:14\tSPEAKER_00\n Let's just get up together.\n\n0:33:17\tSPEAKER_00\n See how the one...\n\n0:33:19\tSPEAKER_00\n...I'm not...\n\n0:33:21\tSPEAKER_03\n One thing to consider is that...\n\n0:33:25\tSPEAKER_03\n In some ways you want...\n\n0:33:28\tSPEAKER_03\n By having a fairly standard case, it means they can all fit together on top of each other for storage purposes and shops, and it makes it easier...\n\n0:33:36\tSPEAKER_03\n...if you can store them up on top of each other.\n\n0:33:38\tSPEAKER_03\n Whereas if you do fancy things, you then have to put it in a packaging box.\n\n0:33:44\tSPEAKER_03\n That does that.\n\n0:33:46\tSPEAKER_03\n And the cost of packaging could be quite important...\n\n0:33:50\tSPEAKER_03\n...of either the total cost of the product.\n\n0:33:53\tSPEAKER_02\n So should we just work out what we decided on the after?\n\n0:33:57\tSPEAKER_02\n So...\n\n0:33:59\tSPEAKER_00\n It's not very clear up there, but it's like someone who has kind of bulges...\n\n0:34:04\tSPEAKER_00\n...and sets one on the end.\n\n0:34:06\tSPEAKER_00\n When it's a curvy...\n\n0:34:08\tSPEAKER_00\n I don't know if a double-curve is maybe...\n\n0:34:10\tSPEAKER_00\n...it comes off slightly...\n\n0:34:12\tSPEAKER_01\n That's right, so I don't worry.\n\n0:34:14\tSPEAKER_00\n But it is a kind of sleek look if you've got curves in there.\n\n0:34:18\tSPEAKER_03\n So you want to go for curves, more curves?\n\n0:34:21\tSPEAKER_03\n We're meant to be finishing this meeting in about a minute or so.\n\n0:34:26\tSPEAKER_00\n Yeah, okay, so you should be...\n\n0:34:28\tSPEAKER_00\n You're going for a single curve just to compromise.\n\n0:34:30\tSPEAKER_03\n Okay, curve to a double curve to a single curve.\n\n0:34:33\tSPEAKER_02\n So did we decide on the kinetic power supply?\n\n0:34:36\tSPEAKER_02\n Do you have to go around?\n\n0:34:38\tSPEAKER_02\n Yeah.\n\n0:34:43\tSPEAKER_00\n And the other one is...\n\n0:34:45\tSPEAKER_00\n The other one is...\n\n0:34:51\tSPEAKER_00\n I don't really know much about the classical logo yet,\n\n0:34:55\tSPEAKER_02\n but possibly it's thicker. Yeah, it was like...\n\n0:34:58\tSPEAKER_02\n...we're going to give the simple circuit board just to keep the car stand.\n\n0:35:02\tSPEAKER_02\n I think we can't buy...\n\n0:35:03\tSPEAKER_02\n...by not having anything to come here to keep the car.\n\n0:35:06\tSPEAKER_02\n Yeah, and the voice recognition...\n\n0:35:08\tSPEAKER_00\n...we're going to use that car, we're just to find it.\n\n0:35:11\tSPEAKER_00\n Yeah, yeah.\n\n0:35:12\tSPEAKER_02\n We can always decide against it if something comes up.\n\n0:35:16\tSPEAKER_02\n That's just a bit...\n\n0:35:18\tSPEAKER_01\n...like something to be like.\n\n0:35:21\tSPEAKER_01\n Okay.\n\n0:35:22\tSPEAKER_01\n And then are we going for sort of one button?\n\n0:35:25\tSPEAKER_01\n Yeah, that sounds...\n\n0:35:28\tSPEAKER_00\n...like you wouldn't do too much harm in a couple of years.\n\n0:35:31\tSPEAKER_00\n What sort of shape do you want?\n\n0:35:34\tSPEAKER_03\n So we've got spongy feel buttons as well, have we?\n\n0:35:38\tSPEAKER_03\n Or was that...\n\n0:35:40\tSPEAKER_01\n That's rubber buttons.\n\n0:35:42\tSPEAKER_03\n So it's rubber buttons, so it's not really spongy feel buttons.\n\n0:35:44\tSPEAKER_03\n It's just rubber buttons.\n\n0:35:45\tSPEAKER_03\n Yeah.\n\n0:35:46\tSPEAKER_03\n With the rubber case...\n\n0:35:48\tSPEAKER_03\n...and the standby button is going to be different.\n\n0:35:51\tSPEAKER_01\n Yeah, okay.\n\n0:35:53\tSPEAKER_00\n I think an apple would be a good recognisable shape...\n\n0:35:56\tSPEAKER_00\n...if you start getting all busy.\n\n0:36:00\tSPEAKER_03\n Okay, so what shape are we making the standby button?\n\n0:36:03\tSPEAKER_03\n Apple.\n\n0:36:04\tSPEAKER_00\n Apple.\n\n0:36:05\tSPEAKER_00\n Sorry?\n\n0:36:06\tSPEAKER_00\n Should we vote on it?\n\n0:36:07\tSPEAKER_00\n We'll go for it.\n\n0:36:08\tSPEAKER_01\n We'll go for it.\n\n0:36:10\tSPEAKER_01\n It's quite big one as well.\n\n0:36:12\tSPEAKER_01\n Big apple.\n\n0:36:14\tSPEAKER_01\n What could be red?\n\n0:36:16\tSPEAKER_01\n Could be red apple.\n\n0:36:18\tSPEAKER_01\n Yeah.\n\n0:36:19\tSPEAKER_01\n I don't know why.\n\n0:36:20\tSPEAKER_00\n A red apple?\n\n0:36:21\tSPEAKER_00\n Yeah, because we want to incorporate a bit of colour if we can.\n\n0:36:25\tSPEAKER_00\n Once we find out.\n\n0:36:26\tSPEAKER_02\n Okay, and then we're going to...\n\n0:36:27\tSPEAKER_02\n You're going to work on keeping the buttons like that simple.\n\n0:36:30\tSPEAKER_02\n Just like the...\n\n0:36:32\tSPEAKER_02\n Just working out what we're going to do for the next time.\n\n0:36:37\tSPEAKER_00\n Yeah.\n\n0:36:39\tSPEAKER_00\n Yeah, that seems pretty straightforward.\n\n0:36:41\tSPEAKER_00\n Yeah.\n\n0:36:42\tSPEAKER_00\n Because more so we'll just be kind of...\n\n0:36:44\tSPEAKER_00\n...mimly circular or a very clean.\n\n0:36:47\tSPEAKER_03\n Okay.\n\n0:36:52\tSPEAKER_03\n So what was that last thing you got in there?\n\n0:36:55\tSPEAKER_00\n Just to keep the shape of the buttons simple.\n\n0:36:58\tSPEAKER_03\n Right, do I have...\n\n0:37:00\tSPEAKER_03\n...much option on that.\n\n0:37:01\tSPEAKER_03\n I thought you were going for a single curve and...\n\n0:37:03\tSPEAKER_00\n...I was just the...\n\n0:37:05\tSPEAKER_00\n...shaped of the buttons.\n\n0:37:07\tSPEAKER_03\n Alright.\n\n0:37:08\tSPEAKER_02\n And so yeah, just keeping the...\n\n0:37:10\tSPEAKER_02\n...sort of the labelling and labeling of them pervious and what's wrong?\n\n0:37:13\tSPEAKER_02\n Yeah.\n\n0:37:14\tSPEAKER_02\n Having sort of something.\n\n0:37:16\tSPEAKER_03\n Alright, so the shape of the buttons...\n\n0:37:18\tSPEAKER_03\n...simple.\n\n0:37:28\tSPEAKER_03\n Okay, so...\n\n0:37:30\tSPEAKER_03\n That's that, I guess.\n\n0:37:32\tSPEAKER_03\n You know, go away and get these things sorted out.\n\n0:37:35\tSPEAKER_03\n I guess you two are on plasticine duty or whatever.\n\n0:37:39\tSPEAKER_03\n Okay, so...\n\n0:37:46\tSPEAKER_02\n...then...\n\n0:37:47\tSPEAKER_02\n...looks like it.\n\n0:37:49\tNone\n Okay.\n\n0:37:52\tSPEAKER_03\n Okay.\n\n", "summary": [{"summary_text": "At the last meeting, Speaker was trying to send the minutes of the meeting, but it didn't work out too well. Speaker will give a presentation again. The way the remote is going to work is the same idea as before. There's a dynamo, solar cells, a push button, a chip and still a sender. The power supply is the standard battery. "}]}