{"filename": "./data/ES2008a.txt", "transcript": "0:00:30\tSPEAKER_01\n Okay, good morning everybody.\n\n0:00:33\tSPEAKER_01\n I'm glad you could all come.\n\n0:00:35\tSPEAKER_01\n I'm really excited to start this team.\n\n0:00:37\tSPEAKER_01\n I'm just going to have a little PowerPoint presentation for us for kick off meeting.\n\n0:00:42\tSPEAKER_01\n My name is Rose Lundgren, I'll be the project manager.\n\n0:00:46\tSPEAKER_01\n Our agenda today is we're going to do a little opening and then I'm going to talk a little bit about the project.\n\n0:00:50\tSPEAKER_01\n Then we'll move into acquaintance, just getting to know each other a little bit, including a tool training exercise.\n\n0:00:56\tSPEAKER_01\n I know we'll move into the project plan, do a little discussion and close since we only have 25 minutes.\n\n0:01:04\tSPEAKER_01\n First of all, our project aim, we are creating a new remote control which we have three goals about.\n\n0:01:10\tSPEAKER_01\n It needs to be original, trendy and user friendly.\n\n0:01:12\tSPEAKER_01\n I'm hoping that we can all work together to achieve all three of those.\n\n0:01:18\tSPEAKER_01\n So we're going to divide this up into three parts.\n\n0:01:22\tSPEAKER_01\n The functional design, which will first do individual work, come into a meeting, the conceptual design, individual work in a meeting, and then the detailed design, individual work and a meeting.\n\n0:01:34\tSPEAKER_01\n They will each be doing our own ideas when coming together and collaborating.\n\n0:01:40\tSPEAKER_01\n Okay, we're going to get to know each other a little bit.\n\n0:01:45\tSPEAKER_01\n What we're going to do is start off with a MENA, Alima, sorry, Alima.\n\n0:01:53\tSPEAKER_01\n We're going to do a little tool training.\n\n0:01:55\tSPEAKER_01\n We're going to work with that white board behind you.\n\n0:01:58\tSPEAKER_01\n Introduce yourself, say one thing about yourself and then draw your favorite animal and tell us about it.\n\n0:02:03\tSPEAKER_02\n Okay.\n\n0:02:04\tSPEAKER_02\n I don't know which one of those I have to bring with me.\n\n0:02:09\tSPEAKER_01\n Probably both.\n\n0:02:11\tSPEAKER_02\n Right, so I'm supposed to draw my favorite animal.\n\n0:02:15\tSPEAKER_02\n I have no drawing skills whatsoever, but let's see, introduce myself.\n\n0:02:20\tSPEAKER_02\n My name is Alima, which is in Tini.\n\n0:02:23\tSPEAKER_02\n I'm from the state of Maine in the US.\n\n0:02:26\tSPEAKER_02\n I'm doing Nationalism Studies.\n\n0:02:28\tSPEAKER_02\n Blah, blah, blah.\n\n0:02:29\tSPEAKER_02\n I'm a have no artistic talent.\n\n0:02:32\tSPEAKER_01\n How do you spell your name?\n\n0:02:33\tSPEAKER_02\n A-L-I-M-A.\n\n0:02:34\tSPEAKER_02\n Thanks.\n\n0:02:35\tSPEAKER_02\n Oh, and I guess I'm the industrial designer on this project.\n\n0:02:40\tSPEAKER_02\n Let's see if I can get here.\n\n0:02:44\tSPEAKER_02\n I will draw a little turtle for you all.\n\n0:02:49\tSPEAKER_02\n It's not necessarily because it's my absolute favorite animal, but just that I think there's a lot of animals.\n\n0:03:15\tSPEAKER_02\n So what are your favorite characteristics?\n\n0:03:18\tSPEAKER_02\n I like the whole heaven of shell thing.\n\n0:03:21\tSPEAKER_02\n It's quite cool.\n\n0:03:22\tSPEAKER_02\n Carry your home around where you go.\n\n0:03:25\tSPEAKER_02\n They're decorative little animals.\n\n0:03:27\tSPEAKER_02\n They can swim.\n\n0:03:28\tSPEAKER_02\n They're very adaptable.\n\n0:03:29\tSPEAKER_02\n They carry everything they need with them.\n\n0:03:34\tSPEAKER_02\n And they're easy to draw.\n\n0:03:36\tSPEAKER_01\n Excellent.\n\n0:03:37\tSPEAKER_01\n So we just go around the table.\n\n0:03:39\tSPEAKER_00\n I go for my name's Ian.\n\n0:03:43\tSPEAKER_00\n I'm not a user in space.\n\n0:03:46\tSPEAKER_00\n I'm not a product.\n\n0:03:50\tSPEAKER_00\n I'm trying to hold my phone up.\n\n0:03:55\tSPEAKER_00\n I should leave that one out.\n\n0:04:02\tSPEAKER_01\n No, you can erase the turtle itself.\n\n0:04:05\tSPEAKER_00\n It might be nice to have them all up there at the same time.\n\n0:04:09\tNone\n I'm not going to draw it quite this time.\n\n0:04:14\tSPEAKER_00\n It's not at least an identity part of our home.\n\n0:04:36\tSPEAKER_03\n It's a whale.\n\n0:04:38\tSPEAKER_03\n It's a whale.\n\n0:04:39\tSPEAKER_00\n Oh my god.\n\n0:04:40\tSPEAKER_00\n That's not an ordinary whale.\n\n0:04:41\tSPEAKER_00\n That's not an ordinary whale.\n\n0:04:44\tSPEAKER_00\n The reason I like my house is because what's more than quite intelligent.\n\n0:04:50\tSPEAKER_00\n And that kind of mistakes.\n\n0:04:53\tSPEAKER_00\n We don't really know much about them.\n\n0:04:56\tSPEAKER_00\n We don't understand how they work.\n\n0:04:58\tSPEAKER_00\n And they're going to be just like, it's my name.\n\n0:05:01\tSPEAKER_03\n That's my name.\n\n0:05:08\tSPEAKER_03\n I'm Jeffy.\n\n0:05:12\tSPEAKER_03\n I'm from around DC, I just thought of in the US.\n\n0:05:19\tSPEAKER_03\n And we're going to keep the deep sea theme going on.\n\n0:05:23\tSPEAKER_03\n Are they animals?\n\n0:05:28\tSPEAKER_03\n Don't really know how to draw this.\n\n0:05:31\tSPEAKER_03\n I don't know.\n\n0:05:40\tSPEAKER_03\n I think I do the water.\n\n0:05:42\tSPEAKER_03\n Help.\n\n0:05:43\tSPEAKER_03\n Sort of give an idea.\n\n0:05:46\tSPEAKER_03\n I have no idea how one would explain this.\n\n0:05:50\tSPEAKER_03\n I'm going to make some whiskers.\n\n0:05:53\tSPEAKER_03\n Basically it's supposed to be a seal.\n\n0:05:56\tSPEAKER_03\n You can imagine it in the water.\n\n0:05:58\tSPEAKER_03\n I like them because they're like playful and silly.\n\n0:06:02\tSPEAKER_03\n Sort of have a good time.\n\n0:06:05\tSPEAKER_03\n I'm not going to try them for time.\n\n0:06:07\tSPEAKER_03\n It can get me better than that.\n\n0:06:09\tSPEAKER_03\n Okay.\n\n0:06:15\tSPEAKER_01\n Okay, I'm Rose and I'm project manager from California.\n\n0:06:21\tSPEAKER_01\n I'm going to make some whiskers.\n\n0:06:31\tSPEAKER_02\n I'm going to make some whiskers.\n\n0:06:39\tSPEAKER_03\n I'm going to make some whiskers.\n\n0:06:51\tSPEAKER_03\n It's definitely going to be harder once you're doing it.\n\n0:06:55\tSPEAKER_01\n It's actually a coyote.\n\n0:06:58\tSPEAKER_01\n Give it a little bit of a snout.\n\n0:07:02\tSPEAKER_01\n I don't know.\n\n0:07:03\tSPEAKER_02\n That's pretty impressive.\n\n0:07:07\tSPEAKER_01\n I live across the street from an open space in California.\n\n0:07:13\tSPEAKER_01\n We have coyotes all the time.\n\n0:07:16\tSPEAKER_01\n I really enjoy their singing and their beautiful animals.\n\n0:07:22\tSPEAKER_01\n Moving on to more serious stuff.\n\n0:07:30\tSPEAKER_01\n We're going to talk about project finances.\n\n0:07:33\tSPEAKER_01\n We're going to talk about the numbers in the world.\n\n0:07:37\tSPEAKER_01\n I'm going to talk about the number of meaningful...\n\n0:07:40\tSPEAKER_01\n We'd like to sell it for about 25 euros with a profit aim of 50 million euros for all our sales.\n\n0:07:49\tSPEAKER_01\n Because this is for television, we have a market range of internet.\n\n0:07:53\tSPEAKER_01\n In international market range, we don't have to worry about specifics.\n\n0:07:58\tSPEAKER_01\n In order to make a profit of this magnitude, So we're selling it for twice what we'd like to produce it for.\n\n0:08:09\tSPEAKER_01\n Okay.\n\n0:08:13\tSPEAKER_01\n Just to generate a little bit of discussion about the project, I'd like to hear about your experiences using remote controls, your first ideas about creating a new remote control, what would be the best that you, what are the features that you really like, what are the features that you don't like, etc.\n\n0:08:33\tSPEAKER_03\n I hate when there's like four different buttons and you have to press to actually turn on the TV like you have to do one for the power of the TV and then like another one to get the actual screen on and something else to get it all going.\n\n0:08:45\tSPEAKER_03\n I don't know.\n\n0:08:46\tSPEAKER_03\n Now they keep combining all different remote's together and I don't know if I necessarily like that because I feel like you end up like multi-media overload.\n\n0:08:55\tSPEAKER_03\n I just want to watch the TV here.\n\n0:09:01\tSPEAKER_03\n Always gets paused.\n\n0:09:02\tSPEAKER_03\n I'm sort of like devised to help you find it.\n\n0:09:10\tSPEAKER_00\n I do.\n\n0:09:12\tSPEAKER_00\n I do like because it's a TV and a CD player and it's a computer.\n\n0:09:19\tSPEAKER_00\n I guess that we're going to get up and move across the TV.\n\n0:09:26\tSPEAKER_00\n Especially if you're someone really lazy like me.\n\n0:09:31\tSPEAKER_00\n I find that they can be annoying especially my modules TV.\n\n0:09:37\tSPEAKER_00\n I have a tablet that's a computer, I have a one-pilety TV, one-pilety TV box, one-pilety TV, and it's a lot of fun.\n\n0:09:47\tSPEAKER_00\n I also like that.\n\n0:09:49\tSPEAKER_00\n I think that we've been using that for too many buttons on them.\n\n0:09:54\tSPEAKER_00\n It's just complicated.\n\n0:09:56\tSPEAKER_00\n It's all I really want to do is switch on and off.\n\n0:09:59\tSPEAKER_00\n Change the channel, change the volume.\n\n0:10:03\tSPEAKER_02\n Yeah.\n\n0:10:05\tSPEAKER_02\n I agree with having too many remote's around.\n\n0:10:08\tSPEAKER_02\n My dad has a whole drawer at home of remote's for various things so I don't know how to work half of them.\n\n0:10:17\tSPEAKER_02\n What's important for me, I guess, is that it's easy to use and that there's not too many buttons.\n\n0:10:24\tSPEAKER_02\n They're not too small.\n\n0:10:26\tSPEAKER_02\n I need to know what you're doing.\n\n0:10:30\tSPEAKER_02\n One thing I particularly like is if you're not moving it around to get it to work with the infrared, yeah.\n\n0:10:38\tSPEAKER_02\n I think there's a way around that.\n\n0:10:40\tSPEAKER_02\n But I know in my residence right now that the television you have to walk all around the room to turn on.\n\n0:10:47\tSPEAKER_02\n It's just simpler to turn around the TV itself.\n\n0:10:51\tSPEAKER_02\n If you're going to make a remote control, it should actually work for what it's doing.\n\n0:10:57\tSPEAKER_03\n There's about batteries and things like that.\n\n0:10:59\tSPEAKER_03\n Are there some remote that don't require batteries or do well or remote require batteries?\n\n0:11:06\tSPEAKER_01\n I would imagine all of them, but it's also we could use a lithium battery.\n\n0:11:12\tSPEAKER_01\n That would last a lot longer than AA's.\n\n0:11:15\tSPEAKER_01\n Those are the batteries that are used in a lot of MP3 players now.\n\n0:11:19\tSPEAKER_01\n That kind of thing.\n\n0:11:27\tSPEAKER_01\n It seems we have a little bit of a conflict over combining all the remote's together versus having five different remote's.\n\n0:11:37\tSPEAKER_01\n You said you don't like having all the buttons on one remote and yet you don't want to have five remote's.\n\n0:11:45\tSPEAKER_01\n How do we work with that?\n\n0:11:47\tSPEAKER_02\n Could we get something that just has...\n\n0:11:51\tSPEAKER_02\n doesn't have all the buttons that you need to program the video recorder or programs, other things that I'm not very coherent about.\n\n0:12:00\tSPEAKER_02\n But that just has your major buttons for that work for everything.\n\n0:12:05\tSPEAKER_02\n Volume control on, off, channel changing.\n\n0:12:10\tSPEAKER_03\n Maybe that spatially divides it.\n\n0:12:12\tSPEAKER_03\n If you're trying to get the TV on, that's the top thing on the remote.\n\n0:12:16\tSPEAKER_03\n I don't know if it would be vertical or horizontal in terms of how we're going to make it.\n\n0:12:20\tSPEAKER_03\n But if it's all the TV stuff is here, then all the DCR stuff is here, whatever else you have programmed into it.\n\n0:12:26\tSPEAKER_03\n It's all just in a separate place and not all the on buttons together.\n\n0:12:29\tSPEAKER_03\n Because then you're like, I don't even know what I'm turning on.\n\n0:12:31\tSPEAKER_02\n If you'd save the more complicated functions, maybe for separate remotes, that you wouldn't need to use every day.\n\n0:12:40\tSPEAKER_01\n Okay, so maybe you have one remote that has the main functions on, off, channel changing volume, and another remote remote with all the special things.\n\n0:12:48\tSPEAKER_01\n Because that is one thing that, remotes tend to have buttons that the TVs no longer have as well.\n\n0:12:54\tSPEAKER_01\n So you have to have them somewhere, because you're going to need those special functions occasionally.\n\n0:12:59\tSPEAKER_01\n But not necessarily on the normal mode.\n\n0:13:03\tSPEAKER_00\n Can I ask a read?\n\n0:13:05\tSPEAKER_00\n Is there any remote control for television?\n\n0:13:08\tSPEAKER_00\n Good question.\n\n0:13:10\tSPEAKER_00\n The first device is just to be used for the television.\n\n0:13:14\tSPEAKER_00\n Would we even technically be possible to get more defined from the...\n\n0:13:20\tSPEAKER_01\n I don't know that yet.\n\n0:13:22\tSPEAKER_00\n Is it just the...\n\n0:13:29\tSPEAKER_01\n It's a good question.\n\n0:13:33\tSPEAKER_03\n I'll look into it.\n\n0:13:35\tSPEAKER_03\n I think it's just TV.\n\n0:13:37\tSPEAKER_03\n I mean, if we're taking it, just write it sad.\n\n0:13:41\tSPEAKER_03\n New product, a new television remote control.\n\n0:13:44\tSPEAKER_03\n It's not like...\n\n0:13:45\tSPEAKER_03\n You know, I think it might be more advanced than that.\n\n0:13:50\tSPEAKER_03\n So we should...\n\n0:13:53\tSPEAKER_00\n No, there should be something...\n\n0:13:55\tSPEAKER_00\n It's just the television that they want to be.\n\n0:13:58\tSPEAKER_00\n But I suppose it would be nice to have...\n\n0:14:01\tSPEAKER_00\n...right in the corner and stuff like that.\n\n0:14:03\tSPEAKER_00\n And if you could get a good remote, I don't know, I'm like...\n\n0:14:07\tSPEAKER_00\n...telling about the camera.\n\n0:14:09\tSPEAKER_02\n So I guess we have to define what we're aiming for.\n\n0:14:13\tSPEAKER_02\n If it's just a television, then that...\n\n0:14:15\tSPEAKER_02\n...subbit simpler, because there's less buttons that would even need to be on it.\n\n0:14:19\tSPEAKER_02\n Yeah.\n\n0:14:21\tSPEAKER_03\n It's an idea that the buttons being available and large.\n\n0:14:24\tSPEAKER_02\n Yeah.\n\n0:14:25\tSPEAKER_02\n If you have older people or people like me that aren't very coordinated, hand-eye, it's really quite important that you're not pressing a small...\n\n0:14:31\tSPEAKER_02\n...continue mobile phone size buttons.\n\n0:14:34\tSPEAKER_02\n If we can help it.\n\n0:14:38\tSPEAKER_01\n Okay.\n\n0:14:39\tSPEAKER_01\n Sounds like we've had a good little discussion for our first ideas.\n\n0:14:42\tSPEAKER_01\n Might if we move on.\n\n0:14:44\tSPEAKER_01\n Okay.\n\n0:14:47\tSPEAKER_01\n Now our next meeting starts in 30 minutes.\n\n0:14:51\tSPEAKER_01\n I believe we've actually been only working on this one for about 20.\n\n0:14:55\tSPEAKER_01\n So we can continue discussing more new ideas if you'd like.\n\n0:14:59\tSPEAKER_01\n But this is just a breakdown of what we'll be doing individually.\n\n0:15:03\tSPEAKER_01\n The Industrial Design, Alima.\n\n0:15:05\tSPEAKER_01\n We'll be doing the working design.\n\n0:15:10\tSPEAKER_01\n Use your interface designer, that's for you.\n\n0:15:12\tSPEAKER_01\n So technical functions, I guess, like keeping in mind the buttons, the size of the buttons.\n\n0:15:17\tSPEAKER_01\n Use your requirements.\n\n0:15:20\tSPEAKER_01\n So you'll be hearing about different trends, about different things that people need.\n\n0:15:25\tSPEAKER_01\n I guess kind of the same discussion that we've been having.\n\n0:15:28\tSPEAKER_01\n We'll get from actual consumers.\n\n0:15:32\tSPEAKER_01\n Okay.\n\n0:15:35\tSPEAKER_01\n And you will get specific instructions sent by your personal coach.\n\n0:15:38\tSPEAKER_01\n I realized in this past when we didn't have much, we just wanted to get a little brainstorming done.\n\n0:15:44\tSPEAKER_01\n So, very excited to see all your animals and how wonderful artists we all are.\n\n0:15:53\tSPEAKER_01\n Any questions?\n\n0:16:02\tSPEAKER_00\n I haven't gotten an agenda yet.\n\n0:16:16\tSPEAKER_01\n I'll put that together.\n\n0:16:18\tSPEAKER_01\n I'm sure as we'll each get our own instructions.\n\n0:16:21\tSPEAKER_01\n Because what we're going to do is first our individual actions, and then we'll come back together.\n\n0:16:28\tSPEAKER_01\n Sure, we'll all have more concrete things to contribute next time.\n\n0:16:31\tSPEAKER_02\n I'm sure we'll be busy.\n\n0:16:36\tSPEAKER_01\n Okay.\n\n0:16:37\tSPEAKER_01\n I'll type up the minutes and probably email those out to all of you, including all the things that we talked about.\n\n0:16:48\tSPEAKER_01\n Yes, I think I can.\n\n0:16:51\tSPEAKER_01\n I'll just attach it to you.\n\n0:16:53\tSPEAKER_01\n And your number two, I'm two, three, four, is that correct?\n\n0:16:58\tSPEAKER_01\n All right.\n\n0:17:01\tSPEAKER_01\n It's lovely meeting you all.\n\n0:17:12\tSPEAKER_01\n Just make sure to keep checking the company website and the emails.\n\n0:17:19\tSPEAKER_01\n And then we'll see if I can do that right now.\n\n", "summary": [{"summary_text": "Rose Lundgren will be the project manager for the new remote control project. Speaker's name is Rose Lundgren, she's from the state of Maine in the US and she's doing Nationalism Studies. The project is divided into three parts: functional design, functional design and individual work, and detailed design, individual work and a meeting. Speakers are going to do a tool training exercise."}]}