{"filename": "./data/ES2011b.txt", "transcript": "0:00:30\tSPEAKER_00\n Okay, so we'll try to zip through this since we're short on time.\n\n0:00:36\tSPEAKER_00\n Welcome everybody.\n\n0:00:38\tSPEAKER_00\n Hope your sessions went well.\n\n0:00:43\tSPEAKER_00\n So this is our functional design meeting.\n\n0:00:45\tSPEAKER_00\n We're going to consider user needs, technical effects, and the working design of our remote control.\n\n0:00:56\tSPEAKER_00\n I've been taking meetings on the minutes and the meetings, and I'll be putting them in the shared documents folder so if there's anything you need to refer to, you can find them in there.\n\n0:01:07\tSPEAKER_00\n I'll get the ones up next time.\n\n0:01:10\tSPEAKER_00\n They're not finished yet.\n\n0:01:13\tSPEAKER_00\n Right, so can we have updates from everyone from what you've worked on, just kind of a quick summary of anything interesting that you'd like to share or discuss in the past?\n\n0:01:25\tSPEAKER_02\n Sure.\n\n0:01:26\tSPEAKER_02\n Is that an order?\n\n0:01:27\tSPEAKER_02\n No, I'm just sorry, I don't know the order.\n\n0:01:30\tSPEAKER_00\n No, any orders, then.\n\n0:01:32\tSPEAKER_02\n Okay.\n\n0:01:33\tSPEAKER_02\n How do I put this?\n\n0:01:34\tSPEAKER_02\n I'll just put the cable in.\n\n0:01:37\tSPEAKER_00\n Oh, yes, I...\n\n0:01:38\tSPEAKER_00\n Is that it?\n\n0:01:39\tNone\n Can you see?\n\n0:01:40\tSPEAKER_00\n Okay.\n\n0:01:41\tSPEAKER_01\n So what happens?\n\n0:01:42\tNone\n I don't want it.\n\n0:01:43\tSPEAKER_02\n It takes a few seconds, I think.\n\n0:01:58\tSPEAKER_03\n Do you need two?\n\n0:02:14\tSPEAKER_02\n Who's that?\n\n0:02:16\tSPEAKER_01\n In the world, sometimes you have to do it.\n\n0:02:16\tSPEAKER_01\n It's like a three-setting cycle.\n\n0:02:18\tSPEAKER_01\n So I've press it a couple times.\n\n0:02:20\tSPEAKER_01\n Hold down function, and then I'll set it.\n\n0:02:25\tSPEAKER_02\n Oh, right.\n\n0:02:28\tSPEAKER_00\n and then press function and F8.\n\n0:02:33\tSPEAKER_03\n Could you just plug it back into hers?\n\n0:02:38\tSPEAKER_02\n Oh, that's it.\n\n0:02:40\tSPEAKER_02\n Interesting.\n\n0:02:41\tNone\n Yeah.\n\n0:02:42\tSPEAKER_01\n Okay, one might be a little loose, but here we are.\n\n0:02:48\tSPEAKER_01\n Yeah, sit down.\n\n0:02:49\tSPEAKER_01\n Okay.\n\n0:02:50\tSPEAKER_02\n Okay.\n\n0:02:51\tSPEAKER_02\n In order to see what the functional requirements were to be found, um, 100 people were testing usability, laboratory through just their habits and their habits were observed and question as were given out.\n\n0:03:11\tSPEAKER_02\n The findings in some cases matched what we were talking about.\n\n0:03:17\tSPEAKER_02\n Customers and users don't like the way remote controls look.\n\n0:03:22\tSPEAKER_02\n They don't like the way they feel.\n\n0:03:24\tSPEAKER_02\n They don't think they match their operating behavior and an example is what we were talking about the buttons.\n\n0:03:30\tSPEAKER_02\n They only use 10% of the buttons.\n\n0:03:33\tSPEAKER_02\n So later on, there's a study of the buttons that they use most and I think we should design according to these buttons.\n\n0:03:39\tSPEAKER_02\n Easy to lose and RS.\n\n0:03:41\tSPEAKER_02\n I don't know what RS I means.\n\n0:03:44\tSPEAKER_02\n The person that did the questionnaire obviously did.\n\n0:03:47\tSPEAKER_02\n I don't know.\n\n0:03:48\tSPEAKER_02\n I'll include.\n\n0:03:50\tSPEAKER_02\n According to the frequency of use and the relevance of each button, I have made a list of the buttons that we should focus on in order of importance.\n\n0:04:01\tSPEAKER_02\n So the most important buttons are those to do with channel selection.\n\n0:04:04\tSPEAKER_02\n They're used about 160 times power.\n\n0:04:09\tSPEAKER_02\n And, um, yeah.\n\n0:04:11\tSPEAKER_02\n So, and people like to zap a lot, apparently.\n\n0:04:14\tSPEAKER_02\n So this is the order, channel selection, teletext, volume and power.\n\n0:04:20\tSPEAKER_02\n The other ones are the settings and they're used less than, you know, 0.8 to 0.5 times per hour.\n\n0:04:27\tSPEAKER_02\n And this means that I think we could have like a button for all the settings and then just one and then from there go on to the audio on the screen, either on the remote or on the television.\n\n0:04:40\tSPEAKER_02\n And the screen and speech recognition, some people are more willing than others to actually pay for that.\n\n0:04:46\tSPEAKER_02\n And if we look at the market, people from, well, from 15 to 35 year olds, I don't really know how to describe this.\n\n0:04:55\tSPEAKER_02\n Um, 91 to 76% of people in that age range are willing to pay more for this sort of product.\n\n0:05:04\tSPEAKER_02\n Are people that are above 35 years old, um, years old, go from 35% to 8%.\n\n0:05:11\tSPEAKER_02\n So people that are 65, for example, wouldn't actually pay for this sort of thing.\n\n0:05:17\tSPEAKER_02\n Um, I don't, I don't know, um, what the decision to be made is, but I think that the people that actually do buy remote more are those like teenagers and young professionals.\n\n0:05:30\tSPEAKER_02\n Um, it's likely, but we should discuss this together.\n\n0:05:34\tSPEAKER_02\n Um, that's what I have to say about the matter.\n\n0:05:37\tSPEAKER_02\n Um, shall I, what do I do?\n\n0:05:42\tSPEAKER_02\n Do I give this to someone else?\n\n0:05:44\tSPEAKER_02\n Yeah.\n\n0:05:45\tSPEAKER_00\n Just be a friend.\n\n0:05:46\tNone\n All right.\n\n0:05:47\tNone\n Let's get this.\n\n0:05:48\tSPEAKER_03\n Okay.\n\n0:06:13\tSPEAKER_03\n Okay, so, now I need to press evade.\n\n0:06:21\tSPEAKER_03\n What is it?\n\n0:06:22\tSPEAKER_03\n Function effect.\n\n0:06:30\tSPEAKER_03\n What's function?\n\n0:06:31\tSPEAKER_03\n It's the little blue.\n\n0:06:32\tSPEAKER_03\n What is function?\n\n0:06:33\tSPEAKER_00\n I should be cool.\n\n0:06:48\tSPEAKER_03\n Okay.\n\n0:06:51\tSPEAKER_03\n This is my presentation about the technical functions design.\n\n0:06:59\tSPEAKER_03\n I basically just tried to focus on what functions we need and how to make that the best function for the user.\n\n0:07:11\tSPEAKER_03\n I thought about it myself and looked on the internet.\n\n0:07:16\tSPEAKER_03\n Okay.\n\n0:07:17\tSPEAKER_03\n So basically, I think it is really important that we sort of get this done in a user-friendly and fashionable way.\n\n0:07:26\tSPEAKER_03\n So I think things like keeping buttons close together that are used in the same way, or maybe making the same color, keeping the number of buttons to a minimum.\n\n0:07:47\tSPEAKER_03\n And also things like, is it small enough, large enough?\n\n0:07:55\tSPEAKER_03\n I'm not sure.\n\n0:07:56\tSPEAKER_03\n I guess we would need to do some research about what size is appropriate and that sort of thing.\n\n0:08:04\tSPEAKER_03\n But basically, we need to make sure that it turns on and off the TV.\n\n0:08:07\tSPEAKER_03\n Does it have capacity to change the channels?\n\n0:08:11\tSPEAKER_03\n Does it do, do we need to have functions for cable or VCR?\n\n0:08:17\tSPEAKER_03\n And then is it findable?\n\n0:08:20\tSPEAKER_03\n And how do we want to do that?\n\n0:08:24\tSPEAKER_03\n And I just thought that these two remotes were pretty boring.\n\n0:08:30\tSPEAKER_03\n I don't know if this is really good.\n\n0:08:34\tSPEAKER_03\n And I think we can find something that's more fun to look at and use than I did this.\n\n0:08:41\tSPEAKER_03\n I mean, I like the one on the right better, just because it does have fewer buttons.\n\n0:08:46\tSPEAKER_03\n But I mean, I think we can think about things like color and size shapes, that sort of thing, to best fit the user.\n\n0:09:01\tSPEAKER_03\n That concludes my presentation.\n\n0:09:03\tNone\n Okay.\n\n0:09:04\tSPEAKER_03\n Okay, I need to look at things.\n\n0:09:20\tNone\n Okay.\n\n0:09:54\tSPEAKER_01\n Okay, so this is on the working design, which is sort of the mechanical functions of the remote. The method I used was to look at existing designs and corporate ideas from our last reading. So I think we need two basic functions, which is just the basic remote functions.\n\n0:10:33\tSPEAKER_01\n User can input a channel or a volume setting and it would be outputs in the TV. And also we talked about a location function where maybe you could press a button on the TV and it would send sort of signal to the remote where it would be for flash or vibrate or whatever to tell you where the remote is.\n\n0:10:51\tSPEAKER_01\n So the components we need are an energy source to power the remote input, which would probably be buttons, although we just talked about voice recognition, processor to take the information. Something to transmit it to the TV. And we also need something on the remote that would receive the location signal, to have an output like possibly a beep or a vibration. And also you need a sender for location signal, which would probably be a separate thing that we'd have to sell with the remote and people could stick it on their TV or stick it on their wall. And this is just sort of an overview of how the remote works. Power comes from the battery, it goes to the chip, and then it is sent from there to an infrared bulb, which would probably be the easiest way to send it to the TV. And then for the location function you would have a sender on the TV, which would output some sort of signal. We could use IR, but we'd probably want to use radio instead. That signal would go to a receiver, the chip would process it, and it would be output in the form of a buzzer or a light lighting up.\n\n0:12:00\tSPEAKER_01\n So my personal preference is for how to build the remote would probably be a battery for the energy source, that way you wouldn't have to plug it in. A button pad for input, we can purchase a pre-made chip, which will hand all the processing stuff, IR transmitter to communicate to the TV that's just sort of standard.\n\n0:12:19\tSPEAKER_01\n So most TVs have an IR receiver, probably a radio receiver to send out location function and to receive it.\n\n0:12:26\tSPEAKER_01\n And I'd probably say a buzzer for the location function on the remote itself. So that concludes my presentation.\n\n0:12:34\tSPEAKER_03\n Do you know about, like, I don't know, you seem like you know about, yeah, I was an engineer.\n\n0:12:41\tSPEAKER_00\n Okay. Well, thank you everybody. We'll discuss that in a minute. I just want to mention some new project requirements that came in.\n\n0:12:59\tSPEAKER_00\n Teletext is apparently outdated. So due to internet popularity, so that's off the list.\n\n0:13:10\tSPEAKER_00\n Also, our remote should be used only for television. No, extra internet, kind of fancy things, just through it and the television.\n\n0:13:22\tSPEAKER_00\n And also, we need to incorporate our corporate image onto this. So the phrase is, we put fashion in electronics.\n\n0:13:37\tSPEAKER_00\n So it's be fashionable, I guess. If we have something, I mean, silver and gold or yellow or color, we have like a kind of silver one like you saw and yellow writing, something like that.\n\n0:13:53\tSPEAKER_00\n Okay. So we need to make some decisions on the remote control functions.\n\n0:14:06\tSPEAKER_00\n Yeah. I guess we should make some kind of brainstorming terms of how it looks or like what it does.\n\n0:14:19\tSPEAKER_00\n Well, probably our target group and how it's going to appeal to our target group in, I don't know, the buttons and what it does.\n\n0:14:32\tSPEAKER_03\n That's sort of thing. So it's our target group, then people, so do you want to go ahead and design this thing with the finder button?\n\n0:14:47\tSPEAKER_03\n I think that's easy. Yeah. Okay. So then our target age group would be the 19 to 35 range.\n\n0:14:58\tSPEAKER_02\n Yeah. So that's the speed recognition. Oh, that's. I was thinking about that.\n\n0:15:07\tSPEAKER_01\n I mean, speed recognition is really hard to program. And also if the TV is on, it's making sound and the people on the TV are talking.\n\n0:15:13\tSPEAKER_01\n If somebody says like one, then the TV's going to switch itself to channel. Yeah. Yeah. It seems like a silly. Yeah. Not sure how you would implement it.\n\n0:15:22\tSPEAKER_00\n And if you consider our budget, if you consider our budget to have speed recognition programmed in every single remote might be a little crazy.\n\n0:15:38\tSPEAKER_03\n Okay. So are we going to have just some kind of a, like we'll have the buzzer on the, like on the TV itself?\n\n0:15:43\tSPEAKER_01\n But you would have to have a button on a TV or on your wall or someplace, but it's a TV already has power. Yeah. Yeah. You click the button. It's going to send out a signal.\n\n0:15:52\tSPEAKER_01\n I was thinking IR is a line of sight. So unless the remote is like actually in front of the TV, it's not going to work. So probably like a radio signal.\n\n0:16:00\tSPEAKER_01\n Okay. On the phone. I answer out a signal. And then the remote. Here's the signal. And so it beeps probably.\n\n0:16:08\tSPEAKER_01\n Okay. So you need like a separate base for that or like something. You have to sold separately because if the sender is on the remote, then you'd have to find the remote first to click the button.\n\n0:16:19\tSPEAKER_02\n So do you plug it in the TV?\n\n0:16:22\tSPEAKER_02\n Yeah. Probably just take it on TV. Okay.\n\n0:16:25\tSPEAKER_03\n So it's now like a two part. Yeah.\n\n0:16:30\tSPEAKER_03\n So we get to design that too. Make it fashionable. Okay.\n\n0:16:38\tSPEAKER_00\n So do you think even though we're not talking about speech recognition, our target group should still be teenagers and young professionals?\n\n0:16:48\tSPEAKER_02\n Should that thing be on the thing to put the use you're talking about a home for it? Do you still want to build a little thing next to the tally or hang on the wall or shall we leave that?\n\n0:17:02\tSPEAKER_00\n You probably leave that. I mean, I guess one takes care of the other.\n\n0:17:05\tSPEAKER_00\n Okay. Yeah.\n\n0:17:06\tSPEAKER_00\n If you can. Yeah. If you can call it, then it can be anywhere.\n\n0:17:12\tSPEAKER_02\n Okay. For them. So you have that button that so there's is there a light or shall we just have a radio?\n\n0:17:21\tSPEAKER_02\n Oh, on the phone.\n\n0:17:24\tSPEAKER_02\n It seems like a need the light.\n\n0:17:27\tSPEAKER_01\n Yeah. I think that's what the phone is.\n\n0:17:30\tSPEAKER_01\n Yeah. We need to find your phone. You should have someone call it. It starts ringing somewhere and then you can figure out the couch.\n\n0:17:35\tSPEAKER_00\n And like it's the phones under the couch.\n\n0:17:37\tSPEAKER_02\n Yeah. So any of the other buttons. So we have this.\n\n0:17:51\tSPEAKER_00\n So I mean, the two remotes that you had shown.\n\n0:17:54\tSPEAKER_00\n I don't remember who showed me.\n\n0:17:56\tSPEAKER_00\n I needed.\n\n0:17:58\tSPEAKER_00\n There. I mean, one look like it was for VCR type thing and the other look like just television.\n\n0:18:04\tSPEAKER_03\n I think they're both sort of just like general. They're both general elements.\n\n0:18:09\tSPEAKER_00\n That is something we have to decide is whether we want to have VCR capabilities.\n\n0:18:14\tSPEAKER_01\n Yeah.\n\n0:18:15\tSPEAKER_01\n Does anyone know if VCRs are the same across international?\n\n0:18:19\tSPEAKER_02\n They're not.\n\n0:18:20\tSPEAKER_01\n No.\n\n0:18:21\tSPEAKER_01\n Okay. So you need like a whole different.\n\n0:18:23\tSPEAKER_00\n Yeah.\n\n0:18:24\tSPEAKER_00\n The DVD probably is.\n\n0:18:26\tSPEAKER_01\n Yeah.\n\n0:18:27\tSPEAKER_01\n Other than that region including.\n\n0:18:29\tSPEAKER_00\n But these.\n\n0:18:34\tSPEAKER_00\n And if we're targeting young professionals and teenagers, I mean, it's going to be DVD type.\n\n0:18:38\tSPEAKER_03\n Yeah.\n\n0:18:39\tSPEAKER_03\n That's the technology these days.\n\n0:18:42\tSPEAKER_03\n So.\n\n0:18:43\tSPEAKER_03\n Okay.\n\n0:18:44\tSPEAKER_03\n I think still it shouldn't be that hard to type like just reduce the number of buttons.\n\n0:18:47\tSPEAKER_03\n Yeah.\n\n0:18:48\tSPEAKER_03\n Like because if you just have like one menu button that works like with.\n\n0:18:53\tSPEAKER_03\n You know, where you can just kind of scroll through the.\n\n0:18:57\tSPEAKER_02\n Well, for sure we need the.\n\n0:18:59\tSPEAKER_02\n I think we can just design the.\n\n0:19:03\tSPEAKER_02\n Channels.\n\n0:19:04\tSPEAKER_02\n I mean, power is just a button.\n\n0:19:07\tSPEAKER_02\n Yeah.\n\n0:19:08\tSPEAKER_02\n And it's not used that much.\n\n0:19:09\tSPEAKER_02\n Yeah.\n\n0:19:10\tSPEAKER_02\n And it's usually that red.\n\n0:19:11\tSPEAKER_02\n Yeah.\n\n0:19:12\tSPEAKER_02\n And I think it's quite nice to keep it like a red.\n\n0:19:14\tSPEAKER_00\n Yeah.\n\n0:19:15\tSPEAKER_00\n You know, I've seen some.\n\n0:19:16\tSPEAKER_00\n The remote so where you just hold one.\n\n0:19:19\tSPEAKER_00\n Like if you hold one down, it's it's a different color than the other buttons, but that turns it on.\n\n0:19:23\tSPEAKER_00\n So you don't actually have a separate power button.\n\n0:19:26\tSPEAKER_00\n Yeah.\n\n0:19:27\tSPEAKER_03\n It seems like that would be hard though.\n\n0:19:29\tSPEAKER_03\n I mean, because unless you might be confusing.\n\n0:19:32\tSPEAKER_03\n Yeah.\n\n0:19:33\tSPEAKER_03\n Yeah.\n\n0:19:34\tSPEAKER_03\n Just because I wouldn't I would probably pick it up and just be like a.\n\n0:19:36\tSPEAKER_03\n Why is there no.\n\n0:19:37\tSPEAKER_00\n Besides you like to be able to get power.\n\n0:19:39\tSPEAKER_00\n Yeah.\n\n0:19:40\tSPEAKER_00\n Yeah.\n\n0:19:41\tSPEAKER_00\n Yeah.\n\n0:19:42\tSPEAKER_00\n Yeah.\n\n0:19:43\tSPEAKER_00\n Okay.\n\n0:19:44\tSPEAKER_00\n So we definitely want a power button and numbers.\n\n0:19:45\tSPEAKER_00\n Yeah.\n\n0:19:46\tSPEAKER_02\n Or even I'm.\n\n0:19:47\tSPEAKER_02\n I don't know if people are.\n\n0:19:51\tSPEAKER_02\n But if you want to reduce the number of buttons instead of having like one to nine half a sort of.\n\n0:20:01\tSPEAKER_02\n That sort of like a joystick flat.\n\n0:20:04\tSPEAKER_02\n Yeah.\n\n0:20:05\tSPEAKER_02\n Yeah.\n\n0:20:06\tSPEAKER_02\n Because people seem now the iPods up.\n\n0:20:07\tSPEAKER_02\n People seem to like this thing that there's no.\n\n0:20:11\tSPEAKER_02\n You don't have one.\n\n0:20:12\tSPEAKER_02\n Yeah.\n\n0:20:13\tSPEAKER_03\n I think that's an interesting idea because it's cool.\n\n0:20:15\tSPEAKER_03\n It's funny.\n\n0:20:16\tSPEAKER_03\n Like if like I just I don't have an iPod, but like I you know, I just like started messing around with one of my friends.\n\n0:20:20\tSPEAKER_03\n The other day and you just sort of and.\n\n0:20:23\tSPEAKER_03\n It's funny how you pick it up and you just figure out how to use it quite easily.\n\n0:20:26\tSPEAKER_03\n Like it's not that hard.\n\n0:20:27\tSPEAKER_02\n Yeah.\n\n0:20:28\tSPEAKER_02\n Yeah.\n\n0:20:29\tSPEAKER_02\n Yeah.\n\n0:20:30\tSPEAKER_03\n It's just and it's one thing.\n\n0:20:31\tSPEAKER_03\n Yeah.\n\n0:20:32\tSPEAKER_03\n And everything.\n\n0:20:33\tSPEAKER_03\n Yeah.\n\n0:20:34\tSPEAKER_02\n Yeah.\n\n0:20:35\tSPEAKER_02\n But do you need a screen then?\n\n0:20:36\tSPEAKER_02\n Do you have to have a screen?\n\n0:20:37\tSPEAKER_02\n Well, can't tell them like can't you?\n\n0:20:38\tSPEAKER_02\n Yeah.\n\n0:20:39\tSPEAKER_01\n You have the number.\n\n0:20:40\tSPEAKER_01\n You can have the number.\n\n0:20:41\tSPEAKER_02\n Okay.\n\n0:20:42\tSPEAKER_02\n The telegram.\n\n0:20:43\tSPEAKER_03\n Yeah.\n\n0:20:44\tSPEAKER_03\n One two three four five.\n\n0:20:45\tSPEAKER_00\n Yeah.\n\n0:20:46\tSPEAKER_00\n Once you scroll.\n\n0:20:47\tSPEAKER_00\n Okay.\n\n0:20:48\tSPEAKER_00\n So we have this like scrolling sort of button.\n\n0:20:49\tSPEAKER_03\n It's just like the same.\n\n0:20:50\tSPEAKER_03\n It's like technology as a mess.\n\n0:20:52\tSPEAKER_02\n And then you do that.\n\n0:20:55\tSPEAKER_02\n Okay.\n\n0:20:56\tSPEAKER_02\n And then you can have.\n\n0:20:59\tSPEAKER_02\n If you actually just want to zap, you can have like a thing.\n\n0:21:06\tSPEAKER_02\n Like that and that and then it can just be plus and minus.\n\n0:21:11\tSPEAKER_03\n Okay.\n\n0:21:12\tSPEAKER_03\n So like it's like a little part of the circle that.\n\n0:21:16\tSPEAKER_03\n Yeah.\n\n0:21:19\tSPEAKER_03\n Yeah.\n\n0:21:20\tSPEAKER_02\n So it's just a region of the circle that you can.\n\n0:21:22\tSPEAKER_00\n Yeah.\n\n0:21:23\tSPEAKER_00\n Click on.\n\n0:21:24\tSPEAKER_00\n Actually.\n\n0:21:25\tSPEAKER_00\n We could we could even have four buttons.\n\n0:21:26\tSPEAKER_00\n Like that's the if that's the mouse, you could have the volume.\n\n0:21:29\tSPEAKER_00\n Yeah.\n\n0:21:30\tSPEAKER_00\n And the channel changes just like on that.\n\n0:21:31\tSPEAKER_03\n So volume could be like the top and the bottom.\n\n0:21:33\tSPEAKER_03\n So do you need to.\n\n0:21:34\tSPEAKER_01\n Okay.\n\n0:21:35\tSPEAKER_03\n Well, you have to you have to like be able to change the function of it to like.\n\n0:21:41\tSPEAKER_02\n Only mean the function.\n\n0:21:42\tSPEAKER_03\n I mean like, okay, because so.\n\n0:21:46\tSPEAKER_03\n I don't know.\n\n0:21:47\tSPEAKER_03\n I guess.\n\n0:21:48\tSPEAKER_03\n Okay.\n\n0:21:49\tSPEAKER_03\n So when you scroll your thumb like around it, it'll like, let's say you go, you're going clockwise.\n\n0:21:53\tSPEAKER_03\n That means you're going to go up the channels and then scroll the other way and it'll go down.\n\n0:21:57\tSPEAKER_03\n Yeah.\n\n0:21:58\tSPEAKER_03\n But then so if you want to switch to the, do you have to switch to a function where.\n\n0:22:02\tSPEAKER_03\n Like so either in that mode or you're in the mode where like.\n\n0:22:05\tSPEAKER_03\n It just has like the four like, you know, this is channel that way.\n\n0:22:09\tSPEAKER_03\n That's that way and volume is up and down.\n\n0:22:11\tSPEAKER_02\n Yeah, but it knows for some reason.\n\n0:22:13\tSPEAKER_02\n It's just the iPod.\n\n0:22:14\tSPEAKER_02\n It's just no.\n\n0:22:15\tSPEAKER_01\n The iPod knows.\n\n0:22:16\tSPEAKER_01\n If it works on the iPod, then it works.\n\n0:22:17\tSPEAKER_03\n Yeah.\n\n0:22:18\tSPEAKER_03\n So you just, you just can either do this or like you can just touch it if you want.\n\n0:22:21\tSPEAKER_02\n Well, for the volume, you have to press the middle.\n\n0:22:24\tSPEAKER_02\n Okay.\n\n0:22:25\tSPEAKER_03\n And then go up.\n\n0:22:26\tSPEAKER_03\n Okay.\n\n0:22:27\tSPEAKER_03\n So you have to like press this middle region and then you can scroll up.\n\n0:22:30\tSPEAKER_03\n And then it's like holding up.\n\n0:22:32\tSPEAKER_02\n But if you like that makes no sense because there's already ones with up and down here.\n\n0:22:37\tSPEAKER_00\n That I've seen and you.\n\n0:22:41\tSPEAKER_00\n Is there an actual actual button or you actually, you're just using the mask to go up and down.\n\n0:22:46\tSPEAKER_02\n Well, what do you, for the, like, what do you present?\n\n0:22:48\tSPEAKER_02\n Right.\n\n0:22:49\tSPEAKER_02\n If you're on the channel, let's say, then you press on the middle and then if you do that again, the volume goes up.\n\n0:22:54\tSPEAKER_02\n And if you do that, it goes down.\n\n0:22:55\tSPEAKER_02\n But if you want to keep it with volume here and here, I'm pretty sure.\n\n0:23:01\tSPEAKER_00\n Well, I mean, if we are going to use this for channels, right?\n\n0:23:05\tSPEAKER_00\n Wouldn't the volume need to be separate somehow?\n\n0:23:08\tSPEAKER_00\n Like you could just have.\n\n0:23:10\tSPEAKER_00\n I don't know.\n\n0:23:11\tSPEAKER_02\n You can click and then have it up and down.\n\n0:23:13\tSPEAKER_03\n But actually, I think we can go on the fact that it does just work with.\n\n0:23:18\tSPEAKER_03\n But the only thing is like, I've had so expensive.\n\n0:23:20\tSPEAKER_03\n Like it has to be.\n\n0:23:22\tSPEAKER_03\n Is that part of that?\n\n0:23:23\tSPEAKER_03\n Is that what makes me?\n\n0:23:24\tSPEAKER_00\n Yeah.\n\n0:23:25\tSPEAKER_00\n I don't know.\n\n0:23:26\tSPEAKER_00\n They have so much memory though.\n\n0:23:27\tSPEAKER_00\n I think so.\n\n0:23:28\tSPEAKER_00\n I think it's the.\n\n0:23:29\tSPEAKER_00\n I think it's the, it's their capability.\n\n0:23:32\tSPEAKER_00\n I mean, they can hold what?\n\n0:23:33\tSPEAKER_00\n Like 5,000.\n\n0:23:34\tSPEAKER_03\n I'm thinking we could, if we have so bit, I mean, but an iPad just has that circle.\n\n0:23:39\tSPEAKER_01\n Yeah.\n\n0:23:40\tSPEAKER_01\n Yeah.\n\n0:23:41\tSPEAKER_01\n Yeah.\n\n0:23:42\tSPEAKER_01\n Yeah.\n\n0:23:43\tSPEAKER_03\n Yeah.\n\n0:23:44\tSPEAKER_03\n But like since it just has this circle thing, you could make it a kind of cool shape.\n\n0:23:49\tSPEAKER_03\n Like it could be a cool sort of, you know, because it could be circular.\n\n0:23:54\tSPEAKER_02\n Yeah.\n\n0:23:55\tSPEAKER_02\n Or something weird like that.\n\n0:23:56\tSPEAKER_02\n It could just be simple instead of being a mess.\n\n0:23:59\tSPEAKER_02\n Because the other thing I didn't tell you on the presentation is that people find that.\n\n0:24:08\tSPEAKER_02\n Find that it's a big waste of time to have to learn how to use your remote.\n\n0:24:13\tSPEAKER_02\n Yeah.\n\n0:24:14\tSPEAKER_02\n That's another thing they complained about.\n\n0:24:16\tSPEAKER_02\n Yeah.\n\n0:24:17\tSPEAKER_02\n What other buttons were that volume?\n\n0:24:20\tSPEAKER_02\n I would just said that.\n\n0:24:24\tSPEAKER_03\n So, okay, this is just for TV. It's not for, or it is does need to be compatible with.\n\n0:24:30\tSPEAKER_01\n The DVD is simple.\n\n0:24:31\tSPEAKER_01\n You have play, pause.\n\n0:24:32\tSPEAKER_01\n Yeah.\n\n0:24:33\tSPEAKER_00\n So how do you know actually our new project requirements?\n\n0:24:36\tSPEAKER_00\n I'm not sure if they meant, oh, use only for television as a not for DVD or just not Internet type thing.\n\n0:24:43\tSPEAKER_00\n So I'll, I'll check that and update you on the next.\n\n0:24:46\tSPEAKER_00\n So like if we have that, we'll hold off on that.\n\n0:24:49\tSPEAKER_00\n Yeah.\n\n0:24:50\tSPEAKER_02\n But DVD plays do usually have their own remote.\n\n0:24:53\tSPEAKER_03\n Yeah.\n\n0:24:54\tSPEAKER_03\n I know.\n\n0:24:55\tSPEAKER_03\n I'm not really clear.\n\n0:24:56\tSPEAKER_01\n I have it all on one because you want to turn it on.\n\n0:24:58\tSPEAKER_01\n Then you want to turn off the volume and then you want to go to the menu.\n\n0:25:00\tSPEAKER_03\n So you'd have to have like, I think you would have to have like a function switch button, you know, somewhere.\n\n0:25:05\tSPEAKER_03\n So like you're either on TV, you're on DVD or you're on VCR.\n\n0:25:08\tSPEAKER_03\n Yeah.\n\n0:25:09\tSPEAKER_03\n Or you're like, so.\n\n0:25:10\tSPEAKER_01\n Well, the DVD is only like four buttons.\n\n0:25:12\tSPEAKER_03\n Yeah.\n\n0:25:13\tSPEAKER_03\n Yeah, but I mean like to switch the phone.\n\n0:25:14\tSPEAKER_03\n So like to switch the function of the little circle disk.\n\n0:25:17\tSPEAKER_03\n The touchpad.\n\n0:25:18\tSPEAKER_01\n I think the circle only does.\n\n0:25:19\tSPEAKER_01\n The channel is an applicable DVD, really, because you don't want to.\n\n0:25:23\tSPEAKER_01\n Yeah, but it would be.\n\n0:25:24\tSPEAKER_01\n Volume is.\n\n0:25:25\tSPEAKER_01\n Volume is actually controlled on the TV.\n\n0:25:26\tSPEAKER_01\n So you don't have to switch.\n\n0:25:27\tSPEAKER_03\n So, but I'm saying like, does it make sense to have like some kind of a button.\n\n0:25:31\tSPEAKER_03\n So like you're, if you're on TV, like you can switch channels.\n\n0:25:34\tSPEAKER_03\n But then if you're on DVD, then like the channel button, like the, the region of the disk that was for channels is for like switching to different tracks.\n\n0:25:44\tSPEAKER_03\n You know, what to different.\n\n0:25:45\tSPEAKER_03\n I mean, do we need to think about that?\n\n0:25:47\tSPEAKER_00\n Yeah, let's think about it because we need to wrap up.\n\n0:25:50\tSPEAKER_00\n Let's see.\n\n0:25:53\tSPEAKER_00\n So everyone's going to go finish their questionnaire.\n\n0:25:57\tSPEAKER_00\n Then when we come back after lunch, we'll have 30 minutes of individual work.\n\n0:26:03\tSPEAKER_00\n Yeah, so think about the things we've discussed and bring some ideas to our next meeting.\n\n0:26:10\tSPEAKER_00\n See you soon.\n\n0:26:14\tSPEAKER_03\n So I feel like I want to spaceship.\n\n", "summary": [{"summary_text": "The functional design meeting is going to consider user needs, technical effects, and the working design of the remote control. Speaker has been taking meetings on the minutes and the meetings, and he will put them in the shared documents folder. He will get the ones up next time. The findings from the usability tests were not finished yet, so Speaker needs two cables."}]}