{"filename": "./data/ES2010c.txt", "transcript": "0:00:00\tSPEAKER_01\n Both lawyer, both mano Hamp opened\n\n0:00:08\tSPEAKER_02\n to you\n\n0:00:14\tSPEAKER_04\n We're on\n\n0:00:28\tSPEAKER_02\n Okay, hi team. Hope you had a good lunch. Okay, we're back for the conceptual design meeting. Let's get started. Okay, here's the agenda for today's meeting. We're going to open it, and I'm going to keep the minutes as project manager. We're going to have three presentations one from each of you again. Then we are going to come to decision on their remote control concepts, and then we're going to close it up. We have 40 minutes again. Okay, and just to reiterate, after this meeting, the team will reach a decision on the concepts of their remote control. Okay, let's go ahead and start off with your presentations. Who would like to go first? Just trying to move mine right now. Okay, Courtney, would you mind starting yourself? Yeah. Okay, good.\n\n0:01:26\tSPEAKER_03\n Transmatching? Yeah. Okay, so, trend watching. Since we do put the fashion electronics, it is kind of important how our product looks. So I guess we can go ahead and go next. So, what they want right now, customers want fancy versus functional, basically about 58% of what they, like of the product that they want, describing like the, in order of how much they want 58% of the decision of what it should look like, fancy versus functional.\n\n0:02:10\tSPEAKER_03\n And then it has to also be technologically innovative and yet easy to use. So the customer basically is confused. They don't know exactly what they want. They want us to tell them.\n\n0:02:22\tSPEAKER_03\n They want everything. Exactly. So we can go next. Okay, so in Milan and Paris recently, the trends have been showing that clothing, shoes and furniture are basically just covered with fruits and vegetable patterns. So I don't know if we want to go with that. And also the spongy feel is in contrast to last year. I don't know really. I mean, I guess the sponge could relate to the buttons if we want to rather than like a hard clicky button that you find on like some mobiles and stuff. You don't want like a softer touch. I mean, you guys know what I mean? Right. Yeah. But as for the fruits and vegetable patterns, I don't know if we really want to go with that because it is just a trend. And our product we want to stay around for much longer than just a few months. Right. Because people don't buy a new one. Yeah. I mean, that could just be a spring thing right now. I can address some of that issue, I think, with my presentation. Okay. Awesome. So design preferences, we need easy to read like large buttons clearly labeled. So I mean, because we talked about that being a problem. And then also buttons illuminating upon touch. You said that in your design with the bulb. And that could also tie in with the color scheme. We need the real reaction logo. The color scheme obviously. That's one of our key goals. We want to promote our product.\n\n0:03:50\tSPEAKER_03\n And I was thinking about different types of designs. And I came up with something actually right here. So what we could do is something like an old-fashioned telephone like this where we put the buttons around like we put a big on off button or something else in the middle.\n\n0:04:05\tSPEAKER_03\n I mean, it could be the arrows or whatever for channel up and down. And then put the numbers around in like an old-fashioned dial shape. Because that it'll appeal to older generation.\n\n0:04:13\tSPEAKER_03\n Like you said, retro is cool. So it's classically retro. So I mean, that's just an idea.\n\n0:04:20\tSPEAKER_02\n You guys like it. Ready for the next slide? Yep. And that's it. Okay. Great. Great presentation.\n\n0:04:29\tSPEAKER_00\n Ready? Okay, here. See if it's there. Which one is it? I don't know.\n\n0:04:51\tSPEAKER_00\n I don't know. Interface concepts? No. Interface concepts. Either refresh it or wait, maybe I didn't put it in there. Hang on. Mine will always read copy of something rather. Sorry?\n\n0:05:05\tSPEAKER_01\n I copied mine before I sent it in. Okay. Sorry.\n\n0:05:09\tSPEAKER_00\n There we go.\n\n0:05:29\tSPEAKER_00\n Okay. Looking at the interface concept, it's going to be mostly examples of possibilities of where we can go with this. If you want to start the next slide, sure.\n\n0:05:53\tSPEAKER_00\n You can't really see it, but there's two possible ways on the left. If you see it on the sides of the remote, you have the sort of scroll down. So you have that option right there. And then also this is the idea of the base.\n\n0:06:06\tSPEAKER_00\n Sort of like an idea there. And then on the right, you have what's really big trend right now is the iPods becoming really fast thing.\n\n0:06:14\tSPEAKER_00\n And so you have this sort of very, very simplistic menu section with the round buttons. And it's sort of like you have the both kind of trendy and hip, but also very sleek and very simple, but technologically advanced.\n\n0:06:31\tSPEAKER_00\n So if you want to do that, and we can find a way of sort of like using that idea into about controlling, sort of looking to it, maybe next. There's the idea of like being able to do it by feel as well as by sight.\n\n0:06:49\tSPEAKER_00\n You know, you're in the dark, you don't want it. You're looking at the remote controls. And the picture particularly is pointing out if you look at the top volume button, it's a V. And so you're kind of feeling a V like volume up.\n\n0:07:02\tSPEAKER_00\n What it really is is a V. And what you think it is is down because the down arrow.\n\n0:07:08\tSPEAKER_00\n And so it's like sort of Christmas, you'd probably turn that with the other way up.\n\n0:07:12\tSPEAKER_00\n But then you have, you could either do it by raise type, which could be, you know, iffy sort of old fashioned in a way.\n\n0:07:21\tSPEAKER_00\n Either that or just have it by shape, for example, you have a specific triangular shape that you know you're looking at the up and down arrow.\n\n0:07:27\tSPEAKER_00\n And then the round ones you sort of feel by, you know, this second one down, that sort of thing.\n\n0:07:32\tSPEAKER_00\n So it's sort of looking into how we wanted to do it by feel.\n\n0:07:36\tSPEAKER_00\n Okay.\n\n0:07:37\tSPEAKER_00\n Okay.\n\n0:07:38\tSPEAKER_00\n This is sort of an example of going for a certain demographic.\n\n0:07:42\tSPEAKER_00\n This is particularly the gear towards children. That's cute.\n\n0:07:46\tSPEAKER_00\n We move.\n\n0:07:47\tSPEAKER_00\n It's very cute. We could probably change it to yellow, bright yellow for like the company logo.\n\n0:07:53\tSPEAKER_00\n You have the shapes, it's very simplistic and friendly looking.\n\n0:07:58\tSPEAKER_00\n And then the other thing that you would be able to do is just to be a, you'd program certain channels that only this children watch.\n\n0:08:07\tSPEAKER_00\n So it's like the watch, you know, the CBB, so something like that.\n\n0:08:11\tSPEAKER_00\n Keeping it away from other channels. So that's like another arrow.\n\n0:08:15\tSPEAKER_00\n These are three examples sort of looking at it. You have the wider section for the main controls there.\n\n0:08:22\tSPEAKER_00\n So you can see how many buttons there are. And then on the left, you have an example of the round buttons and a simpler design.\n\n0:08:30\tSPEAKER_00\n On the bottom, we probably wouldn't need that because it's more for like a DVD function, which we're not going to be using.\n\n0:08:39\tSPEAKER_00\n So again, it's sort of like just giving you ideas. And then down at the bottom, you have the logos.\n\n0:08:44\tSPEAKER_00\n And that's where you could put the RR real reaction.\n\n0:08:50\tSPEAKER_00\n And then finally, these are like the sort of same examples, but also some more just possibilities that we can go with.\n\n0:08:56\tSPEAKER_00\n None of them are particularly keen on, by the way.\n\n0:09:02\tSPEAKER_00\n But it's sort of like just taking aspects out of that and saying, well, out of this one, we like, you know, the round section.\n\n0:09:09\tSPEAKER_00\n Or we like the button size on this.\n\n0:09:12\tSPEAKER_02\n Or I like, you know, the black finish, I just still be finished.\n\n0:09:15\tSPEAKER_03\n Right. I have four of those from out.\n\n0:09:18\tSPEAKER_02\n Okay. Ready? That's it.\n\n0:09:21\tSPEAKER_02\n Okay. Great job.\n\n0:09:24\tSPEAKER_01\n Okay, my turn.\n\n0:09:27\tSPEAKER_01\n Okay. What's the title?\n\n0:09:30\tSPEAKER_01\n It'll be copy of component design.\n\n0:09:35\tSPEAKER_01\n Yeah. That looks like it.\n\n0:09:42\tSPEAKER_01\n Okay.\n\n0:09:44\tSPEAKER_01\n So basic remote operation runs as follows. Press button makes connection with the power source and the rest of the circuit.\n\n0:09:52\tSPEAKER_01\n Chip sends is the connection. Chip produces a more code infrared signal specific to that button.\n\n0:09:59\tSPEAKER_01\n So you press the button and produces a signal that's encoded specifically for that button.\n\n0:10:04\tSPEAKER_01\n Transistors amplify that signal and it goes to the TV center, which interprets the signal and responds accordingly, changes channel, etc.\n\n0:10:13\tSPEAKER_01\n So that being said, next slide please.\n\n0:10:16\tSPEAKER_01\n Findings, which were the required materials for the basic internal construction.\n\n0:10:21\tSPEAKER_01\n So all the really simplistic functions that we just discussed, we need rubber for buttons, aluminum for battery contacts, integrated circuit, which consists of a diode transistor, resonator, resistors, and a capacitor.\n\n0:10:35\tSPEAKER_01\n All those basic things that make a circuit function.\n\n0:10:38\tSPEAKER_01\n Fiberglass and think-up or wire to create the actual circuit board itself.\n\n0:10:43\tSPEAKER_01\n And LED, which is a light emitting diode.\n\n0:10:48\tSPEAKER_01\n Contact disks for the buttons, plastic for the casing and a power source, whatever power source we've actually determined we want.\n\n0:10:56\tSPEAKER_01\n Next slide please.\n\n0:10:58\tSPEAKER_01\n Personal preferences. To save money for the components, the remote should be mass-produced and basic materials should be bought on mass.\n\n0:11:06\tSPEAKER_01\n If we find another company who can produce the required chips, casing LED, any additional materials we decide we require, add less expensive rate than we ourselves are producing we should go for it.\n\n0:11:18\tSPEAKER_01\n Next slide please.\n\n0:11:20\tSPEAKER_01\n Just talking to the manufacturing division.\n\n0:11:25\tSPEAKER_01\n They suggested power options, solar cells, hand, dynamo, and kinetic power. So you shake it and increases the power.\n\n0:11:34\tSPEAKER_01\n I'm not sure how the hand dynamo works. They have yet to get back to me on that.\n\n0:11:38\tSPEAKER_01\n So next slide please.\n\n0:11:41\tSPEAKER_01\n Suggested casing options.\n\n0:11:43\tSPEAKER_01\n Okay. We can offer options for casing such as straight curved, double curved, you know, very specific to the customer.\n\n0:11:50\tSPEAKER_01\n Options for materials, plastic rubber, titanium wood.\n\n0:11:54\tSPEAKER_01\n I don't think anyone's going to go for a wood one because- It's amazing.\n\n0:11:58\tSPEAKER_01\n Yeah, it's fun to listen.\n\n0:12:00\tSPEAKER_01\n Certain restrictions do apply here though. Latex, you can't do solar power with a latex one.\n\n0:12:06\tSPEAKER_01\n So if they want soft squishy rubber, they can't have the solar power adoption.\n\n0:12:11\tSPEAKER_01\n Double curved, you can't do titanium.\n\n0:12:14\tSPEAKER_01\n That would be two curvature. So it would actually- If the shape of your hand you curve here and you curve here.\n\n0:12:20\tSPEAKER_01\n So you could have two curves that match the shape of your hand to make it more comfortable to hold.\n\n0:12:24\tSPEAKER_01\n Now if you wanted that, you can't do titanium.\n\n0:12:28\tSPEAKER_01\n Suggested functions for the buttons scrolling function could be very beneficial to us.\n\n0:12:37\tSPEAKER_01\n Instead of actual buttons themselves, I think I have one more slide.\n\n0:12:42\tSPEAKER_01\n No, I don't.\n\n0:12:43\tSPEAKER_01\n The manufacturing division also has said that they have several types of chips and they've just developed a sample sensor or sample speaker chip, which we could utilize.\n\n0:12:57\tSPEAKER_01\n Push button requires a simple ship and scroll requires more complicated chip.\n\n0:13:03\tSPEAKER_01\n So depends on what we decide we want to do.\n\n0:13:07\tSPEAKER_01\n In addition to that, if we're offering all those different options to the customer for producing their remote, we're going to have to have multiples of each type.\n\n0:13:17\tSPEAKER_01\n Like a double curved in rubber.\n\n0:13:21\tSPEAKER_01\n Each option should have a certain select number produced with all those options.\n\n0:13:28\tSPEAKER_01\n So we'll have to mix it up, make sure we produce enough of everyone.\n\n0:13:32\tSPEAKER_01\n But that could also drive up the price of the actual remote itself if they know that we only produced 5,000 double curved wooden remotes.\n\n0:13:44\tSPEAKER_02\n Oh my god.\n\n0:13:46\tSPEAKER_02\n Thank you for those informative presentations.\n\n0:13:51\tSPEAKER_02\n Let's go back to now we have to make some decisions.\n\n0:13:56\tSPEAKER_00\n Let me just add one more thing that I couldn't say for sure.\n\n0:13:59\tSPEAKER_00\n That's just that this new technology that I've developed on the voice recognition.\n\n0:14:05\tSPEAKER_00\n Oh, this is the thing we're talking about earlier.\n\n0:14:08\tSPEAKER_00\n Except it's sort of odd and not exactly sure why they're explaining it in the way they are.\n\n0:14:16\tSPEAKER_00\n There's a sample sensor and there's a sample speaker unit.\n\n0:14:19\tSPEAKER_00\n So you would say like good morning coffee maker and it would just blend.\n\n0:14:23\tSPEAKER_00\n Good morning Joe.\n\n0:14:25\tSPEAKER_00\n But I'm not sure exactly how it's going to work.\n\n0:14:29\tSPEAKER_00\n Because do you program the Wii program, the responses and the questions?\n\n0:14:33\tSPEAKER_00\n Does that mean that the user then has to ask the specific question and can't change it?\n\n0:14:37\tSPEAKER_00\n In order for it to be recognized, can it be altered in a certain way or just the actual user program it?\n\n0:14:42\tSPEAKER_00\n Like channel means this.\n\n0:14:44\tSPEAKER_03\n Yeah, like using the menu to be like inner your name into the screen, like on the menu option to that way.\n\n0:14:49\tSPEAKER_00\n So it's got like a limited memory and so you program it.\n\n0:14:52\tSPEAKER_00\n So it's sort of iffy.\n\n0:14:54\tSPEAKER_00\n That's kind of what you say.\n\n0:14:57\tSPEAKER_03\n I feel like voice recognition would be, I don't know, it would be too hard to really probably.\n\n0:15:04\tSPEAKER_02\n I mean we could do it, but if it's within our price to get that kind of chip that would, you know, take that.\n\n0:15:12\tSPEAKER_01\n Well, we are making the chip.\n\n0:15:15\tSPEAKER_01\n So I mean, but I guess we have to look at what our production cost is for the chip itself.\n\n0:15:24\tSPEAKER_03\n And it is a growing trend, the higher technological, like the, I mean just like the more advanced it is.\n\n0:15:32\tSPEAKER_01\n Yeah, better it'll sell.\n\n0:15:34\tSPEAKER_01\n I thought offering some of those options for different materials that it could be made of different, you know.\n\n0:15:40\tSPEAKER_01\n I think we'd have to decide on the power options maybe.\n\n0:15:44\tSPEAKER_02\n Yeah, that we could reduce cost.\n\n0:15:46\tSPEAKER_02\n Yeah, how heavy.\n\n0:15:47\tSPEAKER_02\n Okay, that kind of brings us to this.\n\n0:15:49\tSPEAKER_02\n Let's see if we can decide what kind of energy source we want to have first and foremost.\n\n0:15:58\tSPEAKER_02\n Do we want to go for batteries or a stand like the one that we saw illustrated earlier?\n\n0:16:07\tSPEAKER_02\n Oh, the base, yeah.\n\n0:16:08\tSPEAKER_02\n The base, the charging base.\n\n0:16:10\tSPEAKER_02\n I don't know what it looks like before.\n\n0:16:13\tSPEAKER_00\n I mean, there's something really, really small.\n\n0:16:16\tSPEAKER_00\n Then it's sort of harder to imagine the base where that was quite a substantial size sort of standing up.\n\n0:16:22\tSPEAKER_02\n Yeah, and we don't have multiple things that it has to control, just has to control the TV.\n\n0:16:27\tSPEAKER_02\n It's not going to be a huge universal amount.\n\n0:16:30\tSPEAKER_03\n We need to decide, well, so we can figure out how big it's going to be, like what exactly what buttons we want.\n\n0:16:35\tSPEAKER_00\n Exactly.\n\n0:16:36\tSPEAKER_00\n The other thing is like even if it's got a few buttons, we want to figure this.\n\n0:16:40\tSPEAKER_00\n It could be like bigger than this.\n\n0:16:41\tSPEAKER_00\n Yes.\n\n0:16:42\tSPEAKER_00\n Well, it still fits in your hands, you still want it something that's comfortable and substantial, but not necessarily full of buttons.\n\n0:16:47\tSPEAKER_03\n This one is really comfortable.\n\n0:16:48\tSPEAKER_03\n Like, I like the sides.\n\n0:16:50\tSPEAKER_03\n Whatever.\n\n0:16:51\tSPEAKER_03\n It'll lose it easier.\n\n0:16:52\tSPEAKER_03\n But if we have the locator, then we don't have to worry about that.\n\n0:16:57\tSPEAKER_03\n That's true.\n\n0:16:58\tSPEAKER_03\n So we can make it small if we have a locating device.\n\n0:17:01\tSPEAKER_01\n We do a voice activated locator, though.\n\n0:17:03\tSPEAKER_01\n We're going to be looking at a more substantial chip.\n\n0:17:07\tSPEAKER_00\n So that's the other thing.\n\n0:17:10\tSPEAKER_00\n Are we going to have certain chips that are going to require bigger size in the period?\n\n0:17:16\tSPEAKER_03\n Two double A's.\n\n0:17:18\tSPEAKER_03\n For the size.\n\n0:17:23\tSPEAKER_00\n But if we get more complicated, then it's going to have to be bigger to just accommodate the chip size.\n\n0:17:29\tSPEAKER_01\n Honestly, I think the customer would be irritated by the fact that it has a base if we did do a nice small compact.\n\n0:17:36\tSPEAKER_02\n It's either going to be bigger with a base or smaller with a battery like this guy.\n\n0:17:43\tSPEAKER_02\n So what direction do you want to go in?\n\n0:17:46\tSPEAKER_03\n I think if we had a locating device with a small one, I think that seems way more advanced.\n\n0:17:52\tSPEAKER_02\n I'm kind of leaning in the direction.\n\n0:17:55\tSPEAKER_02\n A base.\n\n0:17:56\tSPEAKER_02\n It's a bigger and a base.\n\n0:17:57\tSPEAKER_03\n That just seems clunky.\n\n0:17:59\tSPEAKER_03\n Yeah, because, I mean, even looking at cell phones right now, those trends, the smaller the hotter it is.\n\n0:18:05\tSPEAKER_03\n Okay.\n\n0:18:06\tSPEAKER_01\n The only problem with that is you forget to take a dirty repocket and go in the wash.\n\n0:18:09\tSPEAKER_01\n Oh, kidding.\n\n0:18:11\tSPEAKER_01\n You know, it happens.\n\n0:18:13\tSPEAKER_01\n Yeah, I had three watches go that way too.\n\n0:18:16\tSPEAKER_00\n I've never watched the phone roll.\n\n0:18:19\tSPEAKER_03\n That would, wow.\n\n0:18:20\tSPEAKER_03\n That would hurt.\n\n0:18:21\tSPEAKER_02\n Okay.\n\n0:18:22\tSPEAKER_02\n So what kind of material do we want?\n\n0:18:24\tSPEAKER_01\n Well, we have lots of options.\n\n0:18:26\tSPEAKER_01\n I don't think wood is a viable option.\n\n0:18:28\tSPEAKER_02\n Yeah.\n\n0:18:29\tSPEAKER_02\n Well, what did you say?\n\n0:18:30\tSPEAKER_00\n Go ahead.\n\n0:18:31\tSPEAKER_00\n I was just saying that Titanic, if we're being restricted then.\n\n0:18:35\tSPEAKER_00\n I hope it's going to lead away from that.\n\n0:18:37\tSPEAKER_03\n Yeah, because it's going to cause this mortar producer chip.\n\n0:18:39\tSPEAKER_03\n Titanium would be more expensive.\n\n0:18:41\tSPEAKER_03\n However, what would you recommend?\n\n0:18:43\tSPEAKER_01\n Oh, we only want to sell it for 25 euro, right?\n\n0:18:46\tSPEAKER_01\n Yeah.\n\n0:18:47\tSPEAKER_01\n Because I was thinking if we wanted to get the high end market, then you could produce a few in titanium.\n\n0:18:51\tSPEAKER_01\n Make them rarerity sort of.\n\n0:18:53\tSPEAKER_03\n We could do that because all our research shows that people are definitely willing to spend more.\n\n0:18:58\tSPEAKER_00\n Oh, we have restricted by this.\n\n0:19:01\tSPEAKER_04\n Well, the original.\n\n0:19:02\tSPEAKER_02\n I think we should just focus on one design and one concept right now.\n\n0:19:06\tSPEAKER_02\n I'm not sure that we'll have the time and money to produce a whole array of.\n\n0:19:12\tSPEAKER_02\n Remotes.\n\n0:19:13\tSPEAKER_02\n If this was a successful remote, we might then produce a higher end version of it.\n\n0:19:18\tSPEAKER_02\n I think.\n\n0:19:19\tSPEAKER_02\n Good plan.\n\n0:19:20\tSPEAKER_02\n Good plan.\n\n0:19:21\tSPEAKER_02\n Okay, so we want to go for plastic or what would you recommend for materials?\n\n0:19:25\tSPEAKER_01\n Honestly, I'd recommend like, since we're going with batteries instead of solar power, I'd recommend maybe a soft latex because we could produce, you know how cell phones have those overlays that you can change the color.\n\n0:19:41\tSPEAKER_01\n We could do one that fits in with the trends of the year.\n\n0:19:45\tSPEAKER_01\n So because this year is all fruit, got to get us why?\n\n0:19:49\tSPEAKER_01\n Who knows.\n\n0:19:50\tSPEAKER_01\n We could do a cherry cover for this year and then if next year is stripes or solids, you know.\n\n0:19:58\tSPEAKER_00\n So you're talking about like when it leaves our sales room, then it's all going to be cherry colored or is it going to be the kind of thing where people come back?\n\n0:20:05\tSPEAKER_02\n Or we could like take it back in the back cases and buy the extra case if they wanted.\n\n0:20:10\tSPEAKER_02\n I think it's good to sell basic thing and then sell.\n\n0:20:13\tSPEAKER_01\n So we could do like a hard base plastic and then we could give the two latex covers.\n\n0:20:21\tSPEAKER_01\n Yeah, okay, to start.\n\n0:20:22\tSPEAKER_03\n Yeah, because the soft latex definitely is squishy.\n\n0:20:28\tSPEAKER_03\n Well, I mean squishier than like, right, yeah, just a hard plastic.\n\n0:20:32\tSPEAKER_02\n Okay, and what kind of chip would we need for this guy?\n\n0:20:36\tSPEAKER_01\n How complicated are we going to go with the voice activated?\n\n0:20:39\tSPEAKER_02\n I don't think we should do voice.\n\n0:20:40\tSPEAKER_02\n I think we should just do the recognition for when it's lost.\n\n0:20:45\tSPEAKER_02\n You know, could we talk?\n\n0:20:47\tSPEAKER_03\n Yeah, because I don't know what type of voice activation would be like a certain term, what would we say?\n\n0:20:54\tSPEAKER_03\n Because people could just be talking and we don't want it going off all the time.\n\n0:21:00\tSPEAKER_03\n Right, so.\n\n0:21:01\tSPEAKER_01\n Well, we could give it a specific code, you know, remote missing.\n\n0:21:07\tSPEAKER_03\n I see, I'm straightingly track due because I know that's definitely going to be big because it's, I don't know, just so high-tech.\n\n0:21:15\tSPEAKER_00\n My little sister got, for Christmas, she got one of those keyfinders that's like a key ring.\n\n0:21:20\tSPEAKER_00\n And you have to whistle in a certain frequency for it to work.\n\n0:21:24\tSPEAKER_00\n Yeah, see that would just be your laugh.\n\n0:21:26\tSPEAKER_00\n And it would start going off and her person, you couldn't turn it off.\n\n0:21:28\tSPEAKER_00\n Oh, it's okay.\n\n0:21:29\tSPEAKER_00\n Oh, it's okay.\n\n0:21:30\tSPEAKER_00\n And it came highly irritating.\n\n0:21:31\tSPEAKER_01\n Okay, maybe voice activated.\n\n0:21:32\tSPEAKER_01\n So I think having a key phrase is much better.\n\n0:21:34\tSPEAKER_02\n Okay.\n\n0:21:35\tSPEAKER_02\n All right, but it's not going to be voice activated in the fact that you would say channel up and it would work.\n\n0:21:39\tSPEAKER_02\n Right?\n\n0:21:40\tSPEAKER_02\n Yeah, no, no, no.\n\n0:21:41\tSPEAKER_03\n We don't have to be affluent.\n\n0:21:42\tSPEAKER_03\n Okay.\n\n0:21:43\tSPEAKER_03\n But can your, can the department make that would be like a mid class?\n\n0:21:48\tSPEAKER_01\n Um, yeah, so we don't actually have to go for.\n\n0:21:53\tSPEAKER_01\n Well, if they've just developed a sample sensor, sample speaker.\n\n0:21:59\tSPEAKER_01\n It's a brand new chip.\n\n0:22:00\tSPEAKER_01\n Why not introduce it in this way?\n\n0:22:02\tSPEAKER_02\n Yeah, okay.\n\n0:22:03\tSPEAKER_02\n And what size batteries?\n\n0:22:07\tSPEAKER_02\n AA, AAA.\n\n0:22:08\tSPEAKER_02\n I think AAA.\n\n0:22:09\tSPEAKER_03\n It'll be lighter too.\n\n0:22:11\tSPEAKER_00\n Can you run off of two more than a package?\n\n0:22:14\tSPEAKER_01\n I think, well, we could do two.\n\n0:22:18\tSPEAKER_01\n We could do one small lithium.\n\n0:22:21\tSPEAKER_01\n Because you know, the lithium batteries are doing quite well in most other electronic products, right?\n\n0:22:27\tSPEAKER_01\n So they're more widely available now.\n\n0:22:30\tSPEAKER_01\n And they also have a longer battery life than most batteries.\n\n0:22:33\tSPEAKER_02\n They're more expensive than that, too.\n\n0:22:35\tSPEAKER_01\n But I feel like I have to replace it every five years.\n\n0:22:38\tSPEAKER_00\n Does it get thoughts?\n\n0:22:41\tSPEAKER_00\n As long as we sell it with it.\n\n0:22:43\tSPEAKER_01\n Well, how about an initial?\n\n0:22:45\tSPEAKER_01\n You get one battery when you buy it.\n\n0:22:47\tSPEAKER_01\n Isn't pretty sure we can get them.\n\n0:22:49\tSPEAKER_03\n We could think about it.\n\n0:22:50\tSPEAKER_02\n We'll come back to it next week.\n\n0:22:51\tSPEAKER_02\n Yeah.\n\n0:22:52\tSPEAKER_02\n All right.\n\n0:22:59\tSPEAKER_02\n Okay.\n\n0:23:01\tSPEAKER_02\n So we've covered that first category.\n\n0:23:03\tSPEAKER_02\n User interface concept, meaning design.\n\n0:23:08\tSPEAKER_00\n Yeah, what's it going to look like?\n\n0:23:10\tSPEAKER_02\n Okay.\n\n0:23:11\tSPEAKER_02\n I kind of like your idea about the retro phone dial.\n\n0:23:15\tSPEAKER_02\n And that the central button could have maybe our logo on it.\n\n0:23:21\tSPEAKER_02\n It might be the four-way scroll, too.\n\n0:23:23\tSPEAKER_02\n Yeah, it could be whatever.\n\n0:23:25\tSPEAKER_03\n As long as there's something big in the middle because like the old phones.\n\n0:23:28\tSPEAKER_03\n Yeah.\n\n0:23:29\tSPEAKER_03\n There's like that just like piece of metal or like a picture or something.\n\n0:23:32\tSPEAKER_00\n And the two of that is if it got too big though.\n\n0:23:35\tSPEAKER_00\n So if you have the circle and the button in the middle, then is it going to get wider than your hands or?\n\n0:23:40\tSPEAKER_00\n Oh, that's true.\n\n0:23:41\tSPEAKER_00\n And then would the buttons be too small if it was enough to fit on it?\n\n0:23:44\tSPEAKER_00\n It could be a complaint.\n\n0:23:46\tSPEAKER_01\n In the sample ones that you showed us, there was one that had the scroll buttons on the side.\n\n0:23:50\tSPEAKER_01\n Yeah.\n\n0:23:51\tSPEAKER_01\n Which I think if we make it curved like a hand shape.\n\n0:23:55\tSPEAKER_01\n Like if we put the scroll button on the side.\n\n0:23:58\tSPEAKER_01\n Oh, I see.\n\n0:23:59\tSPEAKER_01\n That could be particularly useful.\n\n0:24:00\tSPEAKER_03\n I think so.\n\n0:24:01\tSPEAKER_03\n So scroll buttons on the side and the buttons on the top.\n\n0:24:07\tNone\n But we definitely, if we have scroll thing on the side, we definitely have to have them labeled.\n\n0:24:13\tNone\n Yeah.\n\n0:24:14\tNone\n Like on the side.\n\n0:24:15\tSPEAKER_03\n It's just up and down.\n\n0:24:16\tSPEAKER_03\n But is that for volume or channel?\n\n0:24:18\tSPEAKER_03\n Which I don't know.\n\n0:24:19\tSPEAKER_03\n Well, you could do.\n\n0:24:20\tSPEAKER_03\n We have more stuff.\n\n0:24:21\tSPEAKER_03\n Yeah.\n\n0:24:31\tSPEAKER_01\n Yeah.\n\n0:24:34\tSPEAKER_01\n We should probably make it that you have to depress it to activate it then.\n\n0:24:38\tSPEAKER_01\n Yeah.\n\n0:24:39\tSPEAKER_01\n Otherwise you're not just holding it and going like this.\n\n0:24:42\tSPEAKER_00\n Instead of a scroll, you just have buttons on the side, which are on the side.\n\n0:24:47\tSPEAKER_04\n Yeah.\n\n0:24:48\tSPEAKER_04\n Yeah.\n\n0:24:51\tSPEAKER_02\n Yeah.\n\n0:25:00\tSPEAKER_02\n Okay.\n\n0:25:01\tSPEAKER_02\n Any other ideas?\n\n0:25:03\tSPEAKER_02\n What color?\n\n0:25:06\tSPEAKER_02\n Yeah.\n\n0:25:07\tSPEAKER_02\n Latex covers.\n\n0:25:09\tSPEAKER_01\n We have to make sure that the logo always sticks out when we put the latex cover on.\n\n0:25:14\tSPEAKER_01\n So we'll have to like have a little square or something.\n\n0:25:17\tSPEAKER_01\n Yeah.\n\n0:25:18\tSPEAKER_00\n A logo is available.\n\n0:25:19\tSPEAKER_00\n A yellow strip at the bottom with the RR like that.\n\n0:25:24\tSPEAKER_00\n Yeah.\n\n0:25:25\tSPEAKER_02\n So the bottom of it.\n\n0:25:26\tSPEAKER_02\n I think maybe we should do it on a button itself though, because people are able to change the covers.\n\n0:25:31\tSPEAKER_02\n I don't know.\n\n0:25:32\tSPEAKER_02\n Maybe the on-off button, something.\n\n0:25:34\tSPEAKER_02\n Some, the menu button.\n\n0:25:36\tSPEAKER_02\n I don't know.\n\n0:25:37\tSPEAKER_02\n But you know, if we're going to put our company logo on there, and somebody could just get another one, are they all going to have our company logo on them?\n\n0:25:44\tSPEAKER_02\n Every cover?\n\n0:25:45\tSPEAKER_01\n Yeah.\n\n0:25:47\tSPEAKER_01\n I don't think we should do that because that would just be icky.\n\n0:25:48\tSPEAKER_01\n Yeah.\n\n0:25:49\tSPEAKER_01\n So I think maybe putting it on a button is probably a good idea.\n\n0:25:52\tSPEAKER_02\n If we want it to be visible.\n\n0:25:56\tSPEAKER_02\n Are all of those ones that you showed where they were silver metallic looking?\n\n0:26:02\tSPEAKER_02\n Yeah.\n\n0:26:03\tSPEAKER_02\n But those are plastic, right?\n\n0:26:04\tSPEAKER_02\n You're not titanium.\n\n0:26:05\tSPEAKER_02\n I kind of like that look.\n\n0:26:08\tSPEAKER_02\n For our base one?\n\n0:26:09\tSPEAKER_01\n Yeah.\n\n0:26:10\tSPEAKER_02\n For the base.\n\n0:26:11\tSPEAKER_02\n Or if we're going for the retro look, I think like a really shiny black would be cool.\n\n0:26:16\tSPEAKER_02\n Yeah.\n\n0:26:17\tSPEAKER_02\n Or like a good gunmetal gray.\n\n0:26:18\tSPEAKER_03\n Because that gray could bind to the silver and the black.\n\n0:26:21\tSPEAKER_02\n There you go.\n\n0:26:22\tSPEAKER_02\n That'll gray.\n\n0:26:33\tSPEAKER_00\n I'm just really wary of putting anything on a button.\n\n0:26:36\tSPEAKER_00\n Why?\n\n0:26:37\tSPEAKER_02\n It'll wear off.\n\n0:26:38\tSPEAKER_00\n Yeah, buttons will.\n\n0:26:41\tSPEAKER_00\n Well, then what's the button do and how do you know what the button does?\n\n0:26:44\tNone\n Yes.\n\n0:26:45\tSPEAKER_00\n Just looking at your examples.\n\n0:26:48\tSPEAKER_00\n You just don't ever see the logo on a button.\n\n0:26:50\tSPEAKER_00\n It's always on the actual casing.\n\n0:26:52\tSPEAKER_04\n Right.\n\n0:26:53\tSPEAKER_01\n There's nothing saying that we have to put the logo on the front.\n\n0:26:59\tSPEAKER_01\n We want to be visible.\n\n0:27:01\tSPEAKER_03\n We want to be visible.\n\n0:27:02\tSPEAKER_02\n Because if it was only on the back really the only time you're going to see it is.\n\n0:27:06\tSPEAKER_02\n When you drop it or when you're changing the battery.\n\n0:27:09\tSPEAKER_00\n The other option is.\n\n0:27:11\tSPEAKER_00\n If you can see it, it's like if I can find it again.\n\n0:27:15\tSPEAKER_02\n Yeah.\n\n0:27:16\tSPEAKER_00\n It's like the second or last slide.\n\n0:27:18\tSPEAKER_02\n Okay.\n\n0:27:19\tSPEAKER_02\n And yours was called.\n\n0:27:20\tSPEAKER_02\n Interfaces.\n\n0:27:21\tSPEAKER_02\n Yeah.\n\n0:27:22\tSPEAKER_02\n This one.\n\n0:27:24\tSPEAKER_02\n Yeah.\n\n0:27:25\tSPEAKER_02\n There's some reason I can't get it to just go to that slide directly.\n\n0:27:29\tSPEAKER_00\n Okay, it's the very right one.\n\n0:27:32\tSPEAKER_00\n You see at the bottom it's kind of difficult to see.\n\n0:27:34\tSPEAKER_00\n But you have like a sort of division between the bottom like where the logo is.\n\n0:27:38\tSPEAKER_00\n And if we have the replaceable section, it's like the top.\n\n0:27:41\tSPEAKER_00\n It doesn't necessarily replace the entire top.\n\n0:27:44\tSPEAKER_00\n So you have that one piece of stays and the rest sort of clips in.\n\n0:27:48\tSPEAKER_00\n Okay.\n\n0:27:49\tSPEAKER_00\n Yes.\n\n0:27:50\tSPEAKER_00\n You're envisioning it.\n\n0:27:51\tSPEAKER_00\n So that stays the same when you have the logo.\n\n0:27:53\tSPEAKER_00\n And then you have to slip that client clips in and that's a bit of changes.\n\n0:27:57\tSPEAKER_00\n Okay.\n\n0:27:58\tSPEAKER_01\n The only problem is we're using a latex overlay.\n\n0:28:00\tSPEAKER_01\n So that actually would go over top of everything and have holes for the buttons.\n\n0:28:05\tSPEAKER_01\n So I was thinking maybe instead of doing that what we could do is leave a space for where the logo should be like a little cut out.\n\n0:28:13\tSPEAKER_00\n Yeah.\n\n0:28:14\tSPEAKER_00\n Right.\n\n0:28:15\tSPEAKER_00\n You know, really like a cell phone.\n\n0:28:17\tSPEAKER_00\n It's like the screen.\n\n0:28:18\tSPEAKER_00\n Right.\n\n0:28:19\tSPEAKER_00\n It's always just left open.\n\n0:28:21\tSPEAKER_00\n And so what are we going to do it like right yellow with our.\n\n0:28:25\tSPEAKER_02\n Anybody see anything that they liked in.\n\n0:28:35\tSPEAKER_03\n Well, some of those buttons that are blue based.\n\n0:28:38\tSPEAKER_03\n Well, a lot of those buttons are blue based.\n\n0:28:40\tSPEAKER_03\n Well, kind of.\n\n0:28:41\tSPEAKER_03\n And then if we do have them illuminate upon contact, they can illuminate yellow yellow.\n\n0:28:47\tSPEAKER_03\n I like that.\n\n0:28:48\tSPEAKER_03\n Like if we like the one all the way on the left, you can see it on your computer better.\n\n0:28:53\tSPEAKER_03\n Where the button is actually blue, but the number itself is clear or white or whatever.\n\n0:28:59\tSPEAKER_03\n So if you pressed it, it would illuminate yellow.\n\n0:29:01\tSPEAKER_03\n Sweet, blue and yellow for the touch.\n\n0:29:03\tSPEAKER_03\n Oh, and so.\n\n0:29:04\tSPEAKER_02\n I like the yellow illumination idea.\n\n0:29:07\tSPEAKER_02\n Very good.\n\n0:29:09\tNone\n Okay.\n\n0:29:12\tSPEAKER_02\n Any other ideas or thoughts?\n\n0:29:19\tSPEAKER_02\n Yeah, some be fairly in agreement about what we want to do with this project.\n\n0:29:26\tSPEAKER_00\n So let me catch up.\n\n0:29:27\tSPEAKER_02\n Okay.\n\n0:29:29\tSPEAKER_00\n Do we finalize what buttons were including?\n\n0:29:36\tSPEAKER_00\n It was just everything that we said before.\n\n0:29:41\tSPEAKER_02\n I think there will be time for that later.\n\n0:29:43\tSPEAKER_02\n I'm guessing.\n\n0:29:47\tSPEAKER_02\n Okay, well, we're going to wrap this up.\n\n0:29:50\tSPEAKER_02\n Next meeting is going to start in 30 minutes.\n\n0:29:53\tSPEAKER_02\n And here's what we're each of us going to do.\n\n0:29:56\tSPEAKER_02\n The ID is going to do the look and field design.\n\n0:29:59\tSPEAKER_02\n The UID, the user interface design.\n\n0:30:01\tSPEAKER_02\n I think you're going to get a lot of, I mean, the final say on what buttons get put.\n\n0:30:06\tSPEAKER_02\n We'll all talk about it, but I think that's pretty much what you're going to do, right?\n\n0:30:10\tSPEAKER_02\n Yeah.\n\n0:30:11\tSPEAKER_02\n Okay.\n\n0:30:12\tSPEAKER_02\n And you're going to do some product evaluation.\n\n0:30:15\tSPEAKER_02\n Okay.\n\n0:30:18\tSPEAKER_02\n And right now, the ID and UID, you two are going to work together on a prototype using modeling clay.\n\n0:30:22\tSPEAKER_01\n Great.\n\n0:30:24\tSPEAKER_02\n Played it.\n\n0:30:25\tSPEAKER_02\n Yeah.\n\n0:30:26\tSPEAKER_02\n Okay.\n\n0:30:27\tSPEAKER_02\n And you shall be getting an email pretty soon.\n\n0:30:29\tSPEAKER_02\n All right.\n\n0:30:30\tSPEAKER_02\n Thank you for a very productive meeting.\n\n0:30:33\tSPEAKER_04\n Thank you.\n\n", "summary": [{"summary_text": "After lunch, the team will reach a decision on the concepts of their remote control. Courtney will start with her presentation. Speaker's presentation will address the design preferences of the customers. Speakers' presentation will focus on fashion electronics and the design of the product. "}]}