{"filename": "./data/ES2009d.txt", "transcript": "0:00:00\tNone\n Oh I told you...\n\n0:00:25\tSPEAKER_02\n Oh, I told me the X-I moved it.\n\n0:00:32\tSPEAKER_02\n I just put it over here.\n\n0:00:37\tSPEAKER_02\n You know, do I have to wait for this?\n\n0:00:42\tSPEAKER_01\n How's that?\n\n0:00:43\tSPEAKER_01\n Cool.\n\n0:00:44\tSPEAKER_01\n Oh, right.\n\n0:00:45\tSPEAKER_01\n It is PowerPoint time.\n\n0:00:48\tSPEAKER_01\n I've done more PowerPoints in this particular experiment than I've ever done in my life before before this experiment.\n\n0:00:56\tSPEAKER_01\n Yeah.\n\n0:00:57\tNone\n I'm just kind of fun.\n\n0:01:01\tSPEAKER_01\n So here we have our detailed design meeting where we will look at the prototype.\n\n0:01:10\tSPEAKER_01\n Right.\n\n0:01:11\tSPEAKER_01\n So I finally figured out what this whole second bullet point is about in my, that my coach was sending to me.\n\n0:01:16\tSPEAKER_01\n It means I'm supposed to read the minutes from the previous meeting.\n\n0:01:19\tSPEAKER_01\n Oh, really?\n\n0:01:20\tSPEAKER_01\n Okay.\n\n0:01:21\tSPEAKER_01\n I think.\n\n0:01:22\tSPEAKER_01\n Otherwise, it's just saying, I'm the secretary and I'm there for I'm taking the minutes.\n\n0:01:27\tSPEAKER_01\n So just to go, just real briefly to go over minutes from last meeting, I will open them slowly.\n\n0:01:36\tSPEAKER_01\n No.\n\n0:01:37\tSPEAKER_01\n Wait for it.\n\n0:01:39\tSPEAKER_01\n Wait for it.\n\n0:01:46\tSPEAKER_02\n Yeah, that's not you.\n\n0:01:48\tSPEAKER_01\n No, that's not you.\n\n0:01:54\tSPEAKER_01\n This is this is a very high powered stuff here.\n\n0:01:57\tSPEAKER_01\n That will click here.\n\n0:01:58\tSPEAKER_01\n There we go.\n\n0:01:59\tSPEAKER_01\n So basically the moral of the story from our last meeting was that we, that we had meetings from, we had presentations done by the industrial designer, well, from Nathan and Ron and Sarah about what we can do here and what sort of limitations we're operating with.\n\n0:02:19\tSPEAKER_01\n I'm sorry, limitations were operating under what kind of risk we'd be looking at with some of the various approaches we were discussing.\n\n0:02:26\tSPEAKER_01\n And we essentially came to the conclusion that we should develop a remote with our voice recognition.\n\n0:02:32\tSPEAKER_01\n I've had a vaguely non-remote like shape because you didn't really use it as a remote, as you could just use your voice.\n\n0:02:39\tSPEAKER_01\n That would include some mostly just the simple design features for a television operation, but with a slider fulled out Bay for more advanced functions for users.\n\n0:02:49\tSPEAKER_01\n And the, the, the idea and the idea were asked to go ahead and start developing a prototype press to look at.\n\n0:02:58\tSPEAKER_01\n So that sorted back to the main.\n\n0:03:07\tSPEAKER_01\n Meet here.\n\n0:03:08\tSPEAKER_01\n Go ahead and take it away guys.\n\n0:03:12\tSPEAKER_03\n Well, we have assembled our prototype.\n\n0:03:19\tSPEAKER_03\n What's to be said about it.\n\n0:03:22\tSPEAKER_03\n We took into account a lot of things that we went over in the last meeting.\n\n0:03:28\tSPEAKER_03\n Some of the most important things to consider are that we decided not to go for the touch screen, which you can see.\n\n0:03:35\tSPEAKER_03\n And opted for some very large buttons for the primary functions.\n\n0:03:42\tSPEAKER_03\n This is going to be the on and off button.\n\n0:03:44\tSPEAKER_03\n And we have these buttons to go through the channels.\n\n0:03:48\tSPEAKER_03\n And then two volume buttons down here. We decided those were the most important buttons.\n\n0:03:54\tSPEAKER_03\n And then for the more advanced functions, there's a slide out panel here.\n\n0:04:01\tSPEAKER_03\n You can see that there are lots of things going on.\n\n0:04:04\tSPEAKER_03\n But this actually can slide back in.\n\n0:04:06\tSPEAKER_03\n It's very nice aesthetic when it's all put away.\n\n0:04:15\tSPEAKER_03\n As far as the whole visible light thing, we decided to go with multiple colors.\n\n0:04:21\tSPEAKER_03\n Why not?\n\n0:04:24\tSPEAKER_03\n Of course, if that's annoying for some people, that function can be turned off.\n\n0:04:31\tSPEAKER_04\n Now, it's important that we talk to quite a bit about the interchangeable faces.\n\n0:04:37\tSPEAKER_04\n And what we've done here is come up with a bit of a natural look here.\n\n0:04:42\tSPEAKER_04\n And we call it fruity.\n\n0:04:45\tSPEAKER_04\n A appropriate.\n\n0:04:47\tSPEAKER_04\n Of course, that's interchangeable.\n\n0:04:50\tSPEAKER_04\n I think it would be desirable for the regular product in the first packaging to be something a little bit more subdued.\n\n0:04:59\tSPEAKER_04\n But this is kind of something that can be done.\n\n0:05:02\tSPEAKER_04\n And as you can see on the television there, we have the voice detector device on the top.\n\n0:05:11\tSPEAKER_04\n So that will work quite well with regard to finding this contraption.\n\n0:05:18\tSPEAKER_04\n What other things we see here?\n\n0:05:21\tSPEAKER_04\n Well, if you give it a touch, it does have actually a bit of a spongy feel.\n\n0:05:25\tSPEAKER_04\n So I think that will work well with regards to our market.\n\n0:05:31\tSPEAKER_04\n And let's see.\n\n0:05:36\tSPEAKER_04\n Clearly, there's going to be some more colors and whatnot available.\n\n0:05:42\tSPEAKER_04\n Do you have anything else to add to that?\n\n0:05:45\tSPEAKER_03\n I've worried about the materials.\n\n0:05:48\tSPEAKER_03\n The entire thing is covered in rubber coating.\n\n0:05:51\tSPEAKER_03\n So it's very durable.\n\n0:05:54\tSPEAKER_03\n It's not going to break like some type of plastic that's dropped.\n\n0:05:59\tSPEAKER_03\n And of course, as you can see, if you touch it, it does have that nice squishy feel.\n\n0:06:05\tSPEAKER_04\n It's actually important to note that the television, if there's an earthquake or anything like that, it actually is edible inside.\n\n0:06:17\tSPEAKER_03\n I don't know if you noticed, but I wrote the company's name.\n\n0:06:21\tSPEAKER_01\n Oh, well done.\n\n0:06:23\tSPEAKER_03\n Yeah.\n\n0:06:24\tSPEAKER_03\n This is actually an apple inside.\n\n0:06:26\tSPEAKER_02\n Do we need to worry about broad factors?\n\n0:06:30\tSPEAKER_04\n It's encased and then you type them.\n\n0:06:34\tSPEAKER_02\n Okay, this is presented as a problem.\n\n0:06:36\tSPEAKER_03\n We got to go ahead of ourselves.\n\n0:06:37\tSPEAKER_03\n I know we're not talking about making televisions.\n\n0:06:40\tSPEAKER_03\n Edible televisions.\n\n0:06:41\tSPEAKER_04\n So wave of the future.\n\n0:06:43\tSPEAKER_04\n It's a couple of years off at least.\n\n0:06:44\tSPEAKER_04\n Impossible new product.\n\n0:06:47\tSPEAKER_04\n But I think that sums up the main features of the remote.\n\n0:06:52\tSPEAKER_04\n I don't know if you guys have any questions or whether we need to worry about any other marketing areas or anything of that.\n\n0:07:01\tSPEAKER_04\n Nature, did we come in under budget?\n\n0:07:04\tSPEAKER_03\n We did.\n\n0:07:05\tSPEAKER_03\n Yeah, this costs, well, to put this into production, looking at about, was our goal was 1250 euro.\n\n0:07:16\tSPEAKER_03\n And this actually came at 1199.\n\n0:07:20\tSPEAKER_03\n So I was quite pleased with that.\n\n0:07:22\tSPEAKER_03\n One thing that we didn't do, obviously we had a choice with the buttons, whether to use scroll buttons or standard rubber buttons.\n\n0:07:29\tSPEAKER_03\n But we just went for a classic rubber button.\n\n0:07:32\tSPEAKER_03\n And since we did that, we didn't have to use as many microchips, which is quite nice.\n\n0:07:37\tSPEAKER_03\n That's what helped keep the cost down.\n\n0:07:39\tSPEAKER_03\n Really?\n\n0:07:40\tSPEAKER_03\n Even though it has a lot of modern technology, for example, the voice recognition.\n\n0:07:45\tSPEAKER_03\n In a lot of ways, it's just a simple remote.\n\n0:07:49\tSPEAKER_03\n I think if we shopped around for other manufacturers, we might be able to get it even cheaper.\n\n0:07:58\tSPEAKER_04\n Did we talk about the voice recognition option?\n\n0:08:03\tSPEAKER_04\n Oh, no, we haven't talked about that.\n\n0:08:06\tSPEAKER_04\n So on the back here, you'll notice this area here, which is actually the voice recognition console.\n\n0:08:14\tSPEAKER_04\n And I think it's nicely designed into the overall look.\n\n0:08:19\tSPEAKER_04\n But basically, the voice recognition incorporates the latest designs that our research team has come up with.\n\n0:08:27\tSPEAKER_04\n Basically, quite similar to the coffee maker design that we were talking about earlier.\n\n0:08:34\tSPEAKER_04\n And I think that has given a proven ease of use and whatnot.\n\n0:08:42\tSPEAKER_04\n Yeah.\n\n0:08:43\tSPEAKER_04\n And allows features like the remote to actually talking back to the user.\n\n0:08:52\tSPEAKER_03\n Cool.\n\n0:08:53\tSPEAKER_01\n Any questions?\n\n0:08:55\tSPEAKER_02\n No, no, let's do.\n\n0:08:57\tSPEAKER_02\n Do we have other, for lack of a word, skins, covers, and play now?\n\n0:09:01\tSPEAKER_02\n Are those going to be developed later?\n\n0:09:03\tSPEAKER_02\n Once we see how the couple we have go?\n\n0:09:06\tSPEAKER_02\n Or do we need to understand what I am?\n\n0:09:08\tSPEAKER_04\n Well, we didn't quite have enough material.\n\n0:09:11\tSPEAKER_02\n Oh, I was expecting a prototype.\n\n0:09:13\tSPEAKER_00\n I just don't know if you guys had any in mind.\n\n0:09:15\tSPEAKER_03\n Right.\n\n0:09:16\tSPEAKER_03\n Well, as you can see, this is just a most superficial layer.\n\n0:09:21\tSPEAKER_03\n And it'd be very easy to put another layer.\n\n0:09:24\tSPEAKER_03\n Something else.\n\n0:09:25\tSPEAKER_02\n Something else.\n\n0:09:26\tSPEAKER_02\n Yeah.\n\n0:09:27\tSPEAKER_04\n Right.\n\n0:09:28\tSPEAKER_04\n Actually, this bottom red ring here just unclips.\n\n0:09:31\tSPEAKER_04\n And then you put a new plate on top of that.\n\n0:09:37\tSPEAKER_04\n So, I mean, we definitely priced out even spongier, non-natural look materials, which I think worked out fine.\n\n0:09:47\tSPEAKER_04\n We also continued on with the ideas that following apples, color schemes, with the light orange and shine, it's not quite a face plate.\n\n0:09:58\tSPEAKER_03\n It's more like a pseudo face plate.\n\n0:10:01\tSPEAKER_03\n Okay.\n\n0:10:02\tSPEAKER_03\n Because it's simple enough that in the factory, we could very easily put a different one on it.\n\n0:10:07\tSPEAKER_03\n It locks into place such that it's pretty permanent.\n\n0:10:11\tSPEAKER_03\n At the same time, if we want to go the other way, it's just a matter of a couple of adjustments.\n\n0:10:16\tSPEAKER_03\n And we could go the face plate way.\n\n0:10:18\tSPEAKER_03\n If you know what I mean.\n\n0:10:19\tSPEAKER_02\n Yep. It's still an option.\n\n0:10:22\tSPEAKER_02\n Very cool.\n\n0:10:23\tSPEAKER_02\n Nice job.\n\n0:10:24\tSPEAKER_01\n Right.\n\n0:10:25\tSPEAKER_01\n Yeah. Thanks, guys.\n\n0:10:26\tSPEAKER_01\n That's very, very good work.\n\n0:10:28\tSPEAKER_01\n I like it.\n\n0:10:29\tSPEAKER_01\n Brilliant.\n\n0:10:32\tSPEAKER_01\n What we need to discuss now is the finance of it.\n\n0:10:35\tSPEAKER_01\n I got me, you've provided a number that actually sounds quite nice.\n\n0:10:41\tSPEAKER_01\n The trouble is I was just given this by finance.\n\n0:10:44\tSPEAKER_01\n It's a spreadsheet of the parts.\n\n0:10:46\tSPEAKER_01\n And I've just tentatively put in what it's going to look like.\n\n0:10:51\tSPEAKER_01\n I'm just going to clear this out real quickly.\n\n0:10:54\tSPEAKER_01\n But it looks like.\n\n0:11:00\tSPEAKER_01\n So we'll just, if we can just itemize what's in here, we've got this, it's a solar cell thing, right?\n\n0:11:06\tSPEAKER_03\n Right.\n\n0:11:07\tSPEAKER_03\n With the backup battery.\n\n0:11:09\tSPEAKER_03\n It's in that.\n\n0:11:10\tSPEAKER_01\n With the back.\n\n0:11:11\tSPEAKER_01\n Okay.\n\n0:11:12\tSPEAKER_04\n And the worst recognition area actually doubles as the solar cell area.\n\n0:11:18\tSPEAKER_01\n Claver.\n\n0:11:19\tSPEAKER_01\n Claver.\n\n0:11:20\tSPEAKER_01\n Well then.\n\n0:11:21\tSPEAKER_01\n So I guess that would mean we've got a bit of a, it's a speaker in a sensor at the same time, isn't it?\n\n0:11:28\tSPEAKER_03\n Yeah.\n\n0:11:29\tSPEAKER_03\n It's just making use of the same space and the same particular space.\n\n0:11:33\tSPEAKER_01\n In the case, it's more of a single curved case.\n\n0:11:37\tSPEAKER_01\n I guess it would be that would be the general.\n\n0:11:39\tSPEAKER_03\n Yeah.\n\n0:11:40\tSPEAKER_03\n I guess you could say.\n\n0:11:42\tSPEAKER_01\n And we've got a rubber skin material basically throughout push button interface with this other drop-downs.\n\n0:11:54\tSPEAKER_01\n And maybe we've got two push button interfaces.\n\n0:11:56\tSPEAKER_01\n Yeah.\n\n0:11:57\tSPEAKER_01\n And special.\n\n0:12:01\tSPEAKER_01\n I guess it's a, we've got a sort of a wood material, a rubbery type material.\n\n0:12:07\tSPEAKER_01\n Yeah.\n\n0:12:08\tSPEAKER_03\n Yeah.\n\n0:12:10\tSPEAKER_03\n Yeah.\n\n0:12:11\tSPEAKER_03\n I guess you'd have to mark special color and special form as well.\n\n0:12:14\tSPEAKER_03\n And she, because it is very unconventional.\n\n0:12:16\tSPEAKER_01\n Yeah.\n\n0:12:17\tSPEAKER_01\n It's quite unique.\n\n0:12:18\tSPEAKER_01\n I like it.\n\n0:12:19\tSPEAKER_01\n Yeah.\n\n0:12:20\tSPEAKER_01\n So it looks like.\n\n0:12:22\tSPEAKER_02\n It's 16.\n\n0:12:23\tSPEAKER_01\n A bit over budget.\n\n0:12:25\tSPEAKER_01\n Yeah.\n\n0:12:26\tSPEAKER_01\n Just a little bit.\n\n0:12:28\tSPEAKER_01\n So what we could do perhaps.\n\n0:12:31\tSPEAKER_01\n A simple fix would maybe to switch away from the solar cells.\n\n0:12:36\tSPEAKER_01\n Or take out the backup battery.\n\n0:12:39\tSPEAKER_04\n I mean, I think that if we were talking about it being one of her main selling features, being environmental on the way up the batteries and whatnot, although it does still have a battery, so I'm not sure that what the cell is on that.\n\n0:12:54\tSPEAKER_03\n I mean, we could take the battery out of it, you see.\n\n0:12:57\tSPEAKER_03\n And it probably worked 99% of the time.\n\n0:12:59\tSPEAKER_03\n But you're going to have to set up a call center for that 1% of the time when people are calling.\n\n0:13:04\tSPEAKER_03\n So like, my remote isn't working.\n\n0:13:06\tSPEAKER_03\n What am I going to do?\n\n0:13:07\tSPEAKER_03\n People will be upset.\n\n0:13:09\tSPEAKER_03\n I think in a long run, it's better to keep the battery.\n\n0:13:12\tSPEAKER_03\n And it's hard to scrap the whole solar battery idea because that's so integral to the theme that we have.\n\n0:13:21\tSPEAKER_00\n Hmm.\n\n0:13:29\tSPEAKER_01\n Well, it's difficult. We have all these things integral to the, um, two to the design of it that we just can't back out of now.\n\n0:13:36\tSPEAKER_01\n It would have to be.\n\n0:13:37\tSPEAKER_01\n Seems like we'd have to go back to square one.\n\n0:13:44\tSPEAKER_01\n In a way, um, if we were going to try to undo one bit, we probably have to undo most of it.\n\n0:13:52\tSPEAKER_02\n Although we don't want to get rid of the whole environmental, I mean, obviously the solar cell is a big piece of the way we're marking this is like a natural new thing.\n\n0:14:04\tSPEAKER_02\n But honestly, if we cut that one piece out, we're actually coming in on the budget.\n\n0:14:09\tSPEAKER_02\n In fact, I'm a math correctly.\n\n0:14:12\tSPEAKER_04\n You might be able to sway me on the idea that our main selling point could be already this voice recognition thing.\n\n0:14:19\tSPEAKER_02\n That's what sets us apart, right? Yeah, that's what setting us into this young market.\n\n0:14:23\tSPEAKER_02\n That's what we started from.\n\n0:14:25\tSPEAKER_02\n So, I don't know what I mean, you know, perhaps when the cell technology comes down in price, we can bring that back into the game.\n\n0:14:34\tSPEAKER_02\n But it looks like at this point that may be out of our league.\n\n0:14:38\tSPEAKER_04\n The reality is, you know, for me, from an ideological standpoint, I'd like to stick with the solar cell, but I kind of have to throw myself in the business structure and model here.\n\n0:14:52\tSPEAKER_04\n It's either or.\n\n0:14:54\tSPEAKER_04\n I think that we need to come to a compromise here and maybe move ahead with the project without the solar cell.\n\n0:15:02\tSPEAKER_03\n Yeah. I think that's, fortunately, that's our best option.\n\n0:15:05\tSPEAKER_03\n We're going to get below gold.\n\n0:15:08\tSPEAKER_03\n 1250.\n\n0:15:09\tSPEAKER_01\n Because we can't remove the push buttons because they are.\n\n0:15:13\tSPEAKER_01\n Yeah.\n\n0:15:14\tSPEAKER_01\n We can't get rid of the, I mean, removing the changing the case wouldn't be so much of a...\n\n0:15:22\tSPEAKER_01\n...suit.\n\n0:15:24\tSPEAKER_01\n...nor would changing the case materials.\n\n0:15:29\tSPEAKER_01\n So yeah, that looks like to be the only thing. So that would be, it's a major change, but...\n\n0:15:37\tNone\n Yeah.\n\n0:15:39\tSPEAKER_01\n Okay. All right.\n\n0:15:40\tSPEAKER_01\n So we're in agreement on that.\n\n0:15:42\tSPEAKER_02\n Unfortunately, I think we are.\n\n0:15:46\tSPEAKER_04\n I think that was a good compromise you brought for it, too.\n\n0:15:50\tSPEAKER_01\n Right.\n\n0:15:59\tSPEAKER_01\n Moving along swiftly.\n\n0:16:01\tSPEAKER_01\n So I guess now we just go to the project evaluation, which I will allow.\n\n0:16:09\tSPEAKER_02\n That will be me.\n\n0:16:11\tSPEAKER_02\n...cord?\n\n0:16:13\tSPEAKER_01\n Of course, sorry.\n\n0:16:14\tSPEAKER_02\n No problem.\n\n0:16:15\tNone\n You reach.\n\n0:16:17\tSPEAKER_02\n It will be great. Thank you.\n\n0:16:20\tSPEAKER_02\n That would be great.\n\n0:16:23\tSPEAKER_02\n I didn't even do that on purpose either.\n\n0:16:26\tSPEAKER_02\n Okay. Basically, I was just evaluating from what we know of our products working right now with the criteria that we set at the beginning of...\n\n0:16:34\tSPEAKER_02\n...these are the things we needed to do, these are the things that look like we feel are important.\n\n0:16:38\tSPEAKER_02\n So I was looking at basic design things.\n\n0:16:41\tSPEAKER_02\n Does it fulfill its function, does it remote, is the design, what we wanted to do, our technologies up to where we'd hope they would be, and does it fulfill the aesthetic qualities that our original market research was looking for?\n\n0:16:53\tSPEAKER_02\n Basic questions like, you know, does it turn on, does it respond to voice recognition?\n\n0:16:59\tSPEAKER_02\n And overall, in general, it looks like it's coming up to par.\n\n0:17:02\tSPEAKER_02\n The only thing is with the pull-out panel, that is going to take some adjusting because of the new sort of interface, that looked like it was coming up rough, but then once you get used to it, it does make a lot of sense.\n\n0:17:15\tSPEAKER_02\n So I think overall, we're heading the right direction.\n\n0:17:18\tSPEAKER_04\n Yeah, okay.\n\n0:17:20\tSPEAKER_04\n So...\n\n0:17:21\tSPEAKER_02\n Like that spongy feel.\n\n0:17:23\tSPEAKER_02\n Yeah. It looks like it's going over well.\n\n0:17:25\tSPEAKER_02\n The page function works well. That's good to hear.\n\n0:17:27\tSPEAKER_02\n We're good, yeah.\n\n0:17:29\tSPEAKER_02\n We're good, yeah.\n\n0:17:30\tSPEAKER_02\n Yeah.\n\n0:17:31\tSPEAKER_02\n I think eventually, if we do branch out with this program, maybe when we do have higher budget options, and if it goes over with this model, we can look into wider range voice recognition.\n\n0:17:38\tSPEAKER_02\n Like from other rooms of the house and stuff, but for now, what we've got is working in the range we need it for.\n\n0:17:43\tSPEAKER_02\n So it's all good.\n\n0:17:45\tNone\n Really?\n\n0:17:46\tSPEAKER_03\n That's everything for me.\n\n0:17:47\tSPEAKER_02\n That's everything for me.\n\n0:17:48\tSPEAKER_03\n But losing the solar panel.\n\n0:17:49\tSPEAKER_03\n Yeah.\n\n0:17:50\tSPEAKER_02\n It's okay.\n\n0:17:51\tSPEAKER_02\n Yeah.\n\n0:17:52\tSPEAKER_02\n It is a setback, but...\n\n0:17:54\tSPEAKER_02\n Okay, do you need the quad back?\n\n0:17:57\tSPEAKER_04\n We might have lost that granola market again.\n\n0:18:01\tSPEAKER_01\n Oh, they don't want to tell you, is there any way to do that?\n\n0:18:04\tSPEAKER_01\n I guess that's true.\n\n0:18:05\tSPEAKER_01\n Right.\n\n0:18:08\tSPEAKER_01\n So this one's a bit unclear to me to be perfectly fair.\n\n0:18:17\tSPEAKER_01\n I got this slide from the coach, and I'm not sure what it's connected to.\n\n0:18:23\tSPEAKER_01\n So I guess we are going to discuss project process.\n\n0:18:30\tSPEAKER_01\n And that is going to go into my report.\n\n0:18:35\tSPEAKER_01\n So I guess this is the point where we go out of roll that looks like and talk about our satisfaction for room for creativity and so forth.\n\n0:18:44\tSPEAKER_01\n Okay.\n\n0:18:45\tSPEAKER_01\n How that all worked, I guess.\n\n0:18:46\tSPEAKER_02\n As in within the team.\n\n0:18:48\tSPEAKER_02\n I think so, yeah.\n\n0:18:49\tSPEAKER_02\n Right.\n\n0:18:50\tSPEAKER_03\n So it's just kind of...\n\n0:18:51\tSPEAKER_03\n I think it's a mic kind of thing.\n\n0:18:53\tSPEAKER_03\n I think so.\n\n0:18:55\tSPEAKER_02\n It is now.\n\n0:18:56\tSPEAKER_01\n You're charged.\n\n0:18:57\tSPEAKER_01\n So there you go.\n\n0:18:58\tSPEAKER_01\n I'm not screwing up and experiencing it.\n\n0:19:03\tSPEAKER_01\n But I trusted she would jump in if I was.\n\n0:19:05\tSPEAKER_01\n So okay.\n\n0:19:06\tSPEAKER_01\n Whatever.\n\n0:19:07\tSPEAKER_01\n Right.\n\n0:19:08\tSPEAKER_01\n So any thoughts?\n\n0:19:12\tSPEAKER_03\n We can start at these points here.\n\n0:19:15\tSPEAKER_02\n Yeah.\n\n0:19:16\tSPEAKER_02\n I think they're starting box, yeah.\n\n0:19:18\tSPEAKER_01\n What did you guys feel about the process?\n\n0:19:21\tSPEAKER_02\n I think in general, for a day's worth of work, we actually were relatively productive considering the little amount of input we had going in.\n\n0:19:31\tSPEAKER_02\n And the technology has definitely been a help.\n\n0:19:33\tSPEAKER_02\n It's really been interesting to try out all this new stuff.\n\n0:19:37\tSPEAKER_04\n We didn't use the whiteboard at all.\n\n0:19:39\tSPEAKER_04\n No, no whiteboard.\n\n0:19:41\tSPEAKER_02\n We could now, if that had made up for it, really.\n\n0:19:45\tSPEAKER_02\n And I feel like if you guys have been designing in here, perhaps that would have changed, but because of the constraints, it doesn't really matter.\n\n0:19:52\tSPEAKER_04\n Also, had I not been intrigued about the pen.\n\n0:19:57\tSPEAKER_04\n I don't think I would have used it at all.\n\n0:19:59\tSPEAKER_04\n I didn't write barely anything.\n\n0:20:01\tSPEAKER_02\n Yeah, I think I was taking notes more often than usually just coming to the pen.\n\n0:20:05\tSPEAKER_02\n That's true.\n\n0:20:08\tSPEAKER_01\n It was pretty cool tack, though.\n\n0:20:12\tSPEAKER_02\n I am disappointed I didn't get a note back from my personal coach.\n\n0:20:17\tSPEAKER_03\n Yeah, is you writing a personal coach?\n\n0:20:19\tSPEAKER_03\n Yeah, but I didn't get a sense of it.\n\n0:20:23\tSPEAKER_03\n What if you get a response two or three months from now?\n\n0:20:27\tSPEAKER_01\n I don't think we can.\n\n0:20:29\tSPEAKER_01\n It attempts to contact the coach.\n\n0:20:32\tSPEAKER_02\n Well, what kind of coaching is that really?\n\n0:20:34\tSPEAKER_02\n What if I really needed something?\n\n0:20:37\tSPEAKER_04\n I think there was a lot of room for creativity.\n\n0:20:42\tSPEAKER_04\n We could do whatever we basically wanted until the budget came down on us.\n\n0:20:48\tSPEAKER_02\n And even then, we did get a decent product turned out, although it's not everything we wanted it to be.\n\n0:20:53\tSPEAKER_04\n Yeah, with the natural look.\n\n0:20:56\tSPEAKER_02\n Organic, really.\n\n0:20:59\tSPEAKER_01\n They had a peeler in here.\n\n0:21:04\tSPEAKER_02\n And highly resourceful teammates might I add, which is always a plus.\n\n0:21:09\tSPEAKER_01\n Yeah, I thought it was really creative.\n\n0:21:12\tSPEAKER_02\n Yeah, I'm impressed.\n\n0:21:15\tSPEAKER_03\n The teamwork was good.\n\n0:21:17\tSPEAKER_03\n The proof that we were always full.\n\n0:21:19\tSPEAKER_02\n We didn't waste a single bit of play to waste every day.\n\n0:21:22\tSPEAKER_02\n Nice.\n\n0:21:23\tSPEAKER_02\n All four of those little containers.\n\n0:21:25\tSPEAKER_03\n I guess the multicolored wave pattern.\n\n0:21:28\tSPEAKER_03\n My one criticism was that we didn't have enough colors to work with.\n\n0:21:32\tSPEAKER_02\n You could have developed multiple skins, really.\n\n0:21:35\tSPEAKER_02\n I know.\n\n0:21:36\tSPEAKER_02\n More colors.\n\n0:21:37\tSPEAKER_02\n Amazing.\n\n0:21:38\tSPEAKER_02\n Oh, wow.\n\n0:21:40\tSPEAKER_01\n What did you guys think about the roles?\n\n0:21:48\tSPEAKER_02\n They were good.\n\n0:21:50\tSPEAKER_03\n Yes.\n\n0:21:51\tSPEAKER_03\n What kind of fun.\n\n0:21:52\tSPEAKER_03\n Yeah.\n\n0:21:53\tSPEAKER_03\n It was.\n\n0:21:56\tSPEAKER_03\n I think it was pretty clever because we were never able to get too far off track.\n\n0:22:01\tSPEAKER_03\n I think it was because the information came in at the right time.\n\n0:22:04\tSPEAKER_03\n True.\n\n0:22:05\tSPEAKER_03\n Kind of filled in the gaps enough.\n\n0:22:07\tSPEAKER_03\n The same time you had enough room to kind of just make things up.\n\n0:22:10\tSPEAKER_03\n Do you know, just kind of that.\n\n0:22:12\tSPEAKER_02\n Do I just feel like the level of information dropped off severely over the course of the day?\n\n0:22:16\tSPEAKER_03\n Yeah.\n\n0:22:17\tSPEAKER_02\n I mean, maybe it's just me, but I didn't actually get any information.\n\n0:22:21\tSPEAKER_02\n That's presentation at all.\n\n0:22:23\tSPEAKER_02\n That's true.\n\n0:22:24\tSPEAKER_00\n I got this.\n\n0:22:25\tSPEAKER_02\n I didn't even get email.\n\n0:22:26\tSPEAKER_02\n Like, that was it.\n\n0:22:28\tSPEAKER_02\n So, yeah, I feel like that was slightly lacking, but then, you know, fill in the blanks on your own level of creativity up.\n\n0:22:36\tSPEAKER_04\n Well, I think that was, I think that was an issue I kept finding with regard to.\n\n0:22:39\tSPEAKER_04\n What to do.\n\n0:22:40\tSPEAKER_04\n Well, no, but also, yeah, when I was reporting about what each of us was doing as often confused as to what you were doing.\n\n0:22:47\tSPEAKER_04\n It was a bit much.\n\n0:22:49\tSPEAKER_04\n And then I also felt like, you know, a lot of our discussion would center around specifically what my task was because that was kind of the interface question.\n\n0:22:57\tSPEAKER_04\n Which is what the whole project was about.\n\n0:23:00\tSPEAKER_04\n Very much so.\n\n0:23:02\tSPEAKER_04\n But, and then in the end, I think our job's kind of melted together.\n\n0:23:05\tSPEAKER_04\n Yeah.\n\n0:23:06\tSPEAKER_03\n That was fun.\n\n0:23:07\tSPEAKER_03\n I think it's fun.\n\n0:23:08\tSPEAKER_03\n The most helpful thing out of everything was getting the PowerPoint slides already put together.\n\n0:23:14\tSPEAKER_03\n Yeah.\n\n0:23:15\tSPEAKER_02\n We didn't have that.\n\n0:23:16\tSPEAKER_03\n There's no way we could have got all that done in time.\n\n0:23:18\tSPEAKER_02\n Very much so.\n\n0:23:20\tSPEAKER_01\n Cool.\n\n0:23:22\tSPEAKER_04\n I think your leadership was quite good.\n\n0:23:24\tSPEAKER_01\n It was.\n\n0:23:25\tSPEAKER_01\n She said, she actually made a comment off on the board.\n\n0:23:28\tSPEAKER_01\n You're getting into this.\n\n0:23:29\tSPEAKER_01\n And I really, it's true.\n\n0:23:30\tSPEAKER_01\n I did get, I felt like I got way too into it.\n\n0:23:32\tSPEAKER_02\n That's kind of a good thing though.\n\n0:23:34\tSPEAKER_01\n I feel like I slept in a lot.\n\n0:23:35\tSPEAKER_02\n You know, the rest of us in the structure work with.\n\n0:23:37\tSPEAKER_04\n So, hey.\n\n0:23:38\tSPEAKER_04\n So, is that the first time you're taking on that kind of rule?\n\n0:23:40\tSPEAKER_01\n The first time you've ever done anything like, yeah, project management.\n\n0:23:44\tSPEAKER_01\n I use the organized crap.\n\n0:23:45\tSPEAKER_01\n It's one thing to do, you know, set up a party with your friends.\n\n0:23:48\tSPEAKER_01\n Yeah.\n\n0:23:49\tSPEAKER_01\n You know, little second.\n\n0:23:51\tSPEAKER_01\n I think you guys felt that you could keep the, yeah, suspension of disbelief kind of like, like the role.\n\n0:23:57\tSPEAKER_02\n Yeah.\n\n0:23:58\tSPEAKER_02\n Except for a couple moments where it just got out of hand and I knew we were all flying through our teeth.\n\n0:24:02\tSPEAKER_04\n I had to admit, as soon as we started, I mean, as soon as we got the play-doh.\n\n0:24:08\tSPEAKER_04\n I can only imagine.\n\n0:24:10\tSPEAKER_04\n You know, the whole concept of really trying to stick with reality went out the window.\n\n0:24:14\tSPEAKER_04\n Yeah.\n\n0:24:15\tSPEAKER_01\n Yeah.\n\n0:24:17\tSPEAKER_01\n Maybe it, it like us, you know.\n\n0:24:19\tSPEAKER_01\n Absolutely.\n\n0:24:21\tSPEAKER_01\n Like us to like, like, an Erimo control or a spaceship, which is a spaceship like us.\n\n0:24:25\tSPEAKER_01\n Do you guys ever used to build a spaceship like us?\n\n0:24:27\tSPEAKER_00\n Yeah.\n\n0:24:28\tSPEAKER_00\n Still have been in those.\n\n0:24:29\tSPEAKER_01\n Totally.\n\n0:24:30\tSPEAKER_01\n Best spaceships ever.\n\n0:24:31\tSPEAKER_01\n You guys felt like there's enough teamwork in all.\n\n0:24:33\tSPEAKER_02\n Yeah.\n\n0:24:34\tSPEAKER_02\n Thanks, though.\n\n0:24:36\tSPEAKER_01\n Yeah.\n\n0:24:37\tSPEAKER_01\n No, I don't know.\n\n0:24:41\tSPEAKER_01\n I don't know.\n\n0:24:42\tSPEAKER_01\n I don't know.\n\n0:24:43\tSPEAKER_01\n I was just.\n\n0:24:44\tSPEAKER_02\n No, we didn't actually, I mean, other than minor discussion meetings, there wasn't, except for the actual building.\n\n0:24:48\tSPEAKER_02\n Yeah.\n\n0:24:49\tSPEAKER_02\n But I feel like if this was a team project, there actually would have been much more of the collaborative, like brainstorming, use the board.\n\n0:24:56\tSPEAKER_02\n Well, and this would have been six months worth of work, not like three hours worth of meetings.\n\n0:25:02\tSPEAKER_04\n I mean, I think had the issue being more serious, it would probably would have brainstormed more during our meetings.\n\n0:25:06\tSPEAKER_04\n That's true.\n\n0:25:07\tSPEAKER_04\n Yeah.\n\n0:25:08\tSPEAKER_01\n Of course, I'm unconscious of the idea of the project manager asking if you guys feel like there's a team.\n\n0:25:17\tSPEAKER_01\n That's that kind of like, like, yeah, that is kind of interesting.\n\n0:25:23\tSPEAKER_01\n It's kind of fascinating with it.\n\n0:25:26\tSPEAKER_01\n I mean, the whole process is.\n\n0:25:28\tSPEAKER_03\n I wonder why, is there anything about the way that we got so much commitment?\n\n0:25:31\tSPEAKER_03\n What was the kept us from going to the board?\n\n0:25:34\tSPEAKER_01\n I don't know.\n\n0:25:35\tSPEAKER_01\n I don't know if there was a right.\n\n0:25:37\tSPEAKER_02\n Mine was the mics.\n\n0:25:38\tSPEAKER_02\n I didn't feel like getting up and down and dealing with all these wires.\n\n0:25:40\tSPEAKER_02\n I was afraid of the brakes.\n\n0:25:41\tSPEAKER_03\n The mics are loose and at each time you get up, it's a possibility of tripping over something like, contangle there.\n\n0:25:48\tSPEAKER_04\n Well, I don't know what I would have shown on that board.\n\n0:25:50\tSPEAKER_02\n True.\n\n0:25:51\tSPEAKER_02\n But it didn't even occur to me as an option.\n\n0:25:53\tSPEAKER_02\n I mean, I don't know that I would have, but I know that I consciously didn't.\n\n0:25:56\tSPEAKER_04\n I mean, it's just like the paper.\n\n0:25:57\tSPEAKER_04\n I don't know what I really need the paper for.\n\n0:25:59\tSPEAKER_04\n True.\n\n0:26:00\tSPEAKER_04\n Because I've got this laptop.\n\n0:26:03\tSPEAKER_04\n Yeah.\n\n0:26:04\tNone\n Send it.\n\n0:26:05\tSPEAKER_04\n I just use it because it's literally right in front of me.\n\n0:26:08\tSPEAKER_01\n I want to see the output files from the digital paper.\n\n0:26:12\tSPEAKER_01\n I know.\n\n0:26:13\tSPEAKER_01\n My handwriting looks like digitized because my handwriting is crap.\n\n0:26:17\tSPEAKER_01\n Yeah.\n\n0:26:18\tSPEAKER_01\n I mean, see what it looks like in PDF format or something.\n\n0:26:23\tSPEAKER_03\n Usually I would do a lot more to it, like too, but I didn't.\n\n0:26:25\tSPEAKER_03\n I know.\n\n0:26:26\tSPEAKER_02\n I felt like I needed to be professional, so I didn't like to roll my paper and stuff.\n\n0:26:31\tSPEAKER_02\n Okay, well, not entirely.\n\n0:26:33\tSPEAKER_02\n But still, I do have less than I usually do.\n\n0:26:37\tSPEAKER_01\n I'm curious about what the debriefing is going to be like.\n\n0:26:41\tSPEAKER_01\n You know, like what is the, well, exactly we're looking for here.\n\n0:26:45\tSPEAKER_04\n So is this all I need to go through?\n\n0:26:47\tSPEAKER_01\n I don't know.\n\n0:26:48\tSPEAKER_01\n I'm not sure what the new idea is found.\n\n0:26:50\tSPEAKER_01\n It is about ideas.\n\n0:26:52\tSPEAKER_02\n Did it just say in the email that we needed to discuss that?\n\n0:26:55\tSPEAKER_01\n Well, that's the thing I got in the email.\n\n0:26:57\tSPEAKER_01\n I got this PowerPoint file, but this slide was.\n\n0:27:00\tSPEAKER_01\n That slide was like that.\n\n0:27:02\tSPEAKER_01\n I didn't change this one at all.\n\n0:27:04\tSPEAKER_01\n Wow.\n\n0:27:06\tSPEAKER_01\n I guess one the right track.\n\n0:27:09\tSPEAKER_04\n Any new ideas with regard to environmental concepts?\n\n0:27:15\tSPEAKER_04\n No.\n\n0:27:16\tSPEAKER_02\n I kind of like.\n\n0:27:17\tSPEAKER_02\n I think they still do their job.\n\n0:27:19\tSPEAKER_02\n Yeah, you're fine, actually.\n\n0:27:20\tSPEAKER_02\n I am thinking outside the little square box, though, but literally in like form.\n\n0:27:25\tSPEAKER_03\n Yeah, maybe a circle would be all right.\n\n0:27:28\tSPEAKER_01\n Yeah, different.\n\n0:27:29\tSPEAKER_01\n This is going to make you wonder.\n\n0:27:30\tSPEAKER_01\n I mean, how much can you do with remote control?\n\n0:27:33\tSPEAKER_01\n It's like inventing a new car.\n\n0:27:35\tSPEAKER_02\n Yeah, yeah, you got to be technically car shaped and won't fit on the road.\n\n0:27:38\tSPEAKER_02\n Yeah.\n\n0:27:41\tSPEAKER_02\n Don't know.\n\n0:27:42\tSPEAKER_01\n Hmm.\n\n0:27:44\tSPEAKER_01\n Okay.\n\n0:27:45\tSPEAKER_01\n I know.\n\n0:27:46\tSPEAKER_01\n I'm going back into it.\n\n0:27:47\tSPEAKER_01\n I don't know.\n\n0:27:49\tSPEAKER_01\n I think this is.\n\n0:27:50\tSPEAKER_02\n Oh, how long was I being supposed to be?\n\n0:27:52\tSPEAKER_02\n How much time?\n\n0:27:53\tSPEAKER_01\n 40ish.\n\n0:27:54\tSPEAKER_01\n I wish it go on a bit.\n\n0:27:55\tSPEAKER_01\n Yeah, about the project you've out.\n\n0:27:59\tSPEAKER_01\n I don't know, but you guys, but I felt like a bit.\n\n0:28:03\tSPEAKER_01\n Understimulated on the whole thing.\n\n0:28:06\tSPEAKER_01\n Like what?\n\n0:28:07\tSPEAKER_01\n Like, you know, what am I really doing?\n\n0:28:09\tSPEAKER_01\n You know, what is.\n\n0:28:10\tSPEAKER_02\n Yeah.\n\n0:28:11\tSPEAKER_02\n At the beginning, it started out and I felt actually like under pressure like the first couple.\n\n0:28:15\tSPEAKER_02\n Yeah.\n\n0:28:16\tSPEAKER_02\n Taking out of work.\n\n0:28:17\tSPEAKER_02\n And I was like, had like all these brainstorming I was doing and then suddenly I was like, well, it's just another two-minute presentation that you guys don't really care about.\n\n0:28:24\tSPEAKER_02\n I knew I said, well, hey.\n\n0:28:26\tSPEAKER_02\n I think it was the real.\n\n0:28:27\tSPEAKER_02\n You know what I mean?\n\n0:28:28\tSPEAKER_02\n Like, we also knew when we were headed with it so it didn't feel.\n\n0:28:30\tSPEAKER_02\n Definitely wouldn't.\n\n0:28:31\tSPEAKER_02\n Like, it mattered.\n\n0:28:32\tSPEAKER_03\n I just filled out the question I was marking and probably higher in terms of how much I had to, how much I stressed over it.\n\n0:28:38\tSPEAKER_03\n And by the time I got to the last one, I was like, what I would.\n\n0:28:41\tSPEAKER_03\n Yeah.\n\n0:28:42\tSPEAKER_04\n I think there's also realization of basically just copying face.\n\n0:28:47\tSPEAKER_04\n What's given to you?\n\n0:28:48\tSPEAKER_04\n Yeah.\n\n0:28:49\tSPEAKER_04\n Which wasn't so clear to me at the beginning.\n\n0:28:52\tSPEAKER_01\n I actually didn't do that at all though.\n\n0:28:54\tSPEAKER_01\n Every single one of the presentations, I either added slides or added them.\n\n0:28:58\tSPEAKER_01\n Oh, I added like five slides.\n\n0:29:00\tSPEAKER_02\n I only got like ones.\n\n0:29:02\tSPEAKER_03\n I just got blank ones.\n\n0:29:03\tSPEAKER_02\n What, really?\n\n0:29:04\tSPEAKER_02\n My slides were all like they'd have a title maybe.\n\n0:29:06\tSPEAKER_01\n Yeah, my name.\n\n0:29:07\tSPEAKER_01\n And they were just empty.\n\n0:29:08\tSPEAKER_01\n They didn't have, they didn't like, mine, yeah, they didn't come like this.\n\n0:29:11\tSPEAKER_01\n Like, this was what it looks like.\n\n0:29:13\tSPEAKER_01\n Like with those boarddardi on it.\n\n0:29:14\tSPEAKER_01\n Literally, just like that.\n\n0:29:15\tSPEAKER_01\n And.\n\n0:29:16\tSPEAKER_01\n And.\n\n0:29:17\tSPEAKER_02\n And why yours always looked so more complicated.\n\n0:29:19\tSPEAKER_02\n I didn't need it slides.\n\n0:29:21\tSPEAKER_02\n I think I added a slide one time.\n\n0:29:25\tSPEAKER_04\n I added many slides every time.\n\n0:29:28\tSPEAKER_04\n Hey, what the whole new background.\n\n0:29:30\tSPEAKER_02\n That was what they call.\n\n0:29:31\tSPEAKER_03\n That was class.\n\n0:29:32\tSPEAKER_03\n High moment.\n\n0:29:33\tSPEAKER_03\n I'll explain.\n\n0:29:34\tSPEAKER_03\n You can see.\n\n0:29:35\tSPEAKER_01\n I mean, the thoughts come to mind.\n\n0:29:43\tSPEAKER_02\n I want to know how our products were there.\n\n0:29:46\tSPEAKER_03\n I think you would fail.\n\n0:29:48\tSPEAKER_02\n I think you would take a special look like that.\n\n0:29:51\tSPEAKER_00\n Okay.\n\n0:29:52\tSPEAKER_02\n An apple would have read it by now.\n\n0:29:55\tSPEAKER_02\n He even has a physical.\n\n0:29:59\tSPEAKER_02\n But you know the whole.\n\n0:30:01\tSPEAKER_04\n Even you.\n\n0:30:02\tSPEAKER_03\n We kind of designed it to look a little bit like face.\n\n0:30:07\tSPEAKER_04\n Here, but it's happy face.\n\n0:30:09\tSPEAKER_04\n Actually, that looked a lot more like a ton.\n\n0:30:12\tSPEAKER_04\n It's previous to build other design modifications.\n\n0:30:22\tSPEAKER_04\n I hope you appreciate the incorporation of some tinfoil from a random pick up bar that we consumed by accident.\n\n0:30:34\tSPEAKER_01\n Interesting.\n\n0:30:37\tSPEAKER_02\n I'm interesting day.\n\n0:30:39\tSPEAKER_04\n I say so.\n\n0:30:40\tSPEAKER_04\n So again, I reiterate my question of how different we are compared to the other groups, especially between culture groups.\n\n0:30:48\tSPEAKER_01\n I don't know.\n\n0:30:53\tSPEAKER_01\n It seems like everything flowed pretty logically, you know, from the basics to the concept.\n\n0:30:58\tSPEAKER_01\n Although the whole concept thing, the whole concept's face.\n\n0:31:01\tSPEAKER_01\n I don't think I really understood like the concept.\n\n0:31:04\tSPEAKER_01\n Well, the idea.\n\n0:31:05\tSPEAKER_01\n Okay.\n\n0:31:06\tSPEAKER_01\n Conocional item.\n\n0:31:07\tSPEAKER_01\n Yeah, I mean, it's like I have a concept of a mug's material.\n\n0:31:11\tSPEAKER_01\n It's just maybe that's what it is.\n\n0:31:13\tSPEAKER_01\n Yeah.\n\n0:31:14\tSPEAKER_01\n You know, maybe rather than concepts, it should be thought of.\n\n0:31:17\tSPEAKER_01\n I thought of it.\n\n0:31:18\tSPEAKER_01\n I thought of it right other than in terms of concepts.\n\n0:31:19\tSPEAKER_01\n I thought of it in terms of like proposed idea.\n\n0:31:27\tSPEAKER_01\n And then the final would be back to the actual specified prototype or whatever.\n\n0:31:31\tSPEAKER_01\n I don't know.\n\n0:31:34\tSPEAKER_01\n But.\n\n0:31:37\tSPEAKER_01\n Bono is kind of interesting.\n\n0:31:40\tSPEAKER_01\n So we have more slides.\n\n0:31:42\tSPEAKER_01\n No, just this closing one.\n\n0:31:44\tSPEAKER_01\n I mean, the established at the cost weren't really within budget, but we could.\n\n0:31:48\tSPEAKER_02\n We got it to be.\n\n0:31:50\tSPEAKER_01\n We did the project evaluation based on.\n\n0:31:55\tSPEAKER_01\n Sarah's evaluation of.\n\n0:31:57\tSPEAKER_02\n There was really technically an evaluation of the products, not the project in general.\n\n0:32:04\tSPEAKER_02\n Which I'm not sure is the same thing at the time that just made more sense.\n\n0:32:07\tSPEAKER_02\n But I could see if they were really asking about us.\n\n0:32:12\tSPEAKER_01\n Yeah.\n\n0:32:15\tSPEAKER_01\n Because we did we had a fight think about it.\n\n0:32:19\tSPEAKER_01\n Yeah.\n\n0:32:23\tSPEAKER_01\n And it's all recorded.\n\n0:32:25\tSPEAKER_01\n And what I'm going to put.\n\n0:32:26\tSPEAKER_01\n I'm supposed to do this final report thing at the end.\n\n0:32:29\tSPEAKER_01\n So I'll put all that into the final report as well.\n\n0:32:32\tSPEAKER_01\n Or as much as seems like maybe not like that.\n\n0:32:35\tSPEAKER_01\n Articles and stuff like because.\n\n0:32:37\tSPEAKER_01\n Yeah.\n\n0:32:38\tSPEAKER_01\n And so forth.\n\n0:32:39\tSPEAKER_01\n But up with my students.\n\n0:32:40\tSPEAKER_03\n Maybe so hopefully we get a copy of the recording.\n\n0:32:43\tSPEAKER_02\n I've had done.\n\n0:32:46\tSPEAKER_02\n I've done transcription before and it's really ridiculous how many words people say like.\n\n0:32:51\tSPEAKER_02\n Just in the middle of the sentences like that that mean nothing.\n\n0:32:54\tSPEAKER_01\n There's a whole branch of psychology that looks into that.\n\n0:32:56\tSPEAKER_01\n Second, the sixth.\n\n0:32:57\tSPEAKER_01\n What the.\n\n0:32:58\tSPEAKER_01\n Is guy sitting here.\n\n0:32:59\tSPEAKER_01\n Yeah, he's studying.\n\n0:33:00\tSPEAKER_01\n Fill it works or something.\n\n0:33:01\tSPEAKER_03\n Yeah, they're called the disfluencies.\n\n0:33:03\tSPEAKER_03\n Disfluencies.\n\n0:33:04\tSPEAKER_02\n That's a good word for it.\n\n0:33:06\tSPEAKER_01\n Yeah, we like our fancy phrases.\n\n0:33:08\tSPEAKER_01\n And just add some prefixes.\n\n0:33:10\tSPEAKER_02\n Sounds classier.\n\n0:33:11\tSPEAKER_02\n Exactly.\n\n0:33:12\tSPEAKER_01\n I will save this into the.\n\n0:33:20\tSPEAKER_03\n I find myself hitting the send and receive button.\n\n0:33:22\tSPEAKER_03\n You know what?\n\n0:33:23\tSPEAKER_03\n I can.\n\n0:33:24\tSPEAKER_02\n I can.\n\n0:33:25\tSPEAKER_01\n Yeah, I didn't.\n\n0:33:26\tSPEAKER_01\n Yeah.\n\n0:33:27\tSPEAKER_01\n Come on, give me some information.\n\n0:33:29\tSPEAKER_01\n Well, to be fair, we're hooked.\n\n0:33:30\tSPEAKER_01\n We're all hooked on the internet.\n\n0:33:32\tSPEAKER_01\n Yeah.\n\n0:33:33\tSPEAKER_04\n So I mean, I do.\n\n0:33:34\tSPEAKER_04\n We are addicts.\n\n0:33:35\tSPEAKER_04\n That's scary.\n\n0:33:36\tSPEAKER_04\n I'll just throw on that.\n\n0:33:38\tSPEAKER_01\n I know, imagine we went the first 10, 15 years of our lives without the internet.\n\n0:33:43\tSPEAKER_01\n It's only the last 10 that were like, what was the internet?\n\n0:33:46\tSPEAKER_01\n I mean, it's just in the past five.\n\n0:33:48\tSPEAKER_01\n We've gone from 28 eight modems to broadband all the time.\n\n0:33:51\tSPEAKER_04\n Do you know, I think we've had internet for like 18 years.\n\n0:33:55\tSPEAKER_01\n No, we have, but not in the sense it's so on.\n\n0:33:58\tSPEAKER_02\n You know, my grandparents had an 80s and I got it in 94.\n\n0:34:02\tSPEAKER_02\n But still.\n\n0:34:03\tSPEAKER_02\n It's crazy.\n\n0:34:04\tSPEAKER_03\n So in the 80s.\n\n0:34:07\tSPEAKER_02\n My grandfather does computer science back in the States.\n\n0:34:10\tSPEAKER_02\n And so they had an EDU and Gov network.\n\n0:34:13\tSPEAKER_02\n There's basically the fundamental structures.\n\n0:34:16\tSPEAKER_02\n But it wasn't a household house sold yet.\n\n0:34:19\tSPEAKER_02\n Because it hadn't been.\n\n0:34:21\tSPEAKER_04\n Yeah, it was to the like seven universities or something.\n\n0:34:24\tSPEAKER_02\n Yeah, that was him.\n\n0:34:27\tSPEAKER_04\n You guys ready to celebrate?\n\n0:34:30\tSPEAKER_04\n Yeah, that's how I said that.\n\n0:34:31\tSPEAKER_04\n Yeah, that's how I said that includes like,\n\n0:34:34\tSPEAKER_00\n something exciting.\n\n0:34:35\tSPEAKER_01\n Should probably call that meeting to an end. I think that's closer.\n\n0:34:41\tSPEAKER_03\n It's been 40 minutes or so.\n\n0:34:43\tSPEAKER_03\n Because it's been long enough.\n\n0:34:45\tSPEAKER_04\n Celebrate.\n\n0:34:46\tSPEAKER_04\n Where you find that?\n\n0:34:48\tSPEAKER_02\n I have no idea.\n\n0:34:50\tSPEAKER_03\n It's at the only song you have.\n\n0:34:52\tSPEAKER_03\n There's another one.\n\n0:34:53\tSPEAKER_01\n It's just where those media players.\n\n0:34:55\tSPEAKER_01\n Huh?\n\n0:34:56\tSPEAKER_01\n Yeah, awesome.\n\n0:34:57\tSPEAKER_01\n The default track.\n\n0:34:58\tSPEAKER_01\n I thought it was David Burns looking to the eyeball.\n\n0:35:00\tSPEAKER_01\n That's when it seems to be shipping with it.\n\n0:35:02\tSPEAKER_01\n I don't really ship it for a while.\n\n0:35:03\tSPEAKER_01\n Maybe this is a new version.\n\n0:35:05\tSPEAKER_02\n So is that a close?\n\n0:35:06\tSPEAKER_02\n Yeah, I guess we'll call it an end of the meeting.\n\n0:35:09\tSPEAKER_01\n Okay, the end of the meeting.\n\n0:35:10\tSPEAKER_01\n Fab.\n\n0:35:11\tSPEAKER_02\n Thank you, gentlemen.\n\n0:35:14\tSPEAKER_02\n Thank you.\n\n", "summary": [{"summary_text": "The team is working on developing a remote control with voice recognition. They have a detailed design meeting where they will look at the prototype. Speaker is supposed to read the minutes from the previous meeting. He will open the minutes slowly and click on the bullet points."}]}