{"filename": "./data/ES2015c.txt", "transcript": "0:00:30\tNone\n SD 1 SD 1, yn sg SD 1.\n\n0:00:53\tSPEAKER_01\n SDist deductil\n\n0:00:57\tNone\n SD 3. SD 3 On the agenda for this particular meeting will have your three presentations on what you've done since our last meeting after we came up with some general ideas of our design.\n\n0:01:11\tSPEAKER_01\n And then we have to make some key decisions on our remote control concept and how we're going to make it what material we're going to use and that sort of thing.\n\n0:01:22\tSPEAKER_01\n The meeting will be 40 minutes long and we'll once again have Poppy as our first presenter.\n\n0:01:31\tSPEAKER_01\n Alright, now we'll switch up PowerPoint.\n\n0:01:37\tSPEAKER_03\n Thank you.\n\n0:01:40\tNone\n Okay.\n\n0:01:48\tSPEAKER_03\n Should be just loading.\n\n0:01:53\tSPEAKER_01\n Okay.\n\n0:01:54\tSPEAKER_00\n Oh, although I can't see it on my screen.\n\n0:01:57\tSPEAKER_00\n Let's just go here.\n\n0:02:02\tSPEAKER_00\n Okay.\n\n0:02:03\tSPEAKER_00\n We've been doing some research into the different components that we could use.\n\n0:02:07\tSPEAKER_00\n What's available to us to actually make the remote control.\n\n0:02:14\tSPEAKER_00\n First of all, we have to look at how the remote control is actually made and what is it happens inside the casing, which is what you're feeling.\n\n0:02:23\tSPEAKER_00\n The main internal feature is a circuit board which contains all the electronics and also the contacts with the power source, which is not necessarily a battery is without to see.\n\n0:02:35\tSPEAKER_00\n There are several components of the circuit board that we need to consider where we'll be getting them from what they'll be made of, including the integrated circuit, which is also known as the chip, which is where all the main information is contained.\n\n0:02:53\tSPEAKER_00\n Diode, transistors, resonators, resistors and capacitors all need to be considered as well and all their positioning in the circuit.\n\n0:03:05\tSPEAKER_01\n Are they all included like mandatory or are there these different options?\n\n0:03:08\tSPEAKER_00\n They're all different options.\n\n0:03:10\tSPEAKER_00\n Apart from the chip, which we will probably decide whether we buy a simple or regular advance.\n\n0:03:16\tSPEAKER_00\n All the other things are individual components that we'd have to get in separately and work out the most effective circuit, including all the wires and that and the LED.\n\n0:03:28\tSPEAKER_00\n That's the light emitting diode, so we've got flexibility with colours and things with that as well.\n\n0:03:37\tSPEAKER_00\n There are lots of different possibilities for the energy source. We could use a basic battery, but that brings with it, like there needs to be recharged and the bulk, the sides of it as well.\n\n0:03:48\tSPEAKER_00\n They're not so great to dispose of environmentally.\n\n0:03:52\tSPEAKER_00\n There's the hand-powered dynamo, which is the sort of thing that was used for torches 50 years ago, a bit out of date.\n\n0:04:00\tSPEAKER_00\n Kinetic energy is something that's been recently developed. What is a hand-powered dynamo? Where you manually charge up the power.\n\n0:04:09\tSPEAKER_00\n Just every once in a while.\n\n0:04:12\tSPEAKER_00\n Sorry? Just every once in a while, constantly.\n\n0:04:14\tSPEAKER_00\n Yeah, every once in a while, I think.\n\n0:04:15\tSPEAKER_01\n It'd be kind of strange to always be able to do that.\n\n0:04:18\tSPEAKER_00\n Yeah, be like going a step back in time. I don't think it would really be with cutting edge technology.\n\n0:04:23\tSPEAKER_00\n Whereas kinetic energy is a new idea that's been used by some watches and other devices where you just shake the device, and it gives it power.\n\n0:04:34\tSPEAKER_00\n The kinetic energy is transformed into power to make the circuit work.\n\n0:04:41\tSPEAKER_00\n Or the solar power, which we're considering inside a building, which is where it's going to be used, might not be quite so useful.\n\n0:04:51\tSPEAKER_00\n But good to look into. Renewable energy. Always the way.\n\n0:04:56\tSPEAKER_00\n Lots of considerations for the case. Like what sort of shape it would be curved or flat.\n\n0:05:02\tSPEAKER_00\n That's got a lot to do with the ergonomics. I think how it's comfortable and sits in the hand.\n\n0:05:07\tSPEAKER_00\n We don't want something that's huge and you can't pick up or too small or too sliding.\n\n0:05:13\tSPEAKER_00\n I know I've had a remote control before, which you can tell which was the front and the back.\n\n0:05:19\tSPEAKER_00\n I had so many buttons on and the shape was so symmetrical that I'd be pressing like a volume button instead of the on button.\n\n0:05:27\tSPEAKER_00\n Because you can't really see which way around it.\n\n0:05:30\tSPEAKER_00\n We also can choose what materials. We could use metal. We could use rubber, which might be more ideal for the anti-RSI.\n\n0:05:42\tSPEAKER_00\n It's the same rubber that's used in stress balls and things like that. So it's very soft and not so stressful on your hands.\n\n0:05:51\tSPEAKER_00\n Wood. Again, stepping back inside, I don't think that's quite up to date with what we're looking for here.\n\n0:05:59\tSPEAKER_00\n Detainium is not going to be possible. It's just a beyond our budget really. But what would it be for future projects?\n\n0:06:09\tSPEAKER_00\n I have a choice of buttons as well. We've developed some good advances in technology with our research team.\n\n0:06:16\tSPEAKER_00\n We've found some new multiple options, scroll buttons. I think that was brought up before.\n\n0:06:26\tSPEAKER_00\n They're basically quite flexible design. Modern. You don't have to use individual buttons.\n\n0:06:32\tSPEAKER_00\n You can just slide up and down. I'm sure we're all quite familiar with those on mobile or computer laptop.\n\n0:06:39\tSPEAKER_01\n One thing with the scroll buttons though, we would have to have an LCD display.\n\n0:06:47\tSPEAKER_00\n That would be the lower dark thing.\n\n0:06:50\tSPEAKER_00\n If we have...\n\n0:06:52\tSPEAKER_00\n Going on to that later with the LCD, that means we need an advanced chip.\n\n0:06:57\tSPEAKER_00\n It's unlikely that that's going to be an average. Also we've got the integrated push button, which is what we're most familiar with.\n\n0:07:05\tSPEAKER_00\n This is the most straightforward, but you can incorporate that with the scroll button as well.\n\n0:07:11\tSPEAKER_00\n Good decision to make there. This is what I was just saying for.\n\n0:07:14\tSPEAKER_00\n Link to the different depends on what type of buttons we have in the inputs.\n\n0:07:19\tSPEAKER_00\n Simple, go with the push button. Regular, you could link with the scroll button.\n\n0:07:27\tSPEAKER_00\n The advanced would have to go with a LCD display.\n\n0:07:33\tSPEAKER_00\n My personal preferences, I think we could go for the kinetic energy source.\n\n0:07:37\tSPEAKER_00\n I think that's quite an advanced technology. It's not been seen before, so it could be quite a novelty factor, attractive as well.\n\n0:07:46\tSPEAKER_00\n Also, energy savings, because you're producing the energy.\n\n0:07:51\tSPEAKER_00\n You don't need an external battery supply or solar panels. You just give it a shake.\n\n0:07:58\tSPEAKER_00\n Sounds brilliant to me.\n\n0:08:00\tSPEAKER_00\n Rubbing casing, I think we're probably the best if we're going for the anti-RSI and more choice with aesthetics.\n\n0:08:09\tSPEAKER_00\n It could be pretty much any color in one.\n\n0:08:12\tSPEAKER_00\n It gives you more flexibility there.\n\n0:08:16\tSPEAKER_00\n Probably the regular chip is supposed to be simple, and we could possibly have the scroll, and the push, but no LCD.\n\n0:08:25\tSPEAKER_00\n We probably can't afford that one.\n\n0:08:27\tSPEAKER_01\n One concern with the rubber casing is that it would be rubber encapsulating all of these chips and diodes and delicate technology as the exterior. This is the one thing that's protecting its innards.\n\n0:08:44\tSPEAKER_00\n I think that would be more internal casing, and the rubber would just be what's in contact with the human hand.\n\n0:08:53\tSPEAKER_01\n Another thing is it might be more difficult.\n\n0:08:55\tSPEAKER_01\n If it's a rubber exterior, we're talking about putting on interchangeable plates.\n\n0:09:00\tSPEAKER_01\n I don't see how a rubber plate going on top would stay there.\n\n0:09:06\tSPEAKER_01\n It would be like a clip on plastic plate.\n\n0:09:10\tSPEAKER_01\n It would work that way.\n\n0:09:12\tSPEAKER_00\n Maybe if it was just more of a rubber coating, which was onto a case, so the whole thing would be removable.\n\n0:09:23\tSPEAKER_03\n Plastic with rubber.\n\n0:09:25\tSPEAKER_00\n I can't think of what.\n\n0:09:28\tSPEAKER_03\n Well, there's a certain phone that has a rubber casing.\n\n0:09:32\tSPEAKER_00\n Or you can get out a casing for iPods and something that's just protective as well.\n\n0:09:38\tSPEAKER_00\n It stops it.\n\n0:09:40\tSPEAKER_00\n It would reduce the impact if it was dropped or something.\n\n0:09:43\tSPEAKER_00\n It wouldn't damage its top.\n\n0:09:46\tSPEAKER_00\n Maybe a mixture of both.\n\n0:09:49\tSPEAKER_02\n The actual remote would be hard plastic.\n\n0:09:51\tSPEAKER_02\n The buttons obviously are rubber.\n\n0:09:55\tSPEAKER_01\n Yeah.\n\n0:09:58\tSPEAKER_01\n That sounds good.\n\n0:10:00\tSPEAKER_01\n Is it possible to put designs onto this type of rubber?\n\n0:10:05\tSPEAKER_00\n As far as I know, it should be.\n\n0:10:08\tSPEAKER_00\n Okay.\n\n0:10:09\tSPEAKER_00\n We'll just say yeah.\n\n0:10:10\tSPEAKER_00\n Yeah.\n\n0:10:11\tSPEAKER_01\n Just one more.\n\n0:10:12\tSPEAKER_01\n Yeah, yeah.\n\n0:10:13\tSPEAKER_01\n All right.\n\n0:10:14\tSPEAKER_01\n I like the kinetic energy source idea.\n\n0:10:16\tSPEAKER_01\n Yeah.\n\n0:10:17\tSPEAKER_01\n I don't know when people will be moving or remote around a lot.\n\n0:10:22\tSPEAKER_01\n But I think that it's worth it.\n\n0:10:24\tSPEAKER_01\n Yeah.\n\n0:10:30\tSPEAKER_01\n Yeah.\n\n0:10:31\tSPEAKER_01\n Yeah.\n\n0:10:32\tSPEAKER_01\n Just for environmental reasons.\n\n0:10:34\tSPEAKER_01\n Yeah.\n\n0:10:35\tSPEAKER_02\n I guess it's a bit scary because it hasn't been done before.\n\n0:10:38\tSPEAKER_00\n Yeah.\n\n0:10:39\tSPEAKER_02\n So it seems we'd have to do more research on it.\n\n0:10:42\tSPEAKER_02\n Or you could have a battery pack.\n\n0:10:44\tSPEAKER_00\n Like a backup.\n\n0:10:45\tSPEAKER_00\n Yeah.\n\n0:10:46\tSPEAKER_02\n There is a one battery.\n\n0:10:47\tSPEAKER_02\n Because most remote's use two batteries, really.\n\n0:10:50\tSPEAKER_02\n Yeah.\n\n0:10:51\tSPEAKER_02\n So it was running off of one battery.\n\n0:10:53\tSPEAKER_00\n It's an alternative just in case.\n\n0:10:56\tSPEAKER_00\n Right.\n\n0:10:57\tSPEAKER_00\n Maybe we could...\n\n0:10:59\tSPEAKER_03\n You were saying about solar power.\n\n0:11:02\tSPEAKER_03\n Maybe not working indoors.\n\n0:11:04\tSPEAKER_03\n That's true.\n\n0:11:05\tSPEAKER_03\n I just thought about it.\n\n0:11:07\tSPEAKER_00\n Yeah.\n\n0:11:08\tSPEAKER_00\n Maybe that could be the backup instead of a battery.\n\n0:11:13\tSPEAKER_02\n Although it's in the sunlight, doesn't it?\n\n0:11:16\tSPEAKER_02\n Yeah.\n\n0:11:17\tSPEAKER_01\n You can't watch TV in the dark then.\n\n0:11:19\tSPEAKER_02\n Yeah.\n\n0:11:20\tSPEAKER_00\n It's true.\n\n0:11:23\tSPEAKER_00\n But it's not you don't need the solar all the time.\n\n0:11:26\tSPEAKER_00\n It can be stored.\n\n0:11:27\tSPEAKER_00\n It can be like you can have the solar energy and then it can store that energy.\n\n0:11:32\tSPEAKER_01\n It just needs to be in light for a certain amount of time per day.\n\n0:11:35\tSPEAKER_01\n Like a few hours a day.\n\n0:11:37\tSPEAKER_02\n I think that might be a little impractical.\n\n0:11:39\tSPEAKER_02\n Yeah.\n\n0:11:40\tSPEAKER_01\n I think sometimes it's just shoved under a cushion.\n\n0:11:42\tSPEAKER_01\n That's true.\n\n0:11:43\tSPEAKER_00\n You could easily...\n\n0:11:44\tSPEAKER_00\n People don't want to have to worry about that.\n\n0:11:46\tSPEAKER_00\n Yeah.\n\n0:11:47\tSPEAKER_00\n I suppose it would be really annoying if you get to...\n\n0:11:49\tSPEAKER_00\n I suppose it's a huge one where it votes.\n\n0:11:50\tSPEAKER_00\n It's a kinetic thing.\n\n0:11:51\tSPEAKER_00\n I think it's best about that.\n\n0:11:52\tSPEAKER_00\n It's instant energy.\n\n0:11:53\tSPEAKER_00\n You don't have to...\n\n0:11:54\tSPEAKER_00\n You can shake it a few times or whatever.\n\n0:11:56\tSPEAKER_00\n Or just like work it up when you're going to...\n\n0:11:58\tSPEAKER_00\n Yeah.\n\n0:11:59\tSPEAKER_00\n...use it instead of you don't have to make sure it's in the right place to charge.\n\n0:12:03\tSPEAKER_00\n Yeah.\n\n0:12:04\tSPEAKER_00\n So...\n\n0:12:05\tSPEAKER_01\n Alright.\n\n0:12:06\tSPEAKER_01\n Cool.\n\n0:12:07\tSPEAKER_01\n Okay.\n\n0:12:08\tSPEAKER_01\n Is that the end of your presentation?\n\n0:12:09\tSPEAKER_01\n Yeah.\n\n0:12:10\tSPEAKER_01\n Alright.\n\n0:12:11\tNone\n Thank you.\n\n0:12:16\tSPEAKER_00\n There we go.\n\n0:12:17\tSPEAKER_00\n It's...\n\n0:12:28\tNone\n Oh.\n\n0:12:43\tSPEAKER_03\n It's not on my screen.\n\n0:12:45\tSPEAKER_03\n Why?\n\n0:12:46\tSPEAKER_00\n It wasn't on my knife.\n\n0:12:47\tSPEAKER_00\n I don't know.\n\n0:12:48\tSPEAKER_00\n I think I just...\n\n0:12:49\tSPEAKER_00\n I just use the mouse one.\n\n0:12:50\tSPEAKER_03\n Oh, okay.\n\n0:12:53\tSPEAKER_01\n Yeah.\n\n0:12:54\tSPEAKER_01\n Yeah.\n\n0:12:55\tSPEAKER_03\n So...\n\n0:12:56\tSPEAKER_03\n I'm just going to go through the interface concept with you tonight.\n\n0:13:01\tSPEAKER_03\n First of all, explain what a user interface is.\n\n0:13:06\tSPEAKER_03\n It's the aspects of the computer system which can be seen or otherwise seen, for example, hair or...\n\n0:13:13\tSPEAKER_03\n...fell, maybe a...\n\n0:13:16\tSPEAKER_03\n...by the human user.\n\n0:13:18\tSPEAKER_03\n And it's also the command that the user uses to control its operation and to input data.\n\n0:13:30\tSPEAKER_03\n There are two types of user interfaces.\n\n0:13:32\tSPEAKER_03\n There's the graphical user interface which emphasizes the use of pictures for our fit and a point device.\n\n0:13:39\tSPEAKER_03\n For example, a mouse for effort control.\n\n0:13:43\tSPEAKER_03\n Is that something like the schools that we were talking about?\n\n0:13:46\tSPEAKER_01\n Oh, okay.\n\n0:13:47\tSPEAKER_03\n Yeah.\n\n0:13:48\tSPEAKER_03\n I'm not really sure about the pictures...\n\n0:13:51\tSPEAKER_03\n Maybe that's on an LCD screen.\n\n0:13:54\tSPEAKER_03\n Or maybe it's the buttons and...\n\n0:13:58\tSPEAKER_03\n...pitch...\n\n0:14:00\tSPEAKER_03\n...shoot something.\n\n0:14:04\tSPEAKER_00\n Yeah.\n\n0:14:05\tSPEAKER_00\n So I suppose that's...\n\n0:14:06\tSPEAKER_01\n Yeah, because...\n\n0:14:07\tSPEAKER_01\n...after?\n\n0:14:08\tSPEAKER_01\n Because the command interface requires you to type textual commands and input at a keyboard.\n\n0:14:14\tSPEAKER_01\n So the numbers are sort of like a keyboard.\n\n0:14:16\tSPEAKER_01\n You're pressing the numbers for...\n\n0:14:18\tSPEAKER_01\n So you want...\n\n0:14:20\tSPEAKER_03\n For the graphical user, you must use some kind of presentation for the graphics.\n\n0:14:25\tSPEAKER_00\n I suppose on some buttons you'd have...\n\n0:14:30\tSPEAKER_00\n...the power would be some kind of symbol.\n\n0:14:34\tSPEAKER_00\n If you wanted to go on to tell a text, I know we're not having that, but a similar thing.\n\n0:14:39\tSPEAKER_00\n There's a little picture with a screen with lines across it, which...\n\n0:14:43\tSPEAKER_00\n...is that sort of thing.\n\n0:14:45\tSPEAKER_00\n The symbol on the button.\n\n0:14:47\tSPEAKER_00\n But if we're having a simplified display, anyway...\n\n0:14:51\tSPEAKER_00\n...we would have to focus so much on that and be more than the numbers in the volume.\n\n0:14:55\tSPEAKER_00\n It would be more command interface.\n\n0:14:57\tSPEAKER_00\n So it needs to think of symbols for the volume display.\n\n0:15:01\tSPEAKER_02\n So it's just graphical for the pointing aspect.\n\n0:15:04\tSPEAKER_02\n The infrared is like that's considered.\n\n0:15:07\tSPEAKER_03\n No, I think it did do with the actual symbols that are on the...\n\n0:15:12\tSPEAKER_03\n...that's on the buttons of the control and...\n\n0:15:15\tSPEAKER_02\n Okay, so when it says pointing, that doesn't include...\n\n0:15:17\tSPEAKER_03\n Well, it could be a school thing and something can come up from this.\n\n0:15:20\tSPEAKER_03\n Yeah, I've learned something about LCD type things.\n\n0:15:23\tSPEAKER_03\n Yeah.\n\n0:15:24\tSPEAKER_03\n Okay.\n\n0:15:25\tSPEAKER_03\n Yeah.\n\n0:15:26\tSPEAKER_03\n But...\n\n0:15:28\tSPEAKER_03\n I think we're gonna go with the command interface, anyway, to make it a little bit...\n\n0:15:33\tSPEAKER_03\n...but we could incorporate some of the graphical uses points...\n\n0:15:40\tSPEAKER_03\n...just to make it nicer to look at, maybe...\n\n0:15:44\tSPEAKER_03\n What do you mean?\n\n0:15:45\tSPEAKER_03\n Like...\n\n0:15:46\tSPEAKER_03\n I can't think of an example, but...\n\n0:15:49\tSPEAKER_03\n...sort of like little petrushed baller than...\n\n0:15:53\tSPEAKER_03\n Oh yeah, like how the buttons...\n\n0:15:55\tSPEAKER_03\n...instead of saying volume, like a little speaker...\n\n0:15:57\tSPEAKER_03\n Yeah, as a button, though.\n\n0:15:59\tSPEAKER_01\n So it's a keyboard in the shape of it, right?\n\n0:16:02\tSPEAKER_01\n Yeah.\n\n0:16:03\tSPEAKER_01\n Okay.\n\n0:16:04\tSPEAKER_01\n Yeah, maybe.\n\n0:16:05\tSPEAKER_01\n Yeah, I like that.\n\n0:16:06\tSPEAKER_03\n I do.\n\n0:16:07\tSPEAKER_03\n The...\n\n0:16:08\tSPEAKER_03\n...with the set of the command interface, you see the most useful element of control...\n\n0:16:12\tSPEAKER_03\n...as it would be less complicated.\n\n0:16:15\tSPEAKER_03\n The control would be more than music, than like...\n\n0:16:19\tSPEAKER_03\n...the normal control of the cheaper design...\n\n0:16:22\tSPEAKER_03\n...that we'd have more money in the budget...\n\n0:16:25\tSPEAKER_03\n...to target the design of the interface...\n\n0:16:29\tSPEAKER_03\n...you would make it more trendy in the original...\n\n0:16:31\tSPEAKER_03\n...we would have more money if we keep it simple.\n\n0:16:33\tSPEAKER_01\n Yeah, I'm sure like, kinetic energy would probably dip into the budget...\n\n0:16:37\tSPEAKER_03\n...a bit more to it.\n\n0:16:39\tSPEAKER_03\n Quite in the technology.\n\n0:16:45\tSPEAKER_03\n We also have to keep in mind when we're designing our...\n\n0:16:50\tSPEAKER_03\n...more users and like...\n\n0:16:52\tSPEAKER_03\n...we're working through a lot of interfaces, concepts of the clutter, buttons...\n\n0:16:56\tSPEAKER_03\n...that the functions, colors and forms aren't always helpful.\n\n0:17:03\tSPEAKER_00\n Yeah, that's true.\n\n0:17:05\tSPEAKER_00\n Yeah.\n\n0:17:06\tSPEAKER_00\n The buttons are all the different colors for different choices...\n\n0:17:09\tSPEAKER_00\n...and things can be a bit...\n\n0:17:11\tSPEAKER_00\n...over and over.\n\n0:17:13\tSPEAKER_03\n And that all interfaces are different.\n\n0:17:17\tSPEAKER_03\n That doesn't improve the use of products, so we need to come up with something...\n\n0:17:23\tSPEAKER_03\n...that's easy to understand...\n\n0:17:26\tSPEAKER_03\n...and maybe learn from these stakes of all interfaces...\n\n0:17:30\tSPEAKER_03\n...that can be too complicated for people to use.\n\n0:17:34\tSPEAKER_01\n Yeah.\n\n0:17:36\tSPEAKER_03\n Does anyone have any questions?\n\n0:17:41\tSPEAKER_01\n Do you think that we should keep all the buttons to one same color...\n\n0:17:45\tSPEAKER_01\n...just to keep it a simplistic look?\n\n0:17:49\tSPEAKER_02\n I think if we go with the design plate thing, we'll have to...\n\n0:17:53\tSPEAKER_02\n...just because of color clashing and...\n\n0:17:56\tSPEAKER_02\n...if we wanted to.\n\n0:17:58\tSPEAKER_02\n So we might...\n\n0:17:59\tSPEAKER_02\n...depending on what comes out of the design, we might have to stick to just black buttons.\n\n0:18:03\tSPEAKER_01\n But what about the lighting up effect?\n\n0:18:06\tSPEAKER_02\n You mean different colors for the lighting, or...?\n\n0:18:09\tSPEAKER_01\n Well, I thought we had decided that...\n\n0:18:13\tSPEAKER_01\n...if you touch one of the buttons, they'd all light up.\n\n0:18:16\tSPEAKER_01\n And so if they were black, it would be possible for them to light up.\n\n0:18:21\tSPEAKER_02\n Oh, I see what you're saying.\n\n0:18:23\tSPEAKER_01\n Well, if they were white, they would glow.\n\n0:18:25\tSPEAKER_01\n Probably if they were made in rubber.\n\n0:18:27\tSPEAKER_02\n Oh, so you were picturing the light coming from the back.\n\n0:18:29\tSPEAKER_02\n I kind of pictured it as...\n\n0:18:31\tSPEAKER_02\n...kind of coming from the sides and lighting it up frontwards.\n\n0:18:34\tSPEAKER_02\n Oh, I like coming from the back.\n\n0:18:37\tSPEAKER_00\n I'd seen like an internal light.\n\n0:18:41\tSPEAKER_00\n Yeah, it comes through.\n\n0:18:43\tSPEAKER_00\n So there would have to be some parts, maybe transparent around the buttons.\n\n0:18:47\tSPEAKER_01\n Right, but...\n\n0:18:49\tSPEAKER_01\n...it's a little bit more transparent.\n\n0:18:51\tSPEAKER_01\n And rubber is a more translucent product too, so it should be able to...\n\n0:18:54\tSPEAKER_03\n...that taken care of.\n\n0:18:56\tSPEAKER_03\n And the phone that I was thinking of, when you change the covers of it, the little buttons that actually...\n\n0:19:03\tSPEAKER_03\n...you know, that...\n\n0:19:05\tSPEAKER_03\n...are behind the rubber.\n\n0:19:08\tSPEAKER_03\n So you can change the buttons when you're changing the faces.\n\n0:19:11\tSPEAKER_03\n Oh, yeah, this is too short.\n\n0:19:14\tSPEAKER_03\n Yeah, okay.\n\n0:19:16\tSPEAKER_03\n Behind them.\n\n0:19:18\tSPEAKER_03\n I mean, I don't have to say that one color of each face could have a color of that color.\n\n0:19:26\tSPEAKER_01\n Well, if they're raised up buttons, so that you can feel them, we were talking about it being more...\n\n0:19:36\tSPEAKER_01\n...a lot more tangible.\n\n0:19:39\tSPEAKER_01\n It might be more difficult to do.\n\n0:19:42\tSPEAKER_01\n If they're sticking up, if it's flat, then...\n\n0:19:46\tSPEAKER_01\n...like, I'm on a cell phone or a mobile phone.\n\n0:19:48\tSPEAKER_01\n It's like all very flat, and you just have to sort of press down on these tiny little buttons.\n\n0:19:53\tSPEAKER_01\n Yeah.\n\n0:19:57\tSPEAKER_00\n I think it would be possible.\n\n0:19:58\tSPEAKER_00\n I don't think it would make that much difference.\n\n0:20:01\tSPEAKER_00\n I mean, the dimensions of...\n\n0:20:04\tSPEAKER_00\n...if it's just constructed in the same way as the front cover of the mobile phone, you can take off the hard cover, and then there's the buttons, and then you get to the circuit.\n\n0:20:15\tSPEAKER_00\n I don't think it would matter that the buttons were bigger through the top casing.\n\n0:20:21\tSPEAKER_00\n I'm sure you could work it out to fit in the casing without causing too much...\n\n0:20:26\tSPEAKER_00\n...to be fine.\n\n0:20:28\tSPEAKER_01\n All right.\n\n0:20:30\tSPEAKER_01\n If it's doable, you can...\n\n0:20:32\tSPEAKER_01\n...that would be good to me.\n\n0:20:35\tSPEAKER_01\n Thank you.\n\n0:20:38\tNone\n Okay, is that my turn?\n\n0:20:41\tSPEAKER_01\n Yes.\n\n0:20:43\tSPEAKER_02\n You're up.\n\n0:20:45\tSPEAKER_02\n All right.\n\n0:20:47\tSPEAKER_02\n I have a shorter report for you today.\n\n0:20:52\tSPEAKER_02\n It took a while to get this.\n\n0:20:56\tSPEAKER_00\n I'm not plugged in yet.\n\n0:21:04\tSPEAKER_02\n Oh, that's a very good point.\n\n0:21:26\tSPEAKER_02\n Okay, so this report is about trend-watching.\n\n0:21:30\tSPEAKER_02\n I'm basically...\n\n0:21:34\tSPEAKER_02\n...so I'm having a very fashionable remote control.\n\n0:21:39\tSPEAKER_02\n So, just so you know, my method was mainly web-based research this time around.\n\n0:21:43\tSPEAKER_02\n I also spoke with fashion experts in Milan, New York, and Paris.\n\n0:21:46\tSPEAKER_02\n And I looked at the design reports from previous years here at Real Remote.\n\n0:21:51\tSPEAKER_02\n We can work off with them and see how fashion's have changed.\n\n0:21:55\tSPEAKER_02\n So I'll list the three most important aspects that I've come across.\n\n0:22:00\tSPEAKER_02\n And they're each more important than the one that comes after it.\n\n0:22:03\tSPEAKER_02\n The first one is that there should be a fancy look and feel.\n\n0:22:06\tSPEAKER_02\n Instead of the current functional look and feel, this should be our priority, as we've been saying.\n\n0:22:11\tSPEAKER_02\n The second most important aspect is that the remote control should be technologically innovative.\n\n0:22:16\tSPEAKER_02\n So I think we've done a lot of talking about that, just with lighting and the buttons and the face plates.\n\n0:22:22\tSPEAKER_02\n So we'll be able to keep on track with that.\n\n0:22:25\tSPEAKER_02\n And the third most important aspect is that their remote control should be easy to use.\n\n0:22:29\tSPEAKER_02\n So I'm pretty basic there.\n\n0:22:31\tSPEAKER_02\n The recent fashion update, according to fashion washers in Paris and Milan, is that fruit and vegetables will be the most important theme for clothes, shoes, and furniture.\n\n0:22:41\tSPEAKER_02\n Also, in contrast to last year, the field of the material is expected to be spongy.\n\n0:22:45\tSPEAKER_02\n Again, we've already discussed that with rubber versus hard plastic buttons.\n\n0:22:51\tSPEAKER_02\n So my personal preference is here.\n\n0:22:54\tSPEAKER_02\n Of course, we've already talked about the personal face plates in this meeting, and I'd like to stick to that.\n\n0:23:00\tSPEAKER_02\n The fruits and vegetable themes, I don't know if that's going to work for us.\n\n0:23:03\tSPEAKER_02\n It sounds something that you do is on kitchenware.\n\n0:23:05\tSPEAKER_02\n I don't know if we want to do it on our modes.\n\n0:23:07\tSPEAKER_02\n It could be one of the options, maybe for the television that people have in their kitchen.\n\n0:23:12\tSPEAKER_02\n The temporary light-up idea, sounds like we're going to stick to that.\n\n0:23:16\tSPEAKER_02\n And then tying in a trendy look with user-friendlyness.\n\n0:23:22\tSPEAKER_01\n The fruits and vegetables is the only area that I find, rather jarring.\n\n0:23:29\tSPEAKER_01\n Everything else we can really do, according to our plans, already given the market.\n\n0:23:36\tSPEAKER_01\n But fruits and vegetables seem a very strange idea.\n\n0:23:39\tSPEAKER_02\n It's a lot of love, but it's everywhere.\n\n0:23:41\tSPEAKER_02\n So maybe we've seen a lot of purses with olives on them.\n\n0:23:46\tSPEAKER_02\n But I think we stick to TV-based shows or holidays.\n\n0:23:51\tSPEAKER_01\n But they still need to fit into people's decor, though.\n\n0:23:55\tSPEAKER_00\n I think we could possibly take a more abstract design, like look at the basic shapes of different fruits and vegetables, and then just really strip it down to really basic shapes.\n\n0:24:09\tSPEAKER_00\n I mean, we don't have to make something in the shape of a strawberry, but it could have the curves of a strawberry, or a strawberry seed, or a leaf.\n\n0:24:19\tSPEAKER_00\n Just like, you know, really make it quite abstract if that fits in more with what we're doing, instead of fruits and vegetables, just to be looking straight forward as a bit.\n\n0:24:30\tSPEAKER_00\n Yeah, it doesn't quite fit in with the trendy.\n\n0:24:33\tSPEAKER_00\n Well, obviously it does if that's the case, but maybe we could go more directly.\n\n0:24:38\tSPEAKER_00\n I don't know, but initially, I think if we just sort of turn it down a bit.\n\n0:24:45\tSPEAKER_00\n And like, no.\n\n0:24:47\tSPEAKER_01\n And like, photo is not fruits.\n\n0:24:49\tSPEAKER_01\n Yeah.\n\n0:24:50\tSPEAKER_02\n One thing I was thinking, though, is I don't know if you'll remember from our kickoff meeting, we talked about our favorite animals.\n\n0:24:55\tSPEAKER_02\n So maybe there could be animal-based, you know, because a lot of people have a house cat or a dog.\n\n0:25:01\tSPEAKER_02\n That might be getting, you know, too specific, and we should see what the success of the first face plates are.\n\n0:25:05\tSPEAKER_02\n But it's something to keep in mind.\n\n0:25:08\tSPEAKER_01\n Mm-hmm.\n\n0:25:09\tSPEAKER_02\n And did you have any questions?\n\n0:25:16\tSPEAKER_02\n Pretty straight forward.\n\n0:25:19\tSPEAKER_01\n Yeah.\n\n0:25:22\tSPEAKER_01\n All right, given that information, we need to start making some more specific decisions.\n\n0:25:31\tSPEAKER_01\n So I'll need to hook up the PowerPoint again.\n\n0:25:38\tSPEAKER_01\n There you go.\n\n0:25:51\tSPEAKER_02\n Have you guys been saving your PowerPoint presentations to the...\n\n0:25:54\tSPEAKER_00\n I didn't, for the first one, but I have now.\n\n0:25:56\tSPEAKER_00\n It's still around, right?\n\n0:25:58\tSPEAKER_00\n Yeah.\n\n0:25:59\tSPEAKER_00\n Where are you going?\n\n0:26:01\tSPEAKER_00\n Project documents, I think.\n\n0:26:03\tSPEAKER_03\n Okay.\n\n0:26:13\tSPEAKER_01\n Okay.\n\n0:26:20\tSPEAKER_01\n Let's just try to make this pop up now.\n\n0:26:30\tSPEAKER_01\n All right, here we go.\n\n0:26:33\tSPEAKER_01\n Okay, so we have to decide now exactly what we are going to do.\n\n0:26:38\tSPEAKER_01\n So energy, we owe.\n\n0:26:43\tSPEAKER_01\n Oh no, I can't write it in when it's in this setting.\n\n0:26:46\tSPEAKER_01\n So we don't know how to take it out of...\n\n0:26:50\tSPEAKER_01\n To the PowerPoint.\n\n0:26:52\tSPEAKER_01\n Yeah.\n\n0:26:55\tSPEAKER_01\n Yeah.\n\n0:26:56\tSPEAKER_01\n Okay.\n\n0:26:58\tSPEAKER_01\n So back to decisions.\n\n0:26:59\tSPEAKER_01\n Energy.\n\n0:27:00\tSPEAKER_01\n We've decided on kinetic.\n\n0:27:02\tSPEAKER_00\n Okay, so that's good.\n\n0:27:04\tSPEAKER_00\n Are we going to have a backup?\n\n0:27:08\tSPEAKER_01\n Mm-hmm.\n\n0:27:11\tSPEAKER_00\n Or do we just...\n\n0:27:13\tSPEAKER_01\n Back up really been necessary.\n\n0:27:17\tSPEAKER_01\n I mean, will people just use the battery if there's no...\n\n0:27:21\tSPEAKER_00\n I think maybe we could just go for the kinetic energy and...\n\n0:27:28\tSPEAKER_00\n Be bold and innovative and hope this works.\n\n0:27:32\tSPEAKER_00\n Well, hope that it works.\n\n0:27:34\tSPEAKER_00\n It's like no reason why it wouldn't work.\n\n0:27:36\tSPEAKER_00\n So I think we should just take advantage of...\n\n0:27:40\tSPEAKER_00\n Like using this to its full potential.\n\n0:27:43\tSPEAKER_00\n It could even be one of our selling points.\n\n0:27:46\tSPEAKER_01\n It could be fully kinetic energy.\n\n0:27:49\tSPEAKER_02\n Environmental touches.\n\n0:27:51\tSPEAKER_02\n So if it's not working, they just have to shake it a bit.\n\n0:27:54\tSPEAKER_01\n Yeah.\n\n0:27:55\tSPEAKER_01\n Yeah.\n\n0:27:56\tSPEAKER_01\n Absolutely.\n\n0:27:57\tSPEAKER_01\n All right, the next decision is chip on print.\n\n0:28:00\tSPEAKER_00\n I don't exactly know what that means.\n\n0:28:03\tSPEAKER_00\n It's whether we went for the simple, the regular, or the advanced chip and that linked in with what buttons we're going to have.\n\n0:28:09\tSPEAKER_01\n You're going for more simplistic style, right?\n\n0:28:11\tSPEAKER_00\n Yeah.\n\n0:28:12\tSPEAKER_00\n But that was without the LCD.\n\n0:28:14\tSPEAKER_00\n So that means we're not doing the advanced.\n\n0:28:16\tSPEAKER_00\n So it depends on whether we wanted the scroll buttons or just the push buttons.\n\n0:28:20\tSPEAKER_01\n I think we decided on the push buttons, right?\n\n0:28:23\tSPEAKER_01\n So that's the simple...\n\n0:28:24\tSPEAKER_01\n Yeah.\n\n0:28:25\tSPEAKER_01\n Would we need a more advanced one for the lighting, the interior lighting system?\n\n0:28:29\tSPEAKER_00\n Yeah, possibly.\n\n0:28:30\tSPEAKER_00\n So it's probably going to be the regular chip that we're going to need.\n\n0:28:33\tSPEAKER_00\n So it's a medium.\n\n0:28:35\tSPEAKER_00\n So regular chip.\n\n0:28:36\tSPEAKER_00\n That's called a medium or regular?\n\n0:28:37\tSPEAKER_00\n Sorry.\n\n0:28:39\tSPEAKER_00\n Okay.\n\n0:28:40\tSPEAKER_02\n Oh, it's regular, not simple.\n\n0:28:42\tSPEAKER_02\n Yeah.\n\n0:28:43\tSPEAKER_02\n I didn't.\n\n0:28:44\tSPEAKER_00\n Yeah, if we...\n\n0:28:45\tSPEAKER_00\n Because of the lighting that we've decided to put in the software.\n\n0:28:48\tSPEAKER_01\n Okay, and cases.\n\n0:28:50\tSPEAKER_01\n So is this dependent on shape or what it's made of or what?\n\n0:28:55\tSPEAKER_00\n I think this is just going to be a very outside case, which we both decided on rubber?\n\n0:29:00\tSPEAKER_00\n Yeah.\n\n0:29:01\tSPEAKER_01\n Yeah.\n\n0:29:02\tSPEAKER_01\n Well, I guess plastic and rubber.\n\n0:29:04\tSPEAKER_01\n Coated and rubber.\n\n0:29:05\tSPEAKER_01\n Plastic rubber.\n\n0:29:07\tSPEAKER_01\n With rubber.\n\n0:29:09\tSPEAKER_01\n Coating and inter changeable.\n\n0:29:13\tSPEAKER_00\n Intertangible, yeah.\n\n0:29:15\tSPEAKER_00\n Still going for that.\n\n0:29:16\tSPEAKER_00\n Yeah.\n\n0:29:17\tSPEAKER_01\n Intertangible, please.\n\n0:29:18\tSPEAKER_01\n Okay.\n\n0:29:24\tSPEAKER_01\n User interface concept.\n\n0:29:27\tSPEAKER_01\n So is your time to shine?\n\n0:29:29\tSPEAKER_03\n We decided on the component.\n\n0:29:32\tSPEAKER_03\n I'm sorry, I lost my own part.\n\n0:29:35\tSPEAKER_03\n You're squint.\n\n0:29:36\tSPEAKER_03\n It's called command interface.\n\n0:29:38\tSPEAKER_03\n Oh, yeah, yeah.\n\n0:29:39\tSPEAKER_03\n The command interface.\n\n0:29:41\tSPEAKER_01\n The command interface.\n\n0:29:42\tSPEAKER_03\n The command line interface here.\n\n0:29:46\tSPEAKER_01\n The command line?\n\n0:29:48\tSPEAKER_01\n Yeah.\n\n0:29:49\tNone\n Okay.\n\n0:29:51\tSPEAKER_01\n Line interface.\n\n0:29:55\tSPEAKER_01\n All right.\n\n0:29:56\tSPEAKER_01\n And supplements.\n\n0:29:58\tSPEAKER_01\n What's that all about?\n\n0:30:00\tSPEAKER_03\n I think that is, well, we haven't really made any decisions about what we're going to do about the cluster of buttons, functions, colors, and forms, and consistent use.\n\n0:30:13\tSPEAKER_03\n Like, what are our ideas?\n\n0:30:15\tSPEAKER_03\n You come back these problems.\n\n0:30:17\tSPEAKER_03\n Different interfaces are very different and can be confusing because of the difference and the cause.\n\n0:30:26\tSPEAKER_03\n The different cluster of buttons that we have.\n\n0:30:30\tSPEAKER_03\n We haven't really decided what to do about that.\n\n0:30:35\tSPEAKER_01\n What are our choices here?\n\n0:30:38\tSPEAKER_03\n Well, it's just where shall we locate the buttons?\n\n0:30:46\tSPEAKER_03\n What kind of functions will it show we have?\n\n0:30:50\tSPEAKER_01\n We'll have the numbers of the channels and we'll have power.\n\n0:30:53\tSPEAKER_01\n The channel changer and volume and power.\n\n0:30:57\tSPEAKER_03\n So, just basic?\n\n0:31:00\tSPEAKER_03\n Yeah.\n\n0:31:01\tSPEAKER_01\n I don't know if we should go into adjusting light levels, things like that because different televisions will have.\n\n0:31:08\tSPEAKER_00\n Yeah, tone, contrast, and things.\n\n0:31:10\tSPEAKER_02\n That was on one of my presentations about how often it was used.\n\n0:31:16\tSPEAKER_02\n Do you remember that?\n\n0:31:17\tSPEAKER_02\n Yeah, it was minimal.\n\n0:31:18\tSPEAKER_01\n Well, it wasn't that I was hardly ever used.\n\n0:31:20\tSPEAKER_02\n Should I bring it up?\n\n0:31:23\tSPEAKER_01\n Yeah.\n\n0:31:24\tSPEAKER_00\n It was told that this will come with a remote.\n\n0:31:26\tSPEAKER_00\n Yeah, and surely that would be quite specific to the individual television.\n\n0:31:33\tSPEAKER_01\n Okay, well, we know we want numbers.\n\n0:31:38\tSPEAKER_02\n Screen settings was used 0.5 times an hour.\n\n0:31:42\tSPEAKER_02\n So, once every two hours.\n\n0:31:45\tSPEAKER_02\n And it was considered a 1.5 relevance on scale of 10.\n\n0:31:48\tSPEAKER_02\n And it was a brightness color.\n\n0:31:51\tSPEAKER_00\n I think most of that comes on the individual television itself, isn't it?\n\n0:31:57\tSPEAKER_00\n I'm sure it has its own buttons.\n\n0:31:59\tSPEAKER_00\n So, don't necessarily need to have it on remote.\n\n0:32:03\tSPEAKER_01\n And different televisions, I don't know if we can make a remote that will be universal to all the different kinds of things.\n\n0:32:08\tSPEAKER_00\n So, we're just going for power channels volume.\n\n0:32:14\tSPEAKER_02\n The other one was audio settings, mono stereo pitch.\n\n0:32:18\tSPEAKER_02\n I mean, I sometimes use that.\n\n0:32:19\tSPEAKER_02\n Some TVs will have the option of living room style, movie style.\n\n0:32:23\tSPEAKER_02\n And they said that's used 0.8 times an hour, which is actually somewhat high.\n\n0:32:28\tSPEAKER_02\n Almost once an hour.\n\n0:32:30\tSPEAKER_02\n Yeah.\n\n0:32:31\tSPEAKER_02\n Relovance of two.\n\n0:32:35\tSPEAKER_01\n Oh, we have five minutes to finish our media.\n\n0:32:38\tSPEAKER_01\n Correct.\n\n0:32:39\tSPEAKER_01\n Okay.\n\n0:32:40\tSPEAKER_01\n Let's just get this first.\n\n0:32:41\tSPEAKER_01\n Well, that didn't come up on my name.\n\n0:32:43\tSPEAKER_01\n Have we have audio?\n\n0:32:45\tSPEAKER_01\n It only comes up on my name usually.\n\n0:32:47\tSPEAKER_03\n It would seem so if we could burn carbonating else, just have an audio button.\n\n0:32:54\tSPEAKER_01\n Yeah, I don't...\n\n0:32:56\tSPEAKER_01\n It's a problem with the international appeal.\n\n0:32:59\tSPEAKER_01\n I think if we have audio because we don't know how other televisions work.\n\n0:33:04\tSPEAKER_01\n But we know that everyone has this and it's the same.\n\n0:33:08\tSPEAKER_02\n I guess it affects the marketing.\n\n0:33:10\tSPEAKER_02\n It is a good sales point.\n\n0:33:13\tSPEAKER_02\n Aren't you annoyed with the wrong controls and have all these buttons?\n\n0:33:16\tSPEAKER_00\n Yeah.\n\n0:33:17\tSPEAKER_00\n This one has channel volume.\n\n0:33:18\tSPEAKER_00\n Yeah, that's it.\n\n0:33:19\tSPEAKER_00\n We can just go for it.\n\n0:33:20\tSPEAKER_01\n Make it a setting point that is just the base.\n\n0:33:23\tSPEAKER_01\n Yeah.\n\n0:33:24\tSPEAKER_01\n Okay.\n\n0:33:25\tSPEAKER_01\n Brilliant.\n\n0:33:26\tSPEAKER_01\n Good.\n\n0:33:27\tSPEAKER_01\n And, okay, in closing, because we only have five minutes.\n\n0:33:30\tSPEAKER_01\n We'll be meeting again in 30 minutes.\n\n0:33:33\tSPEAKER_01\n You'll be working...\n\n0:33:35\tSPEAKER_01\n Probably we'll be working on the look and feel design.\n\n0:33:38\tSPEAKER_01\n Wait a minute.\n\n0:33:39\tSPEAKER_01\n Yeah.\n\n0:33:40\tSPEAKER_01\n And the user interface design, so this is where the trendy stuff comes in.\n\n0:33:44\tSPEAKER_01\n And you'll be evaluating the product.\n\n0:33:49\tSPEAKER_01\n Poppy and Tara will have to work together, see modeling clay.\n\n0:33:54\tSPEAKER_01\n And your personal coach will give you the rest of the information about the staff.\n\n0:33:59\tSPEAKER_01\n Okay.\n\n0:34:00\tSPEAKER_01\n Alright, so anyone else has something to say?\n\n0:34:03\tSPEAKER_00\n I just have one question about the whole fruit and vegetable aspect.\n\n0:34:08\tSPEAKER_00\n Are we seeing as that was the most popular thing that came up out of your market research?\n\n0:34:14\tSPEAKER_00\n I think we should keep to that rather than moving to animals or something, because...\n\n0:34:18\tSPEAKER_00\n Yeah.\n\n0:34:19\tSPEAKER_00\n Yeah.\n\n0:34:20\tSPEAKER_00\n Even if that may not seem obvious to us, if that's what the surveys brought out, I think we should probably go along with that.\n\n0:34:25\tSPEAKER_00\n Yeah.\n\n0:34:26\tSPEAKER_00\n So I suppose that I'll come out in our design development, but happy to go ahead with the fruit.\n\n0:34:32\tSPEAKER_02\n Now, do you guys need one idea of how many...\n\n0:34:35\tSPEAKER_02\n Are you going to come up with casing ideas?\n\n0:34:37\tSPEAKER_02\n I'm different.\n\n0:34:38\tSPEAKER_01\n Yeah.\n\n0:34:39\tSPEAKER_03\n We're not five.\n\n0:34:40\tSPEAKER_03\n What do you think of this?\n\n0:34:43\tSPEAKER_03\n Having the numbers, kind of like not a bunch of grapes, but you know, like purple and kind of in a triangle.\n\n0:34:50\tSPEAKER_03\n Like grape?\n\n0:34:51\tSPEAKER_02\n Yeah, you can have some fun with the buttons.\n\n0:34:53\tSPEAKER_02\n It's true.\n\n0:34:54\tSPEAKER_00\n We can have an affinity.\n\n0:34:57\tSPEAKER_02\n I guess ideally you'd kind of think of age markets as well, so it's something that will appeal to the 15 to 25 year olds.\n\n0:35:04\tSPEAKER_02\n It's something that your granny would want on her remote control.\n\n0:35:07\tSPEAKER_02\n Yeah.\n\n0:35:08\tSPEAKER_02\n Yeah.\n\n0:35:09\tSPEAKER_02\n An international taste as well.\n\n0:35:10\tSPEAKER_00\n A lot of things to consider.\n\n0:35:13\tSPEAKER_00\n Lots of...\n\n0:35:14\tSPEAKER_00\n Yeah.\n\n0:35:15\tNone\n Alright.\n\n0:35:16\tSPEAKER_01\n Okay.\n\n0:35:17\tSPEAKER_01\n Yeah, we'll stick to the veggie theme then.\n\n0:35:21\tSPEAKER_01\n Alright.\n\n0:35:22\tSPEAKER_01\n And we'll reconvene in 30 minutes.\n\n0:35:25\tSPEAKER_01\n Okay.\n\n0:35:26\tSPEAKER_01\n Thank you.\n\n0:35:27\tSPEAKER_01\n I'll see you later.\n\n0:35:29\tSPEAKER_01\n Oh, what do I just do?\n\n0:35:33\tSPEAKER_01\n Thank you.\n\n", "summary": [{"summary_text": "The meeting will be 40 minutes long and Poppy will be the first presenter. Speaker has to make some key decisions on the design of the remote control concept and the material they're going to use. The main internal feature is a circuit board which contains all the electronics and the contacts with the power source. The energy source could be a basic battery or a hand-powered dynamo."}]}