{"filename": "./data/ES2012b.txt", "transcript": "0:00:00\tSPEAKER_00\n Let's move on.\n\n0:00:09\tSPEAKER_00\n Let's go over there.\n\n0:00:39\tSPEAKER_00\n Welcome to the second meeting of this design group.\n\n0:00:49\tSPEAKER_00\n Briefly go through the last meeting.\n\n0:00:58\tSPEAKER_00\n Just in a form, and I haven't attributed any individuals because we're working strictly as a team here.\n\n0:01:12\tSPEAKER_00\n We saw that the problems with existing remote controls were the boring shape and boring colour.\n\n0:01:29\tSPEAKER_00\n We saw that what we needed to do was to make sure that the device controls several items, switching was easy.\n\n0:01:39\tSPEAKER_00\n You shouldn't need to point the thing at anything in particular.\n\n0:01:45\tSPEAKER_00\n You need to be contoured to make it interesting. The keys might be concave, simply because that hasn't been done before that we know of.\n\n0:01:57\tSPEAKER_00\n Interchangeable faces, so people can personalise it, illuminated so that people can see it in dark rooms.\n\n0:02:06\tSPEAKER_00\n People might want it in addition to their existing remote controls.\n\n0:02:19\tSPEAKER_00\n Use it, but it should be too small, but it gets lost.\n\n0:02:35\tSPEAKER_00\n I'll short the ask for three presentations.\n\n0:02:42\tSPEAKER_00\n Before I do that, however, I will go through some new project requirements that the management has placed on us.\n\n0:02:52\tSPEAKER_00\n We'll be challenging in terms of what we discussed at the first meeting. The management has had its own thoughts on this, but they didn't necessarily agree with what we thought.\n\n0:03:11\tSPEAKER_00\n We'll talk through the functions that we see the device carrying out.\n\n0:03:22\tSPEAKER_00\n The new requirements are that the management team see that the teletext is no longer of any importance given the device of the internet.\n\n0:03:51\tSPEAKER_00\n They want only to cover television.\n\n0:03:58\tSPEAKER_00\n What is not quite clear from their directives is whether they didn't want it to cover teletext or videos, DVDs, satellite boxes, which we saw as being fundamental to the exercise.\n\n0:04:20\tSPEAKER_00\n The actual wording of the directives should cover television only on that basis.\n\n0:04:31\tSPEAKER_00\n I think we need to bear that in mind, but possibly keep at the backs of our minds with the reality that people, even with it, no longer could teletext any more.\n\n0:04:49\tSPEAKER_00\n The device has to incorporate the company logo and colors.\n\n0:04:56\tSPEAKER_00\n The logo being at the bottom of the screen there, the two hours in gray against a yellow background.\n\n0:05:04\tSPEAKER_00\n Now this doesn't necessarily mean that we have to give up some of our ideas about making it attractive to the market.\n\n0:05:12\tSPEAKER_00\n The third thing we need to do is to do some constraints as to how we might do that.\n\n0:05:19\tSPEAKER_00\n It also has to be simple, which the somebody saying goes wrong with the first one, but the way we've already said that it must be simple because that's what people want anyway.\n\n0:05:29\tSPEAKER_00\n We also want it to be simple to get it to the market quickly, which is our choice, but we need to talk that through.\n\n0:05:50\tSPEAKER_00\n The next thing we need to do is to summarize and note the same thing.\n\n0:06:07\tSPEAKER_00\n First of all, have individual reports from everybody. Again, there is no order of precedence here, so I'll leave it up to you to think so we'd like to go first.\n\n0:06:27\tSPEAKER_01\n I don't mind. I have a verse to move forward. Can I steal a kilo?\n\n0:06:57\tNone\n I don't know.\n\n0:07:20\tSPEAKER_00\n How do I start?\n\n0:07:33\tSPEAKER_01\n This phone is turned off.\n\n0:07:48\tSPEAKER_01\n Everything can be from functionality and how individual functions are, how often they're used and they're necessary and so, in general, opinions about current and what's.\n\n0:08:04\tSPEAKER_01\n I see that as we can now know as 75% people find their own controls ugly.\n\n0:08:12\tSPEAKER_01\n So, some kind of new style should be incorporated.\n\n0:08:19\tSPEAKER_01\n Along with looking less likely, it looks better.\n\n0:08:25\tSPEAKER_01\n People said that people spend more money on it.\n\n0:08:30\tSPEAKER_01\n Which is a plus for us if we can make it look better and be more cost effective.\n\n0:08:37\tSPEAKER_01\n If we can put it price up.\n\n0:08:43\tSPEAKER_01\n Current walker tools do not match the operating behavior of the user.\n\n0:08:46\tSPEAKER_01\n I can take that to mean as they don't, the only work for the television or like, in my own way, I've got six remote controls for our stereo system, digital box, DVD player, video player and TV.\n\n0:09:09\tSPEAKER_01\n My behavior is to use multiple things at the same time.\n\n0:09:15\tSPEAKER_01\n I really matched well to my behavior.\n\n0:09:18\tSPEAKER_01\n Again, 75% is, 75% uses these Apple.\n\n0:09:22\tSPEAKER_01\n I think the big issue is that the user will use it regularly rather than standing up and manually change channels or volume things.\n\n0:09:36\tSPEAKER_01\n I think a big issue is that the user only uses 10% of the buttons.\n\n0:09:43\tSPEAKER_01\n We've got a remote that makes it more like some buttons taken off by the like, a teletax.\n\n0:09:49\tSPEAKER_01\n Some of the functions like audio settings are not very relevant by the user.\n\n0:09:59\tSPEAKER_01\n Maybe here buttons which also make the design look sliger.\n\n0:10:07\tSPEAKER_01\n And the frustration of people losing remote control is maybe some kind of system of press button on the TV or maybe that's something that's in the cockpit.\n\n0:10:19\tSPEAKER_01\n But some kind of system where you can use something else to find in remote control.\n\n0:10:23\tSPEAKER_01\n Maybe like it would be for something.\n\n0:10:29\tSPEAKER_01\n The time taken to learn new remote controls is like you don't want to make it too complicated, easy to use for like first time users and stuff.\n\n0:10:41\tSPEAKER_01\n And the passive stream during, I suppose we speak more comfortable and make it possible even use, have to make it.\n\n0:10:48\tSPEAKER_01\n If you have buttons like you're just showing them the whole mice, the most idea of it.\n\n0:10:52\tSPEAKER_00\n Maybe don't even have to hold it such. It must be some teletax out there.\n\n0:11:04\tSPEAKER_01\n It also asked if people would pay more for speech recorders and younger people say they would.\n\n0:11:13\tSPEAKER_01\n And there was another section on our report for LCD displays but the data wasn't there.\n\n0:11:22\tSPEAKER_01\n To actually know what the results were for that work. Maybe increment the layer meeting.\n\n0:11:28\tSPEAKER_00\n I can't say that the ARCA command box, but you know, if I was using the other day, but that had sort of speech recognition which worked remarkably well.\n\n0:11:46\tSPEAKER_00\n It could cut out the RSI as well.\n\n0:11:53\tSPEAKER_01\n So possibly this speech recognition was supposed to get into the design.\n\n0:11:58\tSPEAKER_01\n I've got some of the things I couldn't fit onto this presentation.\n\n0:12:07\tSPEAKER_01\n See this?\n\n0:12:08\tSPEAKER_01\n No, sorry, it's a bit of a thing. I'll read it.\n\n0:12:11\tSPEAKER_01\n Functionality, people's opinions on functionality, the relevance to the remote and how often they're used.\n\n0:12:21\tSPEAKER_01\n Using the switch, the switch on TV is a higher relevance of 9, but it's not frequently used.\n\n0:12:29\tSPEAKER_01\n We're as channel selection which is very high relevance is used the most.\n\n0:12:34\tSPEAKER_01\n So maybe we can even start to cut down on, or I was supposed to even thinking of a design that maybe some of the buttons are hidden from everyday use.\n\n0:12:44\tSPEAKER_01\n Maybe like a folding lid or something.\n\n0:12:47\tSPEAKER_01\n So that we can maybe go into the channel settings and the audio settings which are lower relevance and rarely used.\n\n0:12:54\tSPEAKER_01\n I keep the volume selection and channel selection very easily.\n\n0:13:01\tSPEAKER_02\n It could be, I'm just going to say maybe like the flip phones that they use.\n\n0:13:07\tSPEAKER_02\n Have you seen the new mobile phones that flip out and they have the texting and then the numbers on one side.\n\n0:13:13\tSPEAKER_02\n So you could have the most huge button on top and...\n\n0:13:18\tSPEAKER_01\n Yeah, like the one that slides back in the button to see what's going on.\n\n0:13:21\tSPEAKER_00\n Yeah, sure. So we actually bite the bullet here.\n\n0:13:23\tSPEAKER_00\n If people really don't use those buttons to any extent at all, just remove them, can we remove them all together?\n\n0:13:31\tSPEAKER_00\n That might be there.\n\n0:13:32\tSPEAKER_00\n We could actually have a remote control with...\n\n0:13:41\tSPEAKER_00\n I wonder whether we could get the remote control with no buttons at all if we went for voice recognition.\n\n0:13:46\tSPEAKER_00\n Given that the...\n\n0:13:51\tSPEAKER_00\n Now the eight structure we were looking at.\n\n0:13:55\tSPEAKER_00\n I mean we had usage by eight structure of what we didn't have was what proportion of people using remote were in those particular age groups.\n\n0:14:05\tSPEAKER_00\n Do we know whether they...\n\n0:14:11\tSPEAKER_00\n 45 to 55 age group to put myself right in the middle of it.\n\n0:14:17\tSPEAKER_00\n Usually remote controls to a great extent.\n\n0:14:22\tSPEAKER_01\n And this...\n\n0:14:24\tSPEAKER_01\n Pay more to speak directly.\n\n0:14:26\tSPEAKER_00\n So we're looking at...\n\n0:14:29\tSPEAKER_00\n And we don't know the relative proportion, the relative numbers in the age groups.\n\n0:14:35\tSPEAKER_00\n Yeah, that's true.\n\n0:14:36\tSPEAKER_00\n If we wanted something different, truly different, then the button must have made control.\n\n0:14:46\tSPEAKER_03\n Well the only problem I can think of with that is if you've got a lot of people that don't want to be bothered learning how to use new remote controls, if you just kind of take away everything that they're used to knowing, that's going to be quite a change.\n\n0:14:56\tSPEAKER_00\n But if you just lift it up and say channel one, or even BC,\n\n0:15:00\tSPEAKER_01\n I mean you could even just have it left on. You could just put it down once on top of your TV and never have to.\n\n0:15:06\tSPEAKER_02\n Yeah, have it be kind of like the satellite box or the cable box and have it just go on the TV.\n\n0:15:11\tSPEAKER_02\n And then it doesn't matter where in the room you are, you won't lose it.\n\n0:15:15\tSPEAKER_00\n I can see technical problems with that in terms of the other sound from the television.\n\n0:15:20\tSPEAKER_00\n Because if somebody actually on the television says, it's like an ITV, and you're watching BBC, then it might change itself.\n\n0:15:30\tSPEAKER_00\n So it probably needs to be possibly actually need a button on it, just to activate it, or something just to identify that you've lifted it up on its use.\n\n0:15:42\tSPEAKER_00\n And then just say, I don't know, I thought, and then, that would certainly be a truly different.\n\n0:15:53\tSPEAKER_00\n Because the audio settings are not 0.8%.\n\n0:15:59\tSPEAKER_00\n I mean if they weren't there, would people miss them?\n\n0:16:04\tSPEAKER_03\n But look at the importance of the volume settings.\n\n0:16:09\tSPEAKER_00\n Relatives of tier 10. Yes. They're not used often, but they are quite important when they use.\n\n0:16:16\tSPEAKER_00\n We need to identify things that people actually need, and it's a functional frequency and relevance.\n\n0:16:23\tSPEAKER_00\n I would say ignoring power for the moment.\n\n0:16:27\tSPEAKER_00\n The channel volume, given that we've been told to ignore teletext, and we've been told to ignore the volume of the only ones that stand out would appear to be essential.\n\n0:16:43\tSPEAKER_00\n So if we can design something that looks interesting, it all looks different.\n\n0:16:52\tSPEAKER_00\n Incorporates the logo, and then the colors.\n\n0:16:56\tSPEAKER_00\n And we can still have our interchangeable faces, even if it's the yellow and gray.\n\n0:17:05\tSPEAKER_00\n And there's no buttons or buttons. There's an option.\n\n0:17:10\tSPEAKER_01\n I just have a thought, actually, so I interrupt.\n\n0:17:14\tSPEAKER_01\n You're saying about a good technical problem of like someone on the television saying a channel number, and we can maybe have an activation word.\n\n0:17:27\tSPEAKER_01\n Because I've seen some computer issues before, which is you address the remote to your address, the computer,\n\n0:17:33\tSPEAKER_00\n and then give it a connect. It depends whether... If you want to make this so simple that anybody can walk into the room, and lift it up and say, oh, yeah, that's what you see.\n\n0:17:49\tSPEAKER_00\n Okay, you could actually print it on the device itself.\n\n0:17:56\tSPEAKER_01\n I'm just thinking of the point of view of...\n\n0:17:58\tSPEAKER_01\n You could still lose this remote.\n\n0:18:01\tSPEAKER_00\n That's always been a problem, I think.\n\n0:18:06\tSPEAKER_00\n And I suppose, well, I'm making it so desirable that people lose it.\n\n0:18:15\tSPEAKER_00\n They may be getting it and buying another one.\n\n0:18:17\tSPEAKER_00\n Anyway, carry on with...\n\n0:18:20\tSPEAKER_00\n Oh, no, I have a drop to you.\n\n0:18:22\tSPEAKER_00\n No, no, no, you'll be absolutely...\n\n0:18:24\tSPEAKER_00\n Oh, okay.\n\n0:18:25\tSPEAKER_01\n You can be the middle of your report, though.\n\n0:18:27\tSPEAKER_01\n Well, I was just kind of wrapping up here. Yeah, I was in a game.\n\n0:18:31\tSPEAKER_01\n Yeah, you said things that are relevant.\n\n0:18:33\tSPEAKER_01\n You can make things much more...\n\n0:18:35\tSPEAKER_01\n I think the 80% of people that are more on remote to look better, combined with decrease the limited functions that we don't really use much.\n\n0:18:48\tSPEAKER_01\n Or we already take it to our text, but as in our channel settings and stuff, it might turn people away, some people that want the whole function on their way.\n\n0:18:59\tSPEAKER_01\n But since if we're marketing and working on a fashion-all approach, then it would be fashion-all over practicality.\n\n0:19:08\tSPEAKER_00\n Because as we could, we could make it dual function, putting our voice recognition on it.\n\n0:19:13\tSPEAKER_00\n Oh, okay.\n\n0:19:14\tSPEAKER_00\n We still have buttons on it.\n\n0:19:16\tSPEAKER_01\n Yeah, we could even have it as like, yeah, the buttons control this and the voice functions control the things that you do all the time.\n\n0:19:22\tSPEAKER_01\n So...\n\n0:19:24\tSPEAKER_00\n Certainly good.\n\n0:19:25\tSPEAKER_01\n So, yeah, we could...\n\n0:19:27\tSPEAKER_01\n The power-on and the channel selection and the climb selection, we'd have to really...\n\n0:19:31\tSPEAKER_00\n Yeah, I mean, the advantage of doing the way the buttons all together is it makes them cheaper.\n\n0:19:35\tSPEAKER_01\n Yeah, probably we'd look better as well.\n\n0:19:38\tSPEAKER_00\n Maybe it's certainly the possibility for making it visually very distinctive.\n\n0:19:44\tSPEAKER_00\n Yeah.\n\n0:19:45\tSPEAKER_00\n Because it does not have to be a oblong box,\n\n0:19:50\tSPEAKER_01\n lined with numbered buttons.\n\n0:19:53\tNone\n Yeah. Okay.\n\n0:19:55\tSPEAKER_00\n Sorry, have you...\n\n0:19:57\tSPEAKER_00\n Yeah, that's happened.\n\n0:19:59\tSPEAKER_00\n Given that we've already had an extensive discussion, I think that's...\n\n0:20:06\tNone\n Okay.\n\n0:20:07\tSPEAKER_02\n Well, I can do mine.\n\n0:20:10\tSPEAKER_01\n Don't know, give me.\n\n0:20:11\tSPEAKER_02\n Yeah, let me see if I can...\n\n0:20:13\tSPEAKER_02\n I think this work.\n\n0:20:36\tSPEAKER_03\n Oh, you have to hit like function and ask something.\n\n0:20:38\tSPEAKER_03\n Oh, yeah, it's...\n\n0:20:39\tSPEAKER_02\n Is it doing...\n\n0:20:46\tSPEAKER_01\n Give it a bit to say.\n\n0:20:51\tSPEAKER_01\n Okay.\n\n0:20:52\tNone\n Okay.\n\n0:20:53\tSPEAKER_03\n Okay.\n\n0:21:02\tSPEAKER_02\n Okay, so this is just about the technical functions.\n\n0:21:05\tSPEAKER_02\n So the method I looked online for examples of other similar products, and then just kind of...\n\n0:21:11\tSPEAKER_02\n We're trying to brainstorm some possible design ideas and identify what the necessary things are, what people are, what you really want to have a remote control do.\n\n0:21:22\tSPEAKER_02\n And then there are two different kinds that I found.\n\n0:21:25\tSPEAKER_02\n There's a user-centered one and an engineering-centered one, which I will have pictures of, and then we kind of decide which one this should be.\n\n0:21:34\tSPEAKER_02\n So these are the two different ones.\n\n0:21:39\tSPEAKER_02\n This one.\n\n0:21:40\tSPEAKER_02\n This is the user-centered.\n\n0:21:42\tSPEAKER_02\n It has quite a few...\n\n0:21:45\tSPEAKER_02\n Fewer buttons.\n\n0:21:46\tSPEAKER_02\n And then this is the engineering-centered, which has a lot more buttons.\n\n0:21:52\tSPEAKER_02\n And probably this is one that people complain about about having too many buttons that you don't use.\n\n0:21:58\tSPEAKER_02\n So basically, what remote control is is you...\n\n0:22:04\tSPEAKER_02\n It's to send messages to the television set, you know, turn on off the switch channels and the volume and things such as that.\n\n0:22:11\tSPEAKER_02\n And so for this product, it's going to be television only, and then it has to have the logos for the company and the colors.\n\n0:22:21\tSPEAKER_02\n And so for my personal preferences, I think this one is easier to use, and it has quite a few fewer buttons.\n\n0:22:28\tSPEAKER_02\n We want something that sends messages to the television, and I was kind of wondering about this example that they have.\n\n0:22:36\tSPEAKER_02\n It looks kind of narrow at the top, and I was thinking maybe if it were wider at the top, then that would be easier.\n\n0:22:44\tSPEAKER_02\n And so we have to decide what's going to make our product different.\n\n0:22:49\tSPEAKER_02\n The unique style, maybe have it light up, so it's visible in the dark, the changeable face plates.\n\n0:22:54\tSPEAKER_02\n And the lighting up and visible, when we were talking about losing it, maybe to have a button on the television that you present it, maybe if it makes a noise or a light stuff or something.\n\n0:23:04\tSPEAKER_02\n Like that, so it's easier to find if someone has hidden under the couch or something like that.\n\n0:23:11\tSPEAKER_02\n So that's my presentation.\n\n0:23:16\tSPEAKER_00\n Yeah.\n\n0:23:17\tSPEAKER_00\n Can I, I'm actually going to use the, of course, great technical forms over here.\n\n0:23:24\tSPEAKER_00\n I'm actually going to use the,\n\n0:23:34\tSPEAKER_02\n They're probably slip.\n\n0:23:36\tSPEAKER_03\n They're not connected to anything on the table, it's just to leave one more ground on them.\n\n0:24:03\tSPEAKER_00\n It's rather than the traditional, in fact, I don't know, you can give that far.\n\n0:24:12\tSPEAKER_00\n Something like this shape, you know, sort of something that you can, sort of, a more vertical shape, that you can sort of hold in your hands, I think, such as, I mean, somebody hold it like that, possibly with a couple of buttons like that, but with the entire top, with the, you know, the infrared or whatever source.\n\n0:24:37\tSPEAKER_00\n So that's, you know, it's flying off in all directions.\n\n0:24:42\tSPEAKER_00\n So that, again, the, the neat look at the, the technicalities of them, actually achieving that in terms of whether they know the power requirements of the, such a source, you know, compromise the, are, are needed for, you know, it being, permanently, you know, available, whether, whether different technology, I mean, all these remote, are presumably infrared, like they have been for a long time.\n\n0:25:20\tSPEAKER_00\n But we possibly need to be looking at, some indifference, you know, short range, not like the older radio remote controls, or you can change the next all-telling, or you can change the system.\n\n0:25:34\tSPEAKER_00\n But I think basically, if we're going to, if minimum number of buttons is our priority, then we should, let's say, they're really bite the buttons and reduce the buttons to, absolute minimum, they're possibly with backup, channel and volume buttons and on off.\n\n0:25:53\tSPEAKER_00\n And, and the else.\n\n0:25:56\tSPEAKER_00\n So, the, it could, it could, and form as end up, like that, it's again accepted, so, you know, there is to be losing it.\n\n0:26:04\tSPEAKER_00\n Anyway, okay, so, okay, before I tell you all, or, thoughts on this.\n\n0:26:11\tSPEAKER_02\n Which one is this plug-in tick?\n\n0:26:14\tSPEAKER_02\n I think it's all, it's all there.\n\n0:26:23\tNone\n I can't, did you guess?\n\n0:26:30\tNone\n Could you see the mouse gray in there?\n\n0:26:33\tNone\n Oh, yeah.\n\n0:26:36\tNone\n That's kind of, that's not cool to win.\n\n0:26:41\tSPEAKER_03\n I think I'm going to have to, I think I'm going to have to,\n\n0:26:50\tSPEAKER_02\n that's kind of, that's not cool to win.\n\n0:26:53\tSPEAKER_03\n Oh well, anyways. Alright, yeah, so, I'll just do my presentation on the working design.\n\n0:27:05\tSPEAKER_03\n Okay, just at the, you know, the household method of how the remote control works.\n\n0:27:12\tSPEAKER_03\n The basic function of the remote control is to send messages to another system, the TV or the DVD player or whatever.\n\n0:27:19\tSPEAKER_03\n And then it does this by, well, you need to start off the energy source.\n\n0:27:23\tSPEAKER_03\n And this energy source will feed into an integrated circuit chip.\n\n0:27:27\tSPEAKER_03\n And the circuit chip is the part that actually composes the different messages within the remote, which will then be sent to the, the television, the DVD to tell what to do.\n\n0:27:37\tSPEAKER_03\n And you use your interface, which controls the chip and thus the messages.\n\n0:27:41\tSPEAKER_03\n And the user interface is, that's basically just the design of the actual remote, which will hold hands and what buttons will be on it.\n\n0:27:52\tSPEAKER_02\n I'm going to shoot.\n\n0:27:57\tSPEAKER_03\n Alright, just general findings.\n\n0:28:00\tSPEAKER_03\n What we need, technically speaking, remote control is some sort of energy source, some sort of user interface, which I think we've mostly been talking about the user interface and the design of that.\n\n0:28:11\tSPEAKER_03\n So, we're going to shoot a chip within that to control and send the messages and sender and receiver.\n\n0:28:18\tSPEAKER_03\n And it's just sort of a little schematic diagram of what we're looking for.\n\n0:28:30\tSPEAKER_03\n This just kind of represents the energy source, which feeds into the circuit chip, which maybe then we can have that feed into a switch, which would send signals to a subcomponent and onto a light bulb, so light up once we start, once you start pressing buttons.\n\n0:28:45\tSPEAKER_03\n Also send signals to the infrared bulb, which will be the part that actually sends signals to the television.\n\n0:28:54\tSPEAKER_03\n And then you've got your happy little TV watcher there.\n\n0:29:01\tSPEAKER_03\n So, my personal preferences, I just think we need sort of big energy source that won't die out.\n\n0:29:06\tSPEAKER_03\n Perhaps some sort of rechargeable battery or battery dock you can place it in, so it would constantly be charged.\n\n0:29:11\tSPEAKER_03\n You wouldn't have to be worrying about it running out of batteries and not changing channels for you.\n\n0:29:16\tSPEAKER_03\n A wide range of sender receiver, so that you can hit the buttons from basically anywhere in the room and the channel will still be changed.\n\n0:29:24\tSPEAKER_03\n Also definitely a user friendly interface.\n\n0:29:27\tSPEAKER_03\n And I think we've all sort of mentioned adding a locating device on it.\n\n0:29:31\tSPEAKER_03\n So when it does get stuck out of the couch cushions as they inevitably do, you can find them easily.\n\n0:29:39\tSPEAKER_03\n And that's pretty much it.\n\n0:29:41\tSPEAKER_00\n Okay.\n\n0:29:44\tSPEAKER_00\n Since the mid-air of the number of fundamental decisions to make people read, I think you'll point about the big energy source as a very valid one.\n\n0:29:56\tSPEAKER_00\n I don't suppose we've got any statistics on the direct expectancy of remote controls particularly, so they're depending on.\n\n0:30:07\tSPEAKER_00\n Given the number of things you buy these days, which are a lithium, whatever battery, that's never needs to be placed in.\n\n0:30:18\tSPEAKER_00\n Perhaps we should have the disposable remote control, no one's a typical usage.\n\n0:30:27\tSPEAKER_00\n The battery will last for five, ten years by which time, I mean when all set and done, the digital television will be taken over in that time scale.\n\n0:30:41\tSPEAKER_00\n Perhaps we should reduce the moving parts even more by not even having a battery compartment.\n\n0:30:47\tSPEAKER_03\n Just having one that's guaranteed to last for five to ten years.\n\n0:30:50\tSPEAKER_00\n Yeah, if anybody manages to run it down, then I'll do well.\n\n0:30:56\tSPEAKER_00\n It's what it saves in cost.\n\n0:31:00\tSPEAKER_00\n You know, there's a, well, so they mark it in gimmick and it's hardly a gimmick.\n\n0:31:04\tSPEAKER_00\n It's very practical.\n\n0:31:06\tSPEAKER_00\n So I think the idea of a rechargeable one is, I see a really high tech in it, so it just recharges itself with its environment and the magnetic waves,\n\n0:31:17\tSPEAKER_01\n it could have like a, like, cordless flowing in your house, it's like a beast that sends their old stuff.\n\n0:31:23\tSPEAKER_00\n Yeah, people are really going to use it, like.\n\n0:31:26\tSPEAKER_02\n Yeah, people think that people might forget, people forgot to put their cordless phones back on there, so.\n\n0:31:32\tSPEAKER_00\n Yeah, it's, I mean, sometimes my wife gives it to me and says, I want you to put the phone on the charge, and then she's at those with so long, which isn't worth that, I know.\n\n0:31:44\tSPEAKER_03\n So I only remember to charge my cell phone when battery dies.\n\n0:31:48\tSPEAKER_03\n When it turns itself off, that's when I plug it in.\n\n0:31:53\tSPEAKER_00\n Yeah, so what do we think about the, the department, that's right.\n\n0:32:02\tSPEAKER_03\n That's a good idea.\n\n0:32:04\tSPEAKER_00\n That's pretty good, you see.\n\n0:32:06\tSPEAKER_00\n We are really going to be able to do an external simplicity here.\n\n0:32:11\tSPEAKER_00\n And they cut costs, but in the manufacturing, you know, they have a higher tech in here than the other, but they will be cost effective.\n\n0:32:22\tSPEAKER_02\n Do they make battery so much on them?\n\n0:32:25\tSPEAKER_00\n I mean, there's certainly, I can't think of anything to talk about.\n\n0:32:30\tSPEAKER_00\n Hey, but there are certainly things that you buy.\n\n0:32:32\tSPEAKER_00\n I'm a calculator, for example.\n\n0:32:34\tSPEAKER_03\n They usually have a little light source, I don't know.\n\n0:32:38\tSPEAKER_00\n They have a little solar.\n\n0:32:39\tSPEAKER_00\n Yeah, the little cells that...\n\n0:32:40\tSPEAKER_00\n Well, some, I mean, the battery ones that are, you know, certainly see the impact.\n\n0:32:48\tSPEAKER_03\n Most of them don't have sort of a combination of the two.\n\n0:32:50\tSPEAKER_03\n Like when there is light, they'll work off the light, and if there isn't, they'll kick into this battery.\n\n0:32:54\tSPEAKER_03\n So we can maybe do something like that, whereas there is a battery.\n\n0:32:57\tSPEAKER_03\n But if there's enough light, then it's using the light, so it's not actually draining the battery all the time.\n\n0:33:01\tSPEAKER_03\n But you will have the battery there for a minute.\n\n0:33:04\tSPEAKER_00\n Yeah, and this needs going into the technology a bit.\n\n0:33:07\tSPEAKER_00\n And the actual time that a remote control is actually operating.\n\n0:33:12\tSPEAKER_00\n And what I think is, it's probably the normal, the minute, and it's entire life.\n\n0:33:19\tSPEAKER_03\n Well, I think it depends who's using it,\n\n0:33:22\tSPEAKER_00\n who's just saying they're clicking, clicking, clicking. There's a bit of people getting the rest of it.\n\n0:33:26\tSPEAKER_00\n Yeah, they're clicking a lot, yeah.\n\n0:33:28\tSPEAKER_00\n That's what the wrong thing is.\n\n0:33:30\tSPEAKER_01\n Like this, this, Mark research thing says, is number of times per hour that's used, child selection 168.\n\n0:33:38\tSPEAKER_01\n That was per hour.\n\n0:33:39\tSPEAKER_02\n Yeah, per hour.\n\n0:33:40\tSPEAKER_02\n Wow.\n\n0:33:42\tSPEAKER_02\n That's a lot.\n\n0:33:44\tSPEAKER_00\n Yeah.\n\n0:33:45\tSPEAKER_00\n I'm just going to use that.\n\n0:33:47\tSPEAKER_00\n I've missed that, that does sound excessive.\n\n0:33:50\tSPEAKER_01\n But then again, if you think it, if they might have, you know, might be used, it's like, you know, that's less than a second.\n\n0:33:57\tSPEAKER_01\n Yeah.\n\n0:33:59\tSPEAKER_00\n That's right. And I don't, I don't know what to do, but I know what the signal lasts as long as you keep the button pressed or whatever it's used to.\n\n0:34:08\tSPEAKER_00\n Yeah.\n\n0:34:09\tSPEAKER_00\n So 10 to the second in a matter of time, I'm impressive for that.\n\n0:34:12\tSPEAKER_00\n I don't actually know.\n\n0:34:14\tSPEAKER_02\n But I think with digital TV, like I know on my cable box, you're not supposed to do that because the channel can't keep up with it.\n\n0:34:21\tSPEAKER_02\n If you just press it like that, you're supposed to use the menu and go through there.\n\n0:34:25\tSPEAKER_02\n And then the channel's that way instead of.\n\n0:34:32\tNone\n Right.\n\n0:34:35\tSPEAKER_00\n So I've got to say five minutes.\n\n0:34:39\tSPEAKER_00\n I don't know how long it'll take.\n\n0:34:41\tSPEAKER_00\n Oh.\n\n0:34:42\tSPEAKER_00\n Right.\n\n0:34:44\tSPEAKER_00\n So I'd need to somewhat very quickly here.\n\n0:34:48\tSPEAKER_00\n We're looking at extreme simplicity.\n\n0:34:51\tSPEAKER_00\n We're looking at a radically different shape.\n\n0:34:56\tSPEAKER_00\n Possibly no buttons at all.\n\n0:34:59\tSPEAKER_00\n But if you can incorporate channel change and volume buttons into the design, then that's fine.\n\n0:35:11\tSPEAKER_00\n And the, I mean, the role of the user interface designer becomes more important here because no shape is no longer a serious constraint.\n\n0:35:25\tSPEAKER_00\n But we clearly only need the main buttons, although clearly only need the main functions.\n\n0:35:35\tSPEAKER_00\n I don't see why we shouldn't go for voice recognition.\n\n0:35:40\tSPEAKER_00\n And the only buttons that I think we need are channel control, volume control, and on off.\n\n0:35:48\tSPEAKER_00\n And it needs to incorporate the, the logo, the gray, yellow color scheme.\n\n0:35:57\tSPEAKER_00\n And there's no reason why we can't introduce interchangeable covers.\n\n0:36:07\tSPEAKER_00\n So does that accurately summarize what we've discussed?\n\n0:36:13\tSPEAKER_01\n Yeah.\n\n0:36:21\tSPEAKER_02\n I just have one question.\n\n0:36:22\tSPEAKER_02\n So are we doing just the television?\n\n0:36:24\tSPEAKER_02\n Are we doing, so not DVD?\n\n0:36:27\tSPEAKER_02\n No.\n\n0:36:28\tSPEAKER_02\n Okay.\n\n0:36:29\tSPEAKER_00\n I think that's quite clear.\n\n0:36:30\tSPEAKER_00\n The information we've been giving away.\n\n0:36:32\tSPEAKER_00\n Okay.\n\n0:36:33\tSPEAKER_01\n Yeah.\n\n0:36:34\tSPEAKER_01\n I can email the television only.\n\n0:36:35\tSPEAKER_01\n Quite necessarily one.\n\n0:36:36\tSPEAKER_01\n And the constraints, the email I got, do you imagine the title?\n\n0:36:41\tSPEAKER_00\n That's the last one I sent you, which was my turn.\n\n0:36:45\tSPEAKER_00\n Oh, okay.\n\n0:36:46\tSPEAKER_00\n Oh, yeah.\n\n0:36:47\tSPEAKER_00\n Oh, okay.\n\n0:36:48\tSPEAKER_00\n Okay.\n\n0:36:49\tSPEAKER_00\n Some head office.\n\n0:36:56\tSPEAKER_00\n That's there.\n\n0:36:58\tSPEAKER_00\n There you go.\n\n0:37:00\tSPEAKER_00\n Okay.\n\n0:37:01\tSPEAKER_00\n So we'll give some thoughts on that.\n\n0:37:04\tSPEAKER_00\n Or we'll make some thinking.\n\n0:37:06\tSPEAKER_00\n Okay.\n\n0:37:07\tSPEAKER_00\n Okay.\n\n", "summary": [{"summary_text": "The design group is meeting to discuss the design of a new remote control. Speaker will talk about the new project requirements that the management has placed on them. The new requirements are that the teletext is no longer of any importance given the device of the internet and that the device has to incorporate the company logo."}]}