{"filename": "./data/ES2006c.txt", "transcript": "0:00:00\tSPEAKER_02\n Excellent. So I sent you the agenda that was on the project document. I don't know if you've got a chance to just have a look at it.\n\n0:00:14\tSPEAKER_02\n Anyway, the meeting is going to follow more or less the same structure as last time. So we'll go around each of you in turn and you can give your presentations on what you've been up to.\n\n0:00:27\tSPEAKER_02\n And at the end of that we need to discuss what you've come up with so that we can make a decision on the key remote control concepts.\n\n0:00:37\tSPEAKER_02\n So that's we need to know about the components, properties, materials, the user interface and any trends that the marketing expert has been watching.\n\n0:00:51\tSPEAKER_00\n Okay, do you understand? Okay. So I haven't made a PowerPoint presentation. Yeah, I thought I'll use the whiteboard instead.\n\n0:01:11\tSPEAKER_00\n So basically I'll start off by I thought I'll use the whiteboard because we have so many different options. And what we can do is that we can start rubbing off the options that we do not require and putting in the options that are more highlighted and lining them or something like that.\n\n0:01:32\tSPEAKER_00\n Okay, so I'll start again with a brief introduction to connect that anywhere. Brief introduction to the insights of a mode control.\n\n0:01:43\tSPEAKER_00\n And then we can probably discuss the various components.\n\n0:01:51\tSPEAKER_00\n Okay, so what you see here is this is the outside of the remote. If you open it, you have a circuit board here.\n\n0:02:04\tSPEAKER_00\n And this is the chip that I was talking about last time. This basically sends information to a transistor here, which then sends the information to an LED device here.\n\n0:02:16\tSPEAKER_00\n If you flip the printed circuit board and this is the most important point here, everything else is kind of.\n\n0:02:25\tSPEAKER_00\n Okay, so if you flip the circuit board, this is what it looks like. So you see, for example, a particular button attaches to a particular place on the PCB.\n\n0:02:35\tSPEAKER_00\n And on pressing this button, I circuit completes the information goes to the chip, which is somewhere here. And the chip that then translates the code into an infrared radiation, which goes out through there.\n\n0:02:51\tSPEAKER_00\n So the important point that I read over the website was that the configurations of these printed circuit circuits are quite hard to make. You can get them printed as you want to.\n\n0:03:05\tSPEAKER_00\n So we can have a configuration irrespective of the cost the way we want to have it.\n\n0:03:12\tSPEAKER_00\n So that's the important point here. So these are the different options that we have. Okay, so the batteries, I'll start with the battery.\n\n0:03:29\tSPEAKER_00\n So they can be simple, which is like the normal batteries in our results. Yeah. These are the kind of different kind of batteries that the company makes.\n\n0:03:44\tSPEAKER_00\n So hand dynamos.\n\n0:03:51\tSPEAKER_00\n Is that me like a wind up one? Yeah. Yeah. I don't know if even if you want to consider this, but these are the different things that the company makes. So they'll, since they'll come internally from the company, they'll be cheaper. All these options.\n\n0:04:07\tSPEAKER_00\n So the third one is the kinetic energy one.\n\n0:04:13\tSPEAKER_04\n You can make the hand dynamo into an exercise bike and then you could exercise walls, watching TV and charging the remote. Yeah.\n\n0:04:22\tSPEAKER_00\n And still worrying about the whole OSI.\n\n0:04:26\tSPEAKER_00\n So what was the kinetic energy one is that usually in modern watches, since our hand keeps moving, it keeps the watch ticking.\n\n0:04:34\tSPEAKER_00\n But I don't know if it is a good idea for a remote control because it'll just lie there for a long while sometimes. As soon as you pick it up, it moves and then again, it recharges or something.\n\n0:04:44\tSPEAKER_00\n And the fourth option is the solar cells, which are also made by the company environment friendly.\n\n0:04:52\tSPEAKER_00\n Okay.\n\n0:04:54\tSPEAKER_00\n So I'll enlist things and then we can come back and discuss what we think from everybody's perspective. There are different cases that can be provided.\n\n0:05:05\tSPEAKER_00\n They can be basically the shape of the cases. They can be flat. They can be curved with one sided curved and one side flat.\n\n0:05:18\tSPEAKER_00\n They can be curved with on both the sides. These are the three options.\n\n0:05:29\tSPEAKER_03\n I mean, this would be like they were all shape of the remote control. Yeah. Would it be flat on both the sides?\n\n0:05:36\tSPEAKER_00\n They can be curved from one side or there were different kind of supplements available. Like it can be plastic, rubber, wood or titanium.\n\n0:05:49\tSPEAKER_01\n Would you say, whoa, wood, wood.\n\n0:05:52\tSPEAKER_04\n Yeah, you understand why we get to purpose.\n\n0:05:57\tSPEAKER_00\n So we can use even so titanium is also used in the company to make some space design equipment.\n\n0:06:08\tSPEAKER_00\n So it's kind of it'll be probably nicer to use because it relates to the overall image of company.\n\n0:06:15\tSPEAKER_00\n But it cannot be used on a double third surface. If we choose this, we cannot use titanium for these two. We can use titanium, wood, rubber or plastic.\n\n0:06:30\tSPEAKER_00\n Okay. The interface options now.\n\n0:06:33\tSPEAKER_00\n So we can have push buttons like most remote too. And our company is an expert in making push buttons.\n\n0:06:45\tSPEAKER_00\n We can have scroll wheels like the ones on mouse pointer.\n\n0:06:51\tSPEAKER_00\n Yeah, something like that.\n\n0:06:56\tSPEAKER_00\n And they can even have an integrated push button inside the scrolling.\n\n0:07:03\tSPEAKER_00\n So this is something that has been recently developed by the company in the last decade.\n\n0:07:10\tSPEAKER_00\n So not too recent. And LCDs. We can have LCDs. These two are recent.\n\n0:07:17\tSPEAKER_00\n And this is quite old. The various electronic options are.\n\n0:07:29\tSPEAKER_00\n So this concerns first of all the chips. I showed you that.\n\n0:07:34\tSPEAKER_00\n So there's a chip behind this one, right? The PCB is inexpensive.\n\n0:07:39\tSPEAKER_00\n So we can put in whatever we want. But the various integrated circuit options are. We have either a simple one.\n\n0:07:49\tSPEAKER_00\n Or a regular.\n\n0:07:53\tSPEAKER_00\n Or advanced.\n\n0:07:57\tSPEAKER_00\n And the price goes up.\n\n0:08:02\tSPEAKER_00\n So the good thing about why we would want to use advanced.\n\n0:08:11\tSPEAKER_00\n Why we might want to use advanced is that LCDs can only come with the advanced chip.\n\n0:08:19\tSPEAKER_00\n We need regular or advanced for scroll wheels.\n\n0:08:30\tSPEAKER_00\n And the chip basically includes the infrared center.\n\n0:08:36\tSPEAKER_00\n Besides this in the electronics.\n\n0:08:40\tSPEAKER_00\n Also the company has started making a sample center which did not explain what it was.\n\n0:08:47\tSPEAKER_00\n But I'm guessing that.\n\n0:08:50\tSPEAKER_00\n So they have a sample center and a sample speaker.\n\n0:08:55\tSPEAKER_00\n So I'm guessing that the sample speaker is probably something like.\n\n0:09:00\tSPEAKER_00\n You know, as soon as you press a button, it.\n\n0:09:03\tSPEAKER_00\n It gives you feedback. One.\n\n0:09:06\tSPEAKER_00\n Five, whatever. Yeah, on.\n\n0:09:10\tSPEAKER_00\n And I don't know whether simple center has to do something with voice recognition or not.\n\n0:09:16\tSPEAKER_00\n But anyway, so these are the different options that we have.\n\n0:09:20\tSPEAKER_00\n Okay, so that's that's basically now.\n\n0:09:25\tSPEAKER_00\n I think that we can integrate.\n\n0:09:28\tSPEAKER_00\n You know, the user interface.\n\n0:09:31\tSPEAKER_00\n And the marketing things in that.\n\n0:09:34\tSPEAKER_00\n Keep taking out things from this and.\n\n0:09:37\tSPEAKER_02\n And lining things that are important.\n\n0:09:39\tSPEAKER_02\n Do you want to stay somewhere near the board so that if we need to.\n\n0:09:43\tSPEAKER_02\n Yeah, you can sit down.\n\n0:09:45\tSPEAKER_02\n But we might need to delay.\n\n0:09:48\tSPEAKER_03\n And I have some PowerPoint.\n\n0:09:51\tSPEAKER_03\n Yeah.\n\n0:09:54\tSPEAKER_03\n Oh, yeah.\n\n0:10:20\tSPEAKER_02\n Okay.\n\n0:10:30\tSPEAKER_03\n Okay.\n\n0:10:37\tSPEAKER_03\n To be honest, actually, I mentioned some some of the things which which could fit under under this talk.\n\n0:10:44\tSPEAKER_03\n This time, I mentioned the more idea in the previous talk.\n\n0:10:47\tSPEAKER_03\n So, yeah, this time, I might not have them on the slides, but I can just mention them again.\n\n0:10:55\tSPEAKER_03\n Okay.\n\n0:10:57\tSPEAKER_03\n So I thought I would also include the definition of using interface.\n\n0:11:03\tSPEAKER_03\n So it's the aspects of a computer system or program which can be seen by the user.\n\n0:11:11\tSPEAKER_03\n And which the mechanism that the user uses to control his operation and input data.\n\n0:11:17\tSPEAKER_03\n So this would include things like shape and size and buttons and voice recognition as well.\n\n0:11:23\tSPEAKER_03\n And color and so on.\n\n0:11:27\tSPEAKER_03\n The method I employed this time was again having a look to related products and mainly on the internet.\n\n0:11:35\tSPEAKER_03\n And then analyze them from the point of view of user friendliness and also whether their appearance was pleasant.\n\n0:11:50\tSPEAKER_03\n And then this can help us to decide which features we want to incorporate in our product.\n\n0:12:01\tSPEAKER_03\n So some findings.\n\n0:12:06\tSPEAKER_03\n So in the case of many user interfaces, they are just so full of buttons that it's actually hard to find the ones you really want to use.\n\n0:12:17\tSPEAKER_03\n And it's just confusing.\n\n0:12:19\tSPEAKER_03\n It takes time to learn.\n\n0:12:23\tSPEAKER_03\n Okay.\n\n0:12:24\tSPEAKER_03\n So I thought I would just quickly show some of them that I found.\n\n0:12:31\tSPEAKER_03\n Okay. Some of them are here.\n\n0:12:34\tSPEAKER_03\n Well, the picture is not very clear, but as you can see there are actually.\n\n0:12:37\tSPEAKER_03\n Oh, sorry for that.\n\n0:12:40\tSPEAKER_03\n Let's go back.\n\n0:12:43\tSPEAKER_03\n Oh, please.\n\n0:12:48\tSPEAKER_03\n So yeah, they are quite big and have many, many buttons.\n\n0:12:55\tSPEAKER_03\n Actually, all these I personally prefer this one because it's the smallest and with the smallest number of buttons as well.\n\n0:13:02\tSPEAKER_03\n And I would say even the appearance of some of them is kind of not so nice.\n\n0:13:10\tSPEAKER_03\n Okay.\n\n0:13:13\tSPEAKER_03\n So let's carry on with this.\n\n0:13:20\tSPEAKER_03\n So other findings.\n\n0:13:23\tSPEAKER_03\n Some new things used.\n\n0:13:27\tSPEAKER_03\n Some of them were mentioned already by our technical designer.\n\n0:13:34\tSPEAKER_03\n Our own company has developed a new user interface.\n\n0:13:38\tSPEAKER_03\n Wait, no, this is not the one.\n\n0:13:40\tSPEAKER_03\n There is a, we can include voice recognition and it allows, it's possible to record 80 different voice samples on it.\n\n0:13:51\tSPEAKER_03\n So this one was already mentioned, the LCD display.\n\n0:13:57\tSPEAKER_03\n Another new development is a scroll button, which was also already mentioned.\n\n0:14:02\tSPEAKER_03\n And our own manufacturing division has designed a new programmable speech, sorry, a speaker unit I guess it should be.\n\n0:14:19\tSPEAKER_03\n And this means that it comes together with a voice recognition, but it's once the gadget recognizes the voice of the speaker, there can be pre-programmed answer.\n\n0:14:35\tSPEAKER_03\n For example, you can pick up the remote control and say something to it like hello and it says hello and your name or whatever.\n\n0:14:43\tSPEAKER_03\n I mean, this is also one of the new developments, we might consider if we wanted to.\n\n0:14:50\tSPEAKER_00\n Can you go back for a second.\n\n0:14:52\tSPEAKER_00\n Are you sure what this means, the spinning wheel with the LCD display?\n\n0:14:57\tSPEAKER_03\n It's like the, like you said, no, the scroll button is a different thing.\n\n0:15:03\tSPEAKER_03\n I have a picture, if you just a moment, I'll show you.\n\n0:15:07\tSPEAKER_03\n So I wasn't completely sure myself, but I think it's just like, it's a wheel, it's like not separate buttons.\n\n0:15:15\tSPEAKER_03\n Look, this one here, but I'm not really sure whether you can really turn it around.\n\n0:15:20\tSPEAKER_03\n It's like a press list or this.\n\n0:15:22\tSPEAKER_04\n Maybe I part is like, you know how you have your mouse and you go around and it's kind of like that and you spin around and it.\n\n0:15:32\tSPEAKER_04\n So instead of going down, you just spin around and it's a bit weird at first, but it's actually very like fast.\n\n0:15:39\tSPEAKER_04\n Like the wheels that click on the side, you get a much slower, so it's quite good if you're like searching quite a lot of stuff.\n\n0:15:46\tSPEAKER_04\n I know, if you're looking, you're going through the A to Z of your music and you're looking for something at T.\n\n0:15:51\tSPEAKER_04\n Then it's a lot faster than the wheel, but you've got a lot less control over.\n\n0:15:55\tSPEAKER_00\n So I just want to include that here as well, series plus spinning.\n\n0:16:04\tSPEAKER_03\n Okay, and the personal preference is pretty much the same as last time.\n\n0:16:09\tSPEAKER_03\n It has to be small, simple.\n\n0:16:11\tSPEAKER_03\n Okay, we decided to include voice recognition.\n\n0:16:14\tSPEAKER_03\n So the standard major buttons like gone off, the channels and then volume.\n\n0:16:23\tSPEAKER_03\n And then there has to be a menu on the screen.\n\n0:16:26\tSPEAKER_03\n And I also thought if we want to put it small and nice, and actually I quite like the idea of a scrolling button for voice like, I don't know, like on movements or something.\n\n0:16:44\tSPEAKER_03\n I think there is no reason why we can use something like this for the remote control.\n\n0:16:50\tSPEAKER_03\n So yeah, let's expand.\n\n0:16:53\tSPEAKER_02\n Okay, straight to trends and then we can discuss it all at once.\n\n0:17:05\tSPEAKER_01\n I can't really add a little bit of vibration.\n\n0:17:10\tSPEAKER_01\n If you take a bus do that.\n\n0:17:41\tSPEAKER_01\n Okay, cool.\n\n0:17:51\tSPEAKER_04\n What I do is search the inserts, come up with market trends.\n\n0:17:57\tSPEAKER_04\n And you know what users are going to be wanting in the near future.\n\n0:18:03\tSPEAKER_04\n Right? No, the first aspect is probably twice as important as the second aspect, which is twice as important as the third aspect.\n\n0:18:12\tSPEAKER_04\n So I mean the easy to use thing is fairly low down on there, which I think giving the target group is what you would expect.\n\n0:18:21\tSPEAKER_04\n You know, people want something new, something technologically innovative and different.\n\n0:18:27\tSPEAKER_04\n So the whole idea with the LCDs and the spinning and the colors and the voice recognition is quite like quite the thing to go for.\n\n0:18:34\tSPEAKER_04\n And yeah, it will just look frankly.\n\n0:18:40\tSPEAKER_00\n So maybe as you're discussing things, is it okay if we just keep highlighting things here?\n\n0:18:48\tSPEAKER_00\n So it could put.\n\n0:18:51\tSPEAKER_00\n Probably voice recognition is kind of important.\n\n0:18:57\tSPEAKER_00\n Maybe the LCD and the.\n\n0:19:00\tSPEAKER_00\n I have a point about LCD.\n\n0:19:03\tSPEAKER_00\n LCDs are basically for feedback to the user who is pressing buttons.\n\n0:19:08\tSPEAKER_00\n And the feedback can come through the television itself.\n\n0:19:12\tSPEAKER_04\n Do we need an LCD on the remote?\n\n0:19:15\tSPEAKER_04\n I think we've got one of those tell you our spot and you put the number in the remote and then you wait and then it goes to TV and then you wait and then it comes.\n\n0:19:24\tSPEAKER_04\n So it actually takes quite a long time.\n\n0:19:27\tSPEAKER_04\n If you get the number wrong, then it's a bit of a pain.\n\n0:19:29\tSPEAKER_04\n So I think you know a screen on the remote would probably get down any time and that.\n\n0:19:34\tSPEAKER_04\n But like we don't just do tend to get thrown out of it.\n\n0:19:37\tSPEAKER_02\n It is also quite nice though to have something here so you don't interrupt the picture on the screen.\n\n0:19:42\tSPEAKER_04\n That's true.\n\n0:19:45\tSPEAKER_04\n It would be like if you could make it integrate with the TV then it could come up with your information about what's on and you could just see that on the remote rather than having to interrupt your viewing pleasure.\n\n0:19:55\tSPEAKER_04\n But I think maybe a way to do it would be a similar way to how you have your mobile phone.\n\n0:19:59\tSPEAKER_04\n You know like you have the slide you want and you have the flip you want and then the screen is protected so it doesn't actually get scratched.\n\n0:20:05\tSPEAKER_04\n So you can have like what looks like a normal remote control or like a minimalist remote control so you've got your buttons one to nine, you're on and off and you're volume on that.\n\n0:20:14\tSPEAKER_04\n And then you want to mess about it, you flip it open and.\n\n0:20:18\tSPEAKER_00\n Okay so now we seem to have a consensus that LCDs are definitely the way to go because of style and.\n\n0:20:24\tSPEAKER_04\n Yeah so that kind of decides your whole chip thing.\n\n0:20:28\tSPEAKER_00\n You agree?\n\n0:20:29\tSPEAKER_00\n Yep.\n\n0:20:30\tSPEAKER_00\n Yeah.\n\n0:20:31\tSPEAKER_00\n Right.\n\n0:20:32\tSPEAKER_00\n So.\n\n0:20:33\tSPEAKER_00\n Okay.\n\n0:20:36\tSPEAKER_04\n Okay.\n\n0:20:38\tSPEAKER_04\n Apparently we should be writing inspiration so I just give it a heart.\n\n0:20:46\tSPEAKER_04\n So these will be an important feature for clothes shoes and furniture.\n\n0:20:50\tSPEAKER_04\n So I mean I'm taking this to mean you know carving us.\n\n0:20:55\tSPEAKER_04\n Do you know because you don't tend to get flat vegetables.\n\n0:20:58\tSPEAKER_04\n Possibly even and even.\n\n0:21:03\tSPEAKER_04\n That would be a good way to get in the whole RSI issue and.\n\n0:21:09\tSPEAKER_04\n Because I mean if you think most people use the remote control with their right hand right hands that you want to.\n\n0:21:15\tSPEAKER_04\n You carve it so that it's suitable for you.\n\n0:21:19\tSPEAKER_04\n Yeah.\n\n0:21:20\tSPEAKER_04\n I'm not quite sure about the relevance of material will be spongy.\n\n0:21:24\tSPEAKER_02\n Yeah.\n\n0:21:29\tSPEAKER_00\n Yeah.\n\n0:21:30\tSPEAKER_00\n Rubber.\n\n0:21:31\tSPEAKER_00\n Rubber.\n\n0:21:32\tSPEAKER_00\n But.\n\n0:21:33\tSPEAKER_00\n It's with.\n\n0:21:34\tSPEAKER_00\n With using.\n\n0:21:36\tSPEAKER_04\n I suppose you will get a right.\n\n0:21:42\tSPEAKER_02\n And it help if you drop it.\n\n0:21:46\tSPEAKER_02\n It protects it as well.\n\n0:21:48\tSPEAKER_02\n Yeah.\n\n0:21:49\tSPEAKER_02\n Yeah.\n\n0:21:50\tSPEAKER_00\n So if we use latex cases they won't allow us to use solar cells.\n\n0:21:57\tSPEAKER_00\n We could use titanium, wood or.\n\n0:22:06\tSPEAKER_02\n Or if we want to use the latex then we have to go with one of the other.\n\n0:22:12\tSPEAKER_02\n Yeah.\n\n0:22:13\tSPEAKER_04\n We should get the kinetic energy fairly easily.\n\n0:22:16\tSPEAKER_02\n Yeah.\n\n0:22:23\tSPEAKER_04\n So probably double curved surface is the way to go.\n\n0:22:29\tSPEAKER_00\n Yeah.\n\n0:22:30\tSPEAKER_00\n Yeah.\n\n0:22:31\tSPEAKER_00\n Yeah.\n\n0:22:32\tSPEAKER_00\n Or curved at one end and flat on the top.\n\n0:22:35\tSPEAKER_00\n Because I'm not sure if it is flat on both sides.\n\n0:22:38\tSPEAKER_00\n Then how much easy would it be to reach for buttons etc.\n\n0:22:42\tSPEAKER_04\n Yeah.\n\n0:22:49\tSPEAKER_04\n It depends on the whole.\n\n0:22:52\tSPEAKER_00\n It's like how you put your hammer so you can reach it in the middle.\n\n0:22:56\tSPEAKER_04\n Single side curved or double side curved does not say too much does it.\n\n0:23:00\tSPEAKER_04\n No, I don't think it makes a lot of difference.\n\n0:23:03\tSPEAKER_04\n I have one of those slightly fainted.\n\n0:23:05\tSPEAKER_04\n I mean the back is essentially straight but it's curved.\n\n0:23:09\tSPEAKER_04\n Yeah.\n\n0:23:12\tSPEAKER_04\n One side is straight.\n\n0:23:13\tSPEAKER_04\n And you know curved two sides means the whole thing is just to be curved but things.\n\n0:23:18\tSPEAKER_00\n Did it say anywhere in your research material about this lighting stuff?\n\n0:23:23\tSPEAKER_00\n Because I call it the intuition that I have I think the only options that we have with the cases are the E3.\n\n0:23:30\tSPEAKER_00\n Yeah.\n\n0:23:31\tSPEAKER_00\n Either you have a lot of surface to the case or a curved surface case.\n\n0:23:35\tSPEAKER_00\n Does not say anything about whether technically this stuff is available at all.\n\n0:23:40\tSPEAKER_04\n Yeah.\n\n0:23:41\tSPEAKER_04\n This is more about the protection of the LCD.\n\n0:23:44\tSPEAKER_04\n Which I think is very kind of on.\n\n0:23:46\tSPEAKER_04\n My research can tell me anything which is why we have all the pictures.\n\n0:23:49\tSPEAKER_04\n That is the beauty with my time.\n\n0:23:51\tSPEAKER_04\n Okay.\n\n0:23:52\tSPEAKER_04\n Cool.\n\n0:23:53\tSPEAKER_04\n We got.\n\n0:23:54\tSPEAKER_04\n Combined style with the level of functionality.\n\n0:23:57\tSPEAKER_04\n Beauty and price quality.\n\n0:23:59\tSPEAKER_04\n Thank you.\n\n0:24:00\tSPEAKER_04\n Okay.\n\n0:24:05\tSPEAKER_02\n So looking at what we've got.\n\n0:24:08\tSPEAKER_02\n We want to now display with a spinning wheel.\n\n0:24:12\tSPEAKER_00\n Let's try to rub off things.\n\n0:24:14\tSPEAKER_00\n Yeah.\n\n0:24:15\tSPEAKER_00\n So hand animals are definitely out.\n\n0:24:20\tSPEAKER_00\n You are not.\n\n0:24:22\tSPEAKER_02\n That's not streamlined and sexy having a wind up.\n\n0:24:27\tSPEAKER_00\n I think that's really good.\n\n0:24:30\tSPEAKER_00\n I think that's the kind of kind of a.\n\n0:24:34\tSPEAKER_00\n I think it's not the practicality of a release.\n\n0:24:37\tSPEAKER_00\n As against a watch which constantly keeps moving this thing will have to be tapped every time.\n\n0:24:41\tSPEAKER_00\n Which might be very frustrating for the user.\n\n0:24:44\tSPEAKER_02\n Depends how much.\n\n0:24:45\tSPEAKER_02\n How much.\n\n0:24:46\tSPEAKER_02\n The movement really needs.\n\n0:24:48\tSPEAKER_01\n I don't know if they're suggesting it.\n\n0:24:51\tSPEAKER_00\n Then what could be.\n\n0:24:53\tSPEAKER_00\n Okay.\n\n0:24:54\tSPEAKER_00\n The flat completely flat case is definitely out.\n\n0:24:59\tSPEAKER_00\n It has to be at least up.\n\n0:25:01\tSPEAKER_00\n Yeah.\n\n0:25:02\tSPEAKER_01\n Not very strong.\n\n0:25:04\tSPEAKER_00\n Okay.\n\n0:25:07\tSPEAKER_00\n We still have all the options.\n\n0:25:09\tSPEAKER_00\n Would you think would.\n\n0:25:11\tSPEAKER_03\n I can't.\n\n0:25:12\tSPEAKER_03\n How do you.\n\n0:25:13\tSPEAKER_03\n I mean, you can't keep it really small.\n\n0:25:16\tSPEAKER_03\n You can't make it like thin and.\n\n0:25:19\tSPEAKER_03\n Right.\n\n0:25:20\tSPEAKER_03\n You need to put all the technology in.\n\n0:25:24\tSPEAKER_03\n If the case, you add the case.\n\n0:25:27\tSPEAKER_00\n If it is really.\n\n0:25:28\tSPEAKER_00\n It's a bit bulky.\n\n0:25:29\tSPEAKER_00\n If it is really thin, it's likely to break.\n\n0:25:32\tSPEAKER_00\n It's much more.\n\n0:25:33\tSPEAKER_02\n Given that we're looking at more spongy material preferences.\n\n0:25:38\tSPEAKER_02\n Would think.\n\n0:25:39\tSPEAKER_02\n Yeah, I would.\n\n0:25:40\tSPEAKER_04\n It's not very clean.\n\n0:25:43\tSPEAKER_04\n That's true.\n\n0:25:44\tSPEAKER_04\n It's not practical.\n\n0:25:47\tSPEAKER_04\n It's quite for a table, but for a microphone.\n\n0:25:50\tSPEAKER_04\n And splinters and stuff.\n\n0:25:53\tSPEAKER_00\n Yeah.\n\n0:25:54\tSPEAKER_00\n Okay.\n\n0:25:55\tSPEAKER_04\n It does make me sense.\n\n0:25:57\tSPEAKER_03\n Yeah.\n\n0:25:58\tSPEAKER_03\n In the case of remote control, more really.\n\n0:26:01\tSPEAKER_00\n Okay.\n\n0:26:02\tSPEAKER_00\n Now for the really interesting stuff, the interface.\n\n0:26:04\tSPEAKER_00\n Yeah.\n\n0:26:05\tSPEAKER_00\n Right.\n\n0:26:06\tSPEAKER_00\n So the push buttons is our expertise in the industry.\n\n0:26:11\tSPEAKER_00\n But it seems to be out of trend.\n\n0:26:14\tSPEAKER_00\n You know, nobody.\n\n0:26:15\tSPEAKER_03\n Yeah, but I think for the channel numbers, you still need them.\n\n0:26:20\tSPEAKER_03\n What do you?\n\n0:26:21\tSPEAKER_04\n Yeah.\n\n0:26:22\tSPEAKER_04\n Yeah.\n\n0:26:23\tSPEAKER_00\n Right.\n\n0:26:24\tSPEAKER_00\n So for channel numbers.\n\n0:26:25\tSPEAKER_00\n If we have LCD displays that opens up a whole world.\n\n0:26:27\tSPEAKER_00\n You know, if you have an LCD display, then you can stack almost everything on the LCD display.\n\n0:26:32\tSPEAKER_03\n Yeah, but I think the LCD display is kind of, yeah, it's faster.\n\n0:26:35\tSPEAKER_03\n And when we discuss that we might like this flipping open thing, then I mean, you can use it as a normal remote control.\n\n0:26:45\tSPEAKER_03\n But if you do want to use LCD, then you'll flip it open, but it's more time consuming.\n\n0:26:49\tSPEAKER_04\n I think this is getting back to the graph at the beginning.\n\n0:26:52\tSPEAKER_04\n I made where, you know, the buttons, the people use all the time.\n\n0:26:55\tSPEAKER_04\n You want buttons for them.\n\n0:26:56\tSPEAKER_00\n Yeah.\n\n0:26:57\tSPEAKER_00\n And everything else.\n\n0:26:58\tSPEAKER_00\n Yeah.\n\n0:26:59\tSPEAKER_00\n Many don't.\n\n0:27:00\tSPEAKER_00\n So in the buttons we have, for the channels also, we have options.\n\n0:27:03\tSPEAKER_00\n Do we enumerate everything from 0 to 9?\n\n0:27:06\tSPEAKER_00\n Or do we have just a channel plus channel minus just?\n\n0:27:10\tSPEAKER_03\n I mean, we definitely need the numbers because otherwise people don't want to flip through all the channels.\n\n0:27:17\tSPEAKER_02\n Do we need them as buttons?\n\n0:27:19\tSPEAKER_00\n Or do we need them as LCD?\n\n0:27:20\tSPEAKER_00\n On the LCD we can, you know.\n\n0:27:22\tSPEAKER_03\n Yeah, I would say buttons because it's...\n\n0:27:25\tSPEAKER_03\n Yeah.\n\n0:27:26\tSPEAKER_04\n It is.\n\n0:27:27\tSPEAKER_04\n So, I think the thing is, so if someone just wants to turn on the TV and put on a channel, then it should be easier to use.\n\n0:27:34\tSPEAKER_04\n And then any of them are made.\n\n0:27:41\tSPEAKER_04\n And then if someone wants to, you know, change the contest on their TV and...\n\n0:27:43\tSPEAKER_04\n Right.\n\n0:27:44\tSPEAKER_04\n They should be able to do that and it should be accessible.\n\n0:27:46\tSPEAKER_04\n But, you know, I mean, most of the time, I mean, there's a limit to how much the biggest technology can spend fiddling with the TV.\n\n0:27:51\tSPEAKER_04\n Right.\n\n0:27:52\tSPEAKER_04\n I think it's the issue.\n\n0:27:54\tSPEAKER_00\n Okay.\n\n0:27:55\tSPEAKER_00\n So, buttons definitely.\n\n0:27:57\tSPEAKER_00\n But, okay.\n\n0:27:58\tSPEAKER_00\n Shall we try to draw our...\n\n0:28:01\tSPEAKER_02\n I think that's what you guys are going to do next.\n\n0:28:04\tSPEAKER_02\n So, if we put down the key...\n\n0:28:06\tSPEAKER_00\n Okay.\n\n0:28:07\tSPEAKER_00\n So, components.\n\n0:28:08\tSPEAKER_00\n So, what about the scrolling?\n\n0:28:13\tSPEAKER_03\n Yeah, but I'm not completely clear.\n\n0:28:16\tSPEAKER_03\n Yeah, about the spinning wheel.\n\n0:28:19\tSPEAKER_03\n So, I think it doesn't make sense to have both, like, a scrolling and spinning thing.\n\n0:28:25\tSPEAKER_03\n You cannot include everything in the spinning wheel.\n\n0:28:27\tSPEAKER_03\n If you've just spinning it and not spinning it.\n\n0:28:29\tSPEAKER_04\n And I would say that the spinning goes at a higher speed to the scrolling wheel.\n\n0:28:33\tSPEAKER_04\n So, you have to decide whether you want to be going to say fast or not.\n\n0:28:38\tSPEAKER_04\n But, I mean, the thing with this whole...\n\n0:28:40\tSPEAKER_04\n You're planning on making it out of rubber on the basis that it's spun me.\n\n0:28:44\tSPEAKER_04\n And I'm not sure how well the scrolling wheel would work.\n\n0:28:47\tSPEAKER_02\n But if you've got a flip thing, effectively, it's something that's curved on one side and flat on the other side.\n\n0:28:54\tSPEAKER_02\n But you've folded it in half.\n\n0:28:56\tSPEAKER_04\n Yeah, but you're spinning wheel tends to go to one side.\n\n0:28:58\tSPEAKER_00\n I'm not sure it'll be a good idea to construct the whole thing out of rubber.\n\n0:29:02\tSPEAKER_00\n Yeah, I think so too.\n\n0:29:04\tSPEAKER_00\n I mean, the case would be rubbed on the buttons.\n\n0:29:07\tSPEAKER_00\n Or at the corner of the edges.\n\n0:29:09\tSPEAKER_00\n Just the edges covered by rubber or something like that.\n\n0:29:11\tSPEAKER_00\n Everything else in plastic or even titanium if you want to use it.\n\n0:29:15\tSPEAKER_04\n Or maybe, like, interchangeable cases.\n\n0:29:18\tSPEAKER_04\n Because I know, like, we're going back to iPods again, the whole spinning wheel.\n\n0:29:22\tSPEAKER_04\n But I have, like, obviously, iPods not made in rubber.\n\n0:29:26\tSPEAKER_04\n Then I have a little rubber case that goes over the top of it.\n\n0:29:29\tSPEAKER_04\n And I can change the color theoretically to match my outfit.\n\n0:29:33\tNone\n Right.\n\n0:29:35\tSPEAKER_00\n Okay, so that gives us a more trendy look as well.\n\n0:29:39\tSPEAKER_04\n Yeah, I think the spinning wheel is definitely very narrow.\n\n0:29:43\tSPEAKER_00\n Right.\n\n0:29:44\tSPEAKER_00\n Yeah, and we're going more for the trends than for the usability anyway.\n\n0:29:47\tSPEAKER_00\n That's right.\n\n0:29:48\tSPEAKER_00\n Yeah, that's right.\n\n0:29:49\tSPEAKER_00\n So rub that out.\n\n0:29:53\tSPEAKER_00\n And colors can be provided with the case rather than...\n\n0:29:58\tSPEAKER_00\n But we still need to think about the color offer mode as such.\n\n0:30:02\tSPEAKER_03\n Yeah, I think it was a requirement that we use.\n\n0:30:06\tSPEAKER_03\n The colors of our company, so would it be like yellow, grey and black or something?\n\n0:30:11\tSPEAKER_03\n I guess.\n\n0:30:12\tSPEAKER_04\n That doesn't fit in with the whole vegetable team bananas.\n\n0:30:16\tSPEAKER_03\n Bananas?\n\n0:30:17\tSPEAKER_03\n Yellow?\n\n0:30:18\tSPEAKER_04\n Yeah, definitely.\n\n0:30:19\tSPEAKER_04\n I mean, do you think we could incorporate the colors of the company into the buttons and then make the color of the main remote, the color like vegetable colors, you know?\n\n0:30:26\tSPEAKER_04\n So you could have like, I mean, I suppose vegetable colors would be orange, green and some reds and maybe purple and then you'd paint with buttons and company colors to match.\n\n0:30:41\tSPEAKER_00\n Okay.\n\n0:30:42\tSPEAKER_00\n Okay, if you go over to the integrated circuits, since we are having LCDs, there's no way that we will be able to.\n\n0:30:52\tSPEAKER_00\n What we do need to consider, however, is that the price is going up with every such thing that we are considering.\n\n0:30:57\tSPEAKER_00\n But since LCDs seems to be a definite yes, so it seems to be one idea where we would want to spend.\n\n0:31:05\tSPEAKER_00\n So rub off the other two.\n\n0:31:09\tSPEAKER_04\n So we discounting solar energy because what was going to be used in there somewhere, or that was the...\n\n0:31:16\tSPEAKER_00\n So the constraint was...\n\n0:31:18\tSPEAKER_00\n We can't have solar panels with rubber.\n\n0:31:22\tSPEAKER_04\n So yeah, okay, so we lose that, I think.\n\n0:31:26\tSPEAKER_02\n Should we go for... if we're going for rubber, we think of it as our case.\n\n0:31:31\tSPEAKER_02\n And then...\n\n0:31:33\tSPEAKER_03\n And the buttons as well, I think?\n\n0:31:35\tSPEAKER_02\n Yeah, yeah.\n\n0:31:37\tSPEAKER_00\n I think we'll have...\n\n0:31:40\tSPEAKER_00\n Using simple battery will be a safer option as compared to the kinetic energy one.\n\n0:31:46\tSPEAKER_00\n I mean, although it does seem interesting, but it does not hold any advantages as well.\n\n0:31:52\tSPEAKER_00\n Yeah, it's just a kinetic...\n\n0:31:58\tSPEAKER_00\n Okay.\n\n0:32:00\tSPEAKER_00\n Okay, so we understand this better now that the speaker is for the feedback, right?\n\n0:32:04\tSPEAKER_00\n It says the things that you type in or something like that.\n\n0:32:08\tSPEAKER_02\n So...\n\n0:32:10\tSPEAKER_02\n I think if we can include them at not too much extra cost, then I'd put them in.\n\n0:32:14\tSPEAKER_00\n We don't have too much information about it.\n\n0:32:17\tSPEAKER_03\n Yeah, but I think it should be quite cheap because it's from the company.\n\n0:32:21\tSPEAKER_00\n It's from the company.\n\n0:32:23\tSPEAKER_00\n Okay, so this isn't as well then.\n\n0:32:26\tSPEAKER_00\n Yeah.\n\n0:32:28\tSPEAKER_02\n Okay.\n\n0:32:30\tSPEAKER_02\n And the case is curved on one side, but then flat on the top.\n\n0:32:34\tSPEAKER_02\n So it's flipped into each other.\n\n0:32:40\tSPEAKER_00\n Okay.\n\n0:32:43\tSPEAKER_02\n Can I pull the...\n\n0:32:47\tSPEAKER_02\n Yeah, sure.\n\n0:32:48\tSPEAKER_02\n Can I pull the...\n\n0:32:54\tSPEAKER_01\n Just so I can...\n\n0:32:57\tSPEAKER_04\n Sorry, I just...\n\n0:33:01\tSPEAKER_02\n Nothing gets far.\n\n0:33:10\tSPEAKER_04\n What is ICIC?\n\n0:33:13\tSPEAKER_00\n ICICs? Integrated circuits?\n\n0:33:15\tSPEAKER_04\n Okay.\n\n0:33:17\tSPEAKER_04\n So it's advanced integrated circuits?\n\n0:33:20\tSPEAKER_04\n Yeah.\n\n0:33:22\tSPEAKER_00\n We're definitely going in for voice recognition as well as on CDs.\n\n0:33:30\tSPEAKER_00\n Yeah.\n\n0:33:32\tNone\n Okay.\n\n0:33:35\tSPEAKER_02\n So we've basically worked out that we're going with a simple battery, the advanced chip.\n\n0:34:01\tSPEAKER_02\n And curved on one side case, which is folded in on itself, made out of rubber.\n\n0:34:09\tSPEAKER_02\n And buttons are also rubber.\n\n0:34:13\tSPEAKER_02\n We're having push buttons on the outside.\n\n0:34:15\tSPEAKER_02\n And then on the inside and LCD with spinning wheel, we're incorporating voice recognition.\n\n0:34:22\tSPEAKER_02\n That's how I've all contacted it.\n\n0:34:24\tSPEAKER_02\n And it's going to look sort of vegetal.\n\n0:34:27\tSPEAKER_02\n And being bright, vegetal colours.\n\n0:34:31\tSPEAKER_03\n So would we have the spinning wheel inside with the LCD or would it be on the older?\n\n0:34:37\tSPEAKER_04\n Imagine it would be inside.\n\n0:34:39\tSPEAKER_04\n Okay.\n\n0:34:40\tSPEAKER_04\n So actually that could really cut down your thing.\n\n0:34:44\tSPEAKER_04\n So you've got your outside, which is minimalist, and then you open it up.\n\n0:34:48\tSPEAKER_04\n You've got a screen and a spinning wheel which you can incorporate buttons in to.\n\n0:34:54\tSPEAKER_04\n So you still not got a lot of stuff in there.\n\n0:34:58\tSPEAKER_04\n You've maybe got, you know, like if you're modelling on iPod, you've got five buttons and a wheel.\n\n0:35:05\tSPEAKER_04\n And four buttons are in the wheel.\n\n0:35:08\tSPEAKER_04\n And the other one's a little bit inside the wheel.\n\n0:35:12\tSPEAKER_02\n Okay.\n\n0:35:13\tSPEAKER_02\n So now we've got 30 minutes before our next meeting.\n\n0:35:17\tSPEAKER_02\n In the meantime, the industrial designer over here is going to work on the look and feel design, which I presume will work out what comes.\n\n0:35:27\tSPEAKER_02\n The user interface designer will work on the user interface design.\n\n0:35:31\tSPEAKER_02\n And the marketing expert is going to work on productive evaluation.\n\n0:35:37\tSPEAKER_02\n And as well as that, the two designers are going to work together on our prototype following those instructions that we've just come up with using modelling plates.\n\n0:35:46\tSPEAKER_02\n And you will get extra instructions from your personal coach.\n\n0:35:53\tSPEAKER_02\n Is that all okay?\n\n0:35:54\tSPEAKER_02\n And anyone who hasn't put their presentation in the project document folder, it would be good just so in case we have to refer to it.\n\n0:36:06\tSPEAKER_04\n I'm going to go and sell my in.\n\n0:36:09\tSPEAKER_04\n Nobody wants to talk to me.\n\n0:36:16\tSPEAKER_03\n Shall I move away first or shall I say here?\n\n0:36:20\tSPEAKER_03\n I don't know.\n\n0:36:21\tSPEAKER_03\n I would care.\n\n", "summary": [{"summary_text": "The meeting is going to follow more or less the same structure as last time. Speaker will discuss the components, properties, materials, the user interface and any trends that the marketing expert has been watching. He will also discuss the various components, including the batteries and hand dynamos."}]}