{"filename": "./data/ES2013b.txt", "transcript": "0:00:00\tSPEAKER_03\n Oh, it fell off.\n\n0:00:07\tSPEAKER_03\n Yeah, we're ready.\n\n0:00:16\tSPEAKER_03\n Okay, welcome to this second meeting.\n\n0:00:23\tSPEAKER_03\n It's now quarter after 12 and we're given 40 minutes for this meeting.\n\n0:00:29\tSPEAKER_03\n This is a meeting on functional design.\n\n0:00:34\tSPEAKER_03\n And I want to welcome you all and thank you all for doing some research in between.\n\n0:00:40\tSPEAKER_03\n I did took minutes from the first meeting and I'll show them to you in a moment.\n\n0:00:46\tSPEAKER_03\n I know each of you have a presentation and in thinking about the 40 minutes, I thought it would take only like three minutes for the previous minutes.\n\n0:00:56\tSPEAKER_03\n Each of you having about seven minutes, maybe a little less for your presentations and a little discussion.\n\n0:01:06\tSPEAKER_03\n Because I had to have been told there was a new project requirements and we have to make some decision on what functions it will have.\n\n0:01:16\tSPEAKER_03\n Okay.\n\n0:01:18\tSPEAKER_03\n Does everybody agree with this?\n\n0:01:21\tSPEAKER_03\n Yes.\n\n0:01:22\tSPEAKER_03\n Okay.\n\n0:01:25\tSPEAKER_03\n And after the meeting, there'll be things to be done.\n\n0:01:29\tSPEAKER_03\n And as you can see, it says we get to get lunch and then some more individual work and then putting minutes away and individual actions.\n\n0:01:41\tSPEAKER_03\n But now for the minutes of the first meeting.\n\n0:01:49\tSPEAKER_03\n So we'll talk about that one.\n\n0:01:52\tSPEAKER_03\n As you can see, it was this earlier today.\n\n0:01:57\tSPEAKER_03\n Kate, Steph, Sarah and myself in our four capacities were present.\n\n0:02:02\tSPEAKER_03\n I opened the meeting.\n\n0:02:04\tSPEAKER_03\n The product was developed and reviewed.\n\n0:02:09\tSPEAKER_03\n And we talked about the financial end of it.\n\n0:02:12\tSPEAKER_03\n And it's some implications.\n\n0:02:15\tSPEAKER_03\n Sales target and new ideas of not too many buttons, bright colors and some of the influence of the Japanese.\n\n0:02:25\tSPEAKER_03\n And we closed early so you could then proceed with your research and getting reports together for this meeting.\n\n0:02:33\tSPEAKER_03\n Anybody have any questions on those minutes?\n\n0:02:37\tSPEAKER_03\n Are they complete? Did they discuss everything that we covered last time?\n\n0:02:43\tSPEAKER_02\n Did I miss something?\n\n0:02:47\tSPEAKER_02\n We talked about the individual roles that we each had as well.\n\n0:02:52\tSPEAKER_03\n Yeah.\n\n0:02:54\tSPEAKER_03\n I'm afraid I incorporated that when I said who was present.\n\n0:02:57\tSPEAKER_03\n Okay.\n\n0:02:58\tSPEAKER_03\n Yes.\n\n0:02:59\tSPEAKER_03\n We did and we did a little bit of team building of both making the pictures.\n\n0:03:03\tSPEAKER_03\n But I didn't think those were appropriate to the minutes necessarily.\n\n0:03:07\tSPEAKER_03\n So as a group, I think we are accepting minutes.\n\n0:03:16\tSPEAKER_00\n Okay.\n\n0:03:17\tSPEAKER_00\n Is that what we were supposed to say?\n\n0:03:20\tSPEAKER_00\n Yeah.\n\n0:03:21\tSPEAKER_01\n Yeah, I did.\n\n0:03:23\tSPEAKER_03\n Good.\n\n0:03:24\tSPEAKER_03\n Then we'll move to the three presentations.\n\n0:03:28\tSPEAKER_03\n Okay.\n\n0:03:30\tSPEAKER_03\n Okay.\n\n0:03:33\tSPEAKER_03\n We need to move this.\n\n0:03:38\tSPEAKER_03\n Who wants to go first?\n\n0:03:44\tSPEAKER_03\n That's as far as it goes.\n\n0:03:49\tSPEAKER_01\n I don't know if it's actually these.\n\n0:03:52\tSPEAKER_01\n Oh, it doesn't have any on this one.\n\n0:03:57\tSPEAKER_02\n Excellent.\n\n0:03:58\tSPEAKER_02\n Thank you.\n\n0:03:59\tSPEAKER_02\n She said we didn't need to screw it in.\n\n0:04:22\tSPEAKER_03\n Okay.\n\n0:04:23\tSPEAKER_03\n Okay, that looks good.\n\n0:04:30\tSPEAKER_03\n It's doing its thing.\n\n0:04:32\tSPEAKER_00\n There we are.\n\n0:04:33\tSPEAKER_00\n All right.\n\n0:04:34\tSPEAKER_00\n Thank you very much.\n\n0:04:38\tSPEAKER_00\n One of the biggest issues I thought about from last meeting was the fact that we need to sell more million of these remote controls.\n\n0:04:50\tSPEAKER_00\n And I think that this is an opportunity to really take real reaction in the direction of similar hand-held tools that have been used and are used by many of us.\n\n0:05:05\tSPEAKER_00\n And to kind of bring the remote control into the same realm as an accessible, useful electronic device as opposed to something that is lost in the couch.\n\n0:05:17\tSPEAKER_00\n So my main goal here is to re-envision remote control in this context and to think about the functionality and the current technology and the fact that it could be interacted with other tools.\n\n0:05:32\tSPEAKER_00\n Some of the research in the market has shown that people really are not happy with remote controls as they are now.\n\n0:05:40\tSPEAKER_00\n And that means we do need to make some decisions about what keys or buttons on the remote control to perhaps keep and what one said is card.\n\n0:05:54\tSPEAKER_00\n And if we devote some energy into this, I think the recent productions of real reaction, I go everywhere power and the high-definition DVD players.\n\n0:06:08\tSPEAKER_00\n Although it makes immediate sense to have our remote control interact with these.\n\n0:06:14\tSPEAKER_00\n I think we can also use this as a platform to make it interact with other tools. And in fact, I think the high-definition DVD players and all of this will come along and we will only benefit from the positive feedback from our well-designed tool.\n\n0:06:30\tSPEAKER_00\n So again, most users really dislike the current look and feel of remote controls. 50% I think of all these numbers, most important is 50% of users say they only use 10% of the buttons.\n\n0:06:46\tSPEAKER_00\n And 80% of users, and if we think about this, there are a lot of television, DVDs, stereo, remote control users out there. 80% spend more money on a remote control that looks fancy.\n\n0:07:01\tSPEAKER_02\n Could come out with this comfort with this market?\n\n0:07:04\tSPEAKER_00\n It was marked at research and there were a hundred people in the room, so 80 out of 100 said they would spend more money.\n\n0:07:11\tSPEAKER_03\n In between, as the project manager, they sent me an email from the powers that be that teletext is outdated and the internet is coming in as important.\n\n0:07:23\tSPEAKER_03\n But that they want this remote control to only be for TV with incorporating the corporate image color and slogan.\n\n0:07:34\tSPEAKER_00\n I think we can really focus on this remote and bring the real reaction branding in and get some positive marketing for our tools, even if we don't advertise for the IGO everywhere.\n\n0:07:59\tSPEAKER_00\n So an interesting element was the, would you pay more for speech recognition questions?\n\n0:08:08\tSPEAKER_00\n So these market research questionnaires looked into your concern about technology and specifically wanted to find out information about speech recognition.\n\n0:08:24\tSPEAKER_00\n Now the early adopters, those of us who grew up with technology and lucky for us have the cash to pay for it, the young age group, without the mortgages and responsibilities, 91% of them would pay more for speech recognition in our remote control.\n\n0:08:49\tSPEAKER_00\n Very interesting. I leave this up to the group to decide if we want to use this in the designers, but 91%.\n\n0:08:58\tSPEAKER_03\n Is it a large enough target market to target it?\n\n0:09:01\tSPEAKER_00\n Well, I think, especially in terms of growth, I think this would be a very smart group to target.\n\n0:09:08\tSPEAKER_00\n I mean, three quarters of the next age group 25 to 35 are interested and with the technologies improving, if we can get things.\n\n0:09:18\tSPEAKER_03\n In real numbers, there's the 91% and the 76% translate to in excess of the 4 million or 8 million.\n\n0:09:29\tSPEAKER_00\n But would you pay more and doesn't work and is it approachable and did I know that it was?\n\n0:09:37\tSPEAKER_00\n That's a very good question.\n\n0:09:39\tSPEAKER_00\n I don't know if speech recognition should be included, but I think it's interesting. I think that maybe shows more about being open to technology.\n\n0:09:51\tSPEAKER_01\n Definitely.\n\n0:09:52\tSPEAKER_01\n I've got more research on how much more it would be and any existing examples and what reactions to them would be.\n\n0:10:04\tSPEAKER_02\n How well our target growth compares to the 50% of existing, that's a pretty good idea.\n\n0:10:13\tSPEAKER_02\n But if we're able to build this thing into 12 years, 50% is a natural.\n\n0:10:20\tSPEAKER_00\n Exactly. I mean, I did not receive any information on that, but I think the competition, assessing out what other people are doing and what's in the pipeline is very, very important.\n\n0:10:33\tSPEAKER_00\n Because there was a question about, you want an LCD screen that wasn't responded to, but some of the larger remotes do have screens where you can navigate.\n\n0:10:48\tSPEAKER_00\n It turns into something, perhaps you all have seen the Osborne Square, as the Osborne is attempting to manage the super entertainment system with something that looks like a small train.\n\n0:11:02\tSPEAKER_02\n I think it's a small population.\n\n0:11:09\tSPEAKER_02\n You're exactly right.\n\n0:11:11\tSPEAKER_00\n But I think the key is to get the early adopters, people with my own technology and they'll be...\n\n0:11:18\tSPEAKER_03\n We're not looking at whether the earlier adopters on that screen, that's looking at age groups.\n\n0:11:23\tSPEAKER_00\n Yes, and I'm making the leap that people who are familiar with technology, that are comfortable.\n\n0:11:39\tSPEAKER_00\n Okay, you had the other power. I think the most important thing is an attractive streamlined remote control and to be extraordinarily reductionist, power, channel volume, and everything else is up to the designs.\n\n0:11:59\tSPEAKER_00\n And this is also supported by the market research.\n\n0:12:04\tSPEAKER_00\n Okay, thank you. That's my contribution.\n\n0:12:09\tSPEAKER_03\n All right.\n\n0:12:11\tSPEAKER_03\n And we'll turn to the next presentation.\n\n0:12:26\tSPEAKER_03\n I think she said we don't need to screw it in, just stick it in and then press FN and F8.\n\n0:12:38\tSPEAKER_03\n Next to the control button on the bottom and then F8 at the top.\n\n0:12:43\tSPEAKER_03\n And then we'll be patient.\n\n0:12:48\tSPEAKER_02\n Tada!\n\n0:12:58\tSPEAKER_02\n Can I not just do it to my order?\n\n0:13:03\tSPEAKER_02\n You can't be loaded.\n\n0:13:06\tSPEAKER_02\n There we are.\n\n0:13:16\tSPEAKER_01\n Great, technical functions design.\n\n0:13:22\tSPEAKER_01\n Well, I think first off, basically I do agree with what Sarah has defined as your personal preferences.\n\n0:13:32\tSPEAKER_01\n I think we need a more streamlined volume with no extraneous functions.\n\n0:13:41\tSPEAKER_01\n So my method was to look at the existing emotes and what functions they have.\n\n0:13:46\tSPEAKER_01\n And what we all need to discuss is whether we want these functions.\n\n0:13:51\tSPEAKER_01\n Pretty much the same as what existing emotes have if we can build on this with the speech recognition.\n\n0:13:57\tSPEAKER_01\n That's not something I've brought about at all.\n\n0:14:00\tSPEAKER_01\n But it's also something we can discuss.\n\n0:14:04\tSPEAKER_01\n And I presume we can miss out functions related to a video or DVD in look control.\n\n0:14:11\tSPEAKER_01\n If this is only going to be a TZM-like cable TV in look control.\n\n0:14:19\tSPEAKER_01\n So these are two models of existing look controls.\n\n0:14:24\tSPEAKER_01\n The one on the left seems to be a fairly standard universal in look control.\n\n0:14:32\tSPEAKER_01\n It has fast forward stop play or related to movies.\n\n0:14:37\tSPEAKER_01\n It also has, seems to have channel up and channel down, which is more of what we'd expect from either a sky or a cable in look control.\n\n0:14:47\tSPEAKER_01\n When you've got hundreds of channels instead of a nearly terrestrial one.\n\n0:14:54\tSPEAKER_01\n But I think we should be looking more along the lines of the one on the right, which has also have play, stop and pause.\n\n0:15:01\tSPEAKER_01\n I don't think we need them at all.\n\n0:15:04\tSPEAKER_01\n I think we just need channel selection volume up volume down.\n\n0:15:11\tSPEAKER_01\n And I think an inter function where you can access, it's not like teletext, but along the same line, the access things on the screen.\n\n0:15:26\tSPEAKER_01\n Not related to internet one that you mentioned because that would be fire outside our budget and what we want this to do.\n\n0:15:35\tSPEAKER_03\n And it's either requirements to expecting others.\n\n0:15:38\tSPEAKER_01\n Yeah, it's either requirements because the requirements really are just want to be able to change channels and functions, which is more of a text on the screen.\n\n0:15:51\tSPEAKER_01\n I don't know how to add your buttons, I was thinking something, something smooth, sleek, little, remote control, big user friendly buttons and a menu that you can access.\n\n0:16:07\tSPEAKER_01\n But then I do think we need to discuss the speech and recognition possibility.\n\n0:16:18\tSPEAKER_03\n Anything else you want?\n\n0:16:21\tSPEAKER_03\n Okay.\n\n0:16:22\tSPEAKER_01\n So we could go back to the pictures of the pictures of the local draws and possibly discuss what we think about them.\n\n0:16:36\tSPEAKER_01\n Or go, maybe just hear what Kate has to say.\n\n0:16:41\tSPEAKER_00\n Or be afterwards we could do a whiteboard that you're the one on the right as a basis.\n\n0:16:58\tSPEAKER_03\n I think the white, the one on the right as well as less cluttered.\n\n0:17:03\tSPEAKER_01\n Definitely less cluttered.\n\n0:17:06\tSPEAKER_01\n But still it's, it's there, but it's used something else I was going to say.\n\n0:17:12\tSPEAKER_01\n The style of these is terrifying.\n\n0:17:15\tSPEAKER_01\n Yeah.\n\n0:17:16\tSPEAKER_01\n I really think we need to not only possibly even materials, like the type of plastic used, but everything including size and shape of buttons, positioning of buttons, the actual shape of the handheld device colors.\n\n0:17:34\tSPEAKER_00\n Or the ergonomics.\n\n0:17:36\tSPEAKER_01\n Yeah, everything to do with this has to be revolutionized.\n\n0:17:43\tSPEAKER_01\n But.\n\n0:17:45\tSPEAKER_01\n So that's that for now.\n\n0:17:51\tSPEAKER_02\n Okay.\n\n0:18:07\tSPEAKER_02\n Okay.\n\n0:18:25\tSPEAKER_02\n Now I want to bring us down to earth again.\n\n0:18:46\tSPEAKER_02\n So let's go back to what the basic function of a remote control is.\n\n0:19:06\tSPEAKER_02\n So I think it's for sending a message to be by infrared.\n\n0:19:17\tSPEAKER_02\n And the basic components we've got to build in for our 12,000, 50 energy source, the user interface.\n\n0:19:29\tSPEAKER_02\n Incorporate an integrated circuit that actually composes the message based on what we, which buttons, the unit presses, we turn that into a message.\n\n0:19:41\tSPEAKER_02\n And then we need a sending mechanism to send it to the receiver.\n\n0:19:45\tSPEAKER_02\n Now I would have hoped, I think that's my only slide actually, yeah, I would have hoped to do you a pretty PowerPoint slide of my first cut design.\n\n0:19:57\tSPEAKER_02\n But unfortunately, technology defeated me. So if you're bear with me, I'll do it on the whiteboard.\n\n0:20:07\tSPEAKER_02\n So we want an energy source.\n\n0:20:16\tSPEAKER_02\n And we've got to think about what that might be.\n\n0:20:27\tSPEAKER_02\n And we have the user interface.\n\n0:20:46\tSPEAKER_02\n And the main components in there are the chip that actually has the intelligence of a machine that translates button presses into a message, which it then transfers to some sending mechanism, which encodes it.\n\n0:21:15\tSPEAKER_02\n And sends the message to the receiver.\n\n0:21:28\tSPEAKER_02\n So those are the basic things that we've got to get in the cloud.\n\n0:21:47\tSPEAKER_03\n But those things, as long as we can get those components, the block that rectangle for the user interface is where the user comes in and what's it look like, what do the buttons look like?\n\n0:22:05\tSPEAKER_03\n What does it feel like? That's where the user interface is really coming into its own.\n\n0:22:10\tSPEAKER_03\n The technical end is what's actually going to be in there. But also it has to be easy enough to change or repair if something goes wrong.\n\n0:22:24\tSPEAKER_03\n For example, the battery energy source or what if the chip for whatever reason breaks down after a certain amount of time, do you just replace it?\n\n0:22:39\tSPEAKER_03\n Because it may be in the same area with several other user interfaces like for DVDs, movies, whatever does it have to have a way of being segregated from the others in a different frequency or something?\n\n0:23:00\tSPEAKER_02\n Well, I'm a wrong here, but I've been thinking of this device as being a cheap mass-produced device, which I myself am really a modern.\n\n0:23:09\tSPEAKER_02\n That's almost one in every tent powder or whatever it is.\n\n0:23:15\tSPEAKER_02\n I haven't thought of it as being a repair, but I'm not convinced we've been put it into this box for the price that we're going to need to hit.\n\n0:23:30\tSPEAKER_00\n I've been thinking of a repair, some idea of how much it would cost to create a device that has B-spacic elements, because then...\n\n0:23:48\tSPEAKER_00\n I don't believe any of that. I'm not convinced my personal coach is going to give me some advice on my question.\n\n0:24:03\tSPEAKER_01\n It does seem like we're just doing something really simple and mass-produced, which is pretty much the same as these existing models, just maybe inspired, a little bit more inspired, but basically just the same.\n\n0:24:20\tSPEAKER_01\n Although what suddenly came into my head is they always take two AA batteries, which is really not very efficient at all.\n\n0:24:32\tSPEAKER_01\n It could be possible to have a rechargeable internal battery, like an NPC player does, or a mobile phone or whatever. You just plug into a parasol, and then it's charged for ages and ages and ages.\n\n0:24:50\tSPEAKER_00\n You don't have to worry if you're placing AA batteries, or that has another element, which is if every time you're done using the remote, you put it on a charger, then it has a battery.\n\n0:25:02\tSPEAKER_01\n You'd never need the batteries, but it also has a place. It's not stuck down the back of the sofa. But then again, I don't know if this is within our Christmassy internet.\n\n0:25:11\tSPEAKER_02\n I think that's a very interesting idea. I'm not a very good industrial designer, and I don't know much about what these things cost. I'll do some research for the next meeting.\n\n0:25:21\tSPEAKER_02\n Okay.\n\n0:25:22\tSPEAKER_00\n Better than the idea about solar.\n\n0:25:24\tSPEAKER_02\n So that may not be so good when you're watching TV in the night.\n\n0:25:29\tSPEAKER_03\n It would have to store up the energy, and then use it.\n\n0:25:36\tSPEAKER_03\n So that we can do that. We are not too heavy and cost too much.\n\n0:25:42\tSPEAKER_01\n No, but just a rechargeable internal battery would probably... I mean, it might cost more at first to develop and to install.\n\n0:25:51\tSPEAKER_01\n But for a long term use, there'll be so much more convenient and economic than fiddling around trying to replace chunky AA batteries, and not having any in your kitchen drawer.\n\n0:26:06\tSPEAKER_02\n You might make that a selling point if it was something that you could afford to develop.\n\n0:26:11\tSPEAKER_00\n Definitely, because I'm thinking in terms of the last and breakage of remote time, it's just to be a little dark, but you can't exactly...\n\n0:26:34\tSPEAKER_00\n And the dark could look very fancy.\n\n0:26:37\tSPEAKER_03\n That could be your inspiration.\n\n0:26:39\tSPEAKER_01\n So I don't know if you could decently...\n\n0:26:40\tSPEAKER_01\n So I don't know if you could decently...\n\n0:26:41\tSPEAKER_01\n...within our face age.\n\n0:26:42\tSPEAKER_00\n And we are talking about another component that can be a piece of it.\n\n0:26:46\tSPEAKER_03\n Okay. Are we agreed as to what our target group is, though?\n\n0:26:54\tSPEAKER_03\n Pretty much so that we'd be looking for the younger end.\n\n0:26:56\tSPEAKER_00\n Exactly.\n\n0:26:57\tSPEAKER_00\n I think you guys see the questions about are there an athlete's peacock?\n\n0:27:01\tSPEAKER_00\n Or are they making purchasing decisions?\n\n0:27:04\tSPEAKER_02\n Yeah, I'm just wondering that because I agree that people with...\n\n0:27:08\tSPEAKER_02\n How can I put it more money than a sentence?\n\n0:27:12\tSPEAKER_00\n I usually put more money than brains.\n\n0:27:16\tSPEAKER_00\n I'll make a note of that.\n\n0:27:18\tSPEAKER_02\n But what I was going to say was that although they may be buying personal music devices, and they're not all necessarily buying TV with my components, because they probably live in a household that has a TV of low end of their range.\n\n0:27:32\tSPEAKER_00\n It might be good to know who is actually buying time.\n\n0:27:38\tSPEAKER_00\n And are we in the region where people have many intentions?\n\n0:27:46\tSPEAKER_02\n I think we've got a big hill behind it.\n\n0:27:48\tSPEAKER_02\n I haven't really read about this way.\n\n0:27:49\tSPEAKER_02\n People who've got a remote control, because they can't even tell you that they should buy our product instead.\n\n0:27:54\tSPEAKER_03\n Or do we make sure that it goes through the manufacturer?\n\n0:27:58\tSPEAKER_03\n We sell to the manufacturer as the remote that goes with it.\n\n0:28:03\tSPEAKER_03\n That's probably what would be a more efficient way of doing it.\n\n0:28:09\tSPEAKER_00\n And some of our DV players incidentally have them because we have federal agencies that are putting the department that more of them into the go-to-go.\n\n0:28:19\tSPEAKER_03\n Okay.\n\n0:28:21\tSPEAKER_03\n Right.\n\n0:28:22\tSPEAKER_01\n Are you going to share any resolutions by the end of the day?\n\n0:28:25\tSPEAKER_03\n Probably not.\n\n0:28:28\tSPEAKER_03\n The other thing that we're supposed to do is make decision on our functions.\n\n0:28:37\tSPEAKER_03\n Our functions, we've so far decided, I think, that power channel volume, make it attractive.\n\n0:28:48\tSPEAKER_03\n It has to have an entry key and of course the number keys.\n\n0:28:52\tSPEAKER_03\n It has to have big user friendly buttons.\n\n0:28:59\tSPEAKER_03\n Definitely, we want to be inspired that the current styles are just playing awful.\n\n0:29:06\tSPEAKER_00\n Do we need...\n\n0:29:10\tSPEAKER_03\n Is that agreeable to everyone?\n\n0:29:12\tSPEAKER_00\n Actually, the entry key, I have a chart nearby, I didn't think food.\n\n0:29:19\tSPEAKER_00\n But it gives my view.\n\n0:29:22\tSPEAKER_03\n Which might throw some light on that.\n\n0:29:26\tSPEAKER_03\n Yeah, those are...\n\n0:29:29\tSPEAKER_00\n Okay, but a lot of charts.\n\n0:29:35\tSPEAKER_03\n Actually, we are almost a half hour out of the 40 minutes that we have to get close to finishing.\n\n0:29:41\tSPEAKER_00\n My only comment is, I think maybe we could somehow include an entry key in a power key.\n\n0:29:50\tSPEAKER_00\n Ah.\n\n0:29:51\tSPEAKER_00\n That was my only...\n\n0:29:54\tSPEAKER_00\n Okay.\n\n0:29:58\tSPEAKER_03\n Enter power as a simultaneous key.\n\n0:30:02\tSPEAKER_00\n Exactly.\n\n0:30:03\tSPEAKER_00\n Is that okay with you?\n\n0:30:06\tSPEAKER_01\n Sorry, I was reading the chart.\n\n0:30:10\tSPEAKER_02\n So, how do you avoid switching the thing off when you actually want to press enter?\n\n0:30:15\tSPEAKER_00\n Well, if you're pressing enter the thing without a beyond.\n\n0:30:20\tSPEAKER_00\n So, maybe when you press power, when you press power again, and you use that as an entry key.\n\n0:30:29\tSPEAKER_00\n So, you have to have an off key.\n\n0:30:32\tSPEAKER_00\n Well, I was thinking maybe to turn it off, you'd have to press power twice.\n\n0:30:36\tSPEAKER_00\n That's interesting.\n\n0:30:37\tSPEAKER_00\n And maybe power follows something like a channel down power, and then that would make that choice.\n\n0:30:44\tSPEAKER_02\n What could I do with it?\n\n0:30:47\tSPEAKER_02\n Well, I'd do this, or we just won't even get credit.\n\n0:30:50\tSPEAKER_00\n Or, yeah, or something that has a turning dial where far-ended...\n\n0:30:55\tSPEAKER_00\n Who's got an iPod then?\n\n0:30:58\tSPEAKER_00\n Yeah, I don't.\n\n0:31:00\tSPEAKER_00\n I wish.\n\n0:31:01\tSPEAKER_00\n Anyway, that was the only comment about some of the decisions people made.\n\n0:31:06\tSPEAKER_00\n What's most important?\n\n0:31:08\tSPEAKER_00\n Definitely channel-line power.\n\n0:31:10\tSPEAKER_01\n Yeah, things like screen settings and audio settings.\n\n0:31:13\tSPEAKER_01\n I would generally do them on the actual television itself.\n\n0:31:18\tSPEAKER_01\n Like, yeah, you have a little flap and a little control panel on the actual box itself.\n\n0:31:25\tSPEAKER_01\n I wouldn't know how to do it using a remote control.\n\n0:31:28\tSPEAKER_01\n So, I would say that they are definitely less relevant.\n\n0:31:34\tSPEAKER_00\n Okay.\n\n0:31:36\tSPEAKER_00\n Thanks for looking at that.\n\n0:31:44\tSPEAKER_03\n So, I guess easy to use is the other thing that we want to be able to do.\n\n0:31:49\tSPEAKER_03\n As you said, don't make it too hard for the granny.\n\n0:31:54\tSPEAKER_03\n I just joined that set last week.\n\n0:31:58\tSPEAKER_03\n Oh, I read this.\n\n0:32:05\tSPEAKER_03\n First grandchild arrived.\n\n0:32:08\tSPEAKER_03\n So, are we agreed then of those things?\n\n0:32:13\tSPEAKER_03\n And let's go back to agenda and hook me up.\n\n0:32:21\tSPEAKER_03\n I think it's going to be fun.\n\n0:32:28\tNone\n You probably won't go the first time.\n\n0:32:31\tSPEAKER_03\n I'll probably be able to mess.\n\n0:32:37\tSPEAKER_03\n Come on.\n\n0:32:38\tSPEAKER_03\n It lost it off here.\n\n0:32:44\tSPEAKER_03\n No, it was up there, but I couldn't see it down here.\n\n0:33:06\tSPEAKER_03\n This time it should be both.\n\n0:33:08\tSPEAKER_03\n There we go.\n\n0:33:10\tSPEAKER_02\n How do you do that?\n\n0:33:16\tSPEAKER_03\n You have to keep doing the FN and F8 to five minutes to finish.\n\n0:33:23\tSPEAKER_03\n Thank you a lot for telling me.\n\n0:33:27\tSPEAKER_03\n Right.\n\n0:33:30\tSPEAKER_03\n We're ready to close.\n\n0:33:33\tSPEAKER_03\n That will be completed a questionnaire.\n\n0:33:37\tSPEAKER_03\n I'm going to have some time for individual work to continue our research.\n\n0:33:43\tSPEAKER_03\n And I'll put some minutes of this meeting together.\n\n0:33:48\tSPEAKER_03\n Your individual assignments are for Kate to do the components for you staff to do the user interface.\n\n0:34:02\tSPEAKER_03\n We'll use the trend watching and each of us will get help from our coach.\n\n0:34:09\tSPEAKER_03\n We agreed to get ourselves together and then have lunch.\n\n0:34:15\tSPEAKER_03\n That's the end of this meeting.\n\n0:34:20\tSPEAKER_01\n I hope that's good enough for her to tell her that's the end.\n\n0:34:26\tSPEAKER_03\n I think I went over the functions and wrote them down and marked them.\n\n0:34:33\tSPEAKER_03\n That's what I went over and nobody was objecting to me.\n\n0:34:38\tSPEAKER_00\n You mentioned I was just going to say could you really go and meet my requirements?\n\n0:34:43\tSPEAKER_00\n It has to be for a TV just to be next time.\n\n0:34:48\tSPEAKER_03\n The teletext is outdated.\n\n0:34:51\tSPEAKER_03\n The internet is important.\n\n0:34:54\tSPEAKER_03\n It's only to be for a TV and it must include the corporate image, color and slogan, which I think is more in the user range with staff.\n\n0:35:07\tSPEAKER_01\n Is that the yellow and black?\n\n0:35:10\tSPEAKER_03\n It doesn't tell me.\n\n0:35:14\tSPEAKER_01\n I'll just use it in the website.\n\n0:35:21\tSPEAKER_02\n Okay.\n\n", "summary": [{"summary_text": "After the first meeting on functional design, Speaker, Kate, Steph, Sarah and Speaker are having a second meeting. They are given 40 minutes for this meeting. Speaker shows them the minutes from the first one. They discuss the product developed and reviewed, financial implications, sales target and new ideas of not too many buttons, bright colors and some of the influence of Japanese."}]}