{"filename": "./data/ES2003b.txt", "transcript": "0:00:00\tSPEAKER_01\n just put it on the desk, all I see is desktop.\n\n0:00:07\tSPEAKER_01\n No, on the desktop you should find that there's a project documents link.\n\n0:00:15\tSPEAKER_01\n Well, actually just there.\n\n0:00:17\tSPEAKER_01\n Project documents, yeah.\n\n0:00:18\tSPEAKER_01\n Yeah, that's it.\n\n0:00:19\tSPEAKER_01\n If you dump it in there.\n\n0:00:20\tSPEAKER_01\n What's a username?\n\n0:00:21\tSPEAKER_00\n A username.\n\n0:00:22\tSPEAKER_00\n What's a username and password?\n\n0:00:40\tSPEAKER_01\n Okay.\n\n0:00:41\tSPEAKER_01\n There we go.\n\n0:00:43\tSPEAKER_01\n Excellent.\n\n0:00:44\tSPEAKER_01\n Right.\n\n0:00:45\tSPEAKER_01\n Hopefully that's us ready to go.\n\n0:00:48\tSPEAKER_01\n So, functional design meeting.\n\n0:00:51\tSPEAKER_01\n We'll have to flesh out some of the stuff.\n\n0:00:56\tSPEAKER_01\n We'll start with the minutes of the last meeting.\n\n0:00:59\tSPEAKER_01\n Not a lot, thankfully, to say.\n\n0:01:01\tSPEAKER_01\n Introduce themselves.\n\n0:01:02\tSPEAKER_01\n Discuss the possibility of a macro facility.\n\n0:01:05\tSPEAKER_01\n Interact them to TV a bit more.\n\n0:01:08\tSPEAKER_01\n Mentioning of barcode.\n\n0:01:10\tSPEAKER_01\n Joystick for user manipulation.\n\n0:01:12\tSPEAKER_01\n And ergonomics of the remote control as well.\n\n0:01:17\tSPEAKER_01\n And it's come to my attention the following.\n\n0:01:22\tSPEAKER_01\n Teletext has come out dated due to the popular TV internet.\n\n0:01:27\tSPEAKER_01\n Remote control should only be used for the TV due for a time to market and possibly also cost issues.\n\n0:01:36\tSPEAKER_01\n Also key is the corporate image to stay recognizable.\n\n0:01:40\tSPEAKER_01\n Your color and slogan, of course, is down at the bottom there.\n\n0:01:46\tSPEAKER_01\n Now, just to say quickly, I would have thought that only being used for the television, the macro facility may now not be required.\n\n0:02:01\tSPEAKER_01\n Or its functionality would have been of limited use to the point, in my opinion, in any way that it might not be worth pursuing.\n\n0:02:10\tSPEAKER_01\n If anybody disagrees, we can definitely say so.\n\n0:02:14\tSPEAKER_01\n And hopefully we'll just crack on and we'll get everything going.\n\n0:02:19\tSPEAKER_01\n I'd like to, if it's possible, hear from our marketing expert first to help us gain an idea of where we're going to go.\n\n0:02:26\tSPEAKER_01\n So I'll just load up here presentation from here if you want.\n\n0:02:30\tSPEAKER_01\n Sure.\n\n0:02:31\tSPEAKER_00\n Would you like to start from here?\n\n0:02:38\tSPEAKER_00\n Yeah, that's it.\n\n0:02:41\tSPEAKER_01\n Is here Steve?\n\n0:02:46\tSPEAKER_00\n Um, try second one maybe.\n\n0:02:54\tSPEAKER_00\n Try it?\n\n0:02:55\tSPEAKER_00\n Yeah, maybe.\n\n0:02:56\tSPEAKER_00\n I'll say it.\n\n0:02:57\tSPEAKER_00\n Yeah.\n\n0:02:58\tSPEAKER_00\n Okay.\n\n0:02:59\tSPEAKER_00\n Right?\n\n0:03:00\tSPEAKER_00\n Uh, put up with it in my last name, I guess not.\n\n0:03:01\tSPEAKER_01\n But if you want me to just cycle through it for you, or, oh yeah, that would be fine.\n\n0:03:07\tSPEAKER_00\n That would be great.\n\n0:03:08\tSPEAKER_00\n Okay.\n\n0:03:11\tSPEAKER_00\n Functional requirement by me, Ebeneza.\n\n0:03:14\tSPEAKER_00\n Okay.\n\n0:03:15\tSPEAKER_00\n Okay.\n\n0:03:16\tSPEAKER_00\n Okay.\n\n0:03:17\tSPEAKER_00\n So, um, we did some research.\n\n0:03:19\tSPEAKER_00\n We asked 100 people their opinions on remote controls.\n\n0:03:23\tSPEAKER_00\n We had some open-ended questions.\n\n0:03:26\tSPEAKER_00\n Just what are your opinions on the remote control?\n\n0:03:30\tSPEAKER_00\n Got a lot of responses.\n\n0:03:31\tSPEAKER_00\n And we asked some very specific questions.\n\n0:03:33\tSPEAKER_00\n And we got a lot of good feedback.\n\n0:03:35\tSPEAKER_00\n There's only 100 people.\n\n0:03:38\tSPEAKER_00\n So even when the groups are divided into 15 to 25, 25 to 35, there's only maybe 10 people.\n\n0:03:46\tSPEAKER_00\n 15 people in each group.\n\n0:03:48\tSPEAKER_00\n Okay.\n\n0:03:50\tSPEAKER_00\n So, we got some of the best of we got.\n\n0:03:53\tSPEAKER_00\n Remote's are often lost.\n\n0:03:55\tSPEAKER_00\n I often lose my remote control to back at the couch.\n\n0:03:58\tSPEAKER_00\n Some place.\n\n0:03:59\tSPEAKER_00\n And even if it's not lost permanently, it takes me a few minutes to find it.\n\n0:04:04\tSPEAKER_00\n buttons are not used anymore. Like you said, tele-tex is outdated now. I remember trying to load a DVD player recently and there were so many buttons. It took me, I don't know, maybe 10 minutes to go for each button because you have to press the shift button to access the yellow buttons. You know, there's just a lot of stuff that no one really uses.\n\n0:04:23\tSPEAKER_00\n And if they do not very often, it takes too long to master the remote control. I've seen some remote controls that are big, they have a lot of buttons. You have to hold down more than one key at one time to do something. They're just not great to use. We just got a lot of bad complaints about remote controls. People do not like remote controls. Some of the good stuff we got. Between the age of 15 and 25, most people will be willing to pay extra for voice recognition software. I don't get excited, I've got more to say on that. Most people will be willing to pay for that. Most people want remote controls to be pretty, they want it to be fancy. They want it to be different. Everybody has a white remote control with black buttons and a red button and a green button. Not everybody wants that. Finally, my opinion. The voice recognition thing is cool. And voice recognition, voice recognition, voice recognition, voice recognition, voice recognition, voice recognition.\n\n0:05:29\tSPEAKER_00\n It's a bit sketchy at sometimes. You're not going to get good, always accurate results.\n\n0:05:33\tSPEAKER_00\n But for a very fixed number of words, you have how many different words can you have for remote control up, down, left, right, channel 5, channel 7. How many, you can't have that many words for a fixed vocabulary. It works quite well. I'm pretty sure people will buy it.\n\n0:05:47\tSPEAKER_00\n But after a while, people may want to return it. Because if you have to say, I mean, most people use a remote control for switching to channels. And they say they do that about 98% of your time using a remote control, 98% of the time for changing channels. And that's for flickering through channels. So if you have to say, if you have to do that, what would the time? Then people might get a bit fed up with that and they may return it.\n\n0:06:15\tSPEAKER_00\n However, because the voice recognition software exists already, there's no need to spend money on research and development. But this doesn't mean the need for microphones in the remote control, which is an unusual feature in my opinion. But if we do have the voice recognition thing, there's a lot of stuff that you can get rid of. See, you get the two options.\n\n0:06:39\tSPEAKER_00\n Even you have voice recognition by itself, which I think is a bit impractical for like night time. If you want to be watching television, you might be quiet. Or I don't know, you have a visitor come around and the remote's only trained for you. It's a bit impractical to have just voice recognition by itself. So you can have voice recognition and the regular remote. But imagine you got rid of the regular remote part. Then you can design the remote to look any way you want it to look because there are no restrictions on physical, size or shape. It could be as fancy as you want it to be. You know, it could be like a lollipop, something like that. Something weird like that. As long as the voice recognition stuff works, that's fine. So we have the free birds. We have the design bit. We have the fancy bit, right? The voice recognition is fancy. It's cool. It's different. It's radical.\n\n0:07:29\tSPEAKER_00\n So, and then we have an extra bit. I don't remember. So I'm pretty sure people will buy the remote. But is it practical to have a voice recognition system in the remote control?\n\n0:07:40\tSPEAKER_00\n I think it's a big question. What people will be willing to wait for the period that it will take to train the remote? Because I think it will. The remote will get better over time with the same user, or user. But for the first week or the first two weeks, are you willing to wait? Are you willing to have a bad remote control?\n\n0:08:02\tSPEAKER_00\n And what if you have visitors come around? They stay the night. They want to use the TV.\n\n0:08:07\tSPEAKER_00\n They can't use the remote because they speak differently to you. How do you account for regional accents and stuff like that? Will people return the remote control? I think a lot of young people will buy the remote control if they have the money. So, do our audience have the money?\n\n0:08:23\tSPEAKER_00\n But will they return it after a while? Because it's not as fast as pressing the button.\n\n0:08:28\tSPEAKER_00\n It's not a practical. So, do you think we should consider? I think it's cool.\n\n0:08:33\tSPEAKER_01\n He could speak up a bit. If he could speak up a bit please. Sure, I'm about to.\n\n0:08:38\tSPEAKER_00\n Yeah, I think it's cool. But there definitely is some considerations.\n\n0:08:44\tSPEAKER_01\n Excellent, right? Here from the user interface design and I think, like your idea. Got your presentation now. There was a technical functions. I started making stuff up. I grabbed me.\n\n0:09:10\tSPEAKER_02\n Okay. Here's a brief run through the technical functions of the remote.\n\n0:09:22\tSPEAKER_02\n The presentation is already slightly obsolete because I had in mind something that would be able to control multiple devices but there's still stuff of relevance.\n\n0:09:35\tSPEAKER_02\n Okay. Press on. Yeah, I've looked at a couple of other remote control models just for an idea of basic design principles and wasn't really satisfied by what I saw. I have to say.\n\n0:09:53\tSPEAKER_02\n So, this is more of a springboard for how these could be improved on.\n\n0:09:57\tSPEAKER_02\n I'm basically the job of the device is to send commands to an appliance, in this case, this television set, to say you're getting off your backside. There's two main trends in the design practice on the one hand. This particularly relates to the earliest models where it was, so many buttons on it is about the size of the television set. Every possible function that the device has, the remote control controls and most of these functions are not going to be used.\n\n0:10:37\tSPEAKER_02\n It creates a rather user unfriendly interface. On the other hand, there's a user-focused approach that pairs things down to just what is most likely to get used. Of course, there is a certain amount of loss of function here, obviously, but mostly that's relatively peripheral functions.\n\n0:11:00\tSPEAKER_02\n It's a new approach, something that's fairly intuitive to use. For the most part, for TV remote, that would be channel-controlled volume. If you are one can cooperate to control a DVD or a PC app or a laptop, into that, there's a play-par stop, we'll end fast-forward.\n\n0:11:25\tSPEAKER_02\n Why are we using it? We should definitely go for a user-focused design.\n\n0:11:38\tSPEAKER_02\n I think the problem with a lot of user-focused designs that are about is that they make assumptions and advance about what a given user is going to want to do most.\n\n0:11:53\tSPEAKER_02\n Something that's more programmable, perhaps has the full range of functions available to it, but you can then specify yourself what you're most likely to want. Those are the enemy accessible through a fairly minimal number of controls. I like Devonies' idea, including a joystick in that, and it's a fairly minimal number of function buttons. You then have some sort of basic display on it, so if you're changing them into different modes for the device, it'll tell you just exactly what each direction of the joystick is going to do or what each function button is going to do. This is, again, slightly taking inspiration of games controllers and the PlayStation controller where you have four basic function buttons that are just marked distinctive geometrical shapes, and then dependent on what you're doing with it.\n\n0:13:03\tSPEAKER_02\n Those functions are further specified, so it's taken away from that.\n\n0:13:18\tSPEAKER_03\n If we could hear from our industrial engineer, I'm still working on this, I haven't got it finished.\n\n0:13:27\tSPEAKER_03\n What's it say? Where do I have to say it?\n\n0:13:30\tSPEAKER_01\n If you look in the desktop, you'll find that there's a link to the project folder or project documents. If you see it in there, we can open it up from here.\n\n0:14:05\tSPEAKER_01\n Are you finding it okay?\n\n0:14:16\tSPEAKER_03\n I'm just actually closing it now. I can't say it.\n\n0:14:20\tSPEAKER_00\n I'm not going to go to one, whichever one I'm going to do today.\n\n0:14:37\tSPEAKER_03\n I'm responsible for working design. This is basically the inside going on of the remote control.\n\n0:14:55\tSPEAKER_03\n You have the energy source. You have the user interface. This is what I've seen.\n\n0:15:00\tSPEAKER_03\n The sender will push the button. The chip will respond. Then the digital signal sent to the TV.\n\n0:15:11\tSPEAKER_03\n If you go to the next slide, you'll see what do we need on the user interface. Do we need many buttons? Do we need many light bulbs that could be easier to do to realize which appliances are on or not? Or without taking too much power. We need more components in there to supply the power. The joystick is another thing if we're going to add that.\n\n0:15:41\tSPEAKER_03\n There will be more components to deal with that. I don't know exactly what does the design of the layout of the electronic design. There will be more details once we decide what we'll put on the user interface. The next slide. If you go to the next slide, I just used the key. It was a mess. I was just putting it together at the end there. So you have the energy source.\n\n0:16:36\tSPEAKER_03\n We'll contact the TV and have whatever device or DVD player. We'll turn on the save button. Do we need on the control different buttons to decide our different light bulbs? It'll be easier.\n\n0:16:54\tSPEAKER_01\n I don't know what we should decide on that. I'm interrupting the audience. We can probably skip that.\n\n0:17:12\tSPEAKER_01\n We've had some stuff put forward. Along with the user requirements. We've had a lot of input.\n\n0:17:30\tSPEAKER_01\n I hear what the marketing experts say about voice activity control. However, I've got a couple of worries about that. The power required and the ability to cost. It seems like for an embedded system, this could cause this issue. For example, you see that there's fairly robust services on computers via voice IBM, do drag and dictate. These require a lot of memory and usually the state, quite advanced processor requirements. Voice activation could be an interesting idea, but I think that our industrial designer would probably, upon some research, say that it's maybe not feasible.\n\n0:18:22\tSPEAKER_01\n That's just my view right now. However, the idea of a joystick and then maybe an LCD, which has been put forward so far. It's almost like having a small TV, not TV, but if you can control almost all of the functionality from the display. I don't know how much power now, CD would take, but it might be quite low. As if you're under a mouse, just telling you what's on.\n\n0:18:48\tSPEAKER_01\n But literally, if you can imagine the display maybe slightly larger than both on a mobile phone. Something where you can read a fair amount of information, traverse maybe quite a few menus. If we maybe use the mobile phones as a good example, they usually incorporate the keypad and then every other functionality is usually associated inside of the traversing around. That could be one possibility. Then we could have like, say, the common buttons, as you say, volume control, changing channels.\n\n0:19:23\tSPEAKER_02\n I think the remote, the default functions for the joystick could be up and down for volume\n\n0:19:30\tSPEAKER_03\n less than right channels. We think that people have got mixed up, like, to be looking at this screen, that not screen, and then, you know, trying to get everything working would be the confusing.\n\n0:19:42\tSPEAKER_02\n I think, probably, for the first couple of hours of using it, but muscle memory is a wonderful thing.\n\n0:19:55\tSPEAKER_02\n I think that size of display was about what I had in mind.\n\n0:20:02\tSPEAKER_02\n I would say, probably, probably, you would quite too. Most of the mobile phones display, you see these days, colour, which is probably kind of stick to black and white.\n\n0:20:14\tSPEAKER_02\n I would simply keep the unit cast down.\n\n0:20:20\tSPEAKER_02\n Colour could be a subsequent development, but cost a bit of extra money.\n\n0:20:26\tSPEAKER_02\n What once everyone's got the first, you know, colours that last,\n\n0:20:31\tSPEAKER_01\n that does nothing extra. That would be my feeling as well. I think we could possibly create quite useful user interface. Now, I mean, I don't... Sorry, go for it.\n\n0:20:41\tSPEAKER_00\n The idea of a remote with a menu and the joystick, I think, like, if I was in a habit of buying remote controls, then I would want one. But I think we don't have a specific audience, you know? Like, what does our target audience want? Me, shall we try to mark in corner?\n\n0:21:00\tSPEAKER_00\n You know, if you're not, I'm saying, like, for whom is this intended? Everybody?\n\n0:21:08\tSPEAKER_01\n I think it could probably be aimed at most people who've used the mobile.\n\n0:21:13\tSPEAKER_01\n And that might be just another way of saying, trying to target most people.\n\n0:21:16\tSPEAKER_01\n No, it's really. If we were to follow that avenue, we might be, you know, we're kind of almost relying on their experience with the mobile phone, I suppose.\n\n0:21:28\tSPEAKER_01\n But that does cover a very large section of the people out there, through our finance group.\n\n0:21:34\tSPEAKER_01\n I mean, I imagine as well that the actual LCD and maybe to a certain extent, the joystick as well, would be for the additional functionality, which maybe doesn't get used as often.\n\n0:21:44\tSPEAKER_01\n Maybe it makes it easy for them to figure out how to change the channels as in the frequencies and such for reprogramming it. And you can still have the main buttons that allow people to turn the machine on and off. Up and down, it depends. I mean, maybe we have the joystick as a separate one for the other functions and that there's just a small number of, as you were saying, buttons that have already been defined. So, like, we go for the nice standard, up and down for an volume control. So that literally anybody can come along, pick up the remote and still know what to do. And they can completely ignore most of the functionality, which would be for the actual owner of the key V end, who would normally use the unit. I don't know.\n\n0:22:35\tSPEAKER_02\n The thing I like about the joystick is that you then basically put it, I mean, for a TV remote alone, you could put, I mean, like I said, the main thing people do with a TV remote is the volume of the channel. You can pack all that onto a single control.\n\n0:23:03\tSPEAKER_02\n But then, obviously, if you want to access further functions, you then get sort of menu navigation.\n\n0:23:12\tSPEAKER_02\n I mean, with things like tuning in channels, adjusting brightness and fiddley things that no one would evolve with. Most TVs these days actually have menus anyway.\n\n0:23:26\tSPEAKER_02\n So this would be a fairly rational way of integrating the remote with the devices controlling.\n\n0:23:37\tSPEAKER_02\n Gideau, would I concern about a market? If we are, I mean, most of the replacement remote market is sort of remote control rationalization. You've got 20 different devices.\n\n0:23:58\tSPEAKER_02\n You want one that will do the job of all of them. If all you're replacing is one of the, however many, the modes you have in your living room, you still need separate remotes for everything else. I just think that, well, this is a requirement that we have to stick to them.\n\n0:24:18\tSPEAKER_01\n If this isn't one that I just arbitrarily decided on. So this is one of the solid ones that has to be evaded for now. So I can understand your point and I would agree with you, but this is our design spec for now. Great to say.\n\n0:24:38\tSPEAKER_02\n Does that include access to say interactive functions on digital or cable?\n\n0:24:47\tSPEAKER_01\n Yeah. I would say so, yes, because then we have to be able to control the remote boxes and that is a separate unit. I think that I would say that the design spec we've been laid with is for the television only for now. Until we hear otherwise we should go with just that.\n\n0:25:05\tSPEAKER_01\n Okay, specifically television. Okay, maybe we'll hear differently. But\n\n0:25:09\tSPEAKER_00\n so the joystick is just for differentness.\n\n0:25:15\tSPEAKER_01\n The ease of manipulation of certain functions. Yes.\n\n0:25:21\tSPEAKER_02\n Maybe then our market should be TV manufacturers from the public.\n\n0:25:25\tSPEAKER_01\n I'm trying to put it to the end to supply with. Drew's that possibility, yes. However, I don't know exactly where we'll be going with that, but I might not even be the avenue for marketing it, because that might be sales.\n\n0:25:41\tSPEAKER_00\n We are not in this meeting. Is this the way I figure 12.5 euros per unit?\n\n0:25:49\tSPEAKER_00\n We have to sell at least like three million, not to account for the money we waste or the remote that no one buys. If we made a perfect, if we made a very remote, we made someone board it. We have to set a lot of remote controls. Is this going to be enough to sell?\n\n0:26:12\tSPEAKER_01\n Well, something else that you brought up was the ability to lose a remote, which, as you say, you've done that. We've probably all done. I don't know if it's a gimmick or not, but if any of you ever seen those odd little key rings where if you whistle, it will beep and you tell you where it is.\n\n0:26:30\tSPEAKER_00\n I had one of those in my brother, my dad could have beat me up because it went off all the time.\n\n0:26:36\tSPEAKER_01\n Accidentally. Well, the other option, of course, is that the required one. I was going to say clapping digital telephones. For example, one unit has, of course, you have to have that base unit somewhere where there's a button, but maybe it's a button that you attach to the TV. When you press that, it would beep to give its location away on the remote unit. That could be something that could be a bit. That way, because we're attaching what would be a small button to the TV. Again, say what would be a small transmitter, watch battery type scenario, I'd say, or something that if it was problems enough, you could actually even just I don't know how we're going to say that might be something that we could look into.\n\n0:27:32\tSPEAKER_01\n Yeah, it's putting a lot on your shoulders there. That could be something that separates us a bit from marketing as well. So to go on from here, we have to decide exactly what we're going to do before we leave this meeting and be best to say this is what we're going, this is the design we're going to try and get. This is how we're going to make ourselves look unique.\n\n0:27:58\tSPEAKER_01\n Do we go for maybe a remote control, sorry, we're going to go for remote control obviously.\n\n0:28:03\tSPEAKER_01\n We go for a small joystick that would operate, say, changing channels up and down and then what another button that would save it, it's now being used in the new around the LCD.\n\n0:28:17\tSPEAKER_03\n There's something, volumes. Volume the important of the joystick, do you think?\n\n0:28:21\tSPEAKER_01\n We could use savey left and right for changing channels and the up and down for volume.\n\n0:28:27\tSPEAKER_00\n Yeah, but we have a frequency of what people use a remote control for most.\n\n0:28:34\tSPEAKER_00\n Power is used like once per hour, channel selection is used 168 per hour. That's by far the biggest one. And then teletext is stored here. That's 14. Go and volume selection.\n\n0:28:49\tSPEAKER_01\n Volume selection. Yeah, the teletext we're gambling with and we're going to say it's dead. Okay, wave the door door. Yeah. So we, well, sorry, we could maybe even go as far as saying power button, small joystick, LCD and then what, maybe is it one more button to save it, you're using the menu system and the possibility of pushing down on the joystick to say okay.\n\n0:29:15\tSPEAKER_01\n So we're having very, very few buttons involved. So navigation around a menu for most things.\n\n0:29:22\tSPEAKER_02\n And so I would say two function buttons, we're now using the menu button and an okay button.\n\n0:29:33\tSPEAKER_02\n I mean, so something I found with the joystick on the, the joysticks on mobile phones is that a lot of the time the device mistakes you've tried to move it in one direction or the other pushing down for okay. Okay. That's really irritating. The other design constraint I think we should bear in mind is that people are, you know, very used to using a remote control one handedly.\n\n0:30:00\tSPEAKER_02\n So we need to make sure that even with the joystick, you know, something that can just sit comfortably\n\n0:30:05\tSPEAKER_01\n in the palm of the hand and have the joystick just control by the some. Okay. So I'd say that sounds like a rough idea. Do we incorporate the idea of trying to locate the remote control again via\n\n0:30:20\tSPEAKER_00\n a beeping noise? Yeah. I think because it's so small it might be and I mean if we only have like three buttons, it might be essential to have to have to locate it again. Yeah. So that would require a\n\n0:30:36\tSPEAKER_01\n transmitter, maybe attached to the TV just so that it says find me. And what basically a small microphone on the actual unit can maybe hide it in the base. Like all this well, no? Sorry?\n\n0:30:49\tSPEAKER_03\n So small speaker, yeah. Speak or speak or show. Yeah. Like both, no. To flash. No.\n\n0:30:56\tSPEAKER_01\n Now you'd see it anyway. Here. We might be better with the sound possibly.\n\n0:31:01\tSPEAKER_01\n Yeah. Those little key rings have both. So in true fact, considering the cost of an LED, you could just incorporate it anyway. Yeah. The LEDs can be surprising on bright now. Yeah.\n\n0:31:13\tSPEAKER_01\n One's particularly, plus that's a nice redesign. Yeah. So by the sense that what we're suggesting so far, your design, the user interface is still quite open. You could go for quite an interest in design because we're only going to have a very few keep and you've got you know a small LCD joystick.\n\n0:31:33\tSPEAKER_01\n I think it leaves you open to a potential wide range of shapes, something that can make it stand out slightly.\n\n0:31:41\tSPEAKER_01\n If you could look into what we suggest to so far, the feasibility of a small transmitter and such, maybe if an LCD screen requires too much power or such.\n\n0:31:54\tSPEAKER_01\n Evan, is there a black necking expert? Well, I can give you the frequency. What\n\n0:32:03\tSPEAKER_00\n people, what options people use most of them. I guess that's going to be important in defining the the software side of the interface, right? You want the stuff that are more? Yeah. If you could maybe as well\n\n0:32:13\tSPEAKER_01\n see what people think about the idea of this minimalist approach that we've taken where of a joystick to control the very basic functions and then the idea of manipulating it like you would a mobile.\n\n0:32:24\tSPEAKER_01\n I don't know how easy that will be within the time frame but it could be something we could maybe look into. Sure. Okay. Any last comments anybody would like to put forward anything that's been missed out? A bit of a wide open questionnaire of course.\n\n0:32:39\tSPEAKER_01\n If you'll free to email me if you think that we screwed something up and want to get it rectified\n\n0:32:51\tSPEAKER_03\n as soon as possible. Yeah. So I should just look at the speaker, about the speaker and LED.\n\n0:32:59\tSPEAKER_01\n The speaker and LED for locating. Transmitter. When we thought about that, if we do end up\n\n0:33:11\tSPEAKER_02\n trying to market this to television manufacturers then the transmitter could actually be built into\n\n0:33:17\tSPEAKER_01\n the television. We've lost the getting external power source. Yeah. That's what it's for. And something that we can easily be adopted at the last minute as well as say, the electronics can be either placed externally or internally. Make sure the difference to the final product of the actual remote control so that's good. Maybe gives us a new potential market.\n\n0:33:45\tSPEAKER_02\n Okay. I think if we get a major television manufacturer to say, oh yeah we'll have that save us the product. Then that's vast amounts of sales. Oh one thing we've almost not talked about at all.\n\n0:34:00\tSPEAKER_01\n My apologies for that. User interface. We also need to maybe get the slogan in here.\n\n0:34:07\tSPEAKER_01\n It's I'm pointing at my laptop. What the God.\n\n0:34:10\tSPEAKER_01\n Real reaction in such. So as long as we put the fashion in electronics. My apologies. No, it could well be. I've probably missed that. I think that's almost the last minute thing we can just incorporate into the actual plastic on top. So I'm not too concerned that we haven't gone into depth about that.\n\n0:34:35\tSPEAKER_01\n But it might be something you can consider when thinking about shapes. In fact we might like to put a slogan on and possibly two hours to signify the company rather than a real reaction. I thought the\n\n0:34:49\tSPEAKER_02\n double arc would perhaps be the end of the book. Sounds good. And I'd say for that source for now. Okay.\n\n", "summary": [{"summary_text": "On the desktop, there's a project documents link. Speaker's presentation starts with the minutes of the functional design meeting. They discuss the possibility of a macro facility and ergonomics of the remote control. They also discuss the use of barcode and joystick for user manipulation."}]}