{"filename": "./data/ES2002b.txt", "transcript": "0:00:00\tSPEAKER_00\n Oh yes, I forgot about that.\n\n0:00:07\tNone\n Okay.\n\n0:00:07\tSPEAKER_00\n So, all right now.\n\n0:00:15\tSPEAKER_00\n Okay.\n\n0:00:16\tNone\n That's cool.\n\n0:00:17\tSPEAKER_00\n Someone turned these on.\n\n0:00:18\tSPEAKER_03\n Sorry?\n\n0:00:19\tSPEAKER_03\n Did someone turn these on?\n\n0:00:20\tSPEAKER_03\n Great.\n\n0:00:21\tSPEAKER_03\n Okay, everybody, I'll start the meeting.\n\n0:00:24\tSPEAKER_00\n Okay, we've got half an hour for this one.\n\n0:00:27\tSPEAKER_00\n To discuss the functional design.\n\n0:00:34\tSPEAKER_00\n Thanks.\n\n0:00:35\tSPEAKER_00\n Already to go.\n\n0:00:36\tSPEAKER_00\n Okay.\n\n0:00:37\tSPEAKER_00\n So, hopefully, it was working away.\n\n0:00:40\tSPEAKER_00\n And I've put the minutes of the last meeting in the project folder.\n\n0:00:45\tSPEAKER_00\n So, I guess just to recap on what we did last time.\n\n0:00:52\tSPEAKER_00\n I got to know each other a little bit and got familiar with all the equipment.\n\n0:00:56\tSPEAKER_00\n And started to discuss a bit about the project.\n\n0:01:00\tSPEAKER_00\n You've caused why, how much money we have to spend.\n\n0:01:30\tSPEAKER_00\n I just want to tell you that we have three new requirements.\n\n0:01:44\tSPEAKER_00\n Which is the first one is that the company has decided that teletext is outdated.\n\n0:01:52\tSPEAKER_00\n Because of how popular the internet is, nobody uses teletext very much anymore.\n\n0:01:56\tSPEAKER_00\n So, we don't really need to consider that in the functionality of the remote control.\n\n0:02:01\tSPEAKER_00\n They've also suggested that we only use the remote control to control the television.\n\n0:02:07\tSPEAKER_00\n Not the VCR or DVD or anything else.\n\n0:02:10\tSPEAKER_00\n I think the worry is that if the project becomes too complex, it will affect how long it takes us to get it into production the time to market.\n\n0:02:20\tSPEAKER_00\n Okay.\n\n0:02:21\tSPEAKER_00\n So, we're just going to keep it simple and it'll just control the TV.\n\n0:02:24\tSPEAKER_00\n And the other thing was that the company wants the corporate color and slogan to be implemented in the new design.\n\n0:02:31\tSPEAKER_00\n I'm not entirely sure what the corporate color is.\n\n0:02:34\tSPEAKER_00\n It might be yellow because there seems to be a lot of yellow everywhere.\n\n0:02:38\tSPEAKER_03\n And the slogan, like the actual written slogan, or just to embody the idea of the slogan?\n\n0:02:43\tSPEAKER_00\n Well, that's the thing.\n\n0:02:44\tSPEAKER_00\n I'm not sure.\n\n0:02:47\tSPEAKER_00\n Because on the company website, what does it say?\n\n0:02:52\tSPEAKER_03\n That's the fashion in electronics.\n\n0:02:54\tSPEAKER_00\n Yeah. I mean, do they... is that something they want to actually written on?\n\n0:02:58\tSPEAKER_00\n Because it's quite long.\n\n0:03:00\tSPEAKER_00\n Or, yeah, just the idea that I'm not sure.\n\n0:03:02\tSPEAKER_00\n Is that something we can discuss as well?\n\n0:03:04\tSPEAKER_00\n So, there's the three things.\n\n0:03:05\tSPEAKER_00\n It's not to worry about teletext.\n\n0:03:07\tSPEAKER_00\n Only control the TV.\n\n0:03:10\tSPEAKER_00\n And incorporate the color and slogan of the company.\n\n0:03:17\tSPEAKER_00\n So, is everybody okay with any of that? Or do you want me to recap?\n\n0:03:23\tSPEAKER_00\n That's all.\n\n0:03:24\tSPEAKER_00\n That time for presentations, and he would like to go first.\n\n0:03:30\tSPEAKER_02\n I'll go first.\n\n0:03:31\tSPEAKER_04\n Okay, cool.\n\n0:03:37\tSPEAKER_02\n All right, can I still listen to the back yellow?\n\n0:03:40\tSPEAKER_00\n Oh, yeah, of course.\n\n0:03:41\tSPEAKER_00\n Good going ahead.\n\n0:04:11\tNone\n So, the technical function design.\n\n0:04:18\tSPEAKER_02\n All right, I'm to do the design.\n\n0:04:28\tSPEAKER_02\n I've had a look on mine.\n\n0:04:30\tSPEAKER_02\n I've had a look at the homepage, which is given a sense of inspiration from previous products.\n\n0:04:35\tSPEAKER_02\n I've had a look at the previous products to see what they offer.\n\n0:04:38\tSPEAKER_02\n And I would like to ask you guys for your ideas about the design at the end of the meeting.\n\n0:04:44\tSPEAKER_02\n Unfortunately, we're not allowed to talk outside the meeting.\n\n0:04:47\tSPEAKER_02\n Okay.\n\n0:04:50\tSPEAKER_02\n I'll have a look at the existing products.\n\n0:04:52\tSPEAKER_02\n I found out that it tends to come into two extremes.\n\n0:04:55\tSPEAKER_02\n There's either a very complicated one that's got lots of buttons, lots of colors, very confusing.\n\n0:04:59\tSPEAKER_02\n You don't know what you're doing.\n\n0:05:01\tSPEAKER_02\n In that case, the labeling tends to be very bad.\n\n0:05:04\tSPEAKER_02\n There's an example of how you eat the ends.\n\n0:05:11\tSPEAKER_02\n I'll show you now.\n\n0:05:16\tSPEAKER_02\n You see here, there's a button there and there.\n\n0:05:19\tSPEAKER_02\n This one's broke.\n\n0:05:20\tSPEAKER_02\n Sorry, that one's broke.\n\n0:05:21\tSPEAKER_02\n And that one's broke.\n\n0:05:22\tSPEAKER_02\n And it doesn't really tell you what it does.\n\n0:05:29\tSPEAKER_02\n I'm not sure if you had a look at the other control on that example.\n\n0:05:37\tSPEAKER_02\n It's a very simple one.\n\n0:05:40\tSPEAKER_02\n It's got only the basic functions.\n\n0:05:42\tSPEAKER_02\n But the same size as the hard to use one.\n\n0:05:47\tSPEAKER_02\n And it's a bit clunky.\n\n0:05:49\tSPEAKER_02\n It's very big and not very much used for actually buttons.\n\n0:05:53\tSPEAKER_02\n And it's very hard to access the advanced functions.\n\n0:05:57\tSPEAKER_02\n There's nothing, for instance, for a slow motion button.\n\n0:06:03\tSPEAKER_02\n My own preferences, I prefer the clunky one.\n\n0:06:06\tSPEAKER_02\n It's very easy to use.\n\n0:06:08\tSPEAKER_02\n But it does like the advanced functions, which I quite like having on the controls.\n\n0:06:14\tSPEAKER_02\n I believe that the advanced functions should maybe be hidden in the drawer.\n\n0:06:17\tSPEAKER_02\n I don't know if you could open the bottom of it.\n\n0:06:22\tSPEAKER_02\n I've got few references, and I sure don't know how long we'll go.\n\n0:06:28\tSPEAKER_00\n Why would we come to chat away for five minutes or so, I think?\n\n0:06:31\tSPEAKER_00\n At most, it's a couple of minutes anyway.\n\n0:06:34\tSPEAKER_03\n Yeah, a lot of what I've read and prepared for this meeting fits and really closely with what Craig's just gone over.\n\n0:06:43\tSPEAKER_03\n So in part, I could give you some of my personal preferences, but I could also add some to this, which is just about sort of market research.\n\n0:06:51\tSPEAKER_03\n But anyway.\n\n0:06:53\tSPEAKER_00\n You'll stick to your area.\n\n0:06:55\tSPEAKER_02\n The clunky one is the one in the right.\n\n0:06:57\tSPEAKER_03\n Clunky in what sense?\n\n0:06:59\tSPEAKER_03\n Like heavier, larger?\n\n0:07:01\tSPEAKER_02\n I think it's supposed to be the same size, but it's got much fewer buttons.\n\n0:07:05\tSPEAKER_02\n It's ISIS, it's more spread out of bacon.\n\n0:07:08\tSPEAKER_02\n You get the idea of this size.\n\n0:07:11\tSPEAKER_02\n Yeah, go very few buttons.\n\n0:07:13\tSPEAKER_02\n Sure.\n\n0:07:14\tSPEAKER_00\n Well, I think, to that other point, I mean, the one on the left looks quite complicated.\n\n0:07:19\tSPEAKER_00\n And that PRG, PROG thing is incredibly confusing.\n\n0:07:23\tSPEAKER_00\n So, see why you might prefer the simpler design, but yeah, you don't want to lose it on what it does.\n\n0:07:31\tSPEAKER_00\n So maybe, you know, you get a lot of remote controls where you kind of feel the thing open, I think that's a good idea.\n\n0:07:37\tSPEAKER_00\n I think it's a good idea.\n\n0:07:39\tSPEAKER_02\n Do we have any functions that we'd want on it?\n\n0:07:43\tSPEAKER_02\n So far, I've got an island off, so it's the channel up and down.\n\n0:07:46\tSPEAKER_02\n And the volume up and down.\n\n0:07:49\tSPEAKER_02\n There's the very basic you can use by TV.\n\n0:07:51\tSPEAKER_00\n And then actual numbers for channels as well, yeah.\n\n0:07:55\tSPEAKER_02\n And you see that's how the required one are requested one.\n\n0:07:58\tSPEAKER_02\n Which was that?\n\n0:07:59\tSPEAKER_02\n The channels, like the numbers?\n\n0:08:01\tSPEAKER_03\n The numbers are the up there.\n\n0:08:03\tSPEAKER_00\n But I would say that's required.\n\n0:08:05\tSPEAKER_00\n I mean, there's no way anybody's going to buy a remote control these days, so if she can't actually individually select channels, I mean, would anybody disagree with that?\n\n0:08:13\tSPEAKER_00\n What else?\n\n0:08:16\tSPEAKER_00\n So don't need to worry about tally text, don't need to worry about VCR.\n\n0:08:23\tSPEAKER_00\n Any kind of like display controls at all?\n\n0:08:25\tSPEAKER_00\n Do you think we need to worry about, you know, like brightness and contrast?\n\n0:08:28\tSPEAKER_03\n Well, I think essentially what we're doing right now is we're categorizing.\n\n0:08:31\tSPEAKER_03\n We're saying, well, we want this to be a product that offers all the sort of more tricky features, but we want them to be in another area.\n\n0:08:38\tSPEAKER_03\n Is that right?\n\n0:08:39\tSPEAKER_03\n Is that what we're doing?\n\n0:08:40\tSPEAKER_03\n Do we're kind of like sorting them?\n\n0:08:43\tSPEAKER_03\n Or are we actually eliminating things we just don't want the product to have?\n\n0:08:46\tSPEAKER_00\n I think are you maybe kind of thinking what we absolutely have to have and what would be nice?\n\n0:08:50\tSPEAKER_02\n To start with, we need to find the exact thing we have to have, not that we can add things at the possible.\n\n0:08:57\tSPEAKER_00\n Okay, right.\n\n0:08:59\tSPEAKER_00\n Well, do you want to maybe just at this point decide on what we absolutely must have as a function of this?\n\n0:09:05\tSPEAKER_00\n So, so far, just to recap, we've got volume and channel control.\n\n0:09:10\tSPEAKER_02\n One in general and skipped certain channels with the numbers.\n\n0:09:13\tSPEAKER_00\n Right, okay.\n\n0:09:20\tSPEAKER_03\n Well, one way I would look at this, be that we approach the different controls in terms of like control types.\n\n0:09:29\tSPEAKER_03\n So that for the user, it's very clear what they want to do, where they go.\n\n0:09:32\tSPEAKER_03\n And also think maybe a little bit about what we just want to be easily accessible.\n\n0:09:37\tSPEAKER_03\n For example, if we had audio controls, those could be something people set up very rarely.\n\n0:09:42\tSPEAKER_03\n Maybe they're in a little area, but covered up.\n\n0:09:47\tSPEAKER_03\n Things like channel and volume are used all the time.\n\n0:09:53\tSPEAKER_03\n So we just have them right out on top, very sort of self-explanatory.\n\n0:10:00\tSPEAKER_03\n So maybe we need to think about having three or more groupings of controls.\n\n0:10:06\tSPEAKER_03\n You know, like one which are just the habitual ones that should be right within your natural grip.\n\n0:10:11\tSPEAKER_03\n And others that are also available and then others that are concealed.\n\n0:10:16\tSPEAKER_03\n Okay.\n\n0:10:17\tSPEAKER_00\n And we're just to wrap up quickly on this little section.\n\n0:10:20\tSPEAKER_00\n I don't know.\n\n0:10:21\tSPEAKER_00\n Do you think maybe that's the only kind of essential requirements?\n\n0:10:28\tSPEAKER_00\n And there may be just things that would be nice if it could do, would be things like audio, set up and display, set up and things like that.\n\n0:10:35\tSPEAKER_00\n Maybe like a mute button.\n\n0:10:37\tSPEAKER_00\n That's really saying.\n\n0:10:38\tSPEAKER_00\n Any of the other things to that at all?\n\n0:10:41\tSPEAKER_00\n No.\n\n0:10:42\tSPEAKER_00\n Okay.\n\n0:10:43\tSPEAKER_00\n Right.\n\n0:10:45\tSPEAKER_00\n Okay.\n\n0:10:46\tSPEAKER_00\n If we can move on to the next presentation then please.\n\n0:10:51\tSPEAKER_00\n Sure.\n\n0:10:52\tSPEAKER_03\n Can this reach, can this plug come across?\n\n0:10:55\tSPEAKER_00\n Probably not, actually.\n\n0:10:58\tSPEAKER_03\n So why don't I just pick up and...\n\n0:11:01\tSPEAKER_03\n Yeah.\n\n0:11:02\tSPEAKER_03\n Yeah, I'll just...\n\n0:11:04\tSPEAKER_06\n I'll just...\n\n0:11:19\tSPEAKER_03\n Can you go behind me?\n\n0:11:23\tSPEAKER_03\n This is so...\n\n0:11:25\tSPEAKER_00\n It's so complicated.\n\n0:11:27\tSPEAKER_00\n I'm all alone.\n\n0:11:28\tSPEAKER_00\n It's so complicated.\n\n0:11:29\tSPEAKER_05\n I'm all alone.\n\n0:11:30\tSPEAKER_05\n It's so complicated.\n\n0:11:31\tSPEAKER_00\n I'm all alone.\n\n0:11:32\tSPEAKER_00\n I'm all alone.\n\n0:11:33\tNone\n I'm all alone.\n\n0:11:34\tNone\n I'm all alone.\n\n0:11:35\tSPEAKER_03\n I'm all alone.\n\n0:11:36\tSPEAKER_03\n I'm all alone.\n\n0:11:37\tSPEAKER_03\n I'm all alone.\n\n0:11:38\tSPEAKER_03\n Okay.\n\n0:11:39\tSPEAKER_03\n All right.\n\n0:11:40\tSPEAKER_03\n So I can say already, I don't know whether this is for good or for bad, but there'll be a lot of kind of redundancy in the issues and the...\n\n0:11:47\tSPEAKER_03\n Oh, like overlap between what you said.\n\n0:11:49\tSPEAKER_00\n Oh, for all you know, something.\n\n0:11:50\tSPEAKER_03\n Not necessarily a bad thing, but what I've already started doing is I created a slide and in my presentation here, so...\n\n0:11:59\tSPEAKER_03\n So that we kind of think what's the cumulative effect of what we've taken from your ideas and mine, because certainly I have a hard time separating things completely.\n\n0:12:10\tSPEAKER_03\n I'm hard to know what you're really, really, just told me.\n\n0:12:12\tSPEAKER_03\n Where you've just told me impacts a lot on what, like market research, that I've been.\n\n0:12:18\tSPEAKER_03\n So how do I get this up?\n\n0:12:20\tSPEAKER_00\n Yeah, I put function in F8, yeah.\n\n0:12:23\tSPEAKER_05\n Okay.\n\n0:12:25\tSPEAKER_06\n All right.\n\n0:12:26\tSPEAKER_06\n So...\n\n0:12:31\tSPEAKER_05\n F8?\n\n0:12:32\tSPEAKER_01\n Okay.\n\n0:12:33\tSPEAKER_01\n The blue button.\n\n0:12:34\tSPEAKER_01\n Thanks for the control on the left.\n\n0:12:35\tSPEAKER_01\n Oh, and F8, okay.\n\n0:12:36\tSPEAKER_01\n Okay.\n\n0:12:37\tSPEAKER_06\n Push it to the left.\n\n0:12:38\tSPEAKER_03\n Okay.\n\n0:12:45\tSPEAKER_03\n Okay.\n\n0:12:46\tSPEAKER_03\n I think that's it.\n\n0:12:50\tSPEAKER_04\n Okay.\n\n0:12:53\tSPEAKER_02\n Again, we need to do the one about maybe this.\n\n0:12:56\tSPEAKER_00\n Yeah, you want to?\n\n0:12:58\tSPEAKER_00\n Oh, here we go.\n\n0:12:59\tSPEAKER_04\n Okay.\n\n0:13:00\tSPEAKER_04\n There you go.\n\n0:13:02\tSPEAKER_03\n Okay.\n\n0:13:03\tSPEAKER_03\n Just before I bring this up, what I'll just say is what I've done is try to collect some information so that I can then relay this to you guys so that it now becomes a collective thing.\n\n0:13:12\tSPEAKER_03\n And then kind of lead us in the direction of deciding, okay, what are our options?\n\n0:13:16\tSPEAKER_03\n What should we decide?\n\n0:13:18\tSPEAKER_03\n And do you know what I mean?\n\n0:13:20\tSPEAKER_04\n So...\n\n0:13:22\tSPEAKER_04\n Okay.\n\n0:13:25\tSPEAKER_04\n Okay.\n\n0:13:27\tSPEAKER_00\n Right.\n\n0:13:30\tSPEAKER_00\n Can you...\n\n0:13:34\tSPEAKER_04\n Okay.\n\n0:13:35\tSPEAKER_03\n Okay.\n\n0:13:38\tSPEAKER_03\n Okay.\n\n0:13:39\tSPEAKER_03\n So that makes sense.\n\n0:13:40\tSPEAKER_03\n So what I basically, God, is I've just looked into some information and sort of tried to think about how we could review it.\n\n0:13:46\tSPEAKER_03\n Now we could...\n\n0:13:47\tSPEAKER_03\n And what kind of decisions we could take away from it.\n\n0:13:49\tSPEAKER_03\n And then maybe by the end of just looking at some of these things, we can think about what are our priorities.\n\n0:13:54\tSPEAKER_03\n Because certainly there's lots of different information to go through.\n\n0:13:57\tSPEAKER_03\n So I'm thinking here about primarily about customer needs that we start with the customer.\n\n0:14:03\tSPEAKER_03\n We have what they want and what are issues with existing products.\n\n0:14:08\tSPEAKER_03\n I just think about trends and also about try and connect that as you see with the company vision, which is about fashion and electronics.\n\n0:14:15\tSPEAKER_03\n And then as I say, we'd like to prioritize our design features from this.\n\n0:14:21\tSPEAKER_01\n Okay.\n\n0:14:24\tSPEAKER_03\n So this is what I've found here.\n\n0:14:29\tSPEAKER_03\n A lot of this is new to me, so we'll just read two together.\n\n0:14:34\tSPEAKER_03\n Users dislike the look and feel of current remote control.\n\n0:14:37\tSPEAKER_03\n So if I find them ugly, most people find them ugly.\n\n0:14:42\tSPEAKER_03\n The vast majority would spend more money for it to look fancy as well.\n\n0:14:45\tSPEAKER_03\n We'll see later, vast majority people would spend more money for slightly more intuitive controls, such as voice recognition.\n\n0:14:53\tSPEAKER_03\n Okay.\n\n0:14:54\tSPEAKER_03\n I'm going to...\n\n0:14:55\tSPEAKER_03\n We'll look at that in a second.\n\n0:14:56\tSPEAKER_03\n Most people use only a very slim portion of all the controls.\n\n0:15:01\tSPEAKER_03\n So I guess what we're looking at here is people want this technology.\n\n0:15:05\tSPEAKER_03\n They tend to use the most simple controls.\n\n0:15:07\tSPEAKER_03\n And overall, they find remote controls to be something they don't really appeal to them.\n\n0:15:12\tSPEAKER_03\n So I think what we're doing is we're trying to take like...\n\n0:15:14\tSPEAKER_03\n For me, this is sort of like three different inspirations.\n\n0:15:19\tSPEAKER_03\n One is that we want something that's high tech, but we want it to seem easy.\n\n0:15:24\tSPEAKER_03\n And in spite of the primitive side of it and the very high tech side, we want it to just be an appealing piece of equipment in people's hand.\n\n0:15:33\tSPEAKER_03\n Frustrations, they get lost a lot as it came up in our last meeting.\n\n0:15:40\tSPEAKER_03\n Takes time to learn how to use them.\n\n0:15:42\tSPEAKER_03\n This is why I mentioned Craig was showing us some ideas that we actually try and group control.\n\n0:15:47\tSPEAKER_03\n So it doesn't just look like a big panel, kind of like when you look at a new computer keyboard or something that is quite explanatory.\n\n0:15:53\tSPEAKER_03\n If you want audio, if you want visual, then you have those.\n\n0:16:00\tSPEAKER_03\n And I will admit, I don't know what RSI stands for.\n\n0:16:02\tSPEAKER_00\n What's headed Australian, Drew?\n\n0:16:04\tSPEAKER_01\n Is installing remote control from the remote people?\n\n0:16:08\tSPEAKER_03\n No, that did not come up at all.\n\n0:16:12\tSPEAKER_03\n So here's another sort of a review here of the main things.\n\n0:16:17\tSPEAKER_03\n I also found that most people would adults at least would pay more for voice recognition.\n\n0:16:22\tSPEAKER_03\n Now, apparently we do have access to all the cutting edge technology and remote control.\n\n0:16:27\tSPEAKER_03\n So I don't know if that's possible.\n\n0:16:29\tSPEAKER_03\n We might consider getting into it.\n\n0:16:34\tSPEAKER_03\n And again, here as we sort of move things, starting about how we want to sell and market this.\n\n0:16:41\tSPEAKER_03\n I think a recurring theme here is the company wants it to be.\n\n0:16:44\tSPEAKER_03\n It wants us to make something that's fashionable and sleek and trendy.\n\n0:16:55\tSPEAKER_03\n People are not liking the appearance of their products.\n\n0:16:59\tSPEAKER_03\n So we want to think about how we can put that into a unit which people like.\n\n0:17:07\tSPEAKER_03\n Big priorities.\n\n0:17:14\tSPEAKER_03\n So just looking at what Craig's ideas sort of tell me that maybe what we want to do is try and separate the different things that we want to include in this.\n\n0:17:22\tSPEAKER_03\n If we do say, well, we want there to be all the technology.\n\n0:17:25\tSPEAKER_03\n But we try and make that almost be like optional technology.\n\n0:17:28\tSPEAKER_03\n No, it's like, I find a lot of TVs these days, something really nice about them is, if you want to just turn them on and off you can, but they have little panels where you click.\n\n0:17:37\tSPEAKER_03\n And there's just like tons of features.\n\n0:17:40\tSPEAKER_00\n So we want to grip all the different types of functions together.\n\n0:17:44\tSPEAKER_00\n That's what I just.\n\n0:17:47\tSPEAKER_03\n But I hope here is that I'm putting out this information so we can then say, okay, well, how do we collectively move on with that?\n\n0:17:57\tSPEAKER_03\n I haven't brought out one specific marketing idea.\n\n0:18:01\tSPEAKER_03\n Although my sense is that what we should try and think about is what are the current trends in materials and shapes and styles and then use that but not let that confine us technologically.\n\n0:18:14\tSPEAKER_00\n Okay.\n\n0:18:15\tSPEAKER_03\n Right.\n\n0:18:16\tSPEAKER_03\n All right.\n\n0:18:17\tSPEAKER_03\n Any comments on all of that?\n\n0:18:20\tSPEAKER_00\n Well, one of the things that we have to decide on by the end of the meeting is who we're going to be.\n\n0:18:26\tSPEAKER_00\n Who's our target audience or target market?\n\n0:18:29\tSPEAKER_00\n So if we want something that looks good and is easy to use but has is fairly powerful product, whatever, who do we really want to aim that out?\n\n0:18:41\tSPEAKER_03\n Where's the money?\n\n0:18:43\tSPEAKER_00\n Yeah, who would have the money to spend?\n\n0:18:46\tSPEAKER_00\n If like 25 euro is our selling price and you can imagine, well, I'm not really sure how much that will retail at.\n\n0:18:54\tSPEAKER_00\n If somebody is not going to just use the remote that comes with their tally, I suppose they're going to actually go out and buy one.\n\n0:19:00\tSPEAKER_00\n So who do you think we're aiming this up?\n\n0:19:03\tSPEAKER_01\n I think it will be the mid-range to the high end market in terms of people because 25 euros for remote.\n\n0:19:11\tSPEAKER_01\n How much is that?\n\n0:19:12\tSPEAKER_01\n About 16, 17 pounds I think?\n\n0:19:14\tSPEAKER_01\n Is that a lot of money to buy an extra remote for a remote?\n\n0:19:18\tSPEAKER_01\n Maybe not the high end range but maybe middle upish.\n\n0:19:27\tSPEAKER_01\n I don't know how much I guess you'd be worth.\n\n0:19:30\tSPEAKER_01\n Like a simple replacement.\n\n0:19:33\tSPEAKER_01\n If you lost your remote and the first thing you just want to go on, this kind of touches on your comments or David.\n\n0:19:39\tSPEAKER_03\n These are the age groups which we have information on.\n\n0:19:42\tSPEAKER_03\n This is a table of what people would pay more for a certain feature, just give us a rough idea of where the will to spend money on TV equipment is.\n\n0:19:51\tSPEAKER_03\n Mostly focused around the 25 age group.\n\n0:19:54\tSPEAKER_00\n Do you think we're aiming at a fairly young market then?\n\n0:19:58\tSPEAKER_03\n Sort of young professional.\n\n0:20:00\tSPEAKER_00\n Do you think then voice recognition is something we should really seriously consider?\n\n0:20:09\tSPEAKER_00\n What do you think Craig?\n\n0:20:12\tSPEAKER_02\n Well, you don't say it was the adults that were going to be the white vaccination.\n\n0:20:17\tSPEAKER_03\n It does fit with the market that we're sort of identifying in terms of that.\n\n0:20:24\tSPEAKER_00\n I think we are going to have to narrow it down so let's target these people and give them what they want.\n\n0:20:29\tSPEAKER_00\n Because you know, it needs to be some kind of selling point to it.\n\n0:20:34\tSPEAKER_00\n So anybody, anything to add, just kind of young professionals, if we are going to include speech recognition, it's kind of between 15 and 35.\n\n0:20:45\tSPEAKER_00\n It seems to be like a really high response to that.\n\n0:20:48\tSPEAKER_00\n So we could say that was our target.\n\n0:20:50\tSPEAKER_01\n Five to 35 is fair to add that in.\n\n0:20:53\tSPEAKER_01\n Yeah.\n\n0:20:54\tSPEAKER_01\n That's more than half a group of people who are willing to at least try to use it.\n\n0:20:58\tSPEAKER_00\n Okay, so 15 to 35 look fairly young, you know, they have a bit of expandable income to spend on this sort of thing.\n\n0:21:05\tSPEAKER_01\n I think perhaps that age group is significant as well.\n\n0:21:07\tSPEAKER_01\n Because those are people who use the computer, who are familiar with computers in the everyday work.\n\n0:21:14\tSPEAKER_01\n I think people who are baby books, I wouldn't say 35, but people are on a foundation above now would not be so dependent and reliant on it.\n\n0:21:24\tSPEAKER_01\n Or mobile phone or something like that.\n\n0:21:28\tSPEAKER_01\n So people who are gadgety, right?\n\n0:21:30\tSPEAKER_01\n Growing up used to, you know, in schools and universities, they got into their working life.\n\n0:21:34\tSPEAKER_00\n So they're not shy away from something quite high-tech. That's a good point.\n\n0:21:39\tSPEAKER_00\n Okay, so shall we make the decision to include speech recognition?\n\n0:21:47\tSPEAKER_00\n If we can.\n\n0:21:48\tSPEAKER_01\n I think one thing we should try not to avoid is not to say we have to use speech recognition right now.\n\n0:21:54\tSPEAKER_01\n Okay, why is that?\n\n0:21:55\tSPEAKER_01\n Based on what everybody is saying, you want something simple, you want basic stuff, and you want something that you speak to recognition, you might not be the simplest thing.\n\n0:22:05\tSPEAKER_03\n Right.\n\n0:22:06\tSPEAKER_03\n Could it be an on-off thing?\n\n0:22:08\tSPEAKER_03\n Like, if you want it.\n\n0:22:09\tSPEAKER_01\n We can act a bit in directories.\n\n0:22:11\tSPEAKER_01\n We're kind of lock ourselves into a particular kind of technology.\n\n0:22:14\tSPEAKER_01\n So focusing on exactly what other features that we're going to say.\n\n0:22:19\tSPEAKER_01\n You know, say speech recognition is good for this speech recognition.\n\n0:22:22\tSPEAKER_01\n It's not good for this.\n\n0:22:23\tSPEAKER_01\n Sure.\n\n0:22:24\tSPEAKER_01\n Okay.\n\n0:22:25\tSPEAKER_01\n I suggest that we think about speech recognition.\n\n0:22:26\tSPEAKER_01\n Sure.\n\n0:22:27\tSPEAKER_01\n It's something that can be used to fulfill our functions.\n\n0:22:29\tSPEAKER_01\n I didn't know that we don't look at the technology, but we'll get the function first.\n\n0:22:33\tSPEAKER_00\n Okay.\n\n0:22:34\tSPEAKER_00\n Okay, well, do you want to give us your presentation?\n\n0:22:38\tSPEAKER_00\n And then we can, I don't mind if you need good ideas.\n\n0:22:40\tSPEAKER_00\n It all deliver presentations and then discuss, but this is highly.\n\n0:22:44\tSPEAKER_00\n Good to get ideas out while the friction mind.\n\n0:22:46\tSPEAKER_00\n Exactly.\n\n0:22:47\tSPEAKER_00\n And something that's just occurred to me as well as if we make it speech recognition, if we incorporate speech recognition, that's appealing to people maybe with physical disability as well.\n\n0:22:59\tSPEAKER_00\n Yeah.\n\n0:23:00\tSPEAKER_03\n And not losing, and also it helps in terms of people not losing this, you know, they're saying, oh, I lose it in the couch.\n\n0:23:10\tSPEAKER_03\n We're sort of getting into here as mating different design features together.\n\n0:23:16\tSPEAKER_02\n Okay.\n\n0:23:17\tSPEAKER_02\n One problem is speech recognition is that I've actually seen one of them used.\n\n0:23:20\tSPEAKER_02\n And the technology it was, that one wasn't picked by amazement.\n\n0:23:24\tSPEAKER_02\n So you end up yelling control for hours, trying to hold up.\n\n0:23:27\tSPEAKER_03\n I really have seen one before.\n\n0:23:28\tSPEAKER_00\n Do you think maybe we need further advances in that kind of area until it's worthwhile to incorporate it?\n\n0:23:33\tSPEAKER_02\n It's quite expensive to understand.\n\n0:23:36\tSPEAKER_04\n That's nice.\n\n0:23:37\tSPEAKER_04\n There you go.\n\n0:23:39\tNone\n Nice.\n\n0:23:41\tSPEAKER_01\n Well, this is just the working design.\n\n0:23:45\tSPEAKER_01\n Well, this is just what, how I would go about it.\n\n0:23:49\tSPEAKER_01\n I guess I try to define, like what we're doing now, try to define what we're trying to get done.\n\n0:23:54\tSPEAKER_01\n I think in a practical way, we kind of know what it is.\n\n0:23:57\tSPEAKER_01\n We've used it with familiar with it, but really we can't.\n\n0:24:00\tSPEAKER_01\n If we have a narrow down, exactly what are the things we're trying to fulfill.\n\n0:24:04\tSPEAKER_01\n Like, design the basics.\n\n0:24:06\tSPEAKER_01\n I think back in the back of our minds, we know what the basics are.\n\n0:24:09\tSPEAKER_01\n It's a change channel, just change volume, but in like specifics, which one of the basics are you trying to target?\n\n0:24:15\tSPEAKER_01\n Are there certain parts of the basics that are more important or less important than the basics?\n\n0:24:20\tSPEAKER_01\n And I just, the idea is just to get everybody to, I usually have a, have a design as a, as a basic.\n\n0:24:29\tSPEAKER_01\n So, you know, things that just start out going, but I guess everybody does have some ideas and I think, I think, you can use that.\n\n0:24:38\tSPEAKER_01\n Okay, this finding thing is a little bit confusing, so I'll go into the diagram.\n\n0:24:43\tSPEAKER_01\n It just explains how the process goes through, from the basic technology point of view, the basic steps that you need in the diagram, this like, hope it works better.\n\n0:24:53\tSPEAKER_01\n Okay, you need some powerful, the batteries are moving, and that power source is important, because it ties you down to how long the device will last.\n\n0:25:04\tSPEAKER_01\n I mean, it ties you down perhaps a bit later on in terms of technologies.\n\n0:25:08\tSPEAKER_01\n How far you can transmit the signal or the complexity of the functions that you want.\n\n0:25:14\tSPEAKER_01\n Like, for example, voice recognition, right?\n\n0:25:16\tSPEAKER_01\n That might be constrained because that, you might need to power microphone, you might need to power other things.\n\n0:25:21\tSPEAKER_01\n That's one aspect of statement.\n\n0:25:26\tSPEAKER_01\n Okay, the basic thing is, there's a user interface, where people punch a button or talk into it or smile to it, blink their eyes, whatever, you know, and that picks up an input from the user.\n\n0:25:40\tSPEAKER_01\n A logic, a series of logic has to decide what the user is telling the device, and the device has to, you know, push button A, so I would do something with button A to maybe button A to power them.\n\n0:25:52\tSPEAKER_01\n And then it needs to be able to send this signal to the device itself, which is a C-level.\n\n0:25:58\tSPEAKER_01\n And I think that's, you know, fit and fit, maybe that.\n\n0:26:02\tSPEAKER_01\n It's fairly general.\n\n0:26:04\tSPEAKER_01\n And I guess the purpose of this is also not to restrict you, in the way you're thinking like, voice recognition, right?\n\n0:26:13\tSPEAKER_01\n If it's something which is important, then we just add more power, rather than having a thing that we don't have enough power, so it's not going to be constrained in that sense.\n\n0:26:20\tSPEAKER_01\n But these are functionally, you know, the needs, what, you know, do have to do, okay.\n\n0:26:27\tSPEAKER_01\n So I guess the rest of it, I think we should maybe want to go back to what the functions are.\n\n0:26:32\tSPEAKER_01\n I think that's more relevant to discussion.\n\n0:26:34\tSPEAKER_00\n Well, do you want to finish up your presentation?\n\n0:26:38\tSPEAKER_01\n Are you all done?\n\n0:26:40\tSPEAKER_01\n Yeah.\n\n0:26:41\tSPEAKER_01\n Oh, it's just putting the rest of it into words, but it's essentially something.\n\n0:26:45\tSPEAKER_01\n You have a computer and a computer.\n\n0:26:48\tSPEAKER_01\n Okay.\n\n0:26:49\tSPEAKER_01\n Okay.\n\n0:26:50\tSPEAKER_03\n And like, on the, I mean, since we're on the topic of the technology, are there any like, what are our options?\n\n0:26:58\tSPEAKER_03\n What's, what is, and is this the only way that we go about it?\n\n0:27:03\tSPEAKER_03\n Are there other?\n\n0:27:04\tSPEAKER_01\n These, these aren't technology options in that sense.\n\n0:27:07\tSPEAKER_01\n This is just a basic principle.\n\n0:27:10\tSPEAKER_01\n Okay.\n\n0:27:11\tSPEAKER_01\n Basic components that I need it.\n\n0:27:12\tSPEAKER_01\n For example, if you needed, if needed to add a voice recognition, right, then you use it in the case, would you split, broken down more components, right?\n\n0:27:23\tSPEAKER_01\n You have a microphone, the R, something like that.\n\n0:27:25\tSPEAKER_00\n So it's just how we're kind of modularizing the whole thing, okay.\n\n0:27:29\tSPEAKER_01\n So each component represents one function.\n\n0:27:31\tSPEAKER_01\n But I think the basic functions are the logic, the transmitter, and the receiver, okay, and the power are things that you won't have to care about.\n\n0:27:39\tSPEAKER_01\n Yeah.\n\n0:27:42\tSPEAKER_01\n And those are things that based on what you're using the face requires, and we'll add more functionality to it.\n\n0:27:47\tSPEAKER_01\n Okay.\n\n0:27:48\tSPEAKER_01\n There might be one other consideration, which would be the transmission between the remote control and the TV, for example.\n\n0:27:54\tSPEAKER_01\n Okay.\n\n0:27:55\tSPEAKER_01\n Okay.\n\n0:27:56\tSPEAKER_01\n Are we going to restrict ourselves to using the traditional technologies and then the data?\n\n0:28:00\tSPEAKER_01\n Okay.\n\n0:28:01\tSPEAKER_01\n Because that's something you need to actually be physically pointing to.\n\n0:28:04\tSPEAKER_00\n Right.\n\n0:28:05\tSPEAKER_00\n Well, a way that was expressed in the new requirements was that if we made this too complex, it would affect how long it took us to get this to market.\n\n0:28:13\tSPEAKER_00\n So as a suspect, it might be a good idea to restrict our kind of creative influence on this, on the user interface, and not worry so much about how we transmit it.\n\n0:28:23\tSPEAKER_00\n Yeah.\n\n0:28:24\tSPEAKER_00\n Because I mean, it's tried and tested and for ads.\n\n0:28:27\tSPEAKER_01\n So they might be a little firm with the transmission, in particular, right now, since we're talking about voice recognition.\n\n0:28:32\tSPEAKER_01\n If somebody's going to talk to the device, you really want them to hold it to them.\n\n0:28:37\tSPEAKER_01\n You may not require that, but you know, it's something very natural, I guess, to hold it, signal to the user and push a button maybe to start talking about it.\n\n0:28:47\tSPEAKER_01\n Then you need to send a signal out.\n\n0:28:49\tSPEAKER_01\n So if you're using infrared, the line of sight, say the TV is at that chair, and I'm standing in front of here, and the transmitter is here, it blocks it.\n\n0:28:57\tSPEAKER_00\n Okay.\n\n0:28:58\tSPEAKER_01\n So in that sense, there's not really a restriction, but there's something you may have to think about later on in the process.\n\n0:29:04\tSPEAKER_01\n Okay.\n\n0:29:05\tSPEAKER_03\n Not so much.\n\n0:29:06\tSPEAKER_03\n And just a clarification before we finish this, is our controller, is it, have the option of being on a standard frequency as all of the other equipment so that the one controller can control several pieces of equipment?\n\n0:29:21\tSPEAKER_01\n There's not much specific information, but I think that one indication of infrared means that you're just targeting traditional devices.\n\n0:29:29\tSPEAKER_00\n Is infrared is something that you can't?\n\n0:29:31\tSPEAKER_00\n Well, we've, in the new requirements spec, they said just to focus on a TV, so that's what we should do for now, I think.\n\n0:29:37\tSPEAKER_00\n Something I was wondering about with the power, is it worth considering, like having a charging unit as opposed to just regular batteries?\n\n0:29:45\tSPEAKER_00\n I mean, is that something you really want to go into to think, or should we just consider\n\n0:29:49\tSPEAKER_01\n running on regular batteries? From the component point of view, there's added complexity.\n\n0:29:53\tSPEAKER_00\n Uh-huh.\n\n0:29:54\tSPEAKER_01\n And then there's probably the fact that you need another physical component, you need a docking cradle for example.\n\n0:30:00\tSPEAKER_01\n Yeah.\n\n0:30:01\tSPEAKER_01\n Put it into charge.\n\n0:30:02\tSPEAKER_01\n Okay.\n\n0:30:03\tSPEAKER_01\n You need to get the user to plug it in.\n\n0:30:05\tSPEAKER_01\n Okay, so.\n\n0:30:06\tSPEAKER_01\n Most users already use the value of buying batteries and putting it in for the whole time.\n\n0:30:11\tSPEAKER_01\n Unless the controller is going to consume a lot of batteries, like, it's going to run through like, the batteries a month, then I don't think you charge about something.\n\n0:30:20\tSPEAKER_00\n Okay, so just stick to regular, okay.\n\n0:30:23\tSPEAKER_00\n Um, right.\n\n0:30:27\tSPEAKER_00\n So, busy, the, um, I'm just going to just recap.\n\n0:30:33\tSPEAKER_00\n When I said at the start, it was that, um, the, the whole point of this meeting was to absolutely finalize who we're going to aim this at.\n\n0:30:41\tSPEAKER_00\n And what exactly the product's going to do.\n\n0:30:43\tSPEAKER_00\n So, um, just to recap on, are we all happy about the idea of, um, aiming the product at, um, the 15 to 35 bracket.\n\n0:30:54\tSPEAKER_00\n Yeah.\n\n0:30:55\tSPEAKER_00\n Um, and also the, the, the actual functions of what it's going to do.\n\n0:31:00\tSPEAKER_00\n Do you want to recap on that, Craig?\n\n0:31:03\tSPEAKER_02\n Um, I think we used to say that it was going to be the most basic stuff possible.\n\n0:31:08\tSPEAKER_02\n Um, on and off, up and down the channel, up and down volume.\n\n0:31:11\tSPEAKER_02\n And skip to the channel.\n\n0:31:14\tSPEAKER_00\n Okay.\n\n0:31:15\tSPEAKER_03\n And is it going to include any of the, uh, the more advanced features?\n\n0:31:19\tSPEAKER_03\n Are we going to eliminate those?\n\n0:31:21\tSPEAKER_02\n Um, I think we include you.\n\n0:31:23\tSPEAKER_02\n But apart from that, um, I think you just go for the simplest.\n\n0:31:27\tSPEAKER_02\n Okay.\n\n0:31:28\tSPEAKER_03\n Is it, is it, is it, is it not an option still that we include some things just as a sort of under, like sort of under a door?\n\n0:31:35\tSPEAKER_00\n Yeah, it's as optional function.\n\n0:31:37\tSPEAKER_03\n What, what I might be a bit worried about is if someone was, uh, had previously developed habits of expecting to control surround sound or this and that, with their controller and then, and then they, you know, they get ours.\n\n0:31:52\tSPEAKER_03\n It doesn't, it doesn't have that.\n\n0:31:54\tSPEAKER_03\n I don't know if that'd be a problem.\n\n0:31:56\tSPEAKER_01\n And I think that you're saying about categorizing the people.\n\n0:32:00\tSPEAKER_01\n Um, maybe I could suggest we, we think that that is, we simple categories.\n\n0:32:04\tSPEAKER_01\n Yeah.\n\n0:32:05\tSPEAKER_01\n One of the audio controls, um, will be video control.\n\n0:32:08\tSPEAKER_01\n Okay.\n\n0:32:09\tSPEAKER_01\n So, you know, this can be the same.\n\n0:32:10\tSPEAKER_01\n I think, I mean, we're also going to be a little bit more, a little bit more of the audio device.\n\n0:32:12\tSPEAKER_01\n Um, this may not map very well to advanced functionality especially.\n\n0:32:15\tSPEAKER_01\n But I think that, um, from a manufacturer, for one of these, yeah, if I'm designing the device, but I think, from the point of view of the person using it, you know, a TV is something you see and something you hear, um, and there's something they do, but there's things to it like, turning on and turning off.\n\n0:32:29\tSPEAKER_01\n Yeah.\n\n0:32:30\tSPEAKER_01\n So what we could have, like, two buckets, and you could scale things into, like, if you want this to turn that square into there.\n\n0:32:36\tSPEAKER_01\n Yeah.\n\n0:32:37\tSPEAKER_01\n and it's basic, but non-basic.\n\n0:32:39\tSPEAKER_01\n Okay, okay.\n\n0:32:39\tSPEAKER_01\n It might help you.\n\n0:32:40\tSPEAKER_01\n It'll be the night of the day.\n\n0:32:41\tSPEAKER_01\n And it would actually help you with the component build as well.\n\n0:32:45\tSPEAKER_00\n Okay.\n\n0:32:46\tSPEAKER_00\n Okay, great.\n\n0:32:46\tSPEAKER_00\n Right.\n\n0:32:47\tSPEAKER_00\n Okay, well, I've got a kind of, got five minutes to wrap up now.\n\n0:32:52\tSPEAKER_00\n Next thing we're doing is having lunch.\n\n0:32:53\tSPEAKER_00\n Woo-hoo.\n\n0:32:54\tSPEAKER_00\n And then we're gonna have 30 minutes of working on the next stage.\n\n0:32:59\tSPEAKER_00\n So I'll be pulling the minutes of this meeting into the project documents folder.\n\n0:33:05\tSPEAKER_00\n Okay.\n\n0:33:06\tSPEAKER_00\n So I guess just to confirm that we know what we're doing in the next, well, in the 30 minutes after lunch anyway.\n\n0:33:15\tSPEAKER_00\n For our industrial designer, you're gonna be thinking about the components concept.\n\n0:33:21\tSPEAKER_00\n User-in-fist designer, you're gonna be thinking about our user interface and marketing.\n\n0:33:25\tSPEAKER_00\n You're gonna be thinking what trend watching and you'll all get specific instructions as well.\n\n0:33:30\tSPEAKER_00\n So I know just to ask now, if you've got anything else you thought about while we've been talking.\n\n0:33:38\tSPEAKER_00\n And do you wanna start with David, then I'll just say at all.\n\n0:33:43\tSPEAKER_00\n No, okay.\n\n0:33:45\tSPEAKER_03\n Yeah, just, I just wanted to ask then before we wrap up, should we agree for sake of sort of clarity and when we resume that we'll use this idea, David's proposal, we think of these three sort of buckets.\n\n0:33:57\tSPEAKER_03\n Yeah, yeah, I think we've got a good idea.\n\n0:33:59\tSPEAKER_03\n I think we've got the best idea.\n\n0:34:00\tSPEAKER_03\n Okay, we're talking about this.\n\n0:34:01\tSPEAKER_02\n Should we do that?\n\n0:34:02\tSPEAKER_02\n Yeah.\n\n0:34:03\tSPEAKER_02\n Okay, great.\n\n0:34:04\tSPEAKER_02\n Just about the three buckets.\n\n0:34:06\tSPEAKER_02\n What would go in the device functions one?\n\n0:34:08\tSPEAKER_01\n Things like on off.\n\n0:34:10\tSPEAKER_01\n Because they don't have anything to do with what you see.\n\n0:34:13\tSPEAKER_01\n Yeah.\n\n0:34:13\tSPEAKER_01\n I mean, in terms of picture and the entertainment value.\n\n0:34:18\tSPEAKER_01\n Okay.\n\n0:34:19\tSPEAKER_01\n So, in channel.\n\n0:34:21\tSPEAKER_01\n In channel.\n\n0:34:22\tSPEAKER_01\n Because the on off also goes, you know, like on off like power, not on off sound.\n\n0:34:26\tSPEAKER_01\n Yeah.\n\n0:34:27\tSPEAKER_01\n On off video, although you don't turn off some TV.\n\n0:34:31\tSPEAKER_01\n But you might wanna turn off the sound so you wanna pick up the phone and mute button.\n\n0:34:35\tSPEAKER_01\n Okay.\n\n0:34:36\tSPEAKER_01\n You have a choice of putting it onto others or device.\n\n0:34:42\tSPEAKER_01\n Device is basically anything we can't categorize.\n\n0:34:44\tSPEAKER_00\n Okay, so you're gonna have audio, which is gonna be like, you know, you base settings and actual volume.\n\n0:34:50\tSPEAKER_00\n Anything to do with what you hear, right?\n\n0:34:52\tSPEAKER_00\n Okay.\n\n0:34:53\tSPEAKER_00\n Put that into audio.\n\n0:34:54\tSPEAKER_00\n Okay, and then visual.\n\n0:34:55\tSPEAKER_00\n There's anything that you can see.\n\n0:34:57\tSPEAKER_00\n Okay.\n\n0:34:58\tSPEAKER_00\n So brightness, contrast, things like that.\n\n0:35:00\tSPEAKER_00\n And then just actual device things like what channel you're watching, turning on and off, stuff like that.\n\n0:35:06\tSPEAKER_00\n Okay.\n\n0:35:08\tSPEAKER_03\n And I suppose quite likely what would happen is in the device category, there might be some which are just like the habitual standard and then others which are maybe a bit more random,\n\n0:35:17\tSPEAKER_01\n which we can go other place to push. Yeah.\n\n0:35:19\tSPEAKER_01\n Somewhere there.\n\n0:35:20\tSPEAKER_01\n Okay.\n\n0:35:21\tSPEAKER_01\n Even if it doesn't matter clearly, what happens is that people at least have some in their mind.\n\n0:35:25\tSPEAKER_01\n It's easy to use.\n\n0:35:26\tSPEAKER_01\n I think that's one thing that, and I guess from the phone at point of view, as well as the speaker.\n\n0:35:34\tSPEAKER_00\n Okay.\n\n0:35:34\tSPEAKER_00\n So yeah, I guess just things to think about are, you know, like the fact that's got to look good because if you were targeting this up, something maybe kind of quirky and design, maybe make it kind of ergonomic kind of to hold, you know, things like that.\n\n0:35:52\tSPEAKER_00\n So I guess that's it.\n\n0:35:54\tSPEAKER_00\n Right.\n\n0:35:55\tSPEAKER_00\n The meeting over.\n\n0:35:55\tSPEAKER_04\n Now we get to go find out what was picked up for lunch for us.\n\n0:37:56\tNone\n Yes.\n\n0:37:57\tNone\n Yes.\n\n0:37:57\tNone\n Hm.\n\n0:38:01\tNone\n Yes.\n\n0:38:04\tNone\n Colleague.\n\n", "summary": [{"summary_text": "The company wants the remote control to control the TV only. The company also wants the corporate color and slogan to be implemented in the new design. Speaker's meeting is to discuss the functional design of the new remote control. It will be simple and it will control only the TV, not the VCR or DVD or anything else."}]}