{"filename": "./data/ES2006a.txt", "transcript": "0:00:00\tSPEAKER_02\n Okay, so this is our first meeting of this design project and I am glad to show you the agenda for the meeting. I don't know if it was sent round to all of you.\n\n0:00:30\tSPEAKER_02\n I don't know, anyway. This is the plan for today's meeting is firstly just to introduce the project briefly, although I'm sure you've actually got some of the information already. Then the main purpose is to so that we get to know each other a little bit more.\n\n0:00:49\tSPEAKER_02\n Then we want to practice using some of the tools that we'll be using during the course of the design project and the meetings, specifically the whiteboard over there.\n\n0:01:04\tSPEAKER_02\n Then we need to go through the specifics of our project plan and discuss, come up with some preliminary ideas about it. Then that's it. We've got 25 minutes to do that until 11.25. Any questions?\n\n0:01:27\tSPEAKER_02\n No, at this point.\n\n0:01:34\tSPEAKER_02\n This is our project. What we're aiming to do is to create a new remote control for television. We want it to be something original, something trendy and also something user-friendly.\n\n0:01:52\tSPEAKER_02\n It has to be quite intuitive that people are able to use this project.\n\n0:02:18\tSPEAKER_02\n The method that we're going to use to complete the project that has three components, such as the functional design of the remote control, the way we'll do that is to work individually, initially, and then come together for meetings to work on that. Similarly, with the conceptual design, we'll start off by working individually with our own expertise and our own laptops, and then we'll bring what we've done together. Then the detailed design will come after that.\n\n0:03:05\tSPEAKER_01\n I'm a bit confused about what's the difference between the functional design and conceptual design. Is it just more detail?\n\n0:03:18\tSPEAKER_02\n I think we're talking that the functional design is more your area of things where you'll be, we want to look at what functions we need, it never might control, and what specific things it has to do, but the conceptual design is perhaps bigger than that and includes there. How it will be done?\n\n0:03:48\tSPEAKER_01\n Where do we identify the components of our product? I think it's in the conceptual design phase that we identify. It's in the conceptual design phase that we identify the components of our product.\n\n0:04:04\tSPEAKER_02\n I think we'll start that initially with the functional design already.\n\n0:04:08\tSPEAKER_02\n Okay, so that's just a brief overview of the project itself. What I'd like us to do now is simultaneously introduce ourselves and start using some of the tools that we're using for the project. Specifically the whiteboard. So each person in turn, I'd like us to go up to the whiteboard, the pens just underneath it there, and draw your favourite animal, and then tell everyone what your favourite characteristics of that animal are, and while you're doing that tell us your name, what your role is, and perhaps how your animal relates to the role that you're taking in this project.\n\n0:05:08\tSPEAKER_02\n Would you like to go first?\n\n0:05:12\tSPEAKER_03\n I do have a choice.\n\n0:05:24\tSPEAKER_03\n Cool.\n\n0:05:27\tSPEAKER_02\n You don't have to hurry, we've got plenty of time.\n\n0:05:30\tSPEAKER_03\n So my name's Katz, and I'm really not very good at this whole drawing when I say...\n\n0:05:50\tSPEAKER_03\n Okay, that's not no-one.\n\n0:06:00\tSPEAKER_03\n Oh, good thing.\n\n0:06:10\tSPEAKER_03\n This is a rabbit.\n\n0:06:20\tSPEAKER_04\n At first I thought it was going to be Katz.\n\n0:06:27\tSPEAKER_03\n There are four sheepish moon- fazendo-asmegaes.\n\n0:06:42\tSPEAKER_03\n Okay, excellent. And what's your role within the team? I am the, I need my notebook.\n\n0:06:53\tSPEAKER_03\n Top the number. Thank you. Okay, cool. I am the marketing expert.\n\n0:06:58\tSPEAKER_03\n So, like, I'm going to be doing the apparently according to the little guy on the computer that knows everything.\n\n0:07:06\tSPEAKER_03\n The user requirements specification of the functional design, trend-wotting in the conceptual design, and products of valuation in the detailed design.\n\n0:07:19\tSPEAKER_03\n Okay. So, yeah.\n\n0:07:22\tSPEAKER_02\n And more about yourself. You're from Ankenlester.\n\n0:07:26\tSPEAKER_03\n Second year. Well, what else do you want to know?\n\n0:07:31\tSPEAKER_03\n I like sports. Yeah, aerobics, kickboxing, spinning, but not with rabbits.\n\n0:07:43\tSPEAKER_03\n Not with rabbits, no, no, no, and bats. I like bats as well.\n\n0:07:48\tSPEAKER_03\n And yeah, and I like cold tails, especially pink ones.\n\n0:07:52\tSPEAKER_02\n Okay. Thanks for all to match the rabbit.\n\n0:08:04\tSPEAKER_04\n Okay. So, my name is Marika.\n\n0:08:08\tSPEAKER_04\n Mr. Penn.\n\n0:08:13\tSPEAKER_02\n If you haven't got enough room, there's only a razor there and you can wrap it.\n\n0:08:18\tSPEAKER_04\n Yeah, well, Marika can make it smaller.\n\n0:08:22\tSPEAKER_04\n So, I'm the interface designer in this project.\n\n0:08:26\tSPEAKER_04\n And my favorite animal, I mean, I'm not so sure because I'm not so, so very familiar with all kinds of animals, but I do like dogs.\n\n0:08:36\tSPEAKER_04\n Oh, sorry, maybe I shouldn't have said it beforehand.\n\n0:08:38\tSPEAKER_04\n Hmm.\n\n0:08:44\tSPEAKER_04\n Well, there are different kinds of dogs, but okay.\n\n0:08:58\tSPEAKER_00\n That's a better dog. It's like a dog.\n\n0:09:01\tSPEAKER_03\n It's a bit more impressive than my mother. I think it needs four legs if it's going to work.\n\n0:09:05\tSPEAKER_04\n Yeah, maybe it has some cool foot patches.\n\n0:09:09\tSPEAKER_04\n Yeah, and I do like dogs because they are good friends.\n\n0:09:15\tSPEAKER_04\n Two people and they are loyal.\n\n0:09:21\tSPEAKER_04\n Well, as compared to some other animals, they're really much more fun because they are not so independent.\n\n0:09:28\tSPEAKER_04\n Yeah, maybe the fact that they protect their home as well.\n\n0:09:36\tSPEAKER_04\n Yeah. What it has to do with my role in the project is hard to say.\n\n0:09:42\tSPEAKER_04\n I hope to be loyal to the project and not to let people doing similar projects know the details or projects or something.\n\n0:09:52\tSPEAKER_02\n Yeah, where are you from?\n\n0:09:54\tSPEAKER_04\n I'm from Estonia.\n\n0:09:59\tSPEAKER_04\n So, is there anything else you would like to know?\n\n0:10:02\tSPEAKER_04\n Oh, right, my roles.\n\n0:10:05\tSPEAKER_04\n So, in the different stages of the design, so at first I will be responsible for designing the technical functions of the remote control.\n\n0:10:20\tSPEAKER_04\n Then in the conceptual design stage, I need to come up with interface concept.\n\n0:10:31\tSPEAKER_04\n And then in the last stage, I will be responsible for the use interface design.\n\n0:10:38\tSPEAKER_04\n Thank you.\n\n0:10:50\tSPEAKER_00\n I'll do some.\n\n0:10:53\tSPEAKER_00\n I'll rub the features.\n\n0:10:56\tSPEAKER_00\n I'll rub the drawings there.\n\n0:10:59\tSPEAKER_01\n My name is Gaurav.\n\n0:11:09\tSPEAKER_01\n My favourite animal, one of my favourite animals is a cow.\n\n0:11:14\tSPEAKER_01\n I have a lot of no idea how to draw.\n\n0:11:17\tSPEAKER_02\n Good luck.\n\n0:11:21\tSPEAKER_01\n This is going to be...\n\n0:11:23\tSPEAKER_03\n We're not just like a big brown body and then some really skinny legs and just some bones.\n\n0:11:29\tSPEAKER_01\n Let me draw the body first.\n\n0:11:35\tSPEAKER_01\n And then what a long tail.\n\n0:11:39\tSPEAKER_01\n On a long face.\n\n0:11:42\tSPEAKER_03\n It looks like you.\n\n0:11:44\tSPEAKER_01\n And there is some grass there.\n\n0:11:47\tSPEAKER_01\n So, this is what I like about.\n\n0:11:50\tSPEAKER_01\n I think it keeps sitting there eating grass that do not disturb anybody.\n\n0:11:56\tSPEAKER_01\n They're kind of put this in a way.\n\n0:12:00\tSPEAKER_01\n So, yeah, I like cows.\n\n0:12:05\tSPEAKER_01\n My role in the project is the industrial designer.\n\n0:12:10\tSPEAKER_01\n So, I'm supposed to design all the details of the product, how it works and whatever it will take.\n\n0:12:20\tSPEAKER_01\n During the functional role, what are the various functions that have to be found by it.\n\n0:12:24\tSPEAKER_01\n During the conceptual design, what are the various components of it.\n\n0:12:29\tSPEAKER_01\n And finally, I'm not to show what was the last part.\n\n0:12:34\tSPEAKER_01\n The detailed design, I guess it will again be identification of the components and how they integrate with each other.\n\n0:12:43\tSPEAKER_01\n I'm from India.\n\n0:12:46\tSPEAKER_01\n I'm doing my PhD in Cyclingistics.\n\n0:12:49\tSPEAKER_01\n I sit at the Department of Psychology.\n\n0:12:52\tSPEAKER_01\n Yeah.\n\n0:12:54\tSPEAKER_04\n Thank you.\n\n0:12:55\tSPEAKER_02\n Thanks.\n\n0:12:56\tSPEAKER_02\n Now it's my turn, I'll be here soon.\n\n0:13:10\tSPEAKER_02\n This is like a carbon.\n\n0:13:13\tSPEAKER_02\n It looks really cute.\n\n0:13:15\tSPEAKER_02\n Yeah.\n\n0:13:16\tSPEAKER_02\n I like the cow.\n\n0:13:17\tSPEAKER_02\n I'm Jen.\n\n0:13:19\tSPEAKER_02\n I like dogs too, but I can't do that already because I can't do a dog as well as you can.\n\n0:13:25\tSPEAKER_02\n I like.\n\n0:13:28\tSPEAKER_00\n I like.\n\n0:13:35\tSPEAKER_03\n Is that a listen?\n\n0:13:45\tSPEAKER_01\n No way.\n\n0:13:52\tSPEAKER_04\n Wow.\n\n0:13:55\tSPEAKER_02\n It's a gecko.\n\n0:13:58\tSPEAKER_02\n Oh, a gecko.\n\n0:13:59\tSPEAKER_03\n Okay.\n\n0:14:00\tSPEAKER_03\n Yeah.\n\n0:14:01\tSPEAKER_03\n Is there a difference?\n\n0:14:02\tSPEAKER_04\n Are they also like lizards or are they yet?\n\n0:14:04\tSPEAKER_02\n Yeah, they are.\n\n0:14:05\tSPEAKER_02\n They are kind of lizard.\n\n0:14:06\tSPEAKER_02\n And I like geckos because they remind me of warm places.\n\n0:14:12\tSPEAKER_02\n And where I was living in Cambodia, they used to live in my house and they were on the ceiling and they would make little geckos.\n\n0:14:21\tSPEAKER_04\n I hope you don't like snakes, do you?\n\n0:14:24\tSPEAKER_02\n I don't like snakes.\n\n0:14:25\tSPEAKER_02\n I can't.\n\n0:14:26\tSPEAKER_02\n Okay.\n\n0:14:27\tSPEAKER_02\n We have nasty snakes.\n\n0:14:28\tSPEAKER_02\n It's very fun.\n\n0:14:29\tSPEAKER_02\n I was really young.\n\n0:14:30\tSPEAKER_02\n I'm from Melbourne.\n\n0:14:34\tSPEAKER_02\n And I'm your project manager for today.\n\n0:14:39\tSPEAKER_02\n And my role is basically to keep things going and make sure that you all work together in a productive way.\n\n0:14:48\tSPEAKER_02\n So that by the end of the day we come up with a great product.\n\n0:14:53\tSPEAKER_02\n Wonderful.\n\n0:14:54\tNone\n Okay.\n\n0:14:55\tSPEAKER_00\n Thank you.\n\n0:14:56\tSPEAKER_02\n So let's see what's next in the PowerPoint presentation.\n\n0:15:12\tSPEAKER_02\n I just thought about this that we could even put much more proficient in.\n\n0:15:19\tSPEAKER_02\n Okay.\n\n0:15:20\tSPEAKER_02\n So this is the overall budget for our project.\n\n0:15:29\tSPEAKER_02\n We're planning to sell these remote controls for...\n\n0:15:34\tSPEAKER_02\n Let's make that go away.\n\n0:15:35\tSPEAKER_02\n That means we've got five minutes.\n\n0:15:37\tSPEAKER_02\n We're planning to sell the remote controls for 25 euros each.\n\n0:15:44\tSPEAKER_02\n And with that we're aiming for a profit of 50 million euros.\n\n0:15:51\tSPEAKER_02\n And that's selling them on the international market, not just in the UK.\n\n0:15:57\tSPEAKER_02\n So to do that, our finance people estimate that we need production costs of maximum 12 and a half euros so that we can reach that profit target.\n\n0:16:28\tSPEAKER_02\n So that's something to keep in mind when we're designing.\n\n0:16:36\tSPEAKER_02\n Okay.\n\n0:16:41\tSPEAKER_02\n Let me just skip ahead to say that's the last thing.\n\n0:16:48\tSPEAKER_02\n Okay.\n\n0:16:49\tSPEAKER_02\n We've only got a couple of minutes.\n\n0:16:51\tSPEAKER_02\n Does anyone have any first ideas to bounce around about what we're thinking of this?\n\n0:16:59\tSPEAKER_04\n Yeah, I'm just wondering whether there is any special feature that we want to have.\n\n0:17:06\tSPEAKER_04\n Want this remote control as opposed to the already existing ones.\n\n0:17:19\tSPEAKER_02\n I think that's probably something that's best if we take away with this.\n\n0:17:24\tSPEAKER_02\n But if we all have a think when we go away from the meeting, what specific things could be included in this remote control?\n\n0:17:34\tSPEAKER_01\n I think in the beginning one thing was that was mentioned was that should be trendy user friendly and original.\n\n0:17:43\tSPEAKER_01\n So I think your point is relevant as far as the originality is concerned that we should provide some features that are quite unique to this.\n\n0:17:52\tSPEAKER_03\n Yeah, I was looking at the website and the other things that they've made and I like put down some inspirational words like that I got from looking at the pictures.\n\n0:18:03\tSPEAKER_03\n So the motto is we put the fashion in electronics and so it's something that is sleek and stylish but it's still functional.\n\n0:18:13\tSPEAKER_03\n So I'm kind of thinking like those phones that they have, the new generation ones where they don't actually have any buttons on them and stuff like that.\n\n0:18:23\tSPEAKER_03\n So it's something adding towards that so it's not overly, I don't know what most of them do on my own account.\n\n0:18:33\tSPEAKER_02\n So perhaps some sort of menu based thing or something that's a little less crowded than this.\n\n0:18:41\tSPEAKER_03\n I mean theoretically you can do all kinds of things with your TV.\n\n0:18:45\tSPEAKER_03\n But what do most people do? They turn it on. They watch certain specified channels and then they turn it off again.\n\n0:18:52\tSPEAKER_01\n There is a lot of functionality in there that is not used 90% of the time but will be used 10% of time.\n\n0:18:58\tSPEAKER_02\n There's no need to have buttons on it to do that. Maybe to do it could be one button for a menu or something that's really nice.\n\n0:19:04\tSPEAKER_02\n And then use that.\n\n0:19:05\tSPEAKER_03\n So if you're a kind of sad case that knows how your making tool works then that's fine and you can do it on the screen rather than everybody else having to have these buttons which is confusing.\n\n0:19:15\tSPEAKER_03\n Excellent. Because if you look at the train it's just very like there's no extra bits on it, the train on the website.\n\n0:19:25\tSPEAKER_03\n I don't know if I haven't had that up on the theme.\n\n0:19:28\tSPEAKER_03\n But it is just like a long, like thing used to moving people but it looks really pretty too.\n\n0:19:38\tSPEAKER_02\n Great.\n\n0:19:39\tSPEAKER_02\n Any other immediate thoughts?\n\n0:19:48\tSPEAKER_01\n We can aim for, I mean we can think about all these little things but we can aim for something that gives a high battery life.\n\n0:19:54\tSPEAKER_01\n Although I don't think that it's a huge problem for a motor controls and even battery life every now and then you need to replace the batteries.\n\n0:20:08\tSPEAKER_04\n Even though it has to be original we shouldn't go too far away from the usual ones because otherwise the new users will just have a lot of problems with learning.\n\n0:20:20\tSPEAKER_01\n So it should fit in as well.\n\n0:20:25\tSPEAKER_01\n It's like a fancy whip.\n\n0:20:26\tSPEAKER_02\n It's a teeter type of a bit.\n\n0:20:29\tSPEAKER_02\n You can't access because you have no idea how to get in but the design is not very great.\n\n0:20:35\tSPEAKER_02\n Okay so we need to wrap it up now so that we can go away and get on with some of this.\n\n0:20:42\tSPEAKER_02\n We've got another meeting in 30 minutes so you'll be getting specific instructions once you go back to your workspace.\n\n0:20:53\tSPEAKER_02\n Basically you're looking at the working design.\n\n0:20:58\tSPEAKER_02\n You're looking at the technical functions design and for your experience the user requirements specification like I said at the start.\n\n0:21:08\tSPEAKER_02\n Okay, thanks for that.\n\n0:21:12\tSPEAKER_02\n Thank you.\n\n0:21:13\tSPEAKER_02\n I'll see you in half an hour.\n\n0:21:16\tSPEAKER_02\n See you.\n\n0:21:17\tSPEAKER_02\n Carry the laptops back again.\n\n0:21:18\tSPEAKER_02\n Do we need to unplug things?\n\n0:21:20\tSPEAKER_02\n Probably.\n\n", "summary": [{"summary_text": "Today is the first meeting of the design project. Speaker and his colleagues are working on a new remote control for television. They have 25 minutes to introduce themselves and practice using the tools they will be using during the course of the project. They will work on the functional design of the remote control first, and then on the conceptual design."}]}