{"filename": "./data/ES2015b.txt", "transcript": "0:00:00\tNone\n Yep.\n\n0:00:07\tNone\n This is some great facial expressions, it's not really.\n\n0:00:10\tNone\n Okay.\n\n0:00:11\tNone\n Just remember it's not real.\n\n0:00:14\tNone\n Yeah.\n\n0:00:15\tNone\n Okay.\n\n0:00:16\tNone\n Okay.\n\n0:00:17\tNone\n Okay.\n\n0:00:18\tNone\n Okay.\n\n0:00:19\tNone\n Okay.\n\n0:00:20\tNone\n Okay.\n\n0:00:21\tNone\n Okay.\n\n0:00:22\tSPEAKER_01\n Okay.\n\n0:00:23\tSPEAKER_01\n Okay.\n\n0:00:24\tSPEAKER_01\n Okay.\n\n0:00:25\tSPEAKER_01\n Okay.\n\n0:00:26\tSPEAKER_01\n Okay.\n\n0:00:27\tSPEAKER_01\n Okay.\n\n0:00:28\tSPEAKER_01\n Okay.\n\n0:00:29\tSPEAKER_01\n Yeah.\n\n0:00:30\tSPEAKER_01\n Okay.\n\n0:00:31\tSPEAKER_01\n Okay.\n\n0:00:32\tSPEAKER_01\n Yeah.\n\n0:00:33\tNone\n Okay.\n\n0:00:36\tNone\n Okay.\n\n0:00:37\tNone\n Okay.\n\n0:00:38\tNone\n Yeah.\n\n0:00:39\tNone\n Okay.\n\n0:00:40\tNone\n Okay.\n\n0:00:41\tNone\n Okay.\n\n0:00:42\tNone\n Okay.\n\n0:00:43\tSPEAKER_01\n Okay.\n\n0:00:44\tSPEAKER_01\n You're going to be the first one on PowerPoint.\n\n0:00:46\tSPEAKER_01\n So.\n\n0:00:47\tSPEAKER_01\n I'll just like cook you up there with that.\n\n0:00:54\tSPEAKER_01\n Am I starting now?\n\n0:00:56\tSPEAKER_01\n Anytime?\n\n0:00:57\tSPEAKER_01\n Oh, sorry.\n\n0:00:58\tSPEAKER_01\n Okay.\n\n0:00:59\tSPEAKER_01\n All right.\n\n0:01:00\tSPEAKER_01\n Welcome back to the second meeting.\n\n0:01:04\tSPEAKER_01\n And I hope you had a productive the last 30 minutes.\n\n0:01:09\tSPEAKER_01\n And I'll be taking minutes on this one.\n\n0:01:12\tSPEAKER_01\n And being hooked up to the PowerPoint for this meeting isn't very necessary for myself because it'll be more about what you guys are bringing to the meeting today.\n\n0:01:25\tSPEAKER_01\n So the first presentation we'll be looking at is Poppy's presentation.\n\n0:01:31\tSPEAKER_01\n And so, sorry.\n\n0:01:35\tSPEAKER_01\n So take it away Poppy.\n\n0:01:37\tSPEAKER_00\n Okay.\n\n0:01:38\tSPEAKER_00\n And then we do.\n\n0:01:40\tSPEAKER_01\n It's plugged in.\n\n0:01:42\tSPEAKER_01\n So.\n\n0:01:43\tSPEAKER_02\n Okay.\n\n0:01:44\tSPEAKER_02\n Okay.\n\n0:01:45\tSPEAKER_00\n Sorry about this guy.\n\n0:01:48\tSPEAKER_00\n You're welcome.\n\n0:01:49\tSPEAKER_00\n Okay.\n\n0:01:50\tSPEAKER_01\n I'll see you all.\n\n0:01:54\tSPEAKER_01\n Okay.\n\n0:01:55\tSPEAKER_01\n Okay.\n\n0:01:56\tSPEAKER_02\n I'll take this time just to apologise.\n\n0:02:01\tSPEAKER_00\n I only received my emails later on because I was too busy carried away doing my own thing, which is not obviously not a very good part of a team working thing.\n\n0:02:16\tSPEAKER_00\n But there we go.\n\n0:02:17\tSPEAKER_00\n I'm sure it's fine.\n\n0:02:19\tSPEAKER_00\n I was looking at how we're going to go about the working design and what we actually need to do and what the remote control needs to do.\n\n0:02:28\tSPEAKER_00\n And it needs to allow a person to have a portable device so they can control the television from wherever they are.\n\n0:02:37\tSPEAKER_00\n They don't need to actually manually touch the television set.\n\n0:02:40\tSPEAKER_00\n So it gives them much more flexibility and they're allowed to be where they want to be.\n\n0:02:47\tSPEAKER_00\n And from on the functional side of things we found out that from a previous meeting we decided that certain points they'll make our project unique.\n\n0:02:59\tSPEAKER_00\n One is the visibility in the dark, which we're gen of these ideas.\n\n0:03:07\tSPEAKER_00\n So we need to think about how we could bring this in technically.\n\n0:03:11\tSPEAKER_00\n We could use illuminated buttons which we're all familiar with when we're using a mobile phone or something familiar.\n\n0:03:18\tSPEAKER_00\n Or automatically lights up at first touch.\n\n0:03:22\tSPEAKER_00\n Or we could use fluorescent materials which would just take in the light during the day and then as soon as they go off they would glow in the dark.\n\n0:03:31\tSPEAKER_00\n Also we could use an alarm.\n\n0:03:34\tSPEAKER_00\n So if we lost the remote control perhaps there could be a button on the television set itself which you could press.\n\n0:03:43\tSPEAKER_00\n And then alarm from the handset would sound where it was hopefully in the room.\n\n0:03:47\tSPEAKER_00\n Maybe behind the cushion or somewhere.\n\n0:03:51\tSPEAKER_00\n That would work.\n\n0:03:54\tSPEAKER_00\n Another thing I think we missed out on on the last meeting was the fact that we should consider the environmental impact of our design.\n\n0:04:03\tSPEAKER_00\n From previous research I've carried out another project.\n\n0:04:07\tSPEAKER_00\n We've learnt about smart materials where specific alloys of metals have a shape memory.\n\n0:04:16\tSPEAKER_00\n But they can be heated and cooled and they change the shape of the metal.\n\n0:04:24\tSPEAKER_00\n So for example a screw that's holding something together could expand and it would force all the components apart.\n\n0:04:30\tSPEAKER_00\n So the benefits of this for our product would be that when it came to the end of its product life.\n\n0:04:36\tSPEAKER_00\n If it was heated everything would spring apart.\n\n0:04:40\tSPEAKER_00\n So all the individual components could be easily separated and then some could be reused, some could be recycled.\n\n0:04:47\tSPEAKER_00\n And I think that would be very important for products now especially because there's so much responsibility for all the companies who are coming up with new designs.\n\n0:04:56\tSPEAKER_00\n Because we all know that our results are being limited and you have to be very environmental conscious.\n\n0:05:02\tSPEAKER_01\n One question.\n\n0:05:04\tSPEAKER_01\n This self-destructible metal it allows for recycling materials so that someone could have this product for as long as they felt that they wanted it.\n\n0:05:16\tSPEAKER_00\n And then once they contributed then that company can break down the parts better.\n\n0:05:29\tSPEAKER_00\n So the bits that hold it all together would be made out of the shape memory alloy and that's the parts that would allow all the other parts to be separated at the end.\n\n0:05:49\tSPEAKER_00\n And then the company could then just make use of this shape memory alloys to accept the components and then either reuse some bits and other bits which are obviously going to wear out with time or not usable.\n\n0:06:05\tSPEAKER_00\n They might be like be able to put into scrap metal or something like the case if it scratched or something you wouldn't want to reuse it but you might be able to mount it down and reuse it again somewhere else.\n\n0:06:16\tSPEAKER_01\n Maybe the company that would break down these metals or would be...\n\n0:06:22\tSPEAKER_00\n We could probably employ a side company or something to do that for us but it would be our responsibility to get that done and to dispose of the products that we made for certain percentage.\n\n0:06:36\tSPEAKER_00\n Not 100% and everything we could do.\n\n0:06:39\tSPEAKER_01\n This sounds like a really great idea. One thing we have to consider is our 100% turnover goal that we have for our financial sector.\n\n0:06:49\tSPEAKER_01\n So we'll have to investigate how much that will cost us, cost the company because it sounds very labor intensive.\n\n0:06:57\tSPEAKER_01\n You would have to hire a number of people and it might be more expensive.\n\n0:07:01\tSPEAKER_00\n The fact of the shape memory alloys is that they don't need to be manually constructed. You don't have to individually unscrew or the screws because of this property, the smart material.\n\n0:07:16\tSPEAKER_00\n All you need is just the heat so they self-destruct themselves.\n\n0:07:20\tSPEAKER_00\n All right. Let's go ahead and investigate the financial implications.\n\n0:07:24\tSPEAKER_00\n I like the environmental approach. We'll have to see if that can meet our financial goals as well.\n\n0:07:36\tSPEAKER_00\n Also, there's some components as well. We'll actually work but I haven't put this plan together yet.\n\n0:07:47\tSPEAKER_00\n This would actually show the circuit diagram, although I haven't come back with a final circuit yet.\n\n0:07:56\tSPEAKER_00\n I just don't know what would put all those components in.\n\n0:07:59\tSPEAKER_01\n Those are what will construct the remote.\n\n0:08:04\tSPEAKER_00\n It just shows what sort of energy source could be a battery rechargeable probably.\n\n0:08:10\tSPEAKER_00\n How the infrared will actually be sent through the chip to see by the chip on television.\n\n0:08:18\tSPEAKER_00\n All right. Great.\n\n0:08:21\tSPEAKER_00\n Now is the F8 again?\n\n0:08:25\tSPEAKER_00\n There we go.\n\n0:08:28\tSPEAKER_01\n Thank you very much.\n\n0:08:31\tSPEAKER_01\n And the next presenter will be Tara.\n\n0:09:01\tSPEAKER_02\n May I?\n\n0:09:22\tSPEAKER_02\n That's right.\n\n0:09:24\tSPEAKER_02\n All right.\n\n0:09:28\tSPEAKER_03\n That looks right.\n\n0:09:40\tSPEAKER_02\n Okay.\n\n0:09:43\tSPEAKER_02\n I'm the user...\n\n0:09:46\tSPEAKER_02\n user interface designer. The technical functions design of the apparatus is the effects the apparatus you have. In this case, the function is remote control, which is to send messages to the television staff. By taking inspiration from other similar designs, you will try and talk about the original trend of remote control, which is the elbow international. There are two functional design options. A multi-functional remote control, which can be used for several entertainment devices.\n\n0:10:22\tSPEAKER_02\n And a single function remote control used specifically for the television. So it was a multi-functional and a single function just for television. Oh, I see. Yeah. Multi-function control can be difficult to use as the multitude of buttons can be confusing. A single function remote control is simpler to use, but it means you have to have other remote controls for your other entertainment devices. I think that a single function remote control is very preferable because it's easier to use.\n\n0:11:17\tSPEAKER_02\n It would be more compatible with the range of television staff making it more internationally scalable. It will make an original design more attainable as the less functional necessities to include in the design and it would be more profitable as it would be more simplistic and less functions would have to be included. So it would be cheaper to make. I'm probably more scalable just because it's more compatible with a wider range of devices. Does anyone have any\n\n0:11:53\tSPEAKER_03\n question? So as far as we know, a single function television remote control is\n\n0:12:03\tSPEAKER_02\n usable internationally. Well, it's just that. Well, we're creating it. We have to make it compatible with different brands and devices. And it would be easier to make it compatible with\n\n0:12:26\tSPEAKER_01\n the range of devices. Does everyone agree with this? Does anyone object and find the multi-functional\n\n0:12:33\tSPEAKER_00\n might be a better way to go? I was just wondering about what generally said before about having some hidden controls, having the outer casing. That would probably have been a more profitable simplistic design. So having that would complicate a lot more. I think I agree with the single design thing now because we're trying to do\n\n0:13:01\tSPEAKER_03\n so much that if we're trying to make a unique user friendly, then it's also multi-functional.\n\n0:13:07\tSPEAKER_02\n We're going to go over budget. With this, we'll have more women in the budget probably to make more of a much new design. We'll have more money to go on to get\n\n0:13:21\tSPEAKER_01\n that. So I'm great. All right. Well, are you ready for your presentation? Yes, I am. Badness. Except you're not hooked up to that. Absolutely right.\n\n0:13:38\tSPEAKER_02\n Great.\n\n0:13:59\tSPEAKER_03\n I'll just last my microphone. All right. This is Pablo. We can...\n\n0:14:10\tSPEAKER_03\n Okay, so I'll be discussing the functional requirements of this remote control.\n\n0:14:15\tSPEAKER_03\n I'll give you a little briefing on what that means exactly. I feel remember from the email we got before a very first kickoff meeting with the coffee machine, the functional requirements of that was to produce hot coffee quickly. So what I'll be talking about now is the equivalent for remote control. So basically what needs and desires are to be fulfilled. I've done some marketing research, a lot of interviews with remote control users and some internet research. I'll show you my findings.\n\n0:14:49\tSPEAKER_03\n Oh, and firstly I want to remind you about our company motto and purpose. So we believe in providing international market with fashionable products. Hence our motto we put the fashion electronics. So I think that should be our priority here. And we should also be looking to trends in clothing and interior design, not just an electronic fashion.\n\n0:15:07\tSPEAKER_03\n So that it's something that fits in the household. I'm sorry, what was that last thing that you just said? We should be looking towards trends in both clothing and interior design. Any trends that are going on in the public, even media, you know, who's famous, what TV shows are being watched to influence our remote control.\n\n0:15:29\tSPEAKER_03\n Okay, so the findings. 75% of users of remote controls find them ugly, which is quite a significant number. The other 25% didn't specify that they love them or found them, you know, neutral. 80% of users would spend more money when a remote control would look fancy.\n\n0:15:46\tSPEAKER_03\n Current remote controls do not match well the operating behavior of the user. I'm sorry,\n\n0:15:50\tSPEAKER_01\n the 80% of users would spend more money when a remote control would look fancy, meaning that they would spend more money on a fancy looking. Yeah, there will be a control.\n\n0:15:57\tSPEAKER_03\n They're willing to spend money on a remote control personality. I suppose to your basic, you know, oval black, all same size, but in remote control. So it is something that people care about. It's not, it's not ignored in the household. 75% of remote control users said that they zap a lot, zapping meaning they go through channels a lot. They're, you know, thumbmasters. And 50% of users say they only use 10% of the buttons, that very small amounts. That was interesting. Right, so it might be very appealing if we have very\n\n0:16:29\tSPEAKER_01\n concise buttons. And another thing with lots of surfing, we probably have to work on something that could be a lot more durable because I find with channel changes that a lot of the numbers get rubbed down if they're printed on the button. Yeah. And actually to go\n\n0:16:45\tSPEAKER_03\n with that, I'm going to give you some statistics on the relevancy of each of the buttons, how much they're used, and how important the users find them. So the power button, obviously in an hour is only used once. Hopefully the first is not turning on and off the TV.\n\n0:16:59\tSPEAKER_03\n But the relevance of that button is 9 out of 10. So people want to be able to turn on the TV with the remote control, as opposed to standing up and turning on television set.\n\n0:17:10\tSPEAKER_03\n Channel selection is used 168 times on average per hour. That's a huge amount. This is the most important button. So obviously when commercials come on, they're changing it. So as you said, we want a durable button that's not going to run down. Relevance of that button, our users found was 10 out of 10. Ditto for volume selection, it's a 10 out of 10. And it's used on average four times an hour. Not as much as channel selection, but still significant. Audio settings is used on average 0.8 times an hour. Relevance is 2. Screen settings, which means brightness, color, et cetera, 0.5 times an hour. And relevance of 1.5, we're getting to specific statistics here. Teletext. Now I'm not too clear on what that is. I don't know if you can help me flipping\n\n0:17:52\tSPEAKER_02\n pages. It has TV, information has been commissioned on holidays, the news, entertainment.\n\n0:18:03\tSPEAKER_01\n So like a running banner? No, it's a button that you press and then you like a menu pops up.\n\n0:18:09\tSPEAKER_02\n I haven't used it before, but. And you have page numbers like for the menu and you press the page numbers with your remote. Okay. Very basic. Very basic. Okay. Like tells you the weather and yeah, but you have no injection backwards. Like that. Yeah. Right.\n\n0:18:29\tSPEAKER_00\n So I'm not sure. Information that I'm like television time. But it's been used 14 times an\n\n0:18:39\tSPEAKER_03\n hour. And has a high relevance of 6.5. So it looks like something that we're going to want to do some research on and include on our remote control. Channel settings 0.01 times an hour. Relevance is 3. Channel settings. The probably just chin in the channels.\n\n0:18:56\tSPEAKER_02\n Chim in the memory. So it's not used very often, but people still find it relevant.\n\n0:19:10\tSPEAKER_03\n Okay. Biggest frustrations of the people that we interviewed. Remote controls are often lost somewhere. So that was already discussed by Poppy how we can have an alarm system so that people can find it. Takes too much time to learn how to use a new remote control.\n\n0:19:27\tSPEAKER_03\n So it should be very user friendly, you know, people know what to do very quickly. Remote controls are bad for RSI.\n\n0:19:35\tSPEAKER_03\n Is that what it is people with arthritis? That's better said. Maybe our designers can look into that. But it's that don't require very firm pushing if they respond. But we'll have to also avoid you know, but it's responding to the slightest touch as well. That's a problem.\n\n0:20:01\tSPEAKER_03\n Okay. Did you guys get that one down?\n\n0:20:04\tSPEAKER_03\n Yep. Okay. Here's some ideas for you. A large percentage of the public would pay for voice recognition on the remote controls. So I'll show you some numbers here.\n\n0:20:15\tSPEAKER_03\n So the youngest age group 15 to 25, 91.2% said that they would pay extra money to have voice recognition included on the remote control. You can see that number decreases a bit with the oldest. Interestingly enough, 25 to 35 is the lowest amount that would are willing to pay extra. So I guess we're going to figure out what age group we're targeting and if voice recognition is something we want to look into and if we have the budget for it.\n\n0:20:44\tSPEAKER_03\n If we are targeting young adults, it looks like something that would pay off.\n\n0:20:48\tSPEAKER_03\n So you can see that it's 90% over 90% would pay for it.\n\n0:20:52\tSPEAKER_01\n I agree with them. If we're targeting young adults then it would be something we should look into financially and functionally. And especially if we are trying to be trendy, go with fashions, things like that. Ages like from 35 to 65 that show lower numbers probably won't be as concerned. So that's a whole other field of research.\n\n0:21:16\tSPEAKER_03\n I don't know if you'd still have a remote or if you're talking to your television and saying change channel. Depending on how many members you have in a household.\n\n0:21:22\tSPEAKER_03\n So it may be too complicated for us but it's something to keep in mind anyway.\n\n0:21:25\tSPEAKER_01\n And something that might further complicate it is that the TV makes noise itself.\n\n0:21:29\tSPEAKER_01\n Right. I wonder if it would have.\n\n0:21:32\tSPEAKER_00\n If it was conversation in the movie at the same time. Yeah. Although.\n\n0:21:39\tSPEAKER_00\n And if it's panning for you when you're watching television.\n\n0:21:42\tSPEAKER_00\n But yeah. It would be very difficult to get the specific.\n\n0:21:48\tSPEAKER_01\n Yeah. If we're looking for some plastic design, if we need to decide if that is our intention, is the simplistic design.\n\n0:21:56\tSPEAKER_01\n Because if. If it is then I think voice voice activated.\n\n0:22:02\tSPEAKER_01\n It looks like yeah. And that would sort of negate the whole remote control thing because if people can activate the television with their voice and they might be using it.\n\n0:22:10\tSPEAKER_01\n They won't be talking into remote.\n\n0:22:13\tSPEAKER_03\n Okay. The last thing here was an LCD screen. So I mean voice recognition might be a little too extreme for us not practical. An LCD screen though might be something that you know you can shift through pages kind of the way this PowerPoint is working.\n\n0:22:28\tSPEAKER_03\n So that you don't have so many buttons to deal with.\n\n0:22:30\tSPEAKER_03\n I don't know what an LCD screen is. Oh sorry just just a screen like a computer screen.\n\n0:22:34\tSPEAKER_03\n Or like. Yeah. Like an alarm clock. You'd have an LCD versus just a.\n\n0:22:41\tSPEAKER_00\n What? No. I'm no idea.\n\n0:22:44\tSPEAKER_03\n Sorry. Oh just like an electronic screen as opposed to just buttons.\n\n0:22:47\tSPEAKER_03\n There'd be like a little. Oh I'm remote. Yeah.\n\n0:22:50\tSPEAKER_03\n Okay. Like on the top of the cell phone. The. Yeah. The LCD screen.\n\n0:22:54\tSPEAKER_03\n No it's I don't know what exactly we put on there. I guess the channel that you're on.\n\n0:22:58\tSPEAKER_02\n Yeah. Volume setting.\n\n0:23:00\tSPEAKER_02\n Could it. It would be good if it had that extra program that was on the what was next but that would probably be like linking the. Yeah.\n\n0:23:07\tSPEAKER_02\n That like it. Yeah.\n\n0:23:09\tSPEAKER_00\n You can.\n\n0:23:11\tSPEAKER_00\n Yeah. Yeah.\n\n0:23:15\tSPEAKER_02\n Yeah. Yeah.\n\n0:23:22\tSPEAKER_00\n Yeah.\n\n0:23:25\tSPEAKER_03\n Yeah.\n\n0:23:27\tSPEAKER_03\n Right. I guess that's something we can all take back to our respective research.\n\n0:23:32\tSPEAKER_03\n And finally, whoops. My personal preferences and thoughts.\n\n0:23:36\tSPEAKER_03\n I think our priority really should be unique design.\n\n0:23:39\tSPEAKER_03\n We want some people want their home. Every remote control looks the same.\n\n0:23:43\tSPEAKER_03\n In my opinion, it should be user friendly and unique.\n\n0:23:47\tSPEAKER_03\n So the other stuff might be a little too. A little too gadgety for some people.\n\n0:23:53\tSPEAKER_03\n I myself always recognition kind of scares me off.\n\n0:23:56\tSPEAKER_03\n So if we're if we're aiming to make this an international university universally accepted product.\n\n0:24:01\tSPEAKER_03\n And for all the other thing is age market. I mean, if we wanted to concentrate on 50 to 25 year olds, we could go with the fancy stuff.\n\n0:24:08\tSPEAKER_03\n 50 million and and have everyone want this remote control. We should maybe stick to the basics.\n\n0:24:14\tSPEAKER_02\n I wish you keep in mind that 15 to 25 year olds might not have 25 year olds to stand in a remote control.\n\n0:24:21\tSPEAKER_02\n Like the priority might not be a comfortable remote control. And they're just starting.\n\n0:24:27\tSPEAKER_03\n Right. I mean, to keep in mind the reliability of our research.\n\n0:24:31\tSPEAKER_03\n I mean, you know, a 16 year old boy would say you had pay extra for a boring start connection.\n\n0:24:34\tSPEAKER_03\n So they realize that's three months allowance.\n\n0:24:38\tSPEAKER_03\n So I think I think the older generations we should be catering to a bit more early 20s.\n\n0:24:45\tSPEAKER_01\n And if one of the largest or most complained about thing is that it takes so long to get to know how to use a remote control.\n\n0:24:53\tSPEAKER_01\n I'm sure that something like an LCD screen or remote control would be just furthering that problem.\n\n0:25:01\tSPEAKER_00\n Yeah.\n\n0:25:04\tSPEAKER_03\n All right. Okay. That's it for the market research.\n\n0:25:07\tSPEAKER_01\n Okay. Before we go into more discussion on, and we want this design to look like, I've received some information from the management that will affect some of our decisions.\n\n0:25:20\tSPEAKER_01\n For one thing, because having controls with DVD, VCR, that sort of thing would really complicate the design.\n\n0:25:30\tSPEAKER_01\n Of the remote control.\n\n0:25:33\tSPEAKER_01\n We've decided not to include them and make it a specific, just a specific television function, which is good as we've sort of decided that we would like to go with that anyway.\n\n0:25:45\tSPEAKER_01\n For many reasons. So we have that decision sort of made for us.\n\n0:25:50\tSPEAKER_01\n Another thing that might affect other decisions is that the management feels that teletext is outdated.\n\n0:25:59\tSPEAKER_01\n Because more people are using the internet now.\n\n0:26:02\tSPEAKER_01\n And so we won't concern ourselves with navigating the teletext option.\n\n0:26:07\tSPEAKER_00\n Can I just insert?\n\n0:26:09\tSPEAKER_00\n Yep.\n\n0:26:11\tSPEAKER_00\n Maybe we can add on the powerpoint.\n\n0:26:14\tSPEAKER_01\n Yeah, I do. I'm looking at it right now.\n\n0:26:18\tSPEAKER_01\n There you go. Thank you.\n\n0:26:22\tSPEAKER_03\n We'll come back soon.\n\n0:26:34\tSPEAKER_00\n We're, we're some management suggesting use of the internet rather than teletext or just avoiding both altogether.\n\n0:26:42\tSPEAKER_01\n Well, I mean, we don't have the resources or possibility of using the internet with the remote control, but they were just pretty much saying that the teletext would not be used.\n\n0:26:56\tSPEAKER_01\n And another thing this is for the design, the design of the product is that we want to create, we're in a sense that people know that this is from our company.\n\n0:27:10\tSPEAKER_01\n So all the remote controls must have our, we'll incorporate our logo and color in some way.\n\n0:27:17\tSPEAKER_01\n Yeah. So perhaps our logo on the bottom or wherever you feel like it would look good.\n\n0:27:24\tSPEAKER_01\n It doesn't have to be the color of our, of our company, but another thing is that we need, we probably would have to have that color and logo decided upon.\n\n0:27:40\tSPEAKER_01\n I'm assuming that we already have one, but for the purposes of this meeting, I wasn't offered a, a type of logo or color, so that could be somewhere on the design so it can be recognizable.\n\n0:27:53\tSPEAKER_03\n It's part of our, our yellow.\n\n0:27:57\tSPEAKER_01\n Yeah.\n\n0:27:58\tSPEAKER_01\n The little RR yellow thing, okay.\n\n0:28:00\tSPEAKER_01\n Real reaction.\n\n0:28:03\tSPEAKER_01\n Okay.\n\n0:28:05\tSPEAKER_01\n Yes, those are the changes.\n\n0:28:08\tSPEAKER_01\n So now we need to discuss and come to a decision on our remote control functions of, of how this is going to be.\n\n0:28:19\tSPEAKER_01\n I'm just going to look at my notes for a second.\n\n0:28:22\tSPEAKER_01\n We have to decide on a target group and the functions of the remote control.\n\n0:28:26\tSPEAKER_01\n So we already know that it'll just be for the television.\n\n0:28:29\tSPEAKER_01\n It'll, it won't have teletext, but, you know, we can discuss those other options that you brought up, Genevieve.\n\n0:28:37\tNone\n Okay.\n\n0:28:38\tSPEAKER_03\n So are we going to write off the LCD option?\n\n0:28:42\tSPEAKER_01\n Is that how most people feel about that?\n\n0:28:45\tSPEAKER_01\n Yeah.\n\n0:28:46\tSPEAKER_03\n Okay.\n\n0:28:47\tSPEAKER_03\n So no LCD, no teletext and no voice recognition.\n\n0:28:51\tSPEAKER_02\n I think it would be annoying.\n\n0:28:53\tSPEAKER_02\n I don't use touch that much, but if it was on your TV, you'd want to be able to use it.\n\n0:29:00\tSPEAKER_01\n Yeah, but another thing is that if we're reaching an international crowd, I know for one that in North America, there is no such thing as teletext, so it'd be really superfluous.\n\n0:29:10\tSPEAKER_01\n Yeah.\n\n0:29:11\tSPEAKER_01\n I don't know about other countries besides the UK.\n\n0:29:13\tSPEAKER_01\n Do you know if anywhere else?\n\n0:29:14\tSPEAKER_00\n I do.\n\n0:29:15\tSPEAKER_00\n How's it?\n\n0:29:16\tSPEAKER_00\n It's more recent, I think.\n\n0:29:18\tSPEAKER_00\n All right.\n\n0:29:19\tSPEAKER_00\n It was a management decision that we had.\n\n0:29:22\tSPEAKER_01\n It was a management decision, so it's, it's pretty much out of our hands at this point.\n\n0:29:25\tSPEAKER_01\n Okay.\n\n0:29:26\tSPEAKER_01\n Okay.\n\n0:29:27\tSPEAKER_01\n So I guess we're looking at something rather simple.\n\n0:29:32\tSPEAKER_03\n I guess just for my findings, it looks like we want to minimize buttons.\n\n0:29:39\tSPEAKER_03\n Okay.\n\n0:29:40\tSPEAKER_03\n And what was the word they used?\n\n0:29:44\tSPEAKER_03\n Findability is important.\n\n0:29:47\tNone\n Yeah.\n\n0:29:48\tSPEAKER_01\n I think we should definitely go ahead with the alarm system idea that you had.\n\n0:29:52\tSPEAKER_00\n Yeah.\n\n0:29:53\tSPEAKER_01\n Because I'm sure that could be inexpensive because we could use the same kind of infrared.\n\n0:29:56\tSPEAKER_01\n Yeah.\n\n0:29:57\tSPEAKER_00\n The same signal.\n\n0:29:58\tSPEAKER_01\n The same signal through that Nika just like make a little beeping noise.\n\n0:30:02\tSPEAKER_01\n It's not that expensive to do.\n\n0:30:04\tSPEAKER_00\n Right.\n\n0:30:05\tSPEAKER_00\n Just the same as the mobile phone.\n\n0:30:06\tSPEAKER_00\n Yeah.\n\n0:30:07\tSPEAKER_00\n Yeah.\n\n0:30:08\tSPEAKER_01\n Okay.\n\n0:30:09\tSPEAKER_01\n I like that idea.\n\n0:30:10\tSPEAKER_02\n Would you be able to put the little device anywhere?\n\n0:30:14\tSPEAKER_02\n Because as another look control for all TV, so if you put the link between the.\n\n0:30:24\tSPEAKER_00\n Yeah.\n\n0:30:25\tSPEAKER_00\n Yeah.\n\n0:30:28\tSPEAKER_00\n The button is actually on.\n\n0:30:31\tSPEAKER_02\n My hotel detail there.\n\n0:30:33\tSPEAKER_02\n Like I've always wanted to use that to need to be something.\n\n0:30:36\tSPEAKER_00\n Maybe.\n\n0:30:37\tSPEAKER_00\n Yeah.\n\n0:30:38\tSPEAKER_00\n Yeah.\n\n0:30:39\tSPEAKER_00\n Maybe some of the adhesives that you could stick onto the back of any set that would be.\n\n0:30:43\tSPEAKER_00\n Yeah.\n\n0:30:44\tSPEAKER_00\n Not very obtrusive.\n\n0:30:45\tSPEAKER_00\n Obviously something small.\n\n0:30:46\tSPEAKER_00\n Yeah.\n\n0:30:47\tSPEAKER_01\n Yeah.\n\n0:30:48\tSPEAKER_01\n Yeah.\n\n0:30:49\tSPEAKER_01\n Then it wouldn't.\n\n0:30:50\tSPEAKER_01\n It probably wouldn't be able to use.\n\n0:30:51\tSPEAKER_01\n It would be able to use the same reception on the remote control, I guess, but the actual device would have to have it.\n\n0:30:54\tSPEAKER_01\n Yeah.\n\n0:30:55\tSPEAKER_01\n Inferred signal.\n\n0:30:56\tSPEAKER_01\n Yeah.\n\n0:30:57\tSPEAKER_02\n Okay.\n\n0:30:58\tSPEAKER_02\n Maybe.\n\n0:30:59\tSPEAKER_02\n Probably.\n\n0:31:00\tSPEAKER_01\n I mean, That's your department you'll have.\n\n0:31:03\tSPEAKER_01\n Sort that out.\n\n0:31:04\tSPEAKER_00\n Okay.\n\n0:31:05\tSPEAKER_00\n Unless some way it could have some universal connection to like the socket, the same socket that the TV's supplied from.\n\n0:31:18\tSPEAKER_00\n I mean, the power for the TV.\n\n0:31:20\tSPEAKER_00\n Yeah.\n\n0:31:21\tSPEAKER_00\n I'm just, yeah, just to test that one.\n\n0:31:25\tSPEAKER_01\n Yeah.\n\n0:31:26\tSPEAKER_01\n Dispray search on that, all right?\n\n0:31:27\tSPEAKER_01\n Great.\n\n0:31:28\tSPEAKER_01\n All right.\n\n0:31:29\tSPEAKER_01\n And I'm sure that, um, the glow in the dark fluorescent, whatever system is to go ahead.\n\n0:31:39\tSPEAKER_01\n Is everyone interested in that?\n\n0:31:40\tSPEAKER_02\n I like the light up suggestion.\n\n0:31:42\tSPEAKER_02\n Yeah.\n\n0:31:43\tSPEAKER_02\n You're a great person.\n\n0:31:44\tSPEAKER_00\n Yeah.\n\n0:31:45\tSPEAKER_02\n Yeah.\n\n0:31:51\tSPEAKER_03\n Yeah.\n\n0:31:52\tSPEAKER_03\n It doesn't, it could be a tactile thing as well.\n\n0:31:54\tSPEAKER_03\n Um, right.\n\n0:31:55\tSPEAKER_03\n If we're minimizing buttons, we might be able to make them actually larger and there's something on it.\n\n0:31:59\tSPEAKER_03\n You know, like a raise up arrow down arrow for volume.\n\n0:32:03\tSPEAKER_03\n Um, and I don't know what we could do for channels.\n\n0:32:07\tSPEAKER_02\n Which is the numbers could be embossed?\n\n0:32:09\tSPEAKER_02\n Could be raised.\n\n0:32:10\tSPEAKER_02\n The numbers themselves.\n\n0:32:11\tSPEAKER_03\n Yeah, I could be raised.\n\n0:32:15\tSPEAKER_03\n The numbers themselves.\n\n0:32:16\tSPEAKER_03\n Yeah, I could be raised.\n\n0:32:17\tSPEAKER_03\n The number down button for the channel.\n\n0:32:18\tSPEAKER_03\n Channel changing.\n\n0:32:19\tSPEAKER_03\n Just for the light.\n\n0:32:20\tSPEAKER_03\n Yeah.\n\n0:32:21\tSPEAKER_03\n I think, hmm.\n\n0:32:22\tSPEAKER_03\n It just, it might be sucking more battery power if it is a light up, I'm not sure.\n\n0:32:26\tSPEAKER_02\n Yeah.\n\n0:32:27\tSPEAKER_00\n That's true.\n\n0:32:28\tSPEAKER_00\n And I mean, so, uh, how do you imagine before, um, like how it should be accessible to everybody?\n\n0:32:33\tSPEAKER_00\n Yeah.\n\n0:32:34\tSPEAKER_00\n And so, like, big, um, buttons made before people who are visually impaired, glow in the dark, uh, point, make any difference anyway.\n\n0:32:42\tSPEAKER_00\n So, like, you said, tactile might be better because it'd be more available to everybody.\n\n0:32:47\tSPEAKER_01\n Could we somehow, we could make possibly, sorry, incorporate them both so that, yeah.\n\n0:32:54\tSPEAKER_01\n The buttons could maybe be in the shape of the numbers themselves and be made out of some sort of glow in the dark material.\n\n0:33:01\tSPEAKER_01\n Yeah.\n\n0:33:02\tSPEAKER_01\n So, I don't think that glow in the dark material, um, like the actual soft plastic, um, is that much more than other colors?\n\n0:33:11\tSPEAKER_00\n Not these days and it's quite, yeah.\n\n0:33:13\tSPEAKER_03\n I guess the other option, referring to the battery thing, is, you know, how cell phones will light up for 15 seconds, just like that.\n\n0:33:19\tSPEAKER_03\n Yeah.\n\n0:33:20\tSPEAKER_01\n Yeah.\n\n0:33:21\tSPEAKER_03\n And then it goes, so, if you're like changing the volume during a movie, I'm thinking of most of you watching a movie, turn all the lights off, right?\n\n0:33:25\tSPEAKER_03\n Yeah.\n\n0:33:26\tSPEAKER_03\n You don't turn on the lights, so, to turn it down because it's suddenly an explosion, it's gonna wake up the baby.\n\n0:33:30\tSPEAKER_03\n So, if you touch the button, it kind of reactivates that it lights up.\n\n0:33:34\tSPEAKER_03\n Yeah.\n\n0:33:35\tSPEAKER_03\n Yeah.\n\n0:33:36\tSPEAKER_00\n So, it's a self-timed lighting.\n\n0:33:38\tSPEAKER_00\n All right.\n\n0:33:39\tSPEAKER_01\n We have five minutes left, um, for the meeting, but I think we should discuss this light subject a little bit more before we close.\n\n0:33:48\tSPEAKER_01\n Um, what was, I missed the last moment reading that.\n\n0:33:51\tSPEAKER_01\n What were you talking about with the lighting up?\n\n0:33:53\tSPEAKER_03\n Oh, just if it was kind of the same way that a cell phone will light up for about 10, 15 seconds when you touch a button, after I have not touched it for a while.\n\n0:34:00\tSPEAKER_03\n Yeah.\n\n0:34:01\tSPEAKER_03\n So, instead of a constant light up on the, on the remote control, if it lights up for 10 seconds when it's touched again.\n\n0:34:07\tSPEAKER_01\n So, it could be any button that would be pressed.\n\n0:34:09\tSPEAKER_01\n Yeah.\n\n0:34:10\tSPEAKER_03\n Yeah, you just, and it just kind of lights up a bit and it gives a thing glow.\n\n0:34:12\tSPEAKER_03\n That's right.\n\n0:34:13\tSPEAKER_03\n So, if you have all the lights off in your living room, you'll, you'll, you'll temporarily see it because usually not filling around with it for more than what 10 seconds.\n\n0:34:19\tSPEAKER_01\n Yeah.\n\n0:34:20\tSPEAKER_01\n Okay, so, that's probably feasible.\n\n0:34:22\tSPEAKER_01\n So, do you think that we should do the lighting up thing and the glow and the dark thing and the shape of the numbers?\n\n0:34:26\tSPEAKER_01\n You have to kind of decide what we're gonna do with this.\n\n0:34:28\tSPEAKER_00\n I think the shape of the numbers is a really good idea.\n\n0:34:30\tSPEAKER_00\n Yeah.\n\n0:34:31\tNone\n Yeah.\n\n0:34:31\tSPEAKER_00\n Okay.\n\n0:34:32\tSPEAKER_00\n And I think that's unique as well.\n\n0:34:33\tSPEAKER_00\n Yeah.\n\n0:34:34\tSPEAKER_00\n I mean, I haven't seen that.\n\n0:34:36\tSPEAKER_00\n And as you're saying, like, numbers can wear off if they just sort of, yeah.\n\n0:34:39\tSPEAKER_01\n And it could be, if it's that softer rubber material, it'll be better for people with, or else, no, what's it called?\n\n0:34:48\tSPEAKER_01\n RSI?\n\n0:34:49\tSPEAKER_01\n What was it called?\n\n0:34:50\tSPEAKER_00\n Oh, yeah.\n\n0:34:51\tSPEAKER_00\n Yeah.\n\n0:34:52\tSPEAKER_01\n Yeah.\n\n0:34:53\tSPEAKER_01\n Yeah.\n\n0:34:54\tSPEAKER_01\n Yeah.\n\n0:34:55\tSPEAKER_01\n Yeah.\n\n0:34:56\tSPEAKER_01\n Yeah.\n\n0:34:57\tSPEAKER_01\n Yeah.\n\n0:34:58\tSPEAKER_01\n Yeah.\n\n0:35:00\tSPEAKER_01\n And it's like, look, what did we want to go for the lighting up instantly?\n\n0:35:02\tSPEAKER_01\n Like, should we do both?\n\n0:35:03\tSPEAKER_01\n Or we can have one of the other?\n\n0:35:04\tSPEAKER_01\n Because it might, for design purposes, I mean, the lighting up thing might be better because glow and the dark material has a funny kind of color.\n\n0:35:13\tSPEAKER_01\n And it might not go with different, like, face plates that we might come up with?\n\n0:35:17\tSPEAKER_01\n Exactly.\n\n0:35:18\tSPEAKER_03\n It might be perceived as tacky, glow and the dark.\n\n0:35:20\tSPEAKER_03\n It's kind of like 80s neon style.\n\n0:35:22\tSPEAKER_03\n Yeah.\n\n0:35:23\tSPEAKER_00\n And we could, yeah, they're not like, like, he'd range of different colors that he could light up in as well.\n\n0:35:27\tSPEAKER_00\n Which could, like, link in with their company colors, like blue or green or yellow or...\n\n0:35:32\tSPEAKER_00\n Right.\n\n0:35:33\tSPEAKER_00\n And like, we're just limited to the widthy, just, oh, yeah.\n\n0:35:36\tSPEAKER_01\n Alright, so we've just started lighting up.\n\n0:35:39\tSPEAKER_02\n I was thinking, what was going on the dark to put the real reactions on the dark and then it would be constantly advertised?\n\n0:35:48\tSPEAKER_02\n Yeah.\n\n0:35:49\tSPEAKER_00\n Every time the lit up could light up as well.\n\n0:35:53\tSPEAKER_00\n Yeah, over.\n\n0:35:54\tSPEAKER_01\n But with the same thing, I mean, if you touch the button, then it could be lit up as well.\n\n0:36:01\tSPEAKER_01\n Are you okay with that?\n\n0:36:03\tSPEAKER_01\n Yeah.\n\n0:36:04\tSPEAKER_01\n Okay.\n\n0:36:05\tSPEAKER_01\n Alright, so I think that completes most of our more practical decisions and now it's up to designing.\n\n0:36:17\tSPEAKER_01\n And making sure this can be feasible.\n\n0:36:20\tSPEAKER_01\n And, do you have any things to say?\n\n0:36:23\tSPEAKER_03\n Yeah, well, I was just going to throw out there the thought about personalizing the remote control.\n\n0:36:30\tSPEAKER_03\n Because you mentioned face plates.\n\n0:36:32\tSPEAKER_03\n So I don't know if there's something that, you know, like five different face plates.\n\n0:36:36\tSPEAKER_03\n I don't know if this will start making it more complicated, but it could increase the popularity of the remote.\n\n0:36:40\tSPEAKER_00\n Okay, like you can have changeable mobile cameras.\n\n0:36:44\tSPEAKER_01\n Yeah, you can have an iPod or something.\n\n0:36:46\tSPEAKER_01\n Yeah, exactly.\n\n0:36:47\tSPEAKER_01\n Exactly.\n\n0:36:48\tSPEAKER_01\n Like, mobile phones.\n\n0:36:49\tSPEAKER_03\n And I don't know if you'd want to go with, you know, TV show themes or something, like a Bart Simpson face plate.\n\n0:36:53\tSPEAKER_02\n Yeah.\n\n0:36:54\tSPEAKER_02\n And then that would be more profitable, like a sideline to the remote.\n\n0:36:58\tSPEAKER_02\n Yeah.\n\n0:36:59\tSPEAKER_02\n Yeah.\n\n0:37:00\tSPEAKER_03\n Exactly.\n\n0:37:01\tSPEAKER_03\n You could start out with three and if we hit it big, then we can add someone.\n\n0:37:04\tSPEAKER_01\n Yeah, that's great.\n\n0:37:05\tSPEAKER_01\n Yeah, I think that we should incorporate that into changing.\n\n0:37:08\tSPEAKER_01\n And because that wouldn't be very expensive at all.\n\n0:37:11\tSPEAKER_00\n You just get one mold.\n\n0:37:12\tSPEAKER_01\n Yeah.\n\n0:37:13\tSPEAKER_00\n Throw some plastic in it, you know.\n\n0:37:16\tSPEAKER_00\n And also possible, I mean, we could gain ourselves by advertising certain TV shows.\n\n0:37:24\tSPEAKER_01\n Yeah, that might be problematic with copyright issues.\n\n0:37:27\tSPEAKER_01\n Yeah.\n\n0:37:28\tSPEAKER_00\n So if it takes off then we'll try that out.\n\n0:37:32\tSPEAKER_00\n And the environmental fact we didn't bring that up again.\n\n0:37:36\tSPEAKER_01\n Right.\n\n0:37:37\tSPEAKER_01\n We'll have to do more research.\n\n0:37:38\tSPEAKER_01\n Like, as of yet, there hasn't nothing to do with the way to look.\n\n0:37:42\tSPEAKER_01\n Yeah.\n\n0:37:43\tSPEAKER_01\n So, um, does it need to be reached to the, do we need to reach a decision on that right now?\n\n0:37:47\tSPEAKER_01\n Um, because we need to investigate the financial implications.\n\n0:37:50\tSPEAKER_01\n Okay.\n\n0:37:51\tSPEAKER_01\n Okay.\n\n0:37:52\tSPEAKER_01\n Is it, does it need to be a decided on now?\n\n0:37:55\tSPEAKER_00\n I think we can probably leave that to later on.\n\n0:37:58\tSPEAKER_00\n Okay.\n\n0:37:59\tSPEAKER_01\n Good.\n\n0:38:00\tSPEAKER_01\n All right, then.\n\n0:38:01\tSPEAKER_01\n Anyone else have anything more to say before we close?\n\n0:38:04\tSPEAKER_01\n No.\n\n0:38:05\tSPEAKER_01\n All right.\n\n0:38:06\tSPEAKER_01\n Well, let's have lunch and we'll discuss this later.\n\n0:38:09\tSPEAKER_01\n Okay.\n\n0:38:10\tSPEAKER_00\n All right.\n\n0:38:11\tNone\n Okay.\n\n", "summary": [{"summary_text": "SPEAKER and Poppy are going to watch Poppy's presentation on PowerPoint. Speaker will be taking minutes on the presentation. He will cook Poppy up there with that presentation.  He will see all of them later.   He is going back to the second meeting. "}]}