{"filename": "./data/ES2007c.txt", "transcript": "0:00:00\tSPEAKER_05\n I feel like Madonna with one of these on.\n\n0:00:16\tSPEAKER_04\n I feel like Madonna with one of these on.\n\n0:00:18\tSPEAKER_05\n That's cool, we're dancing, they're saying it's like...\n\n0:00:22\tSPEAKER_05\n I've always wanted one of these, I really have.\n\n0:00:26\tSPEAKER_05\n Which is beautiful.\n\n0:00:36\tNone\n That's cool.\n\n0:00:46\tNone\n I feel like Madonna with one of these on.\n\n0:00:56\tNone\n I feel like Madonna with one of these on.\n\n0:01:06\tNone\n That's cool.\n\n0:01:16\tSPEAKER_03\n Hello everybody.\n\n0:01:18\tSPEAKER_03\n Back again for another wonderful meeting.\n\n0:01:24\tSPEAKER_03\n Everyone ready?\n\n0:01:28\tSPEAKER_03\n Yeah.\n\n0:01:30\tSPEAKER_03\n Okay, we can hold on for a minute.\n\n0:01:50\tSPEAKER_02\n Oh my gosh.\n\n0:01:52\tSPEAKER_05\n Oh, wonderful.\n\n0:02:00\tSPEAKER_04\n I figured with the spam thing if you can't enjoy it.\n\n0:02:06\tSPEAKER_01\n That's the kind of spam that everybody likes to see.\n\n0:02:14\tSPEAKER_03\n Are you ready?\n\n0:02:24\tSPEAKER_03\n Okay, right, I'll take it that you are already now.\n\n0:02:42\tSPEAKER_03\n First off, we'll just recap from our last meeting.\n\n0:02:52\tSPEAKER_04\n Which was we got together just to basically decide on well to talk about what it is.\n\n0:03:00\tSPEAKER_04\n We were actually supposed to be doing and who we all are and stuff like that.\n\n0:03:08\tSPEAKER_04\n We've got a bit more of an idea together of what's going on.\n\n0:03:12\tSPEAKER_04\n What we're going to talk about in this meeting is now that we know what it is that we're doing.\n\n0:03:20\tSPEAKER_04\n Now we know that it's a TV remote and stuff.\n\n0:03:24\tSPEAKER_04\n You guys have just been off doing some R&D for that.\n\n0:03:30\tSPEAKER_04\n Research and development.\n\n0:03:32\tSPEAKER_04\n I haven't heard that before.\n\n0:03:34\tSPEAKER_04\n Learning all sorts of new tech, terms and technology today.\n\n0:03:40\tSPEAKER_04\n Yeah, you're three little presentations.\n\n0:03:44\tSPEAKER_04\n Whether they be on computer or on the white board or whatever you want.\n\n0:03:50\tSPEAKER_01\n You have any preference order?\n\n0:03:56\tSPEAKER_04\n I'd like to hear who's on the Catherine actually first.\n\n0:04:10\tSPEAKER_04\n What I'd like to hear about is if we finally decided on what sort of end you were going to be using.\n\n0:04:18\tSPEAKER_04\n I think she's still finishing her.\n\n0:04:22\tSPEAKER_06\n Let's hear from you first.\n\n0:04:28\tSPEAKER_06\n Where is that thing?\n\n0:04:30\tSPEAKER_06\n It's here.\n\n0:04:34\tSPEAKER_06\n Oh, sorry.\n\n0:04:38\tSPEAKER_06\n Look at that work off.\n\n0:04:40\tSPEAKER_04\n Okay, yourself in position.\n\n0:04:44\tSPEAKER_06\n Okay, so that's me again.\n\n0:04:48\tSPEAKER_06\n So for the energy sources, we can have a basic battery.\n\n0:04:56\tSPEAKER_06\n Hand in a mode which is which was used in the 50s for torches if you remember that kind of.\n\n0:05:02\tSPEAKER_06\n I don't think any of us remember the 50s.\n\n0:05:06\tSPEAKER_06\n Yeah, it wouldn't be very fancy.\n\n0:05:08\tSPEAKER_06\n You can have a kinetic provision of energy which is used on some watches these days.\n\n0:05:12\tSPEAKER_06\n So if you have just a bit of gentle movement that it will give it the energy to work or you can use solar cells.\n\n0:05:20\tSPEAKER_06\n But I'm not sure about that indoors really.\n\n0:05:22\tSPEAKER_01\n Well, there's sometimes combinations.\n\n0:05:24\tSPEAKER_01\n I mean, like calculators to combinations.\n\n0:05:28\tSPEAKER_01\n But also using some solar panels.\n\n0:05:30\tSPEAKER_04\n Do you know the solar panel things do they have to work from the Sun or can they work from a light bulb?\n\n0:05:37\tSPEAKER_03\n I don't think so.\n\n0:05:38\tSPEAKER_03\n Does anybody know?\n\n0:05:39\tSPEAKER_01\n I think it has to be only solar energy.\n\n0:05:42\tSPEAKER_01\n I don't know.\n\n0:05:44\tSPEAKER_06\n I don't know.\n\n0:05:48\tSPEAKER_06\n I think the cost of less would be the basic battery really.\n\n0:05:54\tSPEAKER_06\n And if you want something fancy, I think the kinetic provision of energy could be nice.\n\n0:06:01\tSPEAKER_06\n But I don't know if it's worth the cost.\n\n0:06:05\tSPEAKER_06\n So we've got to discuss that.\n\n0:06:07\tSPEAKER_00\n Okay.\n\n0:06:09\tSPEAKER_00\n Do I look good?\n\n0:06:11\tSPEAKER_06\n For the case of the remote itself, there can be a general case which is just a flat one.\n\n0:06:18\tSPEAKER_06\n You can have a curved one or a double curved one.\n\n0:06:22\tSPEAKER_06\n If you know what I mean.\n\n0:06:24\tSPEAKER_00\n What's a double curved one?\n\n0:06:26\tSPEAKER_06\n You know, kind of more ergonomic that kind of sits the palm of your hands.\n\n0:06:33\tSPEAKER_00\n Okay.\n\n0:06:36\tSPEAKER_06\n Then the case material itself, so it can be either plastic or latex rubber wood or titanium.\n\n0:06:52\tSPEAKER_06\n And for each of them, you have cases where, for example, titanium, you can't use it for if we're choosing a double curved case.\n\n0:07:02\tSPEAKER_06\n We can't choose titanium.\n\n0:07:06\tSPEAKER_06\n And if we're choosing solar cells, then we can't choose latex for the case material.\n\n0:07:10\tSPEAKER_06\n So we just have to take that into account.\n\n0:07:13\tSPEAKER_06\n But if we're choosing just the flat case, then we can go for anything.\n\n0:07:17\tSPEAKER_06\n And I think we discussed earlier on the RSI problem thing.\n\n0:07:23\tSPEAKER_06\n So we could do that.\n\n0:07:25\tSPEAKER_03\n Well, that might be an idea of using the rubber.\n\n0:07:27\tSPEAKER_01\n But then it's a, you know, it's kind of squeezable, isn't it?\n\n0:07:30\tSPEAKER_06\n Yeah. And also it doesn't break, because easily maybe I can.\n\n0:07:34\tSPEAKER_04\n When a TV program's got, when you're watching the match and then you have teams just lost you, you can fuzz it across the road when it will bounce off the wall back at you.\n\n0:07:43\tSPEAKER_03\n Yeah, I like that idea.\n\n0:07:47\tSPEAKER_06\n So rubber, you think?\n\n0:07:50\tSPEAKER_05\n I think rubber.\n\n0:07:52\tSPEAKER_04\n Rubber, we're all going, we're all liking that idea.\n\n0:07:55\tSPEAKER_04\n You think you can mark it, net?\n\n0:07:57\tSPEAKER_05\n After my fashion thing, I think your real life is rubber is more.\n\n0:08:02\tSPEAKER_03\n Ooh, we like rubber.\n\n0:08:04\tSPEAKER_06\n Okay.\n\n0:08:07\tSPEAKER_06\n And then there are the push buttons.\n\n0:08:09\tSPEAKER_06\n So you can have basic push buttons or a school wheels, like you have on a mouse.\n\n0:08:15\tSPEAKER_06\n Or you can have LCD, if you're displayed.\n\n0:08:22\tSPEAKER_06\n And school buttons as well.\n\n0:08:27\tSPEAKER_06\n So if you use a rubber double curved case, you must use rubber push buttons.\n\n0:08:34\tSPEAKER_06\n So if we're going for rubber, then we have to decide for the case.\n\n0:08:39\tSPEAKER_06\n And if we choose double curved, then we have to go for rubber push buttons.\n\n0:08:43\tSPEAKER_04\n Well, we're going to go where we're, I think we've decided that it's going to be a rubber case.\n\n0:08:46\tSPEAKER_06\n Yeah, but is it a double curved one or not?\n\n0:08:49\tSPEAKER_06\n It's not a double curved one, we've got the choice for the push buttons.\n\n0:08:52\tSPEAKER_06\n If it's a double curved, we've got to go for rubber push buttons.\n\n0:08:56\tSPEAKER_06\n And that makes sense.\n\n0:08:58\tSPEAKER_04\n Well, push buttons instead of the wheel.\n\n0:09:01\tSPEAKER_01\n Yeah.\n\n0:09:02\tSPEAKER_01\n If it's rubber, isn't it malleable?\n\n0:09:03\tSPEAKER_01\n Anyways, I mean, it doesn't matter if it's a double, I mean, isn't a rubber case, I mean, it's completely, I mean, it flexes to whatever they want.\n\n0:09:12\tSPEAKER_01\n So what's the difference between a normal rubber case and a rubber double, rubber double, double double.\n\n0:09:17\tSPEAKER_03\n And you see you've got, okay, the energy, that's one thing.\n\n0:09:20\tSPEAKER_03\n I love a big Mac, please.\n\n0:09:21\tSPEAKER_06\n Then you have the case is whether it's flat or curved.\n\n0:09:27\tSPEAKER_06\n And that's, we don't care if it's rubber or not, but then we've decided that we're going for rubber for the case material.\n\n0:09:35\tSPEAKER_06\n So if we've chosen rubber, and if now we have the choice for the case, whether it's flat, single curved or double curved.\n\n0:09:45\tSPEAKER_06\n And I'm just saying, if we choose it to be double curved, then we need to go, I don't know why, but we need to go for rubber push buttons.\n\n0:09:54\tSPEAKER_06\n So either, I don't know, we just need to decide on the case.\n\n0:10:00\tSPEAKER_04\n Let's have rubber push buttons, I go rubber.\n\n0:10:03\tSPEAKER_06\n Let's go crazy.\n\n0:10:06\tSPEAKER_06\n And then do I have a last slide?\n\n0:10:08\tSPEAKER_06\n Yes, I do.\n\n0:10:10\tSPEAKER_06\n And so the push buttons themselves, they can be just simple, they can be, so that's just the electronics between the, behind the push buttons.\n\n0:10:17\tSPEAKER_06\n Yeah.\n\n0:10:19\tSPEAKER_06\n And the price that goes with it, so the simple push buttons are going to be the cheapest.\n\n0:10:26\tSPEAKER_06\n If we get a scroll wheel that's a higher press range, if we get an advanced chip, which is used for the LCD, the display thing, that's even more expensive.\n\n0:10:41\tSPEAKER_00\n Simple print.\n\n0:10:47\tSPEAKER_00\n Chip on print.\n\n0:10:49\tSPEAKER_00\n Chip on print is the infrared sensor.\n\n0:10:56\tSPEAKER_04\n Okay, what I'm not understanding here is, okay, advanced chip on print, which I presume is like one PCB.\n\n0:11:14\tSPEAKER_04\n And that's got all the electronics on one board, including the infrared sensor.\n\n0:11:21\tSPEAKER_04\n Right, what alternatives do we have to that?\n\n0:11:30\tSPEAKER_04\n What alternatives do we have to the chip on print?\n\n0:11:33\tSPEAKER_06\n Well, if it's not chip on print then, I guess you get different chip components and you build them separately and doesn't include the infrared, it's less expensive.\n\n0:11:45\tSPEAKER_06\n Technically speaking, it's not as advanced, but it does the job too.\n\n0:11:50\tSPEAKER_04\n So why would we not go for that?\n\n0:11:53\tSPEAKER_04\n If it's something that's inside the unit, it doesn't affect whether the customer is going to buy it or not.\n\n0:12:03\tSPEAKER_04\n So let's not go for it.\n\n0:12:05\tSPEAKER_04\n Oh, it's along as it works.\n\n0:12:08\tSPEAKER_04\n Yeah, yeah, I agree.\n\n0:12:10\tSPEAKER_04\n So let's not bother with the chip on print.\n\n0:12:13\tSPEAKER_06\n So it's either the scroll wheel or the push buttons.\n\n0:12:19\tSPEAKER_00\n Yeah, yeah, push buttons.\n\n0:12:24\tSPEAKER_05\n What about the sample sensor?\n\n0:12:27\tSPEAKER_03\n What about what?\n\n0:12:29\tSPEAKER_05\n The sample sensor.\n\n0:12:31\tSPEAKER_04\n Well, what do we need to speak before in the remote control unit?\n\n0:12:36\tSPEAKER_05\n I don't know.\n\n0:12:37\tSPEAKER_05\n It'd be cool.\n\n0:12:39\tSPEAKER_06\n It'd be cool, but they're saying they've just developed it.\n\n0:12:42\tSPEAKER_06\n I'm just guessing, but it's going to be the most expensive option probably.\n\n0:12:46\tSPEAKER_01\n The speech recognition option, it doesn't seem really very promising for us.\n\n0:12:53\tSPEAKER_04\n Yeah, it's not something that we want to go into with the products.\n\n0:12:56\tSPEAKER_01\n Yeah, the example that they're already using it for is with the coffee machine, where basically you can program a sample that when you say something, you could response and you could program the response as well.\n\n0:13:08\tSPEAKER_01\n It's just clips that you record yourself.\n\n0:13:11\tSPEAKER_01\n So you can program your coffee maker that when you say good morning to it, it's like, hello Rick or whatever.\n\n0:13:17\tSPEAKER_01\n It would be one thing if it was speech recognition where you say something and it turns the TV on, like, turn the TV on and it comes on, but it's not that.\n\n0:13:25\tSPEAKER_01\n It just gives you an answer.\n\n0:13:27\tSPEAKER_01\n And it gives you a verbal response.\n\n0:13:29\tSPEAKER_01\n Oh, then.\n\n0:13:30\tSPEAKER_01\n What's the point of saying hello remote?\n\n0:13:33\tSPEAKER_05\n I thought it was one they say really lonely.\n\n0:13:36\tSPEAKER_05\n Yeah, really lonely.\n\n0:13:37\tSPEAKER_05\n I thought when they said voice recognition, they meant like channel five.\n\n0:13:41\tSPEAKER_05\n Channel five.\n\n0:13:42\tSPEAKER_05\n No, that would be prompting.\n\n0:13:45\tSPEAKER_01\n It's just a remote that talks to you.\n\n0:13:47\tSPEAKER_01\n Oh, there, forget about it.\n\n0:13:49\tSPEAKER_01\n Okay.\n\n0:13:50\tSPEAKER_01\n I need to certain cues.\n\n0:13:51\tSPEAKER_06\n Yeah.\n\n0:13:52\tSPEAKER_06\n Okay, so I'll go back maybe to the previous slide and we can decide for each problem what we should choose.\n\n0:13:57\tSPEAKER_06\n So for the energy source, do we go for the battery or do?\n\n0:14:02\tSPEAKER_01\n Yeah, I'm fine with the basic battery.\n\n0:14:05\tSPEAKER_04\n Basic battery.\n\n0:14:06\tSPEAKER_04\n Cheap, cheerful, it's worked.\n\n0:14:08\tSPEAKER_04\n It does work.\n\n0:14:10\tSPEAKER_06\n Cheap option.\n\n0:14:11\tSPEAKER_06\n Are you happy with that?\n\n0:14:12\tSPEAKER_06\n Yeah.\n\n0:14:13\tSPEAKER_06\n Okay.\n\n0:14:14\tSPEAKER_06\n So we'll go for the battery.\n\n0:14:18\tSPEAKER_06\n Then the case, do you want it flat or curved or sink or double?\n\n0:14:23\tSPEAKER_04\n We were going with the latest with the RSI rubber.\n\n0:14:26\tSPEAKER_01\n Yes.\n\n0:14:27\tSPEAKER_01\n So we wanted rubber double curved with the air.\n\n0:14:31\tSPEAKER_06\n So it will look like something like this.\n\n0:14:33\tSPEAKER_06\n Double waffle please.\n\n0:14:34\tSPEAKER_06\n Okay.\n\n0:14:35\tSPEAKER_06\n So then if we use double curved case, then we have to use the simple buttons.\n\n0:14:40\tSPEAKER_04\n Rubber push buttons, that's fine.\n\n0:14:42\tSPEAKER_04\n It's cheap, they're still round.\n\n0:14:44\tSPEAKER_04\n It sounds kind of funky.\n\n0:14:46\tSPEAKER_04\n And we can also mark it as, because we were saying earlier in your research, that people will get in the complain of RSI.\n\n0:14:57\tSPEAKER_04\n And this is anti-RSI.\n\n0:14:59\tSPEAKER_06\n Yeah.\n\n0:15:00\tSPEAKER_04\n So that's another marketing point that we can use.\n\n0:15:03\tSPEAKER_05\n Or the rubber push buttons.\n\n0:15:05\tSPEAKER_05\n Do you have to move?\n\n0:15:07\tSPEAKER_04\n Or do you think anything's going to have buttons?\n\n0:15:10\tSPEAKER_04\n Even if it's a jog wheel, it's still repetitive.\n\n0:15:15\tSPEAKER_06\n I thought they were given optional flat buttons or...\n\n0:15:18\tSPEAKER_04\n You can still get repetitive strain injury, whether you're pressing a button or pressing a flat button screen.\n\n0:15:25\tSPEAKER_04\n It's the fact that you're pressing the same, doing the same movement.\n\n0:15:29\tSPEAKER_04\n It's not actually what you're doing.\n\n0:15:34\tSPEAKER_04\n But the fact that this rubber is actually used in these anti-RSI, specific.\n\n0:15:41\tSPEAKER_01\n Yeah, the rubber push buttons.\n\n0:15:42\tSPEAKER_01\n We're giving them away to Bernstein, basically.\n\n0:15:45\tSPEAKER_05\n Yeah.\n\n0:15:46\tSPEAKER_05\n Yeah, so they can sit there and...\n\n0:15:48\tSPEAKER_01\n You know, watching TV should be that stressful.\n\n0:15:50\tSPEAKER_04\n And you know, you can fuzz it across the room,\n\n0:15:53\tSPEAKER_01\n throw it at your children. Throw it at your children's point, if you're watching this book.\n\n0:15:57\tSPEAKER_06\n Alright, that's me, Don.\n\n0:15:59\tSPEAKER_04\n Okay, Gabriel.\n\n0:16:00\tSPEAKER_04\n Let's hear from you about the...\n\n0:16:03\tSPEAKER_04\n It's the interface.\n\n0:16:05\tSPEAKER_01\n Yeah, some of what I have to say ties into what Katherine was just talking about.\n\n0:16:10\tSPEAKER_06\n Right.\n\n0:16:11\tNone\n Sorry.\n\n0:16:13\tNone\n Wow.\n\n0:16:30\tSPEAKER_01\n Okay, so I'm continuing with the user interface topic.\n\n0:16:35\tSPEAKER_01\n And so basically, I consulted with our manufacturing division, that sounded like Katherine was also speaking with them.\n\n0:16:45\tSPEAKER_01\n I also took Reese's marketing findings from the last meeting into consideration, because I think that's crucial as far as what keys we're going to include, what buttons we're going to include, and how they laid out.\n\n0:17:01\tSPEAKER_01\n And so the manufacturing division sent some samples of interface components that we might be interested in using that have been used in other products, like the coffee machine.\n\n0:17:14\tSPEAKER_01\n So, I already mentioned the speech recognition interface.\n\n0:17:17\tSPEAKER_01\n I guess we basically vetoed that idea.\n\n0:17:21\tSPEAKER_01\n It's pointless.\n\n0:17:24\tSPEAKER_01\n It's just a sample sensor, sample output.\n\n0:17:27\tSPEAKER_01\n It would just be probably the most expensive part of our remote without any actual interesting functionality, as far as operating the TV.\n\n0:17:36\tSPEAKER_01\n So, yeah, they also give the idea of using a spinning wheel, like you use on the side of an MP3 player like iPod.\n\n0:17:45\tSPEAKER_01\n So, we've already addressed that, and I think that would actually be worse for something like RSI, and you got that thumb move that we're constantly doing.\n\n0:17:53\tSPEAKER_01\n Yeah, they're suggestion.\n\n0:17:56\tSPEAKER_01\n And I have a feeling that we're interested in something more general, but they suggested going a little bit into a niche, like either gearing a remote towards kids, or you could have a lot of colors.\n\n0:18:11\tSPEAKER_01\n The keys might be funny or playful in some way, or something for the elderly, where the remote's very large, and the buttons are very large, and there's only a few buttons.\n\n0:18:23\tSPEAKER_01\n But we can discuss this, but it sounded like from our last meeting, we really wanted something that was general, but done well.\n\n0:18:30\tSPEAKER_01\n So, the key layout and design are really crucial.\n\n0:18:34\tSPEAKER_01\n You want people to be able to quickly access the buttons that they use a lot without always pressing along one.\n\n0:18:42\tSPEAKER_01\n And I didn't mention that we need a power button in our last.\n\n0:18:45\tSPEAKER_01\n I can give you an example here of good layout and bad layout.\n\n0:18:53\tSPEAKER_01\n I'm a manufacturing department.\n\n0:18:56\tSPEAKER_01\n So this would be an example of bad layout, where you have volume down, but they have a V on both of them.\n\n0:19:02\tSPEAKER_01\n So it's sort of confusing for the user.\n\n0:19:08\tSPEAKER_01\n Do we have a example of the giant remote that's impossible to lose?\n\n0:19:15\tSPEAKER_01\n Brilliant.\n\n0:19:17\tSPEAKER_01\n And for something for kids.\n\n0:19:25\tSPEAKER_01\n And so, yeah, I think my personal preferences have all kind of talked about and seemed to be on the same page.\n\n0:19:35\tSPEAKER_01\n So I was against the speed track ignition and against going towards anything in the niche sense.\n\n0:19:41\tSPEAKER_01\n I think it should be more general.\n\n0:19:43\tSPEAKER_01\n I didn't think the spinning wheel or the LC display were more crucial for us.\n\n0:19:48\tSPEAKER_01\n And, yeah, that's it for me.\n\n0:19:51\tSPEAKER_04\n Okay, well, let's, so what are our definite decisions on this then?\n\n0:19:57\tSPEAKER_04\n As a team, the interface type we're going for.\n\n0:20:06\tSPEAKER_01\n So we're not going to have any sort of display.\n\n0:20:10\tSPEAKER_01\n I think it's just going to be straight set of buttons.\n\n0:20:15\tSPEAKER_01\n I think we should have a limited number of buttons, ideally.\n\n0:20:20\tSPEAKER_01\n I mean, like power, channel up, channel down, volume up, one, numerical, keep it.\n\n0:20:28\tSPEAKER_01\n And some sort of either have a lock button like we mentioned or a cover.\n\n0:20:33\tSPEAKER_01\n Yeah, I guess it's to the point where we need to decide about it.\n\n0:20:36\tSPEAKER_04\n Okay, and we're not, yeah.\n\n0:20:38\tSPEAKER_01\n We're not that we've decided.\n\n0:20:40\tSPEAKER_04\n Are we going to, and are we decided on whether we're going to supplement it with anything, you know, colors.\n\n0:20:49\tSPEAKER_04\n Or, you know, gimmicky bits to it.\n\n0:20:53\tSPEAKER_04\n We're not, we're just going to go for something.\n\n0:20:58\tSPEAKER_01\n It seems like we wouldn't want to make it too busy and too sort of, gotty, but.\n\n0:21:06\tSPEAKER_01\n Yeah, I would say maybe a couple of colors like a, like a black with yellow and somewhere like maybe the RR.\n\n0:21:12\tSPEAKER_01\n Yeah, yeah.\n\n0:21:15\tSPEAKER_00\n Okay, okay, okay, okay.\n\n0:21:21\tSPEAKER_04\n Yeah, I don't have any other questions on this.\n\n0:21:25\tSPEAKER_01\n Let's move on.\n\n0:21:26\tSPEAKER_01\n I guess the fact also that we are having a rubber case would prevent us from having the cover function that we thought of before.\n\n0:21:36\tSPEAKER_00\n Yeah, sure.\n\n0:21:37\tSPEAKER_01\n If we want to have a lock of some sort of, I think that should be.\n\n0:21:41\tSPEAKER_01\n I mean, I can speak with the button department, but I think that it should be easy to have a button that just.\n\n0:21:49\tSPEAKER_01\n Yeah, the button does that.\n\n0:21:51\tSPEAKER_01\n The other buttons from operating.\n\n0:21:53\tSPEAKER_01\n So that should be simple.\n\n0:21:56\tSPEAKER_00\n Cool.\n\n0:21:59\tNone\n Right.\n\n0:22:08\tSPEAKER_05\n Well, I'm just basically letting you know what's happening in the market.\n\n0:22:19\tSPEAKER_05\n Yeah.\n\n0:22:20\tSPEAKER_05\n And what the fashions are for next year.\n\n0:22:26\tSPEAKER_05\n So yes, so from looking at this is trans and fashions and also recent investigation that we've done in the rug control market.\n\n0:22:37\tSPEAKER_05\n We have found that from a truck truck.\n\n0:22:40\tSPEAKER_05\n These are like most important aspects like that we really need to, which we've already probably discussed.\n\n0:22:46\tSPEAKER_05\n The most important aspect is look and feel so the rug control has to look and feel fancy than the ones that already that we already have.\n\n0:22:55\tSPEAKER_05\n So it has to be.\n\n0:22:56\tSPEAKER_04\n Yeah, why should people buy this when everybody got a remote that came with the TV?\n\n0:23:01\tSPEAKER_05\n Second, should be technologically innovative.\n\n0:23:05\tSPEAKER_05\n Innovative.\n\n0:23:07\tSPEAKER_05\n So.\n\n0:23:09\tSPEAKER_04\n What's that mean?\n\n0:23:11\tSPEAKER_05\n Technologically, it should be like work.\n\n0:23:17\tSPEAKER_05\n Basically, I guess it should work.\n\n0:23:19\tSPEAKER_01\n What should be, it should be maybe cutting edge in some sense, I mean, have something that's a little more technologically advanced.\n\n0:23:25\tSPEAKER_04\n Okay.\n\n0:23:26\tSPEAKER_04\n Now the trouble is is we've already decided that we're going with the stuff that works already.\n\n0:23:30\tSPEAKER_04\n That's cheap.\n\n0:23:31\tSPEAKER_01\n I mean, these first two points we've already sort of done away from because our rubber one is not fancy.\n\n0:23:36\tSPEAKER_01\n I mean, it's different.\n\n0:23:37\tSPEAKER_01\n But I wouldn't say like a rubber remote is fancy.\n\n0:23:39\tSPEAKER_01\n If that's what people want, then we're going in the wrong direction.\n\n0:23:42\tSPEAKER_01\n And it's not technologically innovative either.\n\n0:23:46\tSPEAKER_04\n Maybe we could.\n\n0:23:49\tSPEAKER_05\n That's why I think it's Bluetooth because if you put up Bluetooth and it's a Bluetooth remote control, everybody's going to like, because Bluetooth is in thing nowadays.\n\n0:23:57\tSPEAKER_05\n Like really.\n\n0:23:58\tSPEAKER_05\n People.\n\n0:24:00\tSPEAKER_05\n And when it comes to marketing, that's what people go for.\n\n0:24:03\tSPEAKER_05\n They don't really care whether, you know, at the end of the day when it works properly or not.\n\n0:24:10\tSPEAKER_05\n Of course they do.\n\n0:24:11\tSPEAKER_05\n Well, they do, but it's not.\n\n0:24:12\tSPEAKER_04\n Well, 100% less your first thing you go, oh, I'm not going to buy that because I don't know if it works or not.\n\n0:24:16\tSPEAKER_05\n Yeah, but it looks good.\n\n0:24:17\tSPEAKER_05\n If it looks good and it can just be there for decoration.\n\n0:24:23\tSPEAKER_04\n Okay.\n\n0:24:24\tSPEAKER_04\n Well, what do you two think about this?\n\n0:24:27\tSPEAKER_01\n Is the advantage of Bluetooth that you can just synchronize it with other.\n\n0:24:31\tSPEAKER_01\n Yeah, what?\n\n0:24:32\tSPEAKER_01\n I don't understand what.\n\n0:24:33\tSPEAKER_05\n It always ends up.\n\n0:24:34\tSPEAKER_01\n Yeah.\n\n0:24:35\tSPEAKER_01\n That's basically what it allows you to do.\n\n0:24:37\tSPEAKER_04\n Yeah.\n\n0:24:38\tSPEAKER_04\n And this is just going to do all this has been used for is your television.\n\n0:24:43\tSPEAKER_04\n Yeah, but I mean, people, that would mean you'd need a television that has Bluetooth in it, which no television does.\n\n0:24:51\tSPEAKER_05\n If you're looking at something that's going to be bought by people, you have to make it new, you have to make it.\n\n0:24:59\tSPEAKER_04\n That would mean we need to make a television as well.\n\n0:25:03\tSPEAKER_06\n Bluetooth, for example, in a volume, I think to connect, for example, if you get a call on your mobile phone, but your mobile phone is downstairs or something, you would get on your television, you being called by this person right now, things like that.\n\n0:25:19\tSPEAKER_04\n No, that would be your telephone syncing in with your television.\n\n0:25:23\tSPEAKER_01\n Yeah, that wouldn't be very much.\n\n0:25:25\tSPEAKER_01\n Yeah.\n\n0:25:26\tSPEAKER_06\n No, but if you get Bluetooth on the remote, you'd be able to...\n\n0:25:30\tSPEAKER_04\n The television would have to be a Bluetooth compatible, basically.\n\n0:25:37\tSPEAKER_04\n And there is no such thing.\n\n0:25:40\tSPEAKER_05\n Like, it doesn't have to be, you know, Bluetooth, that was just an idea, but like, it needs to be something that, you know, is new.\n\n0:25:48\tSPEAKER_05\n Whether it's a battery, it could be something really, really minor, you know?\n\n0:25:56\tSPEAKER_05\n But I think we are really keeping to what is already out there.\n\n0:26:01\tSPEAKER_05\n And people have already seen it, people have already got it.\n\n0:26:04\tSPEAKER_05\n If it's something new, we need to move away from what we already have.\n\n0:26:09\tSPEAKER_05\n And maybe the kinetic...\n\n0:26:11\tSPEAKER_05\n Just go creative.\n\n0:26:12\tSPEAKER_06\n Provision of energy, then.\n\n0:26:14\tSPEAKER_06\n It's been done for watches, but I haven't seen that for...\n\n0:26:18\tSPEAKER_03\n Okay, but yeah, that's very good.\n\n0:26:21\tSPEAKER_05\n But then you can market it.\n\n0:26:22\tSPEAKER_05\n Never have to change battery again.\n\n0:26:24\tSPEAKER_04\n And...\n\n0:26:26\tSPEAKER_04\n And this is all tying in very nicely.\n\n0:26:28\tSPEAKER_04\n The fact that it's made out of this rubber, we can throw it about, we should encourage people to throw their remote controls about, because it charges itself up, why do they?\n\n0:26:39\tSPEAKER_06\n Yeah, it's an illegal character, as you say, but not too much.\n\n0:26:42\tSPEAKER_01\n But yeah, by the squeezing it...\n\n0:26:44\tSPEAKER_01\n Then we can make the squeezing of the rubber be the generating...\n\n0:26:47\tSPEAKER_04\n Yeah, that's a great idea.\n\n0:26:50\tSPEAKER_04\n Well done.\n\n0:26:51\tSPEAKER_05\n Third, most important aspect.\n\n0:26:53\tSPEAKER_05\n Is it easy to use?\n\n0:26:56\tSPEAKER_05\n And I think we've all...\n\n0:26:57\tSPEAKER_05\n All about that.\n\n0:26:58\tSPEAKER_05\n Work set that.\n\n0:27:00\tSPEAKER_05\n Okay, in the fashion, how it's supposed to look, next year's fashion, very much in fraudulent vegetables, are they like being themed for cloths, shoes and furniture?\n\n0:27:10\tSPEAKER_05\n So next year people will be buying.\n\n0:27:13\tSPEAKER_05\n I found this really funny.\n\n0:27:17\tSPEAKER_05\n You know, strawberry shaped chairs.\n\n0:27:20\tSPEAKER_01\n So we can have keys that are like a broccoli key and...\n\n0:27:24\tSPEAKER_01\n Yeah.\n\n0:27:25\tSPEAKER_01\n And an avocado.\n\n0:27:26\tSPEAKER_05\n I want to watch the pineapple channel.\n\n0:27:29\tSPEAKER_05\n And as it's rubber, the feel, which is in this year is spongy.\n\n0:27:35\tSPEAKER_05\n So it's not quite spongy.\n\n0:27:37\tSPEAKER_04\n Well, spongy, that's where we got it.\n\n0:27:39\tSPEAKER_05\n We're ahead of the game there.\n\n0:27:41\tSPEAKER_05\n Yeah.\n\n0:27:42\tSPEAKER_05\n And so, personally, what I was just saying, we're from the current remote controls, like the look and the feel of the current ones.\n\n0:27:50\tSPEAKER_05\n And change the look and feel while still keeping to the company's image.\n\n0:27:55\tSPEAKER_05\n Basically.\n\n0:27:57\tSPEAKER_05\n So yeah.\n\n0:28:00\tSPEAKER_00\n Okay.\n\n0:28:02\tSPEAKER_05\n What?\n\n0:28:03\tSPEAKER_05\n I have to say.\n\n0:28:05\tSPEAKER_05\n So we're moving in the right direction.\n\n0:28:07\tSPEAKER_04\n Oh, yeah, no, this is good.\n\n0:28:09\tSPEAKER_04\n So through all that, we're going to go back to going with the kinetic.\n\n0:28:16\tSPEAKER_01\n Yeah.\n\n0:28:17\tSPEAKER_04\n Yeah.\n\n0:28:18\tSPEAKER_04\n That's great.\n\n0:28:19\tSPEAKER_04\n Using the spongy rubber that we were talking about, that's anti-RSI.\n\n0:28:22\tSPEAKER_04\n You can, as you squeeze it, you're not only therapeuticizing yourself.\n\n0:28:26\tSPEAKER_04\n You are charging the batteries.\n\n0:28:29\tSPEAKER_04\n And I'm not sure about the buttons being in the shape of fruit, though.\n\n0:28:34\tSPEAKER_04\n No vegetables.\n\n0:28:36\tSPEAKER_03\n Oh, yeah.\n\n0:28:38\tSPEAKER_05\n Well, maybe make it like fruity colours or something.\n\n0:28:44\tSPEAKER_01\n Or the power button could be like a big apple.\n\n0:28:51\tSPEAKER_06\n So yeah, but upward, so you're like, well, yeah, this is true.\n\n0:28:57\tSPEAKER_01\n Yeah, this is true.\n\n0:28:58\tSPEAKER_01\n They don't own all images of apples.\n\n0:29:01\tSPEAKER_01\n Okay, we'll make it a pomegranate.\n\n0:29:05\tSPEAKER_04\n Well, okay, it seems like the only thing that we haven't really fined.\n\n0:29:13\tSPEAKER_04\n A grid on is image.\n\n0:29:20\tSPEAKER_04\n Yeah, we're saying now we don't want it to be fruit and vegetables, but we don't know what it should be.\n\n0:29:25\tSPEAKER_04\n Or like, we're going, yeah, it should look slick.\n\n0:29:27\tSPEAKER_04\n What do we mean by slick?\n\n0:29:30\tSPEAKER_04\n Sort of thing.\n\n0:29:32\tSPEAKER_05\n I think if it's rubber, it needs to be...\n\n0:29:37\tSPEAKER_04\n I mean, you said earlier on that it should be funky.\n\n0:29:40\tSPEAKER_05\n I think it should be...\n\n0:29:43\tSPEAKER_05\n I mean, what do you associate with rubber?\n\n0:29:46\tSPEAKER_05\n You know, like...\n\n0:29:47\tSPEAKER_05\n Really different colours.\n\n0:29:48\tSPEAKER_02\n Keep it clean.\n\n0:29:49\tSPEAKER_05\n I'm sorry I used the wrong word.\n\n0:29:51\tSPEAKER_05\n What do you associate with the material?\n\n0:29:54\tSPEAKER_05\n That material.\n\n0:29:57\tSPEAKER_05\n Like, I'm just thinking bright colours.\n\n0:30:05\tSPEAKER_05\n Bright, natural colours, nothing too bright, but not too bright.\n\n0:30:12\tSPEAKER_05\n No lime green or bright yellow or bright pink.\n\n0:30:17\tSPEAKER_05\n They'll make different colours.\n\n0:30:19\tSPEAKER_04\n Like, the volume buttons should be the same colour.\n\n0:30:24\tSPEAKER_04\n And the channel buttons should be one colour and stuff like that, do you mean?\n\n0:30:28\tSPEAKER_05\n Yeah.\n\n0:30:29\tSPEAKER_05\n And on the back of it have the logo.\n\n0:30:36\tSPEAKER_00\n Okay.\n\n0:30:37\tSPEAKER_00\n What's easy?\n\n0:30:38\tSPEAKER_02\n Yeah.\n\n0:30:39\tSPEAKER_02\n Why not?\n\n0:30:41\tSPEAKER_00\n Okay.\n\n0:30:43\tSPEAKER_01\n The one thing I'm wondering about, I hope that we're not going too much down a gimmicky road of...\n\n0:30:49\tSPEAKER_01\n Yeah, we're going to...\n\n0:30:50\tSPEAKER_01\n If we listen to this story, they're going to see like three or four normal remotes and then a big spongy pink tomato.\n\n0:30:57\tSPEAKER_01\n Yeah, I mean...\n\n0:30:59\tSPEAKER_01\n What a nice...\n\n0:31:00\tSPEAKER_04\n The remote controlled tomato.\n\n0:31:03\tSPEAKER_05\n I can say in this country, you'll get, you know, lots of people wanting something really funky and cool.\n\n0:31:12\tSPEAKER_05\n Like, and kids will be walking in with their parents saying, I want to buy that one.\n\n0:31:28\tSPEAKER_05\n And parents will see the pro in it as well because it's like kids won't break it.\n\n0:31:30\tSPEAKER_05\n It's not breakable if you're thrown around.\n\n0:31:32\tSPEAKER_05\n Especially with younger kids, you know, they can pick it up.\n\n0:31:37\tSPEAKER_05\n The only thing is, it's really small kids much on it.\n\n0:31:40\tSPEAKER_04\n Well, it's going to be too proof.\n\n0:31:44\tSPEAKER_05\n So, it's quite like user friendly and also for different families, like families as well.\n\n0:31:56\tSPEAKER_05\n So for little kids and for older kid like teenagers will like it.\n\n0:32:00\tSPEAKER_05\n I think especially maybe younger girls, if it's in pink, they'll be like, oh yeah, pink, control for their room, something.\n\n0:32:07\tSPEAKER_04\n So, what do you say? Maybe we should mark it in different colours for different.\n\n0:32:11\tSPEAKER_04\n So, we could do like the pink range, the blue range, the green range.\n\n0:32:15\tSPEAKER_05\n So, like you walk in, you're like, oh, I like that remote control because it's so bright.\n\n0:32:18\tSPEAKER_05\n And then, and then the shop assistant comes out and says, oh, what colour would you like it?\n\n0:32:22\tSPEAKER_05\n And they go like, oh, I can do the colour.\n\n0:32:24\tSPEAKER_05\n Wow, so it puts, I think even the customer into more control of what they're buying.\n\n0:32:28\tSPEAKER_05\n Instead of, you got all colour, it's either that or nothing.\n\n0:32:31\tSPEAKER_05\n So, they also get to pick.\n\n0:32:34\tSPEAKER_05\n Well, personally, I like walking into the shop and choosing a colour.\n\n0:32:37\tSPEAKER_01\n I mean, that seems to work well with products like iPod where you have a variety of colours that people feel like they're customising them when they buy it.\n\n0:32:45\tSPEAKER_06\n Do you guys, you know, how many, you know, there are some colours that I would never choose.\n\n0:32:52\tSPEAKER_06\n And I would be curious how many people choose that.\n\n0:32:54\tSPEAKER_04\n Well, I think that can be done to build market researching.\n\n0:32:58\tSPEAKER_04\n That's easy enough to find out what colours are more popular.\n\n0:33:01\tSPEAKER_06\n It's less of the colours.\n\n0:33:07\tSPEAKER_03\n Okay.\n\n0:33:08\tSPEAKER_03\n All right. Well, all right.\n\n0:33:12\tSPEAKER_04\n That's what we're going to aim to get together by the next meeting then.\n\n0:33:21\tSPEAKER_04\n So, the next meeting is from you, Catherine, you're going to be working on the look and feel design.\n\n0:33:32\tSPEAKER_04\n Gabrielle, you're going to be working on, you know, come up with the user interface design.\n\n0:33:38\tSPEAKER_04\n Then, basically, you two are going to be working together, unless you won't be going off to your separate offices.\n\n0:33:45\tSPEAKER_04\n And I think you're going to get a chance to play with some clay.\n\n0:33:51\tSPEAKER_04\n I think, you know, come up for the next meeting.\n\n0:33:56\tSPEAKER_04\n Be able to come in and show us some physical ideas.\n\n0:34:01\tSPEAKER_04\n Because at the moment, you know, it's hard.\n\n0:34:03\tSPEAKER_04\n We were kind of going, yeah, it's got to feel nice.\n\n0:34:05\tSPEAKER_04\n It's got to look cool.\n\n0:34:07\tSPEAKER_04\n And now we can actually start some sort of physical something.\n\n0:34:14\tSPEAKER_04\n It sounds good.\n\n0:34:20\tSPEAKER_04\n And you're going to be working on the product evaluation.\n\n0:34:24\tSPEAKER_00\n Evaluation.\n\n0:34:32\tSPEAKER_04\n And I will be talking to the bosses, basically.\n\n0:34:41\tSPEAKER_04\n And, uh, fielding off some more spam.\n\n0:34:50\tSPEAKER_04\n That's it really.\n\n0:34:53\tSPEAKER_04\n Keeping things to, well, you know, hopefully, keeping things together.\n\n0:35:03\tSPEAKER_04\n Yeah, that's.\n\n0:35:12\tSPEAKER_04\n This is good.\n\n0:35:14\tSPEAKER_04\n So we know for definite, you know, we've now got some definite things going on.\n\n0:35:20\tSPEAKER_04\n We definitely know how it's powered.\n\n0:35:22\tSPEAKER_04\n We definitely know that it's going to be as simple buttons.\n\n0:35:26\tSPEAKER_04\n We're not going to be going for the new technological chip on print, the expensive things.\n\n0:35:30\tSPEAKER_04\n Now let's get to vite with these.\n\n0:35:40\tSPEAKER_04\n The above features of the $200 and the $250-22, you sell as fun and funky.\n\n0:35:49\tSPEAKER_04\n Can, don't know of any other remote controls that are made out of this stuff.\n\n0:35:57\tSPEAKER_04\n We're going to, as a sort of extra something on it, you know, what extra things, other extra things to this product have.\n\n0:36:03\tSPEAKER_04\n We're looking to this lock key, facility, I mean, whether or not it happens, it's always possible, I don't know, but something to look into.\n\n0:36:16\tSPEAKER_04\n Okay, I think that's, well done, everybody.\n\n0:36:21\tSPEAKER_04\n Anyone have any questions everyone know what they're doing?\n\n0:36:26\tSPEAKER_04\n Because if you don't, I'm sure you'll soon get an email about it.\n\n0:36:29\tSPEAKER_01\n Yeah.\n\n0:36:31\tSPEAKER_01\n I think we all know what you need to do now.\n\n0:36:33\tSPEAKER_05\n Excuse your little detail.\n\n0:36:36\tSPEAKER_04\n Okay, right, well, it's, we're still a couple of minutes until our meetings due to finish.\n\n0:36:44\tSPEAKER_04\n But I got a note saying that you two were going to be working together.\n\n0:36:51\tSPEAKER_04\n So, okay, I'll stay here.\n\n0:36:53\tSPEAKER_04\n Before you all disappear off.\n\n0:36:54\tSPEAKER_00\n I'm just wondering.\n\n0:36:59\tSPEAKER_00\n Hold on, fire.\n\n0:37:03\tSPEAKER_01\n Does the peer is immediately come into effect on our next paycheck?\n\n0:37:07\tSPEAKER_04\n Or is that, I think it's, yeah, I think it's going to be part more of a profit sharing on the product\n\n0:37:15\tSPEAKER_01\n for a bank, I mean, we're getting futures in there.\n\n0:37:18\tSPEAKER_04\n Yeah, I think that's the way it's going to happen at the moment.\n\n0:37:22\tSPEAKER_01\n So we really have that incentive to make this remote work.\n\n0:37:26\tSPEAKER_00\n Yeah, yeah.\n\n0:37:28\tSPEAKER_01\n I'd like to share in the coffee machine profits because that's what we're doing.\n\n0:37:31\tSPEAKER_04\n I want to share in the spice rocket. Did you see that this company sense, so we might as well have a spaceship.\n\n0:37:38\tSPEAKER_01\n This company has its fingers in a lot of different parts.\n\n0:37:41\tSPEAKER_01\n Yeah.\n\n0:37:46\tSPEAKER_00\n Yeah, yeah,\n\n0:37:48\tSPEAKER_01\n what I find out in the money making department.\n\n0:37:52\tNone\n Oh. I did notice looking at, I mean, they told you that they wanted what our product to represent the RR brand and to be immediately noticeable, I mean, if you look like at the coffee maker at the corporate web page, it's not obvious.\n\n0:38:23\tSPEAKER_01\n Our world is to us because we worked here for years and we used that coffee machine, but it doesn't have the color scheme of the company anywhere on it.\n\n0:38:34\tSPEAKER_01\n Obviously, it's just so silver and black.\n\n0:38:40\tSPEAKER_04\n And the spaceship doesn't have the, do you think they have a massive RR down the side of it?\n\n0:38:44\tSPEAKER_04\n But I still want one.\n\n0:38:52\tSPEAKER_04\n Okay, I've just had a sign, flesh and upside saying finish the meeting.\n\n0:38:57\tSPEAKER_04\n Yeah.\n\n0:39:10\tSPEAKER_01\n Yeah, I guess that's us.\n\n0:39:13\tSPEAKER_04\n Yeah.\n\n0:39:15\tSPEAKER_04\n It's not telling, it's not saying do anything in particular just yet.\n\n0:39:19\tSPEAKER_04\n So maybe you should go back to your own offices.\n\n0:39:22\tSPEAKER_01\n Okay.\n\n0:39:24\tSPEAKER_01\n All right.\n\n0:39:26\tSPEAKER_06\n Are we taking this off?\n\n0:39:29\tSPEAKER_00\n Yeah.\n\n0:39:30\tSPEAKER_04\n Yeah.\n\n", "summary": [{"summary_text": "SPEAKER and his colleagues are having a meeting. They are going to talk about what it is that they are supposed to be doing and who they are. They have been off doing some R&D for research and development. Speaker wants to know who's on Catherine first."}]}