{"filename": "./data/ES2016a.txt", "transcript": "0:00:00\tNone\n Okay.\n\n0:00:07\tSPEAKER_03\n Oh, that's not going to work.\n\n0:00:14\tSPEAKER_03\n Oh, all right.\n\n0:00:35\tSPEAKER_02\n Okay.\n\n0:01:00\tSPEAKER_03\n All right.\n\n0:01:10\tSPEAKER_03\n As you all know, we're here to create a brand new fantastic remote.\n\n0:01:16\tSPEAKER_03\n I'm Nick Tabusk. I'm the project manager.\n\n0:01:20\tSPEAKER_03\n We'll just get started with everyone kind of letting each other know who they are and what you're doing, what your role is.\n\n0:01:33\tSPEAKER_03\n Go ahead.\n\n0:01:34\tSPEAKER_00\n Okay. I'm Corinne Whiting and I will be the marketing expert.\n\n0:01:39\tSPEAKER_00\n And in each of the three phases, I will have a different role in the function design phase.\n\n0:01:46\tSPEAKER_00\n I will be talking about user requirements specification.\n\n0:01:50\tSPEAKER_00\n And this means what needs and desires are to be fulfilled.\n\n0:01:55\tSPEAKER_00\n And I'll be doing research to figure this out.\n\n0:01:58\tSPEAKER_00\n In the conceptual design phase, I will be dealing with trend watching.\n\n0:02:02\tSPEAKER_00\n And I'll be doing marketing research on the web.\n\n0:02:05\tSPEAKER_00\n And then finally in the detailed design phase, I will be doing product evaluation.\n\n0:02:12\tSPEAKER_00\n And so I will be collecting the requirements and ranking all of the requirements to see how we did.\n\n0:02:19\tSPEAKER_02\n I'm Ryan. I'm the user interface designer. Likewise, I have three different roles for each stage of the design.\n\n0:02:29\tSPEAKER_02\n The functional design is looking at the technical functions of remote control.\n\n0:02:34\tSPEAKER_02\n In the concept design, the user interface, how the user reacts with the product.\n\n0:02:40\tSPEAKER_02\n And in the detailed design, sort of like the user interface design, what they're looking for, things like fashions, what makes it special.\n\n0:02:51\tSPEAKER_02\n That's about it. I'm Manuel.\n\n0:02:54\tSPEAKER_01\n And I'm the industrial designer in this project.\n\n0:03:00\tSPEAKER_01\n In the functional design phase, I'll be dealing mostly with the requirements.\n\n0:03:05\tSPEAKER_01\n We'll discuss what the product has to fulfill and so on.\n\n0:03:12\tSPEAKER_01\n I suppose we'll work pretty much together on that one.\n\n0:03:17\tSPEAKER_01\n In the conceptual design, I'll be mostly dealing with properties and materials of our product.\n\n0:03:24\tSPEAKER_01\n And the detailed design and the detailed design, I'll be concerned with the look and feel of the product itself.\n\n0:03:35\tSPEAKER_01\n Pretty much working together, obviously, on the design.\n\n0:03:40\tSPEAKER_03\n Okay. So we've got our opening, our agenda is the opening acquaintance, which we've kind of done.\n\n0:03:54\tSPEAKER_03\n Tool training, project plan, discussion, and then closing.\n\n0:03:59\tSPEAKER_03\n Granted, 25 minutes we have here.\n\n0:04:03\tSPEAKER_03\n So we are putting together a new remote control.\n\n0:04:10\tSPEAKER_03\n We want it to be something original.\n\n0:04:13\tSPEAKER_03\n Of course, we're a not only electronics company, but a fashion conscious electronics company.\n\n0:04:23\tSPEAKER_03\n We've got a brand new app called Trendy.\n\n0:04:34\tSPEAKER_03\n And we want it to be easy to use.\n\n0:04:40\tSPEAKER_03\n We've got the functional design, conceptual design, and detailed design.\n\n0:04:46\tSPEAKER_03\n And well, functional design.\n\n0:05:05\tSPEAKER_03\n Do we have any ideas of what kind of remote control we want to have?\n\n0:05:19\tSPEAKER_03\n And then we can go into how we're going to design it and how we're going to do the detailing on it.\n\n0:05:27\tSPEAKER_02\n Well, function remote control is just a change of channels as it's main function.\n\n0:05:36\tSPEAKER_03\n So we want it to be a TV remote, or do we want it to do other things besides just be a television remote?\n\n0:05:45\tSPEAKER_02\n I suppose try to make it a university remote, but it could work on all sort of electrical products in one person's house.\n\n0:05:57\tSPEAKER_02\n But you know, they also have the same role, changing channels, volumes, and then programming.\n\n0:06:05\tSPEAKER_02\n I think they all work on the same principles, which I doubt is no.\n\n0:06:10\tSPEAKER_03\n It's not.\n\n0:06:16\tSPEAKER_03\n I think, yeah, universal remote.\n\n0:06:20\tSPEAKER_03\n This is my first go around with creating remote control.\n\n0:06:25\tSPEAKER_03\n I think we're all on the same boat here.\n\n0:06:32\tSPEAKER_02\n One thing I thought of remote control is you always lose them.\n\n0:06:37\tSPEAKER_02\n There's a way of finding that quite easily.\n\n0:06:40\tSPEAKER_03\n So we should we should feature set our remote control up to where it has a.\n\n0:06:47\tSPEAKER_03\n Like a tracking device or like a whistle or making noise.\n\n0:06:52\tSPEAKER_02\n It makes a noise.\n\n0:06:53\tSPEAKER_03\n There's a button on the TV that you press.\n\n0:06:57\tSPEAKER_00\n Okay.\n\n0:06:59\tSPEAKER_01\n So.\n\n0:07:02\tSPEAKER_02\n Generally all remote was a sort of quite similar in their pains.\n\n0:07:09\tSPEAKER_02\n Yeah.\n\n0:07:10\tSPEAKER_03\n We want so they're kind of like long and rectangular.\n\n0:07:14\tSPEAKER_00\n We want something crazy.\n\n0:07:16\tSPEAKER_03\n You know, we want something new that's going to stand out.\n\n0:07:19\tSPEAKER_03\n I think modern.\n\n0:07:21\tSPEAKER_02\n So our remote should be very close.\n\n0:07:25\tSPEAKER_00\n Maybe like user friendly like a little.\n\n0:07:28\tSPEAKER_00\n Yeah.\n\n0:07:29\tSPEAKER_02\n People I thought maybe because people always sent a theory about the place to whether it was in a ball and actual controls or inside or something.\n\n0:07:42\tSPEAKER_01\n Well, there are of course certain restrictions.\n\n0:07:45\tSPEAKER_01\n You can't have it be any form and fulfill all functions at the same time.\n\n0:07:50\tSPEAKER_01\n So there are obviously some restrictions we have to apply here.\n\n0:07:54\tSPEAKER_01\n However, one question is how stable is that.\n\n0:07:58\tSPEAKER_01\n Is that thing supposed to be the first of the material pretty much?\n\n0:08:03\tSPEAKER_01\n What are we going to build the thing out of how sturdy is it going to be?\n\n0:08:06\tSPEAKER_01\n Do we want it to last longer or rather have people.\n\n0:08:15\tSPEAKER_01\n Okay, so by one.\n\n0:08:16\tSPEAKER_01\n Yeah.\n\n0:08:17\tSPEAKER_03\n So we want to be sturdy.\n\n0:08:18\tSPEAKER_03\n We wanted to hold up to somebody's child, you know, throwing it across the room.\n\n0:08:24\tSPEAKER_03\n Or as you said, people kind of throw it so ball shaped.\n\n0:08:29\tSPEAKER_03\n You know, if it were ball shaped, maybe.\n\n0:08:31\tSPEAKER_02\n Can you cast on the outside and everything can be inside.\n\n0:08:35\tSPEAKER_03\n Camp.\n\n0:08:38\tSPEAKER_03\n So we want it to be modern fun.\n\n0:08:40\tSPEAKER_03\n Sturdy.\n\n0:08:48\tSPEAKER_03\n So our form and our function.\n\n0:08:51\tSPEAKER_03\n We wanted to be easy to find.\n\n0:09:19\tSPEAKER_03\n What else.\n\n0:09:24\tSPEAKER_03\n What else do we want it to do?\n\n0:09:26\tSPEAKER_03\n So we want it to be universal.\n\n0:09:32\tSPEAKER_03\n It's something that we're supposed to sell for about 25 euros.\n\n0:09:39\tSPEAKER_03\n And.\n\n0:09:43\tSPEAKER_03\n So we want to make sure that we have the same goals for profits or I think somewhere around 50 million euros.\n\n0:09:50\tSPEAKER_03\n What they want to make on it.\n\n0:09:54\tSPEAKER_00\n Also, since we're partners of the International Remote Control Association, maybe we want to make it something that would globally appeal.\n\n0:10:06\tSPEAKER_00\n Okay.\n\n0:10:07\tSPEAKER_00\n That's more on the research end.\n\n0:10:10\tSPEAKER_03\n So marketing, you know, how maybe marketing you could find out what is the most universally appealing remote control out there.\n\n0:10:26\tSPEAKER_00\n Yeah.\n\n0:10:28\tSPEAKER_00\n And maybe as far as design goes, maybe we could have different ones for different target audiences.\n\n0:10:34\tSPEAKER_00\n Because maybe one won't apply to all of the countries we're targeting.\n\n0:10:41\tSPEAKER_02\n And.\n\n0:11:05\tSPEAKER_03\n You guys have any ideas for what it should look like.\n\n0:11:12\tSPEAKER_03\n We want to be a ball.\n\n0:11:19\tSPEAKER_03\n Drop the ball and maybe where the buttons are located.\n\n0:11:29\tSPEAKER_02\n My original idea was just simply sort of a sphere where maybe you.\n\n0:11:36\tSPEAKER_02\n This is where it's connected together.\n\n0:11:41\tSPEAKER_02\n And then when you open it out, it could be a flip, like a flip phone.\n\n0:11:45\tSPEAKER_02\n And then when you fold it out of the middle, maybe a hinge.\n\n0:11:51\tSPEAKER_02\n That's the strongest part of it.\n\n0:11:53\tSPEAKER_02\n Without if you did use a hinge, you're just two parts and then you'd have just like you buttons.\n\n0:12:02\tSPEAKER_02\n Things inside, I think sometimes we're not so too many buttons.\n\n0:12:07\tSPEAKER_02\n So very simple as possible.\n\n0:12:10\tSPEAKER_02\n There's few of those inside as possible.\n\n0:12:14\tSPEAKER_02\n And then there was the idea for just something.\n\n0:12:17\tSPEAKER_02\n Maybe if it had like some kind of light or something or lights around it.\n\n0:12:22\tSPEAKER_02\n It's looking a bit like something like Star Wars at the moment.\n\n0:12:25\tSPEAKER_02\n To be fair.\n\n0:12:28\tSPEAKER_02\n That was just a simple idea.\n\n0:12:31\tSPEAKER_02\n I didn't know you could feel out about it.\n\n0:12:34\tSPEAKER_02\n It would almost be likeable.\n\n0:12:37\tSPEAKER_02\n So that was just the idea I had.\n\n0:12:39\tSPEAKER_02\n I don't know if there was other ideas.\n\n0:12:41\tSPEAKER_01\n Right.\n\n0:12:42\tSPEAKER_01\n One problem you'd get with this design is the ball is an ice idea because of its stability.\n\n0:12:47\tSPEAKER_01\n But of course, since it's about a roll, we'd have to have it flat on the side of the east.\n\n0:12:54\tSPEAKER_01\n We'd have to take away that part.\n\n0:12:57\tSPEAKER_01\n That's one of the big issues.\n\n0:12:59\tSPEAKER_01\n Also you risk the hinges here.\n\n0:13:02\tSPEAKER_02\n There is a problem.\n\n0:13:04\tSPEAKER_02\n There is a hinge.\n\n0:13:06\tSPEAKER_01\n That's interesting of course, but that's of course a weak point.\n\n0:13:12\tSPEAKER_02\n Yeah.\n\n0:13:23\tSPEAKER_03\n How would we go about making, you know, getting rid of our weak points?\n\n0:13:31\tSPEAKER_03\n What I mean, but we just have a flat spot on the bottom of the ball.\n\n0:13:37\tSPEAKER_03\n Not to put you on the spot, but what did you say your title was again?\n\n0:13:45\tSPEAKER_03\n I'm the industrial designer.\n\n0:13:47\tSPEAKER_01\n Industrial designer.\n\n0:13:50\tSPEAKER_01\n Well, the point is that maybe the shape is perhaps not the most ideal as stable as it is.\n\n0:14:07\tSPEAKER_01\n There must be a compromise between the stability design here.\n\n0:14:14\tSPEAKER_02\n I'm sure I think of the design of others.\n\n0:14:17\tSPEAKER_02\n I can't think of anything other than the long rectangle.\n\n0:14:20\tSPEAKER_02\n For a small sort of faster ones, but there's nothing being done sort of out of.\n\n0:14:26\tSPEAKER_03\n That's not new. It's not innovative.\n\n0:14:30\tSPEAKER_03\n Everybody does longer remote because it's easy.\n\n0:14:33\tSPEAKER_03\n It's stable.\n\n0:14:36\tSPEAKER_00\n I'll do something.\n\n0:14:39\tSPEAKER_03\n Go ahead.\n\n0:14:42\tSPEAKER_00\n My idea was just to have it be kind of like a keyboard type shape, you know, like video games.\n\n0:14:51\tSPEAKER_00\n So maybe, I mean, that would be kind of big and bulky.\n\n0:14:56\tSPEAKER_00\n We could also try to do the hints then so it could like flip out that way.\n\n0:15:00\tSPEAKER_00\n I don't know.\n\n0:15:03\tSPEAKER_02\n I think definitely doing something different.\n\n0:15:08\tSPEAKER_02\n Yeah.\n\n0:15:09\tSPEAKER_02\n I mean, very design something that's sort of like, I suppose not always everybody's hands the same, but something that would be fitting the hand easier.\n\n0:15:33\tSPEAKER_02\n Something with a grip.\n\n0:15:35\tSPEAKER_02\n Yeah.\n\n0:15:40\tSPEAKER_03\n Because even I suppose even with the ball, you still might be able to.\n\n0:15:45\tSPEAKER_03\n It might not be the easiest to hold on to.\n\n0:15:52\tSPEAKER_03\n So perhaps the joystick, the keyboard idea might work better.\n\n0:15:59\tSPEAKER_03\n But then again, people like to use one hand to flip and one hand to hold their soda.\n\n0:16:05\tSPEAKER_02\n So maybe maybe it's the thing is definitely going to be a one on the job.\n\n0:16:14\tSPEAKER_03\n I feel like I'm just shooting everything down here.\n\n0:16:19\tSPEAKER_00\n You're the boss.\n\n0:16:23\tSPEAKER_01\n The one hand to design yourself in front of the size, because you know, from cell phones, they can be too small.\n\n0:16:30\tSPEAKER_01\n Yeah.\n\n0:16:31\tSPEAKER_01\n Yeah.\n\n0:16:32\tSPEAKER_01\n It's too small.\n\n0:16:33\tSPEAKER_01\n If it's small, it probably looks better, but it may not be as functional.\n\n0:16:43\tSPEAKER_03\n Okay, so fortunately we've got about five minutes here to come up with our remote control idea and start rolling with it.\n\n0:16:56\tSPEAKER_03\n We've talked about our experiences with remote control and we've got a couple ideas.\n\n0:17:10\tSPEAKER_03\n Let's see here.\n\n0:17:20\tSPEAKER_03\n What if we had not only, say we went with the ball, the ball function.\n\n0:17:29\tSPEAKER_03\n But maybe we give it sort of grips along the side to make it easier to hold on to.\n\n0:17:43\tSPEAKER_03\n So, you know, so it's easier to hold on to that way.\n\n0:17:54\tSPEAKER_03\n Of course, that'll then remove some of our ball unless this, unless this part were raised.\n\n0:18:01\tSPEAKER_03\n So say the cover flips over and covers that part.\n\n0:18:06\tSPEAKER_03\n So the grip is no, that wouldn't work either.\n\n0:18:17\tSPEAKER_03\n If we're going to make it flat on the bottom, then that eliminates our ball anyways.\n\n0:18:24\tSPEAKER_03\n So if it were flat on the bottom and then had the sort of grips on the side here, I guess.\n\n0:18:35\tSPEAKER_03\n And then we have the problem with the hinge.\n\n0:18:48\tSPEAKER_03\n So if we're flat on the bottom, it's not going to roll away. It'll stay where we want.\n\n0:18:52\tSPEAKER_01\n The question is also, I don't know.\n\n0:18:55\tSPEAKER_01\n Do you really always want to open that thing when you have to use it?\n\n0:18:59\tSPEAKER_01\n That's true. It's probably going to lie around open all the time anyway.\n\n0:19:06\tSPEAKER_01\n So I don't know if a lid is a good idea from stability point of view.\n\n0:19:09\tSPEAKER_01\n It certainly is. But also you have to face it and take into account the more of these things.\n\n0:19:16\tSPEAKER_01\n Break by accident, the more we sell.\n\n0:19:21\tSPEAKER_01\n So, don't make it.\n\n0:19:24\tSPEAKER_03\n So we don't have it flip open. We just have a ball.\n\n0:19:30\tSPEAKER_02\n But then maybe go about to the thing I want to know those things.\n\n0:19:37\tSPEAKER_03\n So then we forget the ball.\n\n0:19:41\tSPEAKER_03\n It looks cool, but it's really not functional.\n\n0:19:46\tSPEAKER_03\n So we've got our sort of keyboard kind. But if we flipped it around here so that it were.\n\n0:19:57\tSPEAKER_03\n Sorry, that doesn't look anything like what you had there.\n\n0:20:01\tSPEAKER_03\n So it's up and down. You hold it this way.\n\n0:20:05\tSPEAKER_03\n Of course, then it's like the rectangular again only with a couple of jutting out points.\n\n0:20:12\tSPEAKER_03\n But it's one handed.\n\n0:20:16\tSPEAKER_01\n Question is what makes those game pads functional?\n\n0:20:19\tSPEAKER_01\n I think that's pretty much the form for the hand.\n\n0:20:23\tSPEAKER_01\n So it's a round shape underneath that makes it comfy.\n\n0:20:27\tSPEAKER_01\n Yeah.\n\n0:20:28\tSPEAKER_01\n Mix it nice. So that's the essential part except for that I think.\n\n0:20:31\tSPEAKER_01\n Yeah.\n\n0:20:32\tSPEAKER_01\n We'll not probably not get away from some longer design.\n\n0:20:37\tSPEAKER_01\n Because you also have to know which way around to point this thing.\n\n0:20:43\tSPEAKER_01\n Yeah.\n\n0:20:44\tSPEAKER_01\n Because it doesn't have a cord like joysticks do.\n\n0:20:47\tSPEAKER_01\n Batteries go weak as well. So after a while you have to point it towards the equipment you want to control with it.\n\n0:20:59\tSPEAKER_01\n Show which is the front which is the back.\n\n0:21:02\tSPEAKER_03\n It's impossible to have it to where it would work with like a sensor on either side.\n\n0:21:08\tSPEAKER_03\n So that either way you're pointing it will work.\n\n0:21:10\tSPEAKER_01\n Of course, the more technology you stick in that, the more.\n\n0:21:13\tSPEAKER_01\n More.\n\n0:21:14\tSPEAKER_01\n More expensive.\n\n0:21:15\tSPEAKER_01\n So.\n\n0:21:16\tSPEAKER_01\n Of course, you can do.\n\n0:21:19\tSPEAKER_03\n Okay.\n\n0:21:26\tSPEAKER_01\n I mean, of course, it will be evident after a while.\n\n0:21:29\tSPEAKER_01\n If you look at it, it will be evident which way around to point it since you have the numbers and the buttons and stuff.\n\n0:21:36\tSPEAKER_01\n But it's about the instinctual thing.\n\n0:21:39\tSPEAKER_01\n I can just grab it. You don't have to just look at it, you know, which way around to point it.\n\n0:21:43\tSPEAKER_01\n Otherwise, the design of the point of putting two sensors on both sides would probably work.\n\n0:21:51\tSPEAKER_02\n Even if you design it in some way that, you know, isn't a rectangle but still pointed in a direction that had a definite point.\n\n0:21:58\tSPEAKER_02\n So that's your thing.\n\n0:21:59\tSPEAKER_02\n Yes, I'm like that instead.\n\n0:22:01\tSPEAKER_02\n And there you can know which way you're in the point today.\n\n0:22:05\tSPEAKER_02\n Okay.\n\n0:22:06\tSPEAKER_02\n Sorry to interrupt, but we have a warning.\n\n0:22:08\tSPEAKER_03\n Oh, we had a time.\n\n0:22:09\tSPEAKER_03\n Yeah.\n\n0:22:10\tSPEAKER_03\n Okay.\n\n0:22:11\tSPEAKER_03\n Well.\n\n0:22:12\tSPEAKER_03\n Just to finish up, should we go with this plan?\n\n0:22:16\tSPEAKER_03\n Let's start making some...\n\n0:22:29\tSPEAKER_03\n Our good ideas, what are not?\n\n0:22:31\tSPEAKER_02\n Let's say, what's he saying?\n\n0:22:32\tSPEAKER_02\n Because now what we need to do for the next meeting, I think.\n\n0:22:38\tSPEAKER_03\n So, we're going to finish now.\n\n0:22:49\tSPEAKER_03\n Okay.\n\n0:22:51\tSPEAKER_03\n Project manager will design a better meeting for the next time around.\n\n0:22:55\tSPEAKER_03\n You're a little bit more prepared.\n\n0:22:59\tSPEAKER_03\n And, all right.\n\n0:23:00\tSPEAKER_03\n Good meeting.\n\n0:23:01\tSPEAKER_03\n Thank you.\n\n", "summary": [{"summary_text": "Nick Tabusk is the project manager. Corinne Whiting is the marketing expert. Manuel is the industrial designer. Ryan is the user interface designer. Speaker is collecting the requirements and ranking all of the requirements to see how they did. The functional design is looking at the technical functions of the remote control. The detailed design is concerned with the look and feel."}]}