{"filename": "./data/IS1009c.txt", "transcript": "0:00:30\tSPEAKER_04\n Okay. Hello everyone. How are we doing? Yeah, good. First we're going over the minutes of the last meeting, more or less. In the last meeting, the marketing manager had presented her method of working, meaning gathering suggestions from everyone to see how she best could market this product within the budget that was given. In general, the idea is that it should be something that is not difficult to use. It's also an item that people lose a lot, so we should address that. And of course, it should be something that is very simple to use. In addition to that, to make it sell, of course, the marketing manager wishes that it's be very attractive, or like she says, put some sizzling into it in one way or another, so that the people are buying it now, because in particular with smaller items, that's a very important fact, because if they say, well, like a home and think about it, that won't work. Also, mentioned was it should be, it should have a very short learning curve, and maybe it could be sold by using a slogan. Our technical manager has then said that he feels it should have a chip that has infrared bits and has an interface controls, interface that controls the chip. Therefore, messages will be controlled in the same manner.\n\n0:02:46\tSPEAKER_04\n There should be extra features like lid buttons, maybe a beep. If too many buttons are pressed, a child lock, and maybe a display clock, so that people could see the time, you know, what show they want to watch. Also mentioned was maybe different shapes. So the components of the thing should be button bulbs, infrared bulbs, battery chips, wires, and maybe some kind of a holder for the item.\n\n0:03:30\tSPEAKER_04\n Francina, who is our interface designer, has mentioned that, of course, you'd have an on-off button, and also has mentioned an interesting feature that it should have maybe a channel lock, particularly with maybe small children that they couldn't watch a channel that is undesirable.\n\n0:03:55\tSPEAKER_04\n It should be compact, for personal favorite was it should be t-shaped, and maybe having an alarm clock and material should possibly be of non-allergic nature.\n\n0:04:11\tSPEAKER_04\n The different systems that exist are infrared or radio waves. Maybe it should have electricity saving feature, and even possibly a timer, so that people can program their favorite program on right from the remote. Are we all in agreement that that's about what we discussed last time?\n\n0:04:44\tSPEAKER_04\n Yes, very good, pretty much, is it?\n\n0:04:47\tSPEAKER_04\n Okay, then I'm looking for three presentations, and I don't know whether the order matters much. I don't think so, so whoever wants to.\n\n0:04:57\tSPEAKER_01\n I can start.\n\n0:04:58\tSPEAKER_04\n Yeah, okay.\n\n0:04:59\tSPEAKER_04\n Okay.\n\n0:05:00\tSPEAKER_04\n My slides, please.\n\n0:05:07\tSPEAKER_04\n Okay.\n\n0:05:10\tSPEAKER_04\n Okay, come on, close already.\n\n0:05:17\tSPEAKER_04\n And that's number two, right?\n\n0:05:24\tSPEAKER_04\n Three.\n\n0:05:25\tSPEAKER_01\n Three.\n\n0:05:26\tSPEAKER_01\n But it's been three.\n\n0:05:28\tSPEAKER_01\n Yes.\n\n0:05:29\tNone\n Okay.\n\n0:05:30\tSPEAKER_01\n Now, as an interface designer, I would give more emphasis on the interface, how the remote looks like, so that it is sellable, it is attractive to customers.\n\n0:05:48\tSPEAKER_01\n Next, please.\n\n0:05:50\tSPEAKER_01\n Okay, now the function of a remote is to send messages to the television.\n\n0:05:57\tSPEAKER_01\n These messages could be a switch on of message or switch to next channel message or swapping the channels or switching on to a particular channel, like you can have the numbers 1, 2, 3, 4 up to 9.\n\n0:06:13\tSPEAKER_04\n 9, 9 channel switches, but me?\n\n0:06:18\tSPEAKER_01\n 9 channel switches.\n\n0:06:19\tSPEAKER_01\n Yes.\n\n0:06:20\tSPEAKER_01\n 9 numbers.\n\n0:06:23\tSPEAKER_01\n And then you have swapping button by which using which you can swap the channels.\n\n0:06:28\tSPEAKER_01\n If you don't want to see the third channel, you can swap it to the fourth channel or vice versa.\n\n0:06:35\tSPEAKER_01\n Then it should have a next button, next button channel by which you can keep on scrolling the channels one by one.\n\n0:06:47\tSPEAKER_01\n Next slide, please.\n\n0:06:50\tSPEAKER_01\n And you should have a button which can be used for increasing or decreasing the volume.\n\n0:06:58\tSPEAKER_01\n Then there should be a button which can give subtitles for a particular program which is going on at television.\n\n0:07:04\tSPEAKER_01\n For example, if you are watching a French program and you would like to have subtitles in English, then there should be a channel which can trigger this mechanism in the television so that the user can see the subtitles on the screen.\n\n0:07:22\tSPEAKER_01\n Then there should be some buttons which can control features like the color of the picture, the contrast, sharpness, brightness of the picture.\n\n0:07:33\tSPEAKER_01\n Now, there should be a memory switch.\n\n0:07:42\tSPEAKER_01\n There should be a mute button, suddenly if a viewer gets a telephone call and if he doesn't want to switch off the TV, but he can reduce the sound.\n\n0:07:55\tSPEAKER_01\n He can bring the volume down and he can watch while talking, he can watch the TV.\n\n0:08:02\tSPEAKER_01\n Now, the most important feature I would like to have in my remote would be the speech recognition feature.\n\n0:08:10\tSPEAKER_01\n It is an integrated programable sample sensor speaker unit.\n\n0:08:18\tSPEAKER_01\n So remote can be designed which can have the voice recognizers.\n\n0:08:24\tSPEAKER_01\n You can record your own voice which can be recognized by a voice recognizer in the television.\n\n0:08:34\tSPEAKER_01\n For example, if you want to see the 9th channel, if you say just say 9th channel, the remote will automatically switch to the 9th channel.\n\n0:08:48\tSPEAKER_01\n So the TV will have some recognizers which will recognize the user's voice and accordingly it will change its functionalities.\n\n0:08:55\tSPEAKER_01\n So this is one of the very important feature a remote control can have.\n\n0:09:01\tSPEAKER_01\n So this is one of the interface which can be created.\n\n0:09:07\tSPEAKER_01\n Very simple interface which has all the important features.\n\n0:09:14\tSPEAKER_01\n These are some of the remote which are different in shape and color, but they have many buttons.\n\n0:09:22\tSPEAKER_01\n So sometimes the user finds it very difficult to recognize which button is for what function and all that.\n\n0:09:28\tSPEAKER_01\n So you can design an interface which is very simple and which is user friendly.\n\n0:09:33\tSPEAKER_01\n Even a kid can use that.\n\n0:09:36\tSPEAKER_01\n So can you go on to the next slide?\n\n0:09:38\tSPEAKER_01\n Yeah.\n\n0:09:39\tSPEAKER_01\n So this is one of the interface or one of the remote which has this voice recognizer and this has multi-purpose use.\n\n0:09:46\tSPEAKER_01\n It can be used for TV.\n\n0:09:48\tSPEAKER_01\n It can be used for cables, satellites.\n\n0:09:50\tSPEAKER_01\n It can be used for VCR DVDs and audio.\n\n0:09:55\tSPEAKER_01\n And this has inbuilt voice recognizer.\n\n0:10:03\tSPEAKER_01\n Now this is an interface for a child, for a remote which a child can use.\n\n0:10:10\tSPEAKER_01\n This is user friendly.\n\n0:10:11\tSPEAKER_01\n It is very attractive and children can use it as well as they can play with it.\n\n0:10:16\tSPEAKER_01\n And this comes with different colors, different shapes.\n\n0:10:27\tSPEAKER_01\n And this child interface has minimum buttons and all the important buttons are there in this small compact attractive child interface.\n\n0:10:46\tSPEAKER_01\n Next slide please.\n\n0:10:47\tSPEAKER_01\n Now this is a big oversized remote which cannot be misplaced or it is impossible to\n\n0:10:54\tSPEAKER_02\n misplaced or loose.\n\n0:11:14\tSPEAKER_01\n This is one such interface which can be created. The personal preference would be to incorporate speech recognizers which will respond to users voice for a particular function.\n\n0:11:52\tSPEAKER_04\n Thank you very much.\n\n0:11:59\tSPEAKER_03\n Well, looks like we still have quite a choice of things out there.\n\n0:12:07\tSPEAKER_03\n No suggestion is bad.\n\n0:12:09\tSPEAKER_03\n But we are going to have to narrow it down a little more.\n\n0:12:11\tSPEAKER_03\n I don't think that we can get the two shape is good, the child one is good.\n\n0:12:17\tSPEAKER_03\n It is a too big to misplaced.\n\n0:12:19\tSPEAKER_03\n I think it is just funny.\n\n0:12:21\tSPEAKER_03\n I don't think that is going to be our impulse purchase at the checkout counter.\n\n0:12:28\tSPEAKER_04\n No, I think these are her presentations.\n\n0:12:31\tSPEAKER_04\n But as far as the decision making, we are getting to that later.\n\n0:12:36\tSPEAKER_04\n But if I just wanted to know whether anybody had anything to add to her presentation.\n\n0:12:42\tSPEAKER_03\n No, I think her presentation was good and she really explored all the options.\n\n0:12:47\tSPEAKER_04\n Who wants to go next?\n\n0:12:54\tSPEAKER_00\n The next one.\n\n0:13:04\tSPEAKER_04\n The components design.\n\n0:13:11\tSPEAKER_00\n This time I am going to concentrate more on the components and the technical side of the remote controller design.\n\n0:13:26\tSPEAKER_00\n Can you go on to the next slide please.\n\n0:13:30\tSPEAKER_00\n I have just brief down a few components which we require for the remote control construction.\n\n0:13:37\tSPEAKER_00\n The first one is case to keep all the components like integrated circuit, battery, etc.\n\n0:13:44\tSPEAKER_00\n It can be a plastic one, hard plastic so that it can be strong even if it falls down then it doesn't break.\n\n0:13:56\tSPEAKER_00\n It should be strong and there are no harmful materials used in that and it should be recyclable.\n\n0:14:03\tSPEAKER_00\n Good point.\n\n0:14:07\tSPEAKER_00\n We are also using of coloring components like if we want to have different colors, blue, red, green.\n\n0:14:14\tSPEAKER_00\n So we have to use some coloring component components.\n\n0:14:19\tSPEAKER_00\n The second important thing is integrated circuit.\n\n0:14:25\tSPEAKER_00\n We can use a highly sophisticated one because it is like the heart of the remote controller.\n\n0:14:30\tSPEAKER_00\n If it is not efficient then everything is going to be like the left is less efficient.\n\n0:14:36\tSPEAKER_00\n So we should have a highly sophisticated one and it should be resistant to high as well as low temperatures.\n\n0:14:43\tSPEAKER_00\n Suppose if it is 38 degrees outside, 40 degrees outside it should be able to resist the temperature high temperature and low temperatures.\n\n0:14:56\tSPEAKER_00\n It should be equipped with timer and alarm facility and the other component we have in the remote controller is a resistor which is like it is very much important for the electricity flow through the remote controller and also a capacitor which is a I think it is like a battery capacitor and you go to the next slide please.\n\n0:15:26\tSPEAKER_00\n A diode, a transistor, a resonator these are all this technical electronic components which we have to use in a remote controller.\n\n0:15:36\tSPEAKER_00\n A battery I would like to suggest one thing.\n\n0:15:41\tSPEAKER_00\n If we will be able to make a rechargeable battery then we need not go for a high performance battery.\n\n0:15:50\tSPEAKER_00\n Even if it is a low performance battery it can't charge much.\n\n0:15:54\tSPEAKER_00\n It is not a high voltage battery then also we can if it is a rechargeable one then people can use it for a long time.\n\n0:16:01\tSPEAKER_00\n So in that way we can cut the cost but that we have to make the battery as rechargeable one and we have a secured board in a remote controller can you go to the next slide please and how it works how the remote controller works.\n\n0:16:17\tSPEAKER_00\n When you press a button, when you press a button when you do that you complete a specific connection that means when you press a button there will be a small circuit underneath the button and it will send some signals through the wires and then the chip will send that connection and knows that which button is pressed.\n\n0:16:46\tSPEAKER_00\n Suppose you have pressed channel 1 button number 1 you have pressed then the chip will know that the number 1 button was pressed.\n\n0:16:54\tSPEAKER_00\n It produces a more more scored line signal specific to that button.\n\n0:16:58\tSPEAKER_00\n Every individual button has its own more scored.\n\n0:17:02\tSPEAKER_00\n Suppose the user has pressed button 1 then it will have the circuit will generate a specific more scored to that button and the transistor will amplify the signal and send them to the LED which translates the signal into infrared light.\n\n0:17:19\tSPEAKER_00\n You have got a signal by pressing a button that more scored has been generated by the integrated circuit.\n\n0:17:27\tSPEAKER_00\n Now that signal that more scored has to be amplified by the transistor that is the use of transistor which we use in the remote controller it will amplify the signal and it will send it to the LED and which translates the signal into an infrared bits.\n\n0:17:42\tSPEAKER_00\n The sensor in the TV can see the infrared light and seeing the signal it reacts appropriately that when it sees the amplified more scored signal then it will know which what action it has to do then it will do the appropriate action.\n\n0:18:01\tSPEAKER_00\n So this is how the remote controller works.\n\n0:18:05\tSPEAKER_00\n Can you go to the next slide please.\n\n0:18:07\tSPEAKER_00\n Yeah I have few pictures when you look at the remote controller it is this is a normal remote controller and to the next slide please and we had a few buttons and all and if you open the remote controller you have this circuit board and few electronic components like you can see a chip there which is having 18 pins and also a capacitor 3 resistors and also resonator.\n\n0:18:40\tSPEAKER_00\n And the diode transistor the electronic components all of the electronic components have all those things like chip and diode transistors.\n\n0:18:55\tSPEAKER_00\n You can see the TA, double 1, 835 labeled chip.\n\n0:19:03\tSPEAKER_00\n You can also see the green two green things are they are resistors and just beside that you can see a transistor and the cylinder shape that one is a capacitor and also there are resistors sorry there is a diode.\n\n0:19:22\tSPEAKER_00\n Can you go to the next slide.\n\n0:19:25\tSPEAKER_00\n So this is the circuit board the green one is a circuit board actually a building a circuit board is pretty easy and also it is inexpensive it is it costs less than what you print on a paper because when you when you are building some circuits some circuits and also wires it is it is better to go for printing because you can build these kind of circuit boards on a on a bulk and it is just printing nothing like you know you do not need to use wires and all it is not exactly wires we are using it is just printing something on a board that those prints will act as wires and circuits.\n\n0:20:06\tSPEAKER_00\n So that green thing is a circuit board and also you can see there are like access for buttons like when you press a button the circuit under the button will be activated it will it will get some signals from it and it will it will send the signals signals to the integrated circuit.\n\n0:20:28\tSPEAKER_00\n Can you go to the next slide please.\n\n0:20:31\tSPEAKER_00\n So this is these are the circuits underneath the buttons.\n\n0:20:35\tSPEAKER_00\n Can you see the black round marks there they are the circuits.\n\n0:20:41\tSPEAKER_00\n And like we have designed before we have seen some few things like instead of buttons we had some scrolls but a push button requires a simple chip underneath it but whereas a scroll wheel requires normally a regular chip which is a higher price range like for scrolls we have to go for a sophisticated and full complete chip.\n\n0:21:07\tSPEAKER_00\n And as energy source we offer a basic battery more engineers a hard dynamo a kinetic provision of energy modern watches that you shake casually to provide energy so with that also we can have in a battery or we can use solar cells.\n\n0:21:25\tSPEAKER_03\n That is interesting.\n\n0:21:27\tSPEAKER_00\n Yeah the product can be delivered into different cases usually the cases on curve flat that we see usually a normal remote controller.\n\n0:21:41\tSPEAKER_00\n Okay.\n\n0:21:42\tSPEAKER_04\n Yeah.\n\n0:21:43\tSPEAKER_04\n You have more pictures we have 5 minutes to the end of the meeting.\n\n0:21:47\tSPEAKER_00\n I have just one more slide I think.\n\n0:21:52\tSPEAKER_00\n We can have material such as plastic rubber wood titanium but titanium we cannot use and also for electronics we can use a simple and regular or an advanced chip on the print also it includes infrared sender.\n\n0:22:09\tSPEAKER_00\n Yeah and for the movie just to develop samples and speak sample speaker.\n\n0:22:16\tSPEAKER_00\n Yeah that is it.\n\n0:22:18\tSPEAKER_00\n It is all for me now.\n\n0:22:20\tSPEAKER_05\n Okay well thank you.\n\n0:22:22\tSPEAKER_04\n Any particular comments by anybody?\n\n0:22:26\tSPEAKER_03\n Yeah on the scroll on the push button.\n\n0:22:29\tSPEAKER_03\n You can achieve scrolling by repeatedly pushing a button.\n\n0:22:33\tSPEAKER_00\n No no no the scrolling was different like you can go for switches like buttons or scrolls which we used to do before 10 years before I think now nobody uses it because you need a sophisticated chip and all so I think it is better we go for it.\n\n0:22:50\tSPEAKER_00\n But ordinary buttons.\n\n0:22:51\tSPEAKER_03\n We will just go for push buttons for interest of cost.\n\n0:22:55\tSPEAKER_04\n We don't have a lot of time left and we will still have to make a decision at the marketing expert has to present her.\n\n0:23:00\tSPEAKER_04\n Okay.\n\n0:23:01\tSPEAKER_05\n You are right my first my next slide.\n\n0:23:04\tSPEAKER_05\n Okay.\n\n0:23:05\tSPEAKER_03\n All right my method is I'm interested in what the competition is doing and want to see how we can make ourselves different from the competition so I have really been looking at the press and the ads that are out there for other remote controllers.\n\n0:23:22\tSPEAKER_03\n I spend a lot of time on the internet surfing around doing the same thing and then when I'm out in people's houses or meetings or anything like that I try to notice what kind of remote controls people have and if it can be in the conversation I ask about it and I would encourage you all to do the same.\n\n0:23:42\tSPEAKER_03\n And my findings from this is that you know small is beautiful.\n\n0:23:47\tSPEAKER_03\n Like something that really fits in their hand.\n\n0:23:50\tSPEAKER_03\n Simple is beautiful.\n\n0:23:51\tSPEAKER_03\n They don't want to have to squint at small print.\n\n0:23:55\tSPEAKER_03\n They want buttons whose functions are obvious and they want as few buttons as possible and they don't care for the mode thing.\n\n0:24:03\tSPEAKER_03\n They want each button to do something and eye catching is important.\n\n0:24:06\tSPEAKER_03\n It's got to look cute.\n\n0:24:07\tSPEAKER_03\n It's got to look appealing.\n\n0:24:08\tSPEAKER_03\n Go ahead I'm trying to finish fast with you.\n\n0:24:13\tSPEAKER_03\n And our preference is as far as I'm concerned we've got to get to the market before the competition.\n\n0:24:18\tSPEAKER_03\n As has to be look really great and it has to come out before the others so that we have a leg up on time to sell it and push it before other people get out there.\n\n0:24:28\tSPEAKER_03\n Christmas item.\n\n0:24:29\tSPEAKER_03\n We should develop one or two features we can really dwell on in our ad campaign.\n\n0:24:33\tSPEAKER_03\n If we try to sell people it has too many great features the consumer just gets confused and we don't get anywhere.\n\n0:24:40\tSPEAKER_03\n So we've got to narrow our selection down to two things I think that we're going to say are really great about our new product.\n\n0:24:49\tSPEAKER_03\n And I've been looking around at what designs every year different things are popular.\n\n0:24:54\tSPEAKER_03\n And in my research this year I found out that fruit and vegetable shapes are really popular.\n\n0:24:59\tSPEAKER_03\n And people are tired of hard plastic and hard metal.\n\n0:25:03\tSPEAKER_03\n They're more back into soft feel, spongy feeling things, things with maybe a little cloth on them.\n\n0:25:09\tSPEAKER_03\n So those are things we want to look at as far as the salability of the item.\n\n0:25:17\tSPEAKER_04\n Okay.\n\n0:25:20\tSPEAKER_04\n That concludes the presentation of everyone.\n\n0:25:25\tSPEAKER_04\n And what we really have to decide in this meeting is the concept of the remote.\n\n0:25:34\tSPEAKER_04\n And so what do we think on the concept of the remote?\n\n0:25:45\tSPEAKER_03\n You want to try to come back to yours and I would like to include this feature which is\n\n0:25:50\tSPEAKER_01\n called as voice recognizer.\n\n0:25:52\tSPEAKER_05\n Okay.\n\n0:25:53\tSPEAKER_03\n So speech recognition is most important as far as you're concerned.\n\n0:26:00\tSPEAKER_01\n This could be a one feature which could be salable.\n\n0:26:02\tSPEAKER_03\n Yeah, that could be our star feature. That would be really good.\n\n0:26:06\tSPEAKER_03\n Yeah.\n\n0:26:07\tSPEAKER_00\n I agree with that.\n\n0:26:08\tSPEAKER_00\n But I'm very, very much doubtful how far it will work because speech recognizer like it has its own problem.\n\n0:26:17\tSPEAKER_00\n Distance problems.\n\n0:26:18\tSPEAKER_00\n Yeah, it's not distance problem.\n\n0:26:19\tSPEAKER_00\n It's recognizing a person's voice.\n\n0:26:22\tSPEAKER_00\n Like maybe different people will be having different voices.\n\n0:26:24\tSPEAKER_00\n Okay.\n\n0:26:25\tSPEAKER_00\n Well, you teach.\n\n0:26:28\tSPEAKER_04\n You have to teach.\n\n0:26:29\tSPEAKER_00\n I get a good recognizer.\n\n0:26:30\tSPEAKER_01\n No, it's like you're recording a question already and then you're expecting an answer from, for example, you have a TV system.\n\n0:26:42\tSPEAKER_01\n I'm the user and my family members are the user.\n\n0:26:45\tSPEAKER_01\n I will already record a question like good morning, like around 8 o'clock.\n\n0:26:51\tSPEAKER_01\n I want to see the news in the television.\n\n0:26:54\tSPEAKER_01\n So I'll say just good morning and the TV will switch on.\n\n0:26:57\tSPEAKER_01\n It will recognize my voice.\n\n0:26:59\tSPEAKER_04\n Okay, before we get too far off here, the components of the concept is the energy.\n\n0:27:06\tSPEAKER_04\n What kind of energy do we foresee?\n\n0:27:08\tSPEAKER_04\n Battery.\n\n0:27:09\tSPEAKER_04\n I think battery.\n\n0:27:10\tSPEAKER_03\n Battery.\n\n0:27:11\tSPEAKER_03\n I think we all agree on that.\n\n0:27:13\tSPEAKER_03\n That's going to be most cost effective and the best thing.\n\n0:27:17\tSPEAKER_04\n Okay, then chip on print.\n\n0:27:19\tSPEAKER_04\n Yeah.\n\n0:27:20\tSPEAKER_04\n Yes.\n\n0:27:21\tSPEAKER_04\n Okay.\n\n0:27:22\tSPEAKER_04\n And the case.\n\n0:27:23\tSPEAKER_04\n And I think we all agree on the case.\n\n0:27:24\tSPEAKER_04\n We want to have something maybe bright, colourful.\n\n0:27:27\tSPEAKER_04\n Yeah.\n\n0:27:28\tSPEAKER_03\n And compact design.\n\n0:27:30\tSPEAKER_03\n And compact.\n\n0:27:31\tSPEAKER_03\n And compact.\n\n0:27:32\tSPEAKER_04\n And compact.\n\n0:27:33\tSPEAKER_05\n Mm-hmm.\n\n0:27:34\tSPEAKER_04\n Trendy design.\n\n0:27:36\tSPEAKER_04\n Compact and strong.\n\n0:27:37\tSPEAKER_04\n Mm-hmm.\n\n0:27:38\tNone\n Yes.\n\n0:27:39\tSPEAKER_04\n User interface concept.\n\n0:27:43\tSPEAKER_04\n Interface type supplements.\n\n0:27:46\tSPEAKER_04\n That would be your area, I think.\n\n0:27:52\tSPEAKER_04\n Yeah.\n\n0:27:53\tSPEAKER_00\n Like switches, like we use buttons for user interface.\n\n0:27:58\tSPEAKER_00\n Push buttons.\n\n0:27:59\tSPEAKER_00\n Push buttons.\n\n0:28:00\tSPEAKER_04\n I guess for, yeah.\n\n0:28:05\tSPEAKER_04\n And I'm not sure what they mean by supplements.\n\n0:28:09\tSPEAKER_04\n Well, I think.\n\n0:28:10\tSPEAKER_01\n Supplements are different types of features, buttons.\n\n0:28:12\tSPEAKER_01\n Yeah.\n\n0:28:13\tSPEAKER_01\n Or like our speech recognition.\n\n0:28:14\tSPEAKER_02\n Or it would also be a supplement.\n\n0:28:16\tSPEAKER_02\n Our speech recognition.\n\n0:28:17\tSPEAKER_02\n Right.\n\n0:28:18\tSPEAKER_02\n Right.\n\n0:28:19\tSPEAKER_03\n So why don't we put down speech recognition if possible.\n\n0:28:23\tSPEAKER_03\n Depending some more research from our industrial engineer on how expensive that is.\n\n0:28:27\tSPEAKER_03\n Right.\n\n0:28:28\tNone\n Yes.\n\n0:28:31\tSPEAKER_04\n OK.\n\n0:28:34\tSPEAKER_04\n Our next meeting will be in 30 minutes.\n\n0:28:36\tSPEAKER_04\n And the ID is to, this is the individual actions to be taken until then, to have the look and feel design.\n\n0:28:48\tSPEAKER_04\n And the UID is supposed to come up with the user interface design.\n\n0:28:58\tSPEAKER_04\n And the marketing expert with the product evaluation.\n\n0:29:03\tSPEAKER_04\n In this phase, the two of you, Yana and Francine, have to work together on a prototype using modeling clay.\n\n0:29:10\tSPEAKER_04\n It says here.\n\n0:29:12\tSPEAKER_04\n You will receive specific instructions.\n\n0:29:16\tSPEAKER_04\n We'll be sent to you by your coaches.\n\n0:29:18\tSPEAKER_04\n OK.\n\n0:29:20\tSPEAKER_04\n If you have any questions, you can always contact me or your coach, I suppose.\n\n0:29:31\tSPEAKER_04\n Where were they hiding?\n\n0:29:34\tSPEAKER_04\n So I think we conclude the meeting here.\n\n0:29:37\tSPEAKER_04\n And we come back in 30 minutes, according to our time table here.\n\n0:29:47\tSPEAKER_05\n Thank you very much.\n\n0:29:48\tSPEAKER_05\n Thank you.\n\n", "summary": [{"summary_text": "In the last meeting, the marketing manager presented her method of working to find the best way to market the product within the budget that was given. The idea is that it should be not difficult to use, easy to learn and attractive. It should have a chip that has infrared bits and has an interface controls, interface that controls the chip and messages will be controlled in the same manner. The components of the thing should be button bulbs, infrared bulbs, battery chips, wires, and maybe some kind of a holder for the item."}]}