{"filename": "./data/IS1008a.txt", "transcript": "0:00:30\tSPEAKER_03\n Hops.\n\n0:00:34\tSPEAKER_03\n Haaaaarh!\n\n0:00:36\tNone\n Haaarh!\n\n0:00:38\tSPEAKER_03\n Haha!\n\n0:00:41\tNone\nã\u0081\u0082ã\u0081\u0081!\n\n0:00:43\tNone\n Mom!\n\n0:00:49\tSPEAKER_01\n Hai Faqypro!\n\n0:00:50\tSPEAKER_01\n Haha!\n\n0:00:52\tSPEAKER_01\n Huwwwwwwww...\n\n0:00:58\tSPEAKER_01\n a project manager for this new project which we are going to discuss now.\n\n0:01:03\tSPEAKER_01\n So I want to introduce first of all the names and the colleagues here and what you are doing.\n\n0:01:13\tSPEAKER_02\n Sure, my name is Agnes and I'm a user usability user interface designer.\n\n0:01:20\tSPEAKER_00\n My name is Ed and I do accounting.\n\n0:01:27\tSPEAKER_01\n How you spell your name?\n\n0:01:29\tSPEAKER_01\n ED.\n\n0:01:30\tSPEAKER_01\n ED, okay.\n\n0:01:35\tSPEAKER_03\n Do you also do marketing?\n\n0:01:36\tSPEAKER_03\n No.\n\n0:01:37\tSPEAKER_01\n So only accounting.\n\n0:01:40\tSPEAKER_00\n Accounting, yes.\n\n0:01:41\tSPEAKER_01\n Right.\n\n0:01:43\tSPEAKER_03\n And I'm Christine and my role in this scenario is to be the industrial designer.\n\n0:01:49\tSPEAKER_01\n So who is marketing?\n\n0:01:51\tSPEAKER_03\n Marketing is me.\n\n0:01:53\tSPEAKER_00\n So thanks for coming for the meeting first of all and we have a long time, just 25 minutes,\n\n0:02:01\tSPEAKER_01\n to discuss about this project and the project initiation. First of all, I want to ask Mr. Ed about your marketing plan and your product plan.\n\n0:02:21\tSPEAKER_01\n I think we will see that throughout the day and how we are going to put this together as a marketing\n\n0:02:27\tSPEAKER_00\n to market the product. We will have to see through discussion on where we are going to go from here and from with us.\n\n0:02:35\tSPEAKER_01\n But do you already have a functional design or technical design?\n\n0:02:41\tSPEAKER_01\n For the moment.\n\n0:02:43\tSPEAKER_01\n Not yet.\n\n0:02:45\tSPEAKER_01\n But what do you have some project plan?\n\n0:02:49\tSPEAKER_01\n Something or?\n\n0:02:51\tSPEAKER_00\n Good question.\n\n0:02:53\tSPEAKER_00\n Now this is like I said, we have to be discussed between all of us and we will go from there.\n\n0:02:57\tSPEAKER_00\n We have to, we have to work on it together.\n\n0:03:01\tSPEAKER_01\n So by when you think you can give me some kind of project plan, discussion will be discussed.\n\n0:03:09\tSPEAKER_01\n Certainly by the next meeting.\n\n0:03:11\tSPEAKER_01\n By next meeting, it will be great.\n\n0:03:21\tSPEAKER_01\n So does any question for Mr. Fawar about this project?\n\n0:03:27\tSPEAKER_03\n Where is the goal of the project?\n\n0:03:29\tSPEAKER_01\n The goal of the project, I think maybe I will hand out to the 8.\n\n0:03:33\tSPEAKER_01\n Explain the project, the geese and the sales and the echo.\n\n0:03:39\tSPEAKER_00\n I am in the sale, I was explaining what the, we have to define exactly what our product is from.\n\n0:03:47\tSPEAKER_01\n Yes, so can you explain what exactly the product is?\n\n0:03:51\tSPEAKER_00\n From what I had in mind, we were supposed to be marketing coffee.\n\n0:03:55\tSPEAKER_00\n Is that right?\n\n0:03:57\tSPEAKER_01\n I think if I am not wrong, we are making the remote control.\n\n0:04:01\tSPEAKER_01\n Remote control, because I had two different things.\n\n0:04:03\tSPEAKER_00\n I have the first part of mine was to make a remote control for new remote control for television.\n\n0:04:09\tSPEAKER_00\n And after I had a discussion about coffee, so we will start with the remote control for television then.\n\n0:04:17\tSPEAKER_00\n So we have to design something that is very user friendly.\n\n0:04:21\tSPEAKER_00\n Something visually has something that will draw people to buy the product.\n\n0:04:29\tSPEAKER_00\n Because I think everybody is experienced with remote controls and some remote controls are worth throwing out the window.\n\n0:04:37\tSPEAKER_00\n Most of them, I don't know, we have to come up with a new idea on how to make it a lot easier to use.\n\n0:04:47\tSPEAKER_00\n That's a lot of times spend half a day through the instruction book trying to figure out how to use it.\n\n0:04:53\tSPEAKER_01\n And what about your industrial design plan?\n\n0:04:59\tSPEAKER_01\n All you have a design already on this product or you are still working on the design?\n\n0:05:07\tSPEAKER_03\n No, I have not begun working on the design.\n\n0:05:11\tSPEAKER_03\n I actually didn't know we were designing a remote control.\n\n0:05:17\tSPEAKER_03\n I thought we were designing a new monitor.\n\n0:05:21\tSPEAKER_03\n The website I went to look at had some announcements about an introduction of a seven inch monitor.\n\n0:05:33\tSPEAKER_03\n And I understood that that was the project goal.\n\n0:05:41\tSPEAKER_03\n I'm glad I didn't do any work ahead of time because I clearly didn't understand the project goal.\n\n0:05:47\tSPEAKER_03\n I just did see that we were starting a new project together and there was going to be a four member team, composed of these people.\n\n0:05:57\tSPEAKER_03\n That's about, and I read through the different steps and what my responsibilities were relative to those steps.\n\n0:06:03\tSPEAKER_01\n So you will be leading the team for your design team or how many members is working in the team for the design?\n\n0:06:09\tSPEAKER_03\n For the industrial design?\n\n0:06:11\tSPEAKER_03\n Yes.\n\n0:06:13\tSPEAKER_03\n Well, I think that depends on how much money he gives us.\n\n0:06:17\tSPEAKER_03\n Because you know, he can make it...\n\n0:06:23\tSPEAKER_03\n You have different choices with different financial models.\n\n0:06:27\tSPEAKER_01\n But before we talk about the finance, do you have some idea how we can sell this product or project in the market?\n\n0:06:35\tSPEAKER_01\n And how much is going to benefit to the company and of course it's to the individual also?\n\n0:06:43\tSPEAKER_03\n You know, I kind of think that in general you have to do... you have to have something that's very fashionable.\n\n0:06:53\tSPEAKER_03\n That's a very attractive that people see and recognize its goal and they immediately want to have it have one of their own.\n\n0:07:05\tSPEAKER_03\n So I think that you need to... something like the iPod would be good, seems to have caught on fairly well.\n\n0:07:13\tSPEAKER_03\n So you know, I don't care what it does, just so it looks cool.\n\n0:07:17\tSPEAKER_01\n Okay.\n\n0:07:19\tSPEAKER_01\n But when you think you can give me like a kind of design on the functional design or the technical design?\n\n0:07:27\tSPEAKER_03\n Well, I've got a lot of other projects I'm doing right now.\n\n0:07:31\tSPEAKER_03\n And so I'll have to wait and see how those go.\n\n0:07:35\tSPEAKER_03\n If they go quickly then it could be a month.\n\n0:07:39\tSPEAKER_03\n If I run into any problems in my other projects, it might be six months.\n\n0:07:43\tSPEAKER_01\n Yeah, but I need something in the writing.\n\n0:07:47\tSPEAKER_01\n So like what's your functional design, what's your technical design?\n\n0:07:51\tSPEAKER_01\n And how many people you need for this project? And what's the time frame you're looking?\n\n0:07:55\tSPEAKER_01\n Okay. And what is the budget? Maybe the initial budget you're looking.\n\n0:07:59\tSPEAKER_01\n Okay. And how is going to the market? Okay. So you have to meet with the marketing team and how they're going to market.\n\n0:08:05\tSPEAKER_01\n And what are the marketing strategy plan? Okay.\n\n0:08:08\tSPEAKER_01\n And now you're going to introduce. Okay. And by the time you introduce the product and you know there will be a competition.\n\n0:08:15\tSPEAKER_01\n Okay. So I need some kind of the plan in the writing from you. Okay.\n\n0:08:21\tSPEAKER_01\n And what would you like that?\n\n0:08:23\tSPEAKER_01\n As soon as possible.\n\n0:08:27\tSPEAKER_03\n Well, if we have enough time, then do you think two weeks is close enough?\n\n0:08:37\tSPEAKER_01\n Yes, I think that would be good because I need to go to the management and tell them what we are going to do.\n\n0:08:42\tSPEAKER_01\n And what's cost-stress, okay. And what's the time frame and what's the project plan?\n\n0:08:47\tSPEAKER_01\n Because without any documentation, so I cannot go to the management and say, we are going to do this and we need this much money. Okay. So then it's difficult for me to say. Okay.\n\n0:08:57\tSPEAKER_01\n That's the reason I need some kind of plan from you initially. Okay.\n\n0:09:01\tSPEAKER_01\n Then we can have the further discussion again.\n\n0:09:05\tSPEAKER_03\n Are there other people who will be contributing to the plan?\n\n0:09:09\tSPEAKER_01\n Yes, of course. If you did some help, so let me know.\n\n0:09:12\tSPEAKER_01\n So for the people you need from the marketing or the technical side or the administration point of you, to add in any documentation or some technical point of view.\n\n0:09:23\tSPEAKER_01\n So just let me know so I can coordinate all the teams. Okay. Get back to you on that.\n\n0:09:27\tSPEAKER_01\n Thank you.\n\n0:09:29\tSPEAKER_01\n And Ed, so what do you think about this project for the remote control?\n\n0:09:35\tSPEAKER_01\n And do you have some already planned something for your marketing strategy or the sales strategy?\n\n0:09:41\tSPEAKER_00\n Well, not yet. I've been doing research and taking remote controls and looking what other companies have to do with their building, their designs, their ideas.\n\n0:09:51\tSPEAKER_00\n I also have to pinpoint which market we're going to go into.\n\n0:09:55\tSPEAKER_00\n This should be a fairly large market because there are a number of people that the competition.\n\n0:10:01\tSPEAKER_00\n I agree. It has to be something new.\n\n0:10:05\tSPEAKER_00\n It has to be something that draws people saying, hey, I like this.\n\n0:10:09\tSPEAKER_00\n Whether it works or not, they have to first say, I like this. I like the design.\n\n0:10:13\tSPEAKER_00\n And then it's got to be simple to use.\n\n0:10:15\tSPEAKER_01\n Yes. So what I prefer, maybe you need to interact more with the Christine.\n\n0:10:21\tSPEAKER_01\n Because you know what she's going to do it.\n\n0:10:25\tSPEAKER_01\n And you know how to sell it.\n\n0:10:27\tSPEAKER_01\n Because she's doing the design, but you're the core because you're in the marketing.\n\n0:10:33\tSPEAKER_01\n Because you need to sell it and you're responsible for all the money, the finance to more.\n\n0:10:39\tSPEAKER_01\n So what I prefer, you need to interact with the Christine more.\n\n0:10:43\tSPEAKER_01\n And within her team who is doing the functional design or technical design.\n\n0:10:49\tSPEAKER_01\n You need to come up with some kind of plan. How are we going to do the sales plan?\n\n0:10:55\tSPEAKER_00\n We already have a cost limit on this.\n\n0:10:59\tSPEAKER_00\n The idea of how much we want to market this for. How much is it going to sell for?\n\n0:11:03\tSPEAKER_01\n That's the best of us to decide.\n\n0:11:05\tSPEAKER_01\n So the best thing is you both of the Christine and you discuss with yourself.\n\n0:11:11\tSPEAKER_01\n And come up with the cost and how we are going to compete in the market.\n\n0:11:17\tSPEAKER_01\n In the technically or in the sales wise, the commercial wise.\n\n0:11:21\tSPEAKER_01\n Then we have to design how long it will take the whole project.\n\n0:11:25\tSPEAKER_01\n How much is going to cost us and how much we are going to benefit for the company.\n\n0:11:31\tSPEAKER_01\n Of course, it's a benefit for everybody individual.\n\n0:11:37\tSPEAKER_01\n So I think it's maybe if you can give me some kind of your the sales plan.\n\n0:11:43\tSPEAKER_01\n Including the technical what she's going to talk to you within the team.\n\n0:11:47\tSPEAKER_01\n Then it will help me to discuss with the management for further and put it in the proper project plan.\n\n0:11:55\tSPEAKER_01\n If you need any coordination in between, compared to some technical vendors or commercial vendors.\n\n0:12:03\tSPEAKER_01\n If you want to have some marketing plan or technical plan, so let me know.\n\n0:12:09\tSPEAKER_01\n I can coordinate. Or maybe you have my coordinate.\n\n0:12:15\tSPEAKER_02\n Well, no, not exactly. My job from what I understood was to look at the usability requirements.\n\n0:12:25\tSPEAKER_02\n And make sure that the product is usable.\n\n0:12:27\tSPEAKER_02\n It's acceptable to the people who are going to use it and look at the best ways to do that.\n\n0:12:31\tSPEAKER_02\n So I think I'll have to interact with Christine and discuss with her.\n\n0:12:35\tSPEAKER_02\n So that she's not designing something that my studies will show right off the bat that it's not going to work.\n\n0:12:41\tSPEAKER_02\n And so it's sort of it's a loop that feeds in, but I don't think necessarily that I'm in a coordinating position.\n\n0:12:51\tSPEAKER_01\n So basically you need to interact with Christine more for the user acceptability and the testing.\n\n0:12:59\tSPEAKER_02\n Which will also feed into the marketing because depending on what users want depends on how you sell it, what tag lines you attach to it, how you try to make it more attractive to you.\n\n0:13:10\tSPEAKER_02\n So I think all three groups will need to interact quite a bit.\n\n0:13:18\tSPEAKER_02\n And then I guess build the plan based on all of that.\n\n0:13:22\tSPEAKER_02\n Because I think you need to take all the factors into account.\n\n0:13:25\tSPEAKER_01\n But what I request, okay, the keep add in the loop.\n\n0:13:28\tSPEAKER_01\n Yeah, of course.\n\n0:13:29\tSPEAKER_01\n You were meeting and Christine meeting because he should know what's happening.\n\n0:13:34\tSPEAKER_01\n Yeah, we can see him on any discussions or documents that are passed out.\n\n0:13:37\tSPEAKER_01\n So all the discussions to me, okay, I need to submit to the management.\n\n0:13:42\tSPEAKER_02\n No problem.\n\n0:13:44\tSPEAKER_01\n So any questions for time being?\n\n0:13:54\tSPEAKER_02\n So the immediate next step is to start determining the functional design.\n\n0:14:00\tSPEAKER_02\n Yes.\n\n0:14:01\tSPEAKER_02\n Okay.\n\n0:14:03\tSPEAKER_01\n So come up with the functional design and to discuss with add, okay, how it's going to be work.\n\n0:14:09\tSPEAKER_01\n And first of all, with your user acceptance, okay, how it looks like and how it's going to be work in the market.\n\n0:14:16\tSPEAKER_01\n Okay.\n\n0:14:17\tSPEAKER_01\n So then we can discuss about further things.\n\n0:14:19\tSPEAKER_01\n Okay.\n\n0:14:20\tSPEAKER_01\n So we'll meet where the will discuss on the further meeting.\n\n0:14:25\tSPEAKER_01\n Okay.\n\n0:14:26\tSPEAKER_01\n Thanks for coming.\n\n0:14:27\tSPEAKER_03\n Would you mind at the conclusion of our meeting, could you send us a copy of your slides?\n\n0:14:32\tSPEAKER_03\n Yes.\n\n0:14:33\tSPEAKER_01\n I would.\n\n0:14:34\tSPEAKER_01\n Yeah, that would be a secret.\n\n0:14:35\tSPEAKER_01\n Yes.\n\n0:14:36\tSPEAKER_01\n I'll copy.\n\n0:14:37\tSPEAKER_01\n Let us keep all the emails and all the copies.\n\n0:14:40\tSPEAKER_01\n So, we share each other.\n\n0:14:41\tSPEAKER_01\n Okay.\n\n0:14:42\tSPEAKER_01\n So you know everybody what's happening.\n\n0:14:44\tSPEAKER_01\n Sure.\n\n0:14:45\tNone\n Okay.\n\n0:14:46\tSPEAKER_01\n And if anything, you need any time.\n\n0:14:48\tSPEAKER_01\n So please either you can call me or just send me email or just come and knock my door.\n\n0:14:54\tSPEAKER_01\n Okay.\n\n0:14:55\tSPEAKER_01\n So I'm available here.\n\n0:14:56\tSPEAKER_01\n Okay.\n\n0:14:57\tSPEAKER_01\n Okay.\n\n0:14:58\tSPEAKER_01\n Thank you.\n\n0:14:59\tSPEAKER_01\n Thanks for coming and I wish you nice time then.\n\n0:15:01\tSPEAKER_01\n Thank you.\n\n0:15:02\tSPEAKER_01\n See you later.\n\n0:15:31\tNone\n Bye.\n\n0:15:32\tNone\n Bye.\n\n0:15:33\tNone\n Bye.\n\n", "summary": [{"summary_text": "SPEAKER is a project manager for a new project. His colleagues are Agnes, Ed, Christine and Ed, who do accounting and marketing, and Christine is an industrial designer. They are going to discuss the project and the project initiation in the next meeting."}]}