{"filename": "./data/IS1005c.txt", "transcript": "0:00:30\tNone\n Hanna, Hello, This meeting should be focused on conceptual design of the remote control.\n\n0:00:50\tSPEAKER_03\n The goal of this meeting is to reach a decision at the end of the concept I think the last time we talked about and we had a rough idea of what is going to be but at the end of this meeting we have to reach a decision.\n\n0:01:12\tSPEAKER_03\n So, we will have again three presentations from all of you and I hope it will be fast because I would like to have time to have a long discussion and decisions.\n\n0:01:29\tSPEAKER_03\n So, we want to start.\n\n0:01:33\tSPEAKER_01\n I so...\n\n0:01:34\tSPEAKER_01\n Okay.\n\n0:01:35\tSPEAKER_01\n No, no.\n\n0:01:36\tSPEAKER_01\n You get a start.\n\n0:01:37\tSPEAKER_01\n Okay, I'll start.\n\n0:01:38\tSPEAKER_00\n Can you open my presentation please?\n\n0:01:40\tSPEAKER_00\n Good.\n\n0:01:50\tSPEAKER_00\n The number four.\n\n0:01:54\tSPEAKER_03\n I'm trying this one.\n\n0:01:55\tSPEAKER_03\n Yep.\n\n0:02:01\tSPEAKER_00\n Can you pass the mouse please?\n\n0:02:03\tSPEAKER_00\n Okay, that's fine.\n\n0:02:05\tSPEAKER_00\n Okay.\n\n0:02:06\tSPEAKER_00\n So, basically I just want to present to you some recent results we've had from looking at some remote control market research and some fashion trends around the world.\n\n0:02:23\tSPEAKER_00\n Fashion trends we got from talking to our contacts in the fashion industry based in Paris and Milan.\n\n0:02:29\tSPEAKER_00\n So, from our market research, basically we've come to the conclusion that a fancy look and feel as opposed to a functional look and feel is our number one priority.\n\n0:02:44\tSPEAKER_00\n Fancy is the highest priority.\n\n0:02:47\tSPEAKER_00\n Secondly, that our remote control needs to be technologically innovative.\n\n0:02:54\tSPEAKER_00\n So, this is number two priority but it's two times less important as the fancy criteria.\n\n0:03:02\tSPEAKER_00\n And thirdly, the easiness of use is important as well but again two times less important as the technologically innovativeness of the remote control.\n\n0:03:15\tSPEAKER_00\n From our fashion people in Paris and Milan, we've discovered that this year fruit, the fruit and vegetable motif will be the most important thing in clothes, shoes and furniture.\n\n0:03:33\tSPEAKER_00\n So, I'm pretty confident that our remote control fits into the furniture category.\n\n0:03:40\tSPEAKER_00\n And also, the feel of material this year is expected to be spongy.\n\n0:03:50\tSPEAKER_00\n So, hopefully our remote control reflects that in some way.\n\n0:03:54\tSPEAKER_02\n What does it mean spongy?\n\n0:03:57\tSPEAKER_00\n Sort of squishy.\n\n0:04:00\tSPEAKER_00\n Like soft or something?\n\n0:04:01\tSPEAKER_00\n Yeah, soft. Like a sponge.\n\n0:04:04\tSPEAKER_00\n Okay.\n\n0:04:07\tSPEAKER_00\n So, in conclusion, our remote control needs to be something that's really fancy.\n\n0:04:13\tSPEAKER_00\n It has lots of technology in it.\n\n0:04:17\tSPEAKER_00\n Somehow, we'd be good to have it related to fruit and vegetables with this spongy feel.\n\n0:04:22\tSPEAKER_00\n And that's easy to use.\n\n0:04:25\tSPEAKER_00\n And from our last meeting, Fabian taught us that one of the requirements is that we have to reflect the look and feel of the real reaction company.\n\n0:04:39\tSPEAKER_03\n Is it to use?\n\n0:04:43\tSPEAKER_03\n As much as important and technology of fancy things.\n\n0:04:46\tSPEAKER_03\n It's less important, right?\n\n0:04:48\tSPEAKER_00\n Less important.\n\n0:04:49\tSPEAKER_00\n So, fancy-ness first and then 2.5 is important as that is technology.\n\n0:04:56\tSPEAKER_00\n And then half important as technology is easy to use.\n\n0:05:02\tSPEAKER_03\n So, Ahmed, can you?\n\n0:05:04\tSPEAKER_03\n Yeah, please.\n\n0:05:07\tSPEAKER_01\n I'll show the presentation number 3.\n\n0:05:11\tSPEAKER_02\n I think the biggest struggle will be the easy to use feature.\n\n0:05:15\tSPEAKER_03\n Yeah. And number 3.\n\n0:05:22\tSPEAKER_03\n This one?\n\n0:05:24\tSPEAKER_01\n Yes.\n\n0:05:30\tSPEAKER_01\n I just could you please check if it is the first one or the second?\n\n0:05:37\tSPEAKER_01\n No, no, no, it's the first one.\n\n0:05:39\tSPEAKER_01\n The second one.\n\n0:05:40\tSPEAKER_03\n So, it's not this one.\n\n0:05:47\tNone\n Okay.\n\n0:05:49\tSPEAKER_00\n Okay.\n\n0:05:52\tSPEAKER_01\n So, I'm going to talk about a little bit about how this remote control should be appear to be more easy to use.\n\n0:06:04\tSPEAKER_01\n I think the feature is more important than being fancy, but we can discuss about it later.\n\n0:06:13\tSPEAKER_01\n Generally, this remote control should be something in my opinion.\n\n0:06:24\tSPEAKER_01\n The first feature is just to be easy to use.\n\n0:06:27\tSPEAKER_01\n So, the more frequent buttons should be larger, they should be placed in a good position inside the remote control.\n\n0:06:37\tSPEAKER_01\n And I can conclude like this that we shouldn't need to learn how to use it.\n\n0:06:44\tSPEAKER_01\n We shouldn't need to open a book and start reading and learning how to use this remote control.\n\n0:06:56\tSPEAKER_01\n Okay.\n\n0:06:59\tSPEAKER_01\n So, what I found out that, as I said, I think it's better to put more frequent buttons which are used more in the middle of the remote control.\n\n0:07:14\tSPEAKER_01\n And they should be bigger in size.\n\n0:07:17\tSPEAKER_01\n The shape of remote control should be in a way which should be taken easily in hand, it should not be completed like a cube.\n\n0:07:29\tSPEAKER_01\n It should have round edge, so then it's easier and maybe just like some toys, some joystick which is easier to take inside the hand.\n\n0:07:41\tSPEAKER_01\n And also, because customer doesn't like to buy a glass of battery, it should not consume a glass of energy.\n\n0:07:56\tSPEAKER_01\n Okay. And my personal preference is, as I said, just putting these buttons in special places and cover some buttons which are not used that much, like settings buttons, like mobile phones, usually some mobile phones cover the dialing number part.\n\n0:08:19\tSPEAKER_01\n So, we can cover these buttons which are not used or number buttons for the channels and just put volume change or channel change buttons in the remote control.\n\n0:08:37\tSPEAKER_01\n And if the user needed to do some more complex tasks, he can open the cover and change settings or something like this.\n\n0:08:49\tSPEAKER_01\n And also, I think if we put some buttons in size of the remote control, it can be used easier, not unremote control. I don't know if I can explain well, but just in size, for example, sliding or rolling stuff, if we put it in size, then we can easily manipulate it with a thumb.\n\n0:09:17\tSPEAKER_01\n So, it can be another preference. And I don't know, but I think you, the specific recognizer can be good. I know that it consumes lots of energy, but if we do it in some way, that it slips when there is no sound and when it detects some sound, it may consume less energy.\n\n0:09:40\tSPEAKER_01\n And I think it's good because it's something new and usually young people like something new. So, it may not be very useful, but because it's new people may buy it.\n\n0:09:54\tSPEAKER_01\n I personally think there should be a big difference between something, otherwise they prefer to buy something which is coming from a famous company.\n\n0:10:12\tSPEAKER_02\n Okay, so good news for me, for me from Hamet, but Benius from Bob, obviously because it's a pointy design, I don't know if it's an engine, but...\n\n0:10:24\tSPEAKER_02\n Could you please go beyond opening? Yeah, I'm present too. And which one? Probably the first one, I'm not sure, but the first one. Most of the things I have to write myself on this board, but yeah, that's it.\n\n0:10:47\tSPEAKER_02\n It's only this slide. Yeah, this is just one thing I wanted to mention and show you that I just found this, that our company developed seven fingers or an inch TFT screen, which is good news for us since we wanted to include the display there.\n\n0:11:15\tSPEAKER_02\n So, I probably draw it down the overall scheme. This is the stuff that I can use.\n\n0:11:28\tSPEAKER_02\n Okay, so this will be like the overall scheme or overall requirements from the engineering point of view.\n\n0:11:38\tSPEAKER_02\n First thing is this will be the overall shape. No, I'm not speaking about the real shape of the device, but the shape of the inside of the device.\n\n0:11:50\tSPEAKER_02\n So there will be some circuit for the power, so say power circuit here.\n\n0:11:58\tSPEAKER_02\n The main energy will be taken from batteries. And if we decide to use the speech recognition stuff there, we must use additional source of energy, which I found the best is to use the solar cells, which can supply everything.\n\n0:12:20\tSPEAKER_02\n I was computing all the things related to the speech recognition and it's okay to use just two batteries and solar cells, so no problem. There can be also solar cells.\n\n0:12:30\tSPEAKER_02\n The main board with all the circuits will take at least 7 to 7 centimeters. So this is my like hard requirement for the guys from the design.\n\n0:12:42\tSPEAKER_02\n So at least 7 to 7, it depends where you put your screen, because the screen is 7 inch, so it depends when you where you put it as a matter.\n\n0:12:52\tSPEAKER_02\n It's just one cord from the main board to the screen, which can be elsewhere. So this will be TFT.\n\n0:13:02\tSPEAKER_02\n And on the main board, we have the interface to the microphone, which is somewhere. Say here, interface to the microphone, then the graphical card for the TFT.\n\n0:13:18\tSPEAKER_02\n And the third unit is the good news is that we decided to use the infrared unit, because our company has also developed the chip for communication by the infrared, including all the stuff inside, so it will be very cheap for us.\n\n0:13:36\tSPEAKER_02\n So infrared here. So once again, the overall requirement is 7 to 7 centimeters for the board, which can be spongy, but has to be this size.\n\n0:13:48\tSPEAKER_02\n And the TFT, which is 7 inches. I have to check what I want to do.\n\n0:13:56\tSPEAKER_02\n From my point of view, I don't care about the material used for the overall device.\n\n0:14:08\tSPEAKER_03\n Can you fit any, for example, the TFT or any electronic device in a spongy thing, or is there any problem for that?\n\n0:14:18\tSPEAKER_03\n Or could the electronic card on a spongy thing, can imagine it could be a problem?\n\n0:14:26\tSPEAKER_02\n All these things in this box are okay to put in any shape, basically. But we have to take care of the TFT sponginess. Maybe it's a good feature, since it takes, if it's around the TFT, then it's good, because it just keeps it safe.\n\n0:14:44\tSPEAKER_01\n Or maybe it's a hard shell inside, and maybe it puts electronic in a box and spongy thing around.\n\n0:14:54\tSPEAKER_02\n Which is that? Well, it's maybe related to the UI.\n\n0:14:58\tSPEAKER_02\n Can I ask a question?\n\n0:15:00\tSPEAKER_02\n Yeah, that's all for me.\n\n0:15:01\tSPEAKER_00\n This 7-inch TFT screen. How big is it in reality?\n\n0:15:05\tSPEAKER_02\n Well, 7 to 7 inches.\n\n0:15:07\tSPEAKER_00\n So like that?\n\n0:15:09\tSPEAKER_02\n Yes.\n\n0:15:11\tSPEAKER_00\n That's quite big. We decided that we're going to use this TFT screen.\n\n0:15:17\tSPEAKER_03\n I don't think it's 7 by 7, I think it's 7.\n\n0:15:20\tSPEAKER_03\n To be honest, I was like, usually when this thing is 7 inches.\n\n0:15:23\tSPEAKER_03\n Even that is still like this big.\n\n0:15:25\tSPEAKER_03\n I don't know, I don't know, one each.\n\n0:15:30\tSPEAKER_02\n Honestly speaking, I was thinking that it was 7 centimeters initially, but I think we can cut it.\n\n0:15:39\tSPEAKER_00\n Yeah, no problem.\n\n0:15:42\tSPEAKER_02\n Because then the size of the graphic card will be one-fourth.\n\n0:15:47\tSPEAKER_00\n So, yeah, but no problem to need to cut this screen.\n\n0:15:53\tSPEAKER_02\n Okay, so for the same price, we have four screens now.\n\n0:15:57\tSPEAKER_03\n Okay.\n\n0:15:59\tSPEAKER_00\n So what's the size of the device?\n\n0:16:02\tSPEAKER_02\n Well, this is almost nothing. 7 to 7, 2 at least, some 3 millimeters or something.\n\n0:16:10\tSPEAKER_00\n Even from my perspective, 7 to 7 centimeters by 7 centimeters is still...\n\n0:16:15\tSPEAKER_02\n Yeah, but we wanted to put some stuff like that.\n\n0:16:20\tSPEAKER_02\n Because if it's too small, we can lose it at home.\n\n0:16:25\tSPEAKER_03\n What's user ones? They want a small remote control?\n\n0:16:29\tSPEAKER_03\n Yeah, small remote control.\n\n0:16:32\tSPEAKER_00\n It should be the big one.\n\n0:16:34\tSPEAKER_00\n But is something that 7 centimeters square? Easy to hold.\n\n0:16:38\tSPEAKER_02\n Well, I think so. If the roller buttons are on the side, you don't have to catch it like that.\n\n0:16:44\tSPEAKER_02\n But just like this and you know, follow, follow.\n\n0:16:47\tSPEAKER_02\n Well, that's, there's no task for me, but...\n\n0:16:51\tSPEAKER_03\n So maybe you can finish your presentation enough to discuss this.\n\n0:16:56\tSPEAKER_02\n Okay, thanks. That's it.\n\n0:16:59\tSPEAKER_02\n Okay.\n\n0:17:13\tSPEAKER_03\n So I think we have a lot... we have to take decision today.\n\n0:17:17\tSPEAKER_03\n So I think we have some more to finalize our ID and take decisions.\n\n0:17:24\tSPEAKER_03\n First, I think energy is a key problem because it depends what can we have as feature if we use only batteries, for example, or something like that.\n\n0:17:39\tSPEAKER_03\n Because can we have LCD and speech recognition with battery and...\n\n0:17:44\tSPEAKER_03\n It's also related to the size of the...\n\n0:17:49\tSPEAKER_02\n Just the point to the energy is things.\n\n0:17:54\tSPEAKER_02\n If we use the batteries and the additional solar cell, then it's okay for speech recognition and LCDs.\n\n0:18:04\tSPEAKER_02\n Oh no problem.\n\n0:18:06\tSPEAKER_02\n So, we have to use the solar cell.\n\n0:18:09\tSPEAKER_03\n Otherwise, no.\n\n0:18:11\tSPEAKER_03\n But using how many batteries, for example, maybe what is the size of the batteries?\n\n0:18:18\tSPEAKER_02\n I think we can just come in AA cells.\n\n0:18:21\tSPEAKER_02\n Okay, so like 1, 2, 5 centimeters, I don't know exactly, but...\n\n0:18:27\tSPEAKER_00\n So if we use solar cells, where is the sun?\n\n0:18:31\tSPEAKER_00\n If someone's watching TV inside.\n\n0:18:33\tSPEAKER_02\n It doesn't need to be, it's just the daylight.\n\n0:18:38\tSPEAKER_02\n I suppose that this remote control won't be in the room like this, where there is light only.\n\n0:18:47\tSPEAKER_03\n And there are people, but at least when there is TV, you can get light from the TV.\n\n0:18:53\tSPEAKER_03\n I don't think it's the alarm.\n\n0:18:56\tSPEAKER_03\n Okay.\n\n0:18:59\tSPEAKER_02\n It's a compromise, you know.\n\n0:19:04\tSPEAKER_03\n At least it's new when maybe technology.\n\n0:19:08\tSPEAKER_02\n Yeah, that's why I wanted to innovate.\n\n0:19:11\tSPEAKER_02\n Because of the speech recognition, because you want it all the different things.\n\n0:19:14\tSPEAKER_00\n But it's very useful.\n\n0:19:17\tSPEAKER_03\n I think before talking about the other thing, it's the case.\n\n0:19:23\tSPEAKER_03\n What are going to be the size?\n\n0:19:25\tSPEAKER_03\n Because it's with drives, there's what we are going to use as features and so on.\n\n0:19:29\tSPEAKER_03\n For example, for the LCD, if we choose to have a small device, we cannot use this.\n\n0:19:38\tSPEAKER_02\n The screen is okay, but the board is a problem.\n\n0:19:44\tSPEAKER_02\n What would you guess as a shape?\n\n0:19:49\tSPEAKER_01\n I think the bank large or small is not important.\n\n0:19:54\tSPEAKER_01\n The only important thing is to be able to take it in the sidehand easily.\n\n0:20:00\tSPEAKER_01\n So let's say an average size, and it should not be very heavy also.\n\n0:20:06\tSPEAKER_01\n And I prefer to, it shouldn't have a uniform shape.\n\n0:20:11\tSPEAKER_01\n So in the middle, it should be a little bit thinner, maybe, maybe.\n\n0:20:16\tSPEAKER_01\n So it's like some joysticks.\n\n0:20:19\tSPEAKER_01\n You can take some joysticks.\n\n0:20:22\tSPEAKER_01\n You can take insidehand easier, because it's designed for your taking into account your finger shape and your palm shape.\n\n0:20:32\tSPEAKER_01\n The general shape should be like this. I think 7 cm by 7 cm is a little bit large.\n\n0:20:41\tSPEAKER_01\n So not 7, but let's say 5 by 10.\n\n0:20:49\tSPEAKER_01\n I think that's my opinion.\n\n0:20:52\tSPEAKER_01\n Which is the same area.\n\n0:20:54\tSPEAKER_00\n Could you redesign your board?\n\n0:20:57\tSPEAKER_00\n 5 to 10.\n\n0:20:59\tSPEAKER_00\n Which is 10 cm by 10 cm?\n\n0:21:02\tSPEAKER_02\n I think it's fissure.\n\n0:21:05\tSPEAKER_02\n Well, one...\n\n0:21:08\tSPEAKER_02\n How could we do it?\n\n0:21:10\tSPEAKER_02\n We could put the board under the LCD, and for example make the LCD be totally unrelated to the thing that you hold in your hand.\n\n0:21:21\tSPEAKER_02\n Like holding something and the LCD to be just on top of it.\n\n0:21:27\tSPEAKER_02\n But maybe let's stick to the spongy thing, like one unit.\n\n0:21:32\tSPEAKER_02\n 5 to 10, it would be fissure.\n\n0:21:34\tSPEAKER_03\n That is just thing could be two.\n\n0:21:36\tSPEAKER_03\n Two after smaller LCD, if it's possible.\n\n0:21:40\tSPEAKER_02\n Okay, so 5 to 10, I think it's feasible.\n\n0:21:44\tSPEAKER_03\n So we are doing it with a smaller LCD.\n\n0:21:48\tSPEAKER_01\n I don't know, but I don't want to now invent something new, because we didn't discuss about it.\n\n0:21:53\tSPEAKER_01\n So using some LCDs we can touch so we can remove keys and just having...\n\n0:22:00\tSPEAKER_01\n I don't know the name.\n\n0:22:02\tSPEAKER_01\n LCD is supposed to be a finger touching screen.\n\n0:22:07\tSPEAKER_01\n Touch screen.\n\n0:22:10\tSPEAKER_01\n But for now if we don't want to use such kind of screen, I think using a smaller screen is better.\n\n0:22:19\tSPEAKER_03\n Because the problem is we have a limited amount of time, so we cannot do something very new.\n\n0:22:26\tSPEAKER_03\n So that's both a small LCD.\n\n0:22:29\tSPEAKER_02\n Yes, so just give me the 5 by 10 numbers that you find the best and send it to me at my live by 10.\n\n0:22:37\tSPEAKER_01\n Okay.\n\n0:22:46\tSPEAKER_03\n So what about the case we talked about?\n\n0:22:53\tSPEAKER_03\n Is it to use?\n\n0:22:55\tSPEAKER_03\n You said something is it to use, but how does that fit in a fashion way?\n\n0:22:59\tSPEAKER_03\n Like with fruit and vegetable?\n\n0:23:02\tSPEAKER_03\n What's the color and logo of the company?\n\n0:23:07\tSPEAKER_03\n And so now can we do that?\n\n0:23:12\tSPEAKER_03\n My first idea is because our color is more yellow and it should be easy to take in a hand.\n\n0:23:20\tSPEAKER_03\n I thought about banana or something like that, which is fruit.\n\n0:23:25\tSPEAKER_02\n I'm 7 to 10 banana.\n\n0:23:32\tSPEAKER_00\n It's definitely the obvious choice with the color of your company.\n\n0:23:38\tSPEAKER_00\n But just an idea, I don't know what you think about it.\n\n0:23:43\tSPEAKER_03\n I don't know if you can fit with the technology you have with the specialists.\n\n0:23:49\tSPEAKER_02\n I think banana.\n\n0:23:56\tSPEAKER_02\n If the banana is big enough, then yes.\n\n0:24:04\tSPEAKER_02\n So if you want to look at the screen and banana, you know.\n\n0:24:11\tSPEAKER_03\n I think the screen has to be square or it can be like a shape quite.\n\n0:24:20\tSPEAKER_02\n It can be whatever you want.\n\n0:24:23\tSPEAKER_02\n But if it's square, then we get four screens out of one by cutting just.\n\n0:24:27\tSPEAKER_02\n But if you want some shape, then we can only get like two screens out of 7 to 7 inches.\n\n0:24:34\tSPEAKER_02\n It's like more expensive to have a shape like that, but I don't care.\n\n0:24:40\tSPEAKER_02\n I think it's a big requirement.\n\n0:24:43\tSPEAKER_00\n I'd like a shaped screen.\n\n0:24:45\tSPEAKER_00\n I think that's more important than saving a bit of money on the TFT screen.\n\n0:24:50\tSPEAKER_02\n Maybe the banana could be a bit fatter than the cut common one.\n\n0:24:55\tSPEAKER_03\n Yeah, you should remember banana, but it doesn't have to be a banana.\n\n0:25:01\tSPEAKER_03\n It's a size and exactly the shape of banana.\n\n0:25:06\tSPEAKER_02\n So well, we stick to banana.\n\n0:25:10\tSPEAKER_00\n Yeah, banana is good.\n\n0:25:13\tSPEAKER_03\n So, the last point we decided it's in 4 red.\n\n0:25:23\tSPEAKER_03\n Yes, that's the right answer.\n\n0:25:30\tSPEAKER_03\n So that's it. I think about the concept. You have other thing to add to this point.\n\n0:25:39\tSPEAKER_03\n No.\n\n0:25:41\tSPEAKER_03\n But the user interface, we are going to use LCD.\n\n0:25:46\tSPEAKER_03\n In the last meeting, we talked about hidden buttons.\n\n0:25:51\tSPEAKER_03\n I don't know what we're going to do with that.\n\n0:25:55\tSPEAKER_03\n You talked about the feeling of buttons on the side.\n\n0:25:59\tSPEAKER_02\n It would be cool.\n\n0:26:01\tSPEAKER_02\n Feeling of the banana, you know, you should discover the other buttons.\n\n0:26:08\tSPEAKER_03\n And you mean the first layer would be spongy?\n\n0:26:13\tSPEAKER_02\n Obviously.\n\n0:26:15\tSPEAKER_02\n So it's like silly, but the people will appreciate it.\n\n0:26:19\tSPEAKER_03\n Is it possible to do that?\n\n0:26:21\tSPEAKER_03\n It would be a great idea, but possible technique.\n\n0:26:27\tSPEAKER_03\n Like doing spongy layer.\n\n0:26:30\tSPEAKER_00\n If we have a spongy layer on the outside of the banana, it's easy to manipulate that.\n\n0:26:39\tSPEAKER_00\n It would be a cover that you can pull off.\n\n0:26:41\tSPEAKER_01\n Something like a plastic cover covering some interface, USB interfaces in digital camera.\n\n0:26:51\tSPEAKER_01\n You see, it's like pulling you open a plastic cover and you see some USB interfaces, some interfaces for adaptors.\n\n0:27:00\tSPEAKER_01\n So, buttons can be covered like this with a plastic cover.\n\n0:27:06\tSPEAKER_01\n And when you open this cover, it's like pulling a banana.\n\n0:27:10\tSPEAKER_01\n So something like this.\n\n0:27:13\tSPEAKER_03\n But do you see that as a rigid thing?\n\n0:27:17\tSPEAKER_03\n Like a banana, something very soft.\n\n0:27:22\tSPEAKER_02\n Is it possible to make it soft?\n\n0:27:25\tSPEAKER_01\n Yeah, it's like a plastic cover.\n\n0:27:28\tSPEAKER_01\n So I think it's so that it's cool.\n\n0:27:30\tSPEAKER_03\n I don't know what you think, Bob, but it would be great for users, I think.\n\n0:27:34\tSPEAKER_00\n I think for sure, definitely the softer the better.\n\n0:27:37\tSPEAKER_00\n Cool.\n\n0:27:40\tSPEAKER_02\n I was just speaking, I cannot imagine it so far, but it will be terrible.\n\n0:27:47\tSPEAKER_02\n Yeah, it's sitting in buttons.\n\n0:27:54\tSPEAKER_03\n He doesn't know.\n\n0:28:18\tSPEAKER_03\n Is there any other remarks or something we didn't talk about?\n\n0:28:24\tSPEAKER_03\n Yes, yes.\n\n0:28:27\tSPEAKER_03\n I think we're almost there.\n\n0:28:32\tSPEAKER_03\n Maybe, if we have a soft thing like this, and to open it, we have to attach it somewhere.\n\n0:28:43\tSPEAKER_03\n I don't know how to do that, technically.\n\n0:28:48\tSPEAKER_00\n Could you spell card?\n\n0:28:52\tSPEAKER_00\n Maybe magnetic.\n\n0:28:55\tSPEAKER_01\n It's a good idea.\n\n0:28:57\tSPEAKER_03\n Magnetic.\n\n0:29:00\tSPEAKER_01\n Yeah, it can be a plastic cover sticking to all this stuff.\n\n0:29:08\tSPEAKER_01\n Magnetic materials in the border, so it sticks like refrigerator door completely.\n\n0:29:21\tSPEAKER_01\n When you try to open it, it will be opened easily.\n\n0:29:26\tSPEAKER_01\n You can be sure that it will not be opened while you are commonly using buttons under the banner.\n\n0:29:47\tSPEAKER_03\n And what would be the material of the first layer?\n\n0:29:53\tSPEAKER_03\n Soft plastic?\n\n0:29:57\tSPEAKER_00\n I imagine some sort of vinyl.\n\n0:30:02\tSPEAKER_00\n With a swayed feel.\n\n0:30:08\tSPEAKER_02\n Since the things like the screen and solar cell has to be kept in shape.\n\n0:30:24\tSPEAKER_02\n We need that to be linked.\n\n0:30:33\tSPEAKER_02\n We should take care of these two things.\n\n0:30:38\tSPEAKER_02\n If the solar cell won't be visible while the banana is closed, then the material must be able to put light inside.\n\n0:30:50\tSPEAKER_02\n So that we can raise the energy out of it.\n\n0:30:55\tSPEAKER_00\n So you're saying it's possible to have a solar cell and this removable cover.\n\n0:31:04\tSPEAKER_02\n I don't know.\n\n0:31:07\tSPEAKER_02\n Let's do it.\n\n0:31:09\tSPEAKER_02\n If it's better to put the solar cell to the peeling.\n\n0:31:16\tSPEAKER_02\n Or inside, but then it must be some window.\n\n0:31:23\tSPEAKER_03\n And something we forgot maybe about the speech recognition system.\n\n0:31:30\tSPEAKER_01\n I think it's important.\n\n0:31:34\tSPEAKER_00\n It seems feasible and it's something for technology.\n\n0:31:37\tSPEAKER_03\n So we have the design, the good shape, new and so on.\n\n0:31:42\tSPEAKER_03\n And we have also the technology thing.\n\n0:31:45\tSPEAKER_03\n Even the easy to use things.\n\n0:31:49\tSPEAKER_03\n So we also have speech recognition.\n\n0:32:02\tSPEAKER_03\n So that's great.\n\n0:32:03\tSPEAKER_03\n We have decided everything and think well on a good way.\n\n0:32:13\tSPEAKER_03\n The next meeting we start in 30 minutes.\n\n0:32:20\tSPEAKER_03\n So the industrial manager will work on the look and fill design.\n\n0:32:30\tSPEAKER_03\n The user interface manager will work on the user interface device.\n\n0:32:41\tSPEAKER_03\n And the marketing expert will do the first product evaluation.\n\n0:32:48\tSPEAKER_03\n So I hope you can do that in 30 minutes.\n\n0:32:54\tSPEAKER_03\n I think you should work together with your Hamad and Peter to work in a first prototype.\n\n0:33:06\tSPEAKER_03\n And more about the shape and so on.\n\n0:33:13\tSPEAKER_03\n And as usual, you will receive some specific instructions.\n\n0:33:21\tSPEAKER_03\n Thank you everybody and see you in 30 minutes.\n\n0:33:24\tSPEAKER_00\n Thank you.\n\n0:33:54\tNone\n Thank you.\n\n", "summary": [{"summary_text": "Hanna, Speaker and others are having a meeting on conceptual design of the remote control. Speaker will present three presentations and they will reach a decision at the end of the meeting. According to the market research, a fancy look and feel is the number one priority. The number two priority is technologically innovative and the number three is easiness of use. This year fruit and vegetable motifs will be the most important thing in clothes, shoes and furniture."}]}