{"filename": "./data/IS1002c.txt", "transcript": "0:00:00\tSPEAKER_01\n So we need to retrain Mike on how to put his mic on.\n\n0:00:25\tSPEAKER_01\n Can he get it all by himself this time?\n\n0:00:32\tSPEAKER_03\n Probably not.\n\n0:00:37\tSPEAKER_03\n It's been a while.\n\n0:00:39\tSPEAKER_01\n I believe I can fly.\n\n0:00:42\tSPEAKER_02\n We got some exciting stuff for you guys.\n\n0:00:45\tSPEAKER_02\n Or not.\n\n0:00:46\tSPEAKER_03\n Or not.\n\n0:00:48\tSPEAKER_01\n Just what I needed was something exciting.\n\n0:00:51\tSPEAKER_01\n Remember I'm an old man.\n\n0:00:54\tSPEAKER_00\n Ready to go.\n\n0:00:56\tSPEAKER_00\n Ready.\n\n0:00:57\tSPEAKER_00\n Okay, so we've got conceptual design meeting.\n\n0:01:00\tSPEAKER_00\n Hopefully we've all got exciting ideas now.\n\n0:01:02\tSPEAKER_00\n We do.\n\n0:01:03\tSPEAKER_00\n And getting exciting ideas.\n\n0:01:05\tSPEAKER_00\n Okay, so here's our agenda.\n\n0:01:08\tSPEAKER_00\n Our agenda.\n\n0:01:10\tSPEAKER_00\n Got open.\n\n0:01:11\tSPEAKER_00\n I'm going to talk for a bit.\n\n0:01:13\tSPEAKER_00\n But what we're going to do.\n\n0:01:15\tSPEAKER_00\n I'm going to take some notes.\n\n0:01:16\tSPEAKER_00\n We're going to all do a presentation.\n\n0:01:18\tSPEAKER_00\n And then hopefully we're going to make some decisions now.\n\n0:01:21\tNone\n Yep.\n\n0:01:22\tSPEAKER_00\n Well, when I say hopefully we have to.\n\n0:01:25\tSPEAKER_00\n So we're going to let you guys talk before we make decisions.\n\n0:01:32\tSPEAKER_00\n Does anyone really want to go first?\n\n0:01:34\tSPEAKER_02\n I guess I'll go first.\n\n0:01:35\tSPEAKER_02\n You too?\n\n0:01:36\tSPEAKER_00\n Yeah.\n\n0:01:37\tSPEAKER_02\n What's component I think?\n\n0:01:40\tSPEAKER_02\n Yes, what does it mean?\n\n0:01:42\tSPEAKER_03\n Yep, that's it.\n\n0:01:44\tSPEAKER_03\n Presented by name.\n\n0:01:46\tSPEAKER_02\n My name is...\n\n0:01:48\tSPEAKER_02\n Oh, see?\n\n0:01:49\tSPEAKER_02\n My name is name.\n\n0:01:50\tSPEAKER_02\n My name is name.\n\n0:01:51\tSPEAKER_03\n Hi.\n\n0:01:52\tSPEAKER_03\n My name is Indigo Montoya.\n\n0:01:53\tSPEAKER_03\n He come up.\n\n0:01:55\tSPEAKER_03\n So I did this in a bit of a rush.\n\n0:01:57\tSPEAKER_02\n Nami.\n\n0:01:58\tSPEAKER_02\n So here's a look inside.\n\n0:02:00\tSPEAKER_02\n You're really all looking remote control.\n\n0:02:02\tSPEAKER_02\n You've got printed circuit board here.\n\n0:02:07\tSPEAKER_02\n And you've got all these buttons which kind of press down little rubber nubbies into these little holes.\n\n0:02:13\tSPEAKER_02\n We've all broken remote control.\n\n0:02:16\tSPEAKER_02\n We've all broken remote control.\n\n0:02:18\tSPEAKER_02\n So you've also got your chip here, your batteries here, and some sort of electronics.\n\n0:02:25\tSPEAKER_01\n I just love you tech guys actually.\n\n0:02:27\tSPEAKER_03\n Yeah, there's a thingy in the world.\n\n0:02:29\tSPEAKER_02\n Dude, jabber.\n\n0:02:31\tSPEAKER_02\n So here's a transistor and this amplifies your signal.\n\n0:02:36\tSPEAKER_02\n You've got the LED here on the end of the printed circuit board.\n\n0:02:41\tSPEAKER_02\n You've got a couple diodes here for, I don't know, who and what not.\n\n0:02:46\tSPEAKER_02\n I don't know.\n\n0:02:47\tSPEAKER_00\n So what not?\n\n0:02:48\tSPEAKER_02\n Exactly.\n\n0:02:49\tSPEAKER_02\n So we've got it in this drawing here, in this example here, this is a 18 pin chip.\n\n0:02:59\tSPEAKER_02\n Yeah, I don't know.\n\n0:03:01\tSPEAKER_02\n It's two AA batteries.\n\n0:03:03\tSPEAKER_02\n This is pretty standard remote.\n\n0:03:06\tSPEAKER_02\n So here are options for our power sources.\n\n0:03:09\tSPEAKER_02\n You can use a basic battery, which we've already discussed.\n\n0:03:13\tSPEAKER_02\n Our tech department also said we have the option of doing some kind of hand dynamo where maybe you crank it or something like that.\n\n0:03:21\tSPEAKER_02\n I don't know if that's really what I'm saying.\n\n0:03:24\tSPEAKER_02\n I don't know, we got some crazy guys down there in the department.\n\n0:03:28\tSPEAKER_01\n I got a flashlight.\n\n0:03:30\tSPEAKER_01\n And you shake it?\n\n0:03:31\tSPEAKER_01\n Yeah, but it's interesting because you shake it like this.\n\n0:03:35\tSPEAKER_01\n Like this.\n\n0:03:36\tSPEAKER_02\n Yeah.\n\n0:03:37\tSPEAKER_02\n So the next bullet is the...\n\n0:03:39\tSPEAKER_02\n The kinetic provision of energy.\n\n0:03:41\tSPEAKER_02\n So it's like that flashlight where you have to shake it.\n\n0:03:45\tSPEAKER_02\n We've got solar cells, which I don't think is a very good idea, because you could not use your remote at night.\n\n0:03:52\tSPEAKER_02\n It just doesn't make a good sense.\n\n0:03:55\tSPEAKER_02\n And finally we've got our power cradle idea.\n\n0:03:58\tSPEAKER_00\n Okay, so we basically have battery versus cradle here.\n\n0:04:01\tSPEAKER_02\n Battery versus cradle, I think.\n\n0:04:03\tSPEAKER_03\n Yeah, like the kinetic.\n\n0:04:05\tSPEAKER_03\n I figured you would.\n\n0:04:07\tSPEAKER_00\n It's actually a novel thing because you could sell it as a novelty to be actually seeded for a minute here.\n\n0:04:14\tSPEAKER_02\n Well, it is more...\n\n0:04:16\tSPEAKER_02\n I mean, it is more eco-friendly than the cradle, because you're still using power off the grid with the cradle.\n\n0:04:22\tSPEAKER_02\n So our case design.\n\n0:04:26\tSPEAKER_02\n We have choices in materials and choices in the general shapes that we can do.\n\n0:04:31\tSPEAKER_02\n Our material choices are a plastic latex type...\n\n0:04:35\tSPEAKER_02\n or a rubber latex type thing, wood or titanium.\n\n0:04:40\tSPEAKER_02\n If we go with titanium, we're going to be limited in the amount of shapes we can do, because it's tough to shape the titanium.\n\n0:04:48\tSPEAKER_02\n And...\n\n0:04:50\tSPEAKER_02\n Yeah.\n\n0:04:51\tSPEAKER_00\n The person would give us a lot of a marketing, you shouldn't it?\n\n0:04:54\tSPEAKER_00\n I think wooded...\n\n0:04:56\tSPEAKER_02\n I can't see anybody wanting to use a wooden remote.\n\n0:05:00\tSPEAKER_02\n It's just anti-technology, really.\n\n0:05:04\tSPEAKER_02\n You know?\n\n0:05:06\tSPEAKER_01\n To me, in a marketing sense, it's not relative.\n\n0:05:10\tSPEAKER_01\n We can accentuate whatever product you put in there.\n\n0:05:14\tSPEAKER_01\n We can find a way to accentuate it.\n\n0:05:16\tSPEAKER_02\n And what we may be able to do, and I think this might be the best option, is to combine some...\n\n0:05:21\tSPEAKER_02\n a couple of these.\n\n0:05:22\tSPEAKER_02\n My recommendation personally would be to do some kind of a plastic inner shell with a rubber outer shell to make it...\n\n0:05:30\tSPEAKER_02\n like a thick plastic inner shell, and to have that rubber outer shell to make it more durable.\n\n0:05:38\tSPEAKER_02\n And also maybe...\n\n0:05:40\tSPEAKER_02\n I think it feels a little better than the plastic.\n\n0:05:43\tSPEAKER_00\n You get your app on the rubber.\n\n0:05:45\tSPEAKER_01\n If you make it from that super rubber, when you drop it on the floor, it can bounce right back up in your hand.\n\n0:05:50\tSPEAKER_01\n You don't even need to lean down to get it.\n\n0:05:52\tSPEAKER_02\n The inches of working with plastic and rubber will have a lot more options in terms of shape, because you can extrude plastic in basically any shape you want.\n\n0:06:02\tSPEAKER_02\n And then we can cover the breakable bits with rubber.\n\n0:06:09\tSPEAKER_02\n But basically, these are curved and double curved.\n\n0:06:12\tSPEAKER_02\n I believe the tech department in their message to me that they were referring to the number of curves in the bottom.\n\n0:06:21\tSPEAKER_02\n I have no idea exactly what they're talking about.\n\n0:06:24\tSPEAKER_02\n But that's what they told me.\n\n0:06:26\tSPEAKER_02\n Uncurved flat curved or double curved.\n\n0:06:28\tSPEAKER_02\n I would guess this pen would be kind of like a double curved, where it's curved on multiple axes.\n\n0:06:35\tSPEAKER_02\n I think curved means just curved in one axis, and double curved is curved in two axes.\n\n0:06:41\tSPEAKER_02\n Or surfaces.\n\n0:06:42\tSPEAKER_00\n I think it might mean something like that sort of shape, because a double cover on it.\n\n0:06:47\tSPEAKER_00\n Oh, okay.\n\n0:06:48\tSPEAKER_00\n That's what I see on some.\n\n0:06:50\tSPEAKER_02\n That makes sense.\n\n0:06:51\tSPEAKER_02\n Okay.\n\n0:06:52\tSPEAKER_02\n Okay.\n\n0:06:53\tSPEAKER_02\n With the interface, we have the following options.\n\n0:06:56\tSPEAKER_02\n We can use push buttons.\n\n0:06:58\tSPEAKER_02\n We can use a scroll wheel with an integrated push button, and LCD display, or multiple scrolling wheels.\n\n0:07:07\tSPEAKER_02\n So these are all options that the user interface guy can have his disposal to put together a user interface.\n\n0:07:16\tSPEAKER_02\n Okay. For electronics, we have these very technical descriptions here.\n\n0:07:22\tSPEAKER_02\n A simple chip, which is the least expensive, but I have no numbers to give you.\n\n0:07:26\tSPEAKER_02\n A regular chip, which is like the medium porridge.\n\n0:07:32\tSPEAKER_00\n Did we have actually any concept of what the differences between a simple chip and an advanced chip?\n\n0:07:37\tSPEAKER_02\n Yes.\n\n0:07:38\tSPEAKER_02\n The difference is with a simple chip, a simple chip will operate.\n\n0:07:41\tSPEAKER_02\n Oh, why doesn't this scroll up?\n\n0:07:44\tSPEAKER_02\n Okay.\n\n0:07:46\tSPEAKER_02\n A simple chip is required to operate push buttons.\n\n0:07:50\tSPEAKER_02\n An advanced chip is required to operate the LCD display.\n\n0:07:56\tSPEAKER_02\n And it didn't say specifically, but I have a hunch that a regular chip is going to be the scroll wheel and the multiple scroll wheels.\n\n0:08:05\tSPEAKER_02\n Okay.\n\n0:08:06\tSPEAKER_02\n So, but yeah.\n\n0:08:07\tSPEAKER_00\n Yeah, how many cents?\n\n0:08:10\tSPEAKER_00\n Let's say in my presentation.\n\n0:08:12\tSPEAKER_00\n From, I guess, design would go best.\n\n0:08:17\tSPEAKER_00\n Next.\n\n0:08:26\tSPEAKER_00\n Technical functions are interface concepts.\n\n0:08:29\tSPEAKER_02\n I think.\n\n0:08:30\tSPEAKER_03\n Oh, interface concept.\n\n0:08:32\tSPEAKER_03\n Yeah, that's it.\n\n0:08:36\tSPEAKER_00\n For all of the things.\n\n0:08:38\tSPEAKER_00\n Yes, but it has your name on it.\n\n0:08:43\tSPEAKER_03\n Well, that doesn't both work well for it, but it does as well.\n\n0:08:48\tSPEAKER_03\n So, somehow the thing is too big.\n\n0:08:51\tSPEAKER_03\n But, okay.\n\n0:08:53\tSPEAKER_03\n Our manufacturing division wanted the speed recognition.\n\n0:08:57\tSPEAKER_03\n They say they could put it to work, but we don't think so.\n\n0:09:01\tSPEAKER_03\n No.\n\n0:09:02\tSPEAKER_03\n And it, you'll be, you know, be affected by the other speed.\n\n0:09:06\tSPEAKER_02\n Working, yeah.\n\n0:09:08\tSPEAKER_02\n I mean, if somebody says up in the middle of the television show, it's going to change the channel.\n\n0:09:15\tSPEAKER_03\n And then fighting for the remote would not be fun anymore.\n\n0:09:18\tSPEAKER_03\n And I think that's one of the things we want.\n\n0:09:20\tSPEAKER_00\n But what if he actually had to press a button to make it recognize.\n\n0:09:23\tSPEAKER_00\n So, if you press the internet up, that kind of would, Well, then why don't you just press the up button?\n\n0:09:28\tSPEAKER_00\n Yeah, that would kind of, But if it's just one thing with a button, you can just go.\n\n0:09:32\tSPEAKER_02\n Even still there's going to be inner fear, there's still will be interference from the TV.\n\n0:09:37\tSPEAKER_02\n It might not be, it might not be completely confusing, but I think you'll still, it's still, I don't think it's practical at all.\n\n0:09:45\tSPEAKER_02\n I think it's a bad idea, Frank.\n\n0:09:47\tSPEAKER_03\n Okay.\n\n0:09:49\tSPEAKER_03\n They can that away.\n\n0:09:51\tSPEAKER_03\n You guys made your stuff.\n\n0:09:53\tSPEAKER_03\n The robot buttons are, the more reliable, the the ones that would allow us to market our product as being less prone to damage and more resistance to things like spillage of liquids over it or, you know, mistreat misuses as it happens to remote controls.\n\n0:10:15\tSPEAKER_03\n As for the point that we're making about losing it, well, we want a small, more control on one side because we want it to be cool.\n\n0:10:26\tSPEAKER_03\n And designed.\n\n0:10:29\tSPEAKER_03\n But apparently, the market shows that bigger, bigger, remote gets less lost than I would believe.\n\n0:10:40\tSPEAKER_03\n But, yeah, I think we need to compromise between those two and somehow we'll do that somehow.\n\n0:10:47\tSPEAKER_03\n So, the, what I would propose is something more or less in the direction of what is to you, the right of that slide.\n\n0:10:57\tSPEAKER_03\n But without, with a less complicated design.\n\n0:11:02\tSPEAKER_03\n So, the numbers, the volume control and channel control and teletext access, the volume and channel control can just become those, the four button array as in, if it was a round dial.\n\n0:11:16\tSPEAKER_03\n And if you just think about it as the one to the right, but with the numbers and the four buttons plus maybe a center one with teletext.\n\n0:11:25\tSPEAKER_00\n So, we're suggesting the inner side scroll wheel thing for the volume.\n\n0:11:28\tSPEAKER_03\n No, it's not a scroll wheel.\n\n0:11:30\tSPEAKER_03\n It's just four buttons that are on the cross.\n\n0:11:33\tSPEAKER_03\n Okay, basically, you can control all of the important tasks from that all the way.\n\n0:11:37\tSPEAKER_02\n Instead of placed up rewind and fast forward there, that's up, down, louder and quieter.\n\n0:11:43\tSPEAKER_03\n Yeah.\n\n0:11:44\tSPEAKER_03\n So, I think we go for something mid-size, something looks good and not too prone to get lost.\n\n0:11:53\tSPEAKER_03\n The beard?\n\n0:11:54\tSPEAKER_00\n Okay.\n\n0:11:56\tSPEAKER_00\n So, onto...\n\n0:12:04\tSPEAKER_00\n Functional requirements or train to watching?\n\n0:12:08\tSPEAKER_01\n I don't know.\n\n0:12:09\tSPEAKER_01\n Train watching, what's the latest?\n\n0:12:11\tSPEAKER_01\n Train watching, I believe.\n\n0:12:12\tSPEAKER_00\n Before I say it's 1557.\n\n0:12:14\tSPEAKER_01\n It looks like it's been so long.\n\n0:12:19\tSPEAKER_01\n I don't know what to say.\n\n0:12:23\tSPEAKER_01\n When I see the product, I don't want to buy it.\n\n0:12:28\tSPEAKER_01\n I see so many of them out there.\n\n0:12:30\tSPEAKER_01\n There's nothing about that product.\n\n0:12:32\tSPEAKER_01\n It makes me want to choose that product over other products that are out there.\n\n0:12:35\tSPEAKER_02\n Are you talking about the picture?\n\n0:12:37\tSPEAKER_02\n Yeah, yeah.\n\n0:12:38\tSPEAKER_02\n That's not our design.\n\n0:12:39\tSPEAKER_02\n That's just something he, a graphic he used to show you the layout of what the layout of the buttons might be like.\n\n0:12:47\tSPEAKER_01\n Okay, because right now, I don't have too much to say about how to market this product because we don't have a product to market yet.\n\n0:12:53\tSPEAKER_01\n And from talking to Mike, we can market a more expensive product now.\n\n0:13:02\tSPEAKER_01\n That's what I understand.\n\n0:13:03\tSPEAKER_01\n A little bit of it said yes.\n\n0:13:04\tSPEAKER_00\n Hello.\n\n0:13:05\tSPEAKER_00\n Excuse me, is that a bit of spun?\n\n0:13:07\tSPEAKER_01\n Yeah, I'm a little bit stuck right now in it.\n\n0:13:11\tSPEAKER_01\n What is it that I'm going to market?\n\n0:13:15\tSPEAKER_01\n Without special or increased marketable features, I don't believe the product has a consumer demand.\n\n0:13:22\tSPEAKER_01\n I like the idea of the scroll.\n\n0:13:25\tSPEAKER_01\n There are so many people making these products at this price right now.\n\n0:13:30\tSPEAKER_01\n What are we going to do to make this one special and unique?\n\n0:13:32\tSPEAKER_02\n What's special and unique about a scroll?\n\n0:13:35\tSPEAKER_01\n I don't kill.\n\n0:13:37\tSPEAKER_01\n Yeah, I just see it as different.\n\n0:13:39\tSPEAKER_01\n I don't say it's special.\n\n0:13:42\tSPEAKER_01\n I don't say it's special.\n\n0:13:44\tSPEAKER_01\n I say that it's different.\n\n0:13:46\tSPEAKER_01\n What I'm looking for is marketing is give me something different.\n\n0:13:49\tSPEAKER_01\n Give me a lower price, give me a higher price, give me some new technology.\n\n0:13:53\tSPEAKER_01\n Don't give me the same thing that everybody else is putting out there on a shelf.\n\n0:13:57\tSPEAKER_01\n It's at the same price.\n\n0:13:59\tSPEAKER_01\n I need something to market about this thing.\n\n0:14:01\tSPEAKER_00\n We're a new firm.\n\n0:14:05\tSPEAKER_00\n If we make this decision to go with the cradle, then we have that.\n\n0:14:09\tSPEAKER_01\n When we have something like the cradle or something, give, that's a marketing standard.\n\n0:14:14\tSPEAKER_01\n I need something to market to make this product unique.\n\n0:14:17\tSPEAKER_02\n I think the two big points that we have so far are the having the cradle and also having the actual design of the case itself.\n\n0:14:29\tSPEAKER_02\n Having this rubber shell, maybe with the plastic interior, having it look really nice and also be really durable.\n\n0:14:38\tSPEAKER_01\n Just remember, when I made up this report, I didn't have the information that we're discussing here.\n\n0:14:43\tSPEAKER_01\n When we have a cradle, when we have some kind of design, so what I'm saying is from my perspective, I don't have a product to market right now.\n\n0:14:55\tSPEAKER_01\n My personal preference is that we make some adjustment in the cost, either lower or develop and integrate new technology.\n\n0:15:03\tSPEAKER_01\n That is the next step.\n\n0:15:05\tSPEAKER_01\n There's technology and then there is technology which we're moving into the next phase.\n\n0:15:09\tSPEAKER_01\n We're going to have some new technology to enhance the marketability.\n\n0:15:13\tSPEAKER_01\n Again, I'm not sold on the product because we don't have a product in my opinion yet.\n\n0:15:21\tSPEAKER_01\n I need a product to market.\n\n0:15:25\tSPEAKER_01\n Whatever products you guys put together, we'll find a way to market it.\n\n0:15:29\tSPEAKER_01\n That I'm not concerned with.\n\n0:15:31\tSPEAKER_01\n Now, if you give me a cutout of what everybody else has, then I need to find a lower cost.\n\n0:15:39\tSPEAKER_00\n So, our big questions here really are cradle or not cradle.\n\n0:15:51\tSPEAKER_00\n Do we go basic or do we go for features?\n\n0:15:55\tSPEAKER_00\n Does anybody really want to do anything with the scroll wheel or should we ditch that?\n\n0:15:59\tSPEAKER_02\n Well, my question is, what would the scroll wheel do function wise?\n\n0:16:04\tSPEAKER_02\n What does that do?\n\n0:16:06\tSPEAKER_02\n It's just another way to do the exact same thing that the buttons do.\n\n0:16:16\tSPEAKER_01\n What I see with the scroll wheel is everybody has buttons.\n\n0:16:20\tSPEAKER_01\n So, from a marketing standpoint, I have another door to walk through when we have something that's unique.\n\n0:16:26\tSPEAKER_01\n If it creates something more complex or more expensive, then I don't know if that makes it a marketing necessity.\n\n0:16:33\tSPEAKER_01\n But, again, from a marketing perspective, I want as much new and different about this thing as possible because we're a very competitive market.\n\n0:16:41\tSPEAKER_00\n If I understand that it's scroll wheels, is there quite expensive to make?\n\n0:16:45\tSPEAKER_02\n They are going to be more expensive.\n\n0:16:47\tSPEAKER_02\n But, on the other hand, I mean, it is an alternative.\n\n0:16:54\tSPEAKER_02\n If you think that's going to sell some extra cost by extra sales, I think maybe it's worth it to do it.\n\n0:17:05\tSPEAKER_02\n But, I mean, I would just use the scroll wheel for channels up and channels down.\n\n0:17:12\tSPEAKER_02\n I don't think volume.\n\n0:17:14\tSPEAKER_02\n Do you think volume would be...\n\n0:17:17\tSPEAKER_03\n I don't know, I would bet the first one involved in maybe.\n\n0:17:20\tSPEAKER_02\n We can do multiple scroll wheels, but...\n\n0:17:24\tSPEAKER_00\n I like the idea of focusing my personal preference, focusing the product on the idea of the case that the dock to put it in, to charge it.\n\n0:17:40\tSPEAKER_00\n We can target the environmentally friendly ideas.\n\n0:17:43\tSPEAKER_00\n That's all the things.\n\n0:17:44\tSPEAKER_00\n It makes it...\n\n0:17:45\tSPEAKER_00\n Yeah, yeah.\n\n0:17:46\tSPEAKER_00\n...to market.\n\n0:17:47\tSPEAKER_01\n I think so.\n\n0:17:48\tSPEAKER_00\n And if we keep the rest in a format that is durable, because the whole product is going to need to be more durable, that's because you're not going to be ditching it as often.\n\n0:18:00\tSPEAKER_00\n It's going to need to be more expensive because of the cradle.\n\n0:18:03\tSPEAKER_00\n So, if we can mark it in terms of that.\n\n0:18:06\tSPEAKER_01\n I think we've got some exclusivity in it.\n\n0:18:09\tSPEAKER_01\n We've got something that nobody else has right now.\n\n0:18:11\tSPEAKER_01\n And that means we can make some adjustments in the retail or wholesale price if we need to, and it also can create its own demand from its uniqueness.\n\n0:18:19\tSPEAKER_00\n So, our big decision then is, how do we do...\n\n0:18:23\tSPEAKER_00\n We have to decide on the details and how to decide on...\n\n0:18:27\tSPEAKER_00\n Well, not exactly the details, but do we have...\n\n0:18:31\tSPEAKER_00\n...what type of casing?\n\n0:18:34\tSPEAKER_00\n I personally like what you were saying about the plastic with the rubber.\n\n0:18:38\tSPEAKER_02\n I'm thinking, yeah, something like, kind of almost like these pins, you know, where there's...\n\n0:18:43\tSPEAKER_02\n...you have plastic bits and then it's not really rubber, but just kind of like a fused...\n\n0:18:47\tSPEAKER_02\n...the plastic with rubber on the outside.\n\n0:18:50\tSPEAKER_00\n Okay.\n\n0:18:51\tSPEAKER_00\n...just a very thin sort of sheet for a grip.\n\n0:18:53\tSPEAKER_02\n Well, maybe a bit more than is on here, but just as a kind of an inspiration, these pins, I think are kind of...\n\n0:19:01\tSPEAKER_00\n Okay.\n\n0:19:03\tSPEAKER_00\n So then, if we... do we want to do anything more basic with the...\n\n0:19:09\tSPEAKER_00\n...more advanced with the user interface in terms of...\n\n0:19:12\tSPEAKER_00\n...do we want to go for buttons or do we want...\n\n0:19:18\tSPEAKER_00\n...if we're ditching the scroll wheels, do we want to go LCD?\n\n0:19:22\tSPEAKER_00\n Do we want to give...\n\n0:19:24\tSPEAKER_00\n...do we want to have anything else on it?\n\n0:19:27\tSPEAKER_03\n It's only a TV.\n\n0:19:29\tSPEAKER_02\n From my perspective, I think LCD is a mistake, because this is a universal remote and all you're doing...\n\n0:19:37\tSPEAKER_02\n...I mean, you're not going to get any information back from the television.\n\n0:19:40\tSPEAKER_02\n So the only information you can display in this remote is what channel you just sent it at last.\n\n0:19:45\tSPEAKER_02\n And there's just not a lot of information, you know, there.\n\n0:19:49\tSPEAKER_02\n It receives no information.\n\n0:19:53\tSPEAKER_02\n So I don't see any reason for having an LCD, because it's an increased cost, unless you can think of something interesting to do with it.\n\n0:20:02\tSPEAKER_01\n Right now, there's nothing coming out of the TV to receive, so...\n\n0:20:07\tSPEAKER_01\n...unless technology changes and information starts coming out of the cable box or something.\n\n0:20:13\tSPEAKER_01\n I don't see the necessity of an LCD either.\n\n0:20:19\tSPEAKER_01\n No, I'll see you out.\n\n0:20:23\tSPEAKER_00\n Okay, so the question is now, I guess, we need to decide.\n\n0:20:28\tSPEAKER_00\n Well, you guys basically have to now go and figure out the details of this thing.\n\n0:20:35\tSPEAKER_00\n So what we need to know in terms of marketing and project management...\n\n0:20:40\tSPEAKER_00\n...are there any other questions that we need to answer now before you guys can go and build this?\n\n0:20:46\tSPEAKER_00\n What overall things have we not decided on?\n\n0:20:50\tSPEAKER_02\n Well, we have to... I think for me, it's still not exactly clear exactly what the user interface is going to be.\n\n0:20:56\tSPEAKER_02\n There's a scroll wheel, inner out.\n\n0:20:58\tSPEAKER_02\n What do you guys like in the user interface?\n\n0:21:01\tSPEAKER_00\n Maybe in terms of marketing, is that going to make us a bit extra?\n\n0:21:04\tSPEAKER_01\n Again, just by the cost.\n\n0:21:06\tSPEAKER_01\n Well, I think it's the more uniqueness you can bring to the product, the easier it is, I believe, for me to market.\n\n0:21:12\tSPEAKER_01\n Again, the push buttons I see are everywhere.\n\n0:21:16\tSPEAKER_01\n And so we can go with the same thing, but we're going to be competing in a broader market than if we go with something unique.\n\n0:21:23\tSPEAKER_01\n The other thing I thought about was, do we go to something like this?\n\n0:21:29\tSPEAKER_01\n Make a remote, it doesn't look like a remote.\n\n0:21:33\tSPEAKER_01\n It's just another, it's just an idea, and I don't know...\n\n0:21:37\tSPEAKER_02\n Well, I don't know about the flip phone idea, because I think, as far as durability, it's not a big...\n\n0:21:46\tSPEAKER_02\n Well...\n\n0:21:47\tSPEAKER_01\n I mean, one of the things you brought up in an earlier presentation is, you've got children, their stuff gets inside the circuitry to get dirty, they get messy with drinks and stuff.\n\n0:21:58\tSPEAKER_01\n And what I keep throwing out there, I just keep throwing out ideas to try to make this thing look or act or in some way identify itself as unique or different.\n\n0:22:12\tSPEAKER_01\n But you guys are the ones that have to ultimately create the product within cost.\n\n0:22:16\tSPEAKER_00\n Yeah, and I guess the question that you're being asked right now is whether is the dock enough of a unique feature to be able to go out and sell that as a very different product, or do we really need the scroll wheel as well?\n\n0:22:33\tSPEAKER_00\n Oh, okay.\n\n0:22:34\tSPEAKER_01\n I think you've got to get into cost effectiveness. I think if you can have the base station with a locator, I think those are two very strong features. If that's something that can be integrated without a bunch of extra cost.\n\n0:22:47\tSPEAKER_02\n The locator is going to require a radio transmitter, which will...\n\n0:22:51\tSPEAKER_00\n Is that going to need a better chip as well?\n\n0:22:55\tSPEAKER_02\n We're probably going to have to go with it like a medium chip, I would imagine.\n\n0:23:00\tSPEAKER_02\n But we will need a receiver in antenna.\n\n0:23:05\tSPEAKER_01\n Integrated, yeah.\n\n0:23:07\tSPEAKER_01\n So it's just... I think that's...\n\n0:23:11\tSPEAKER_02\n It should be a really simple signal though.\n\n0:23:15\tSPEAKER_01\n I know personally that would be a very attractive feature is to have a button I can push to find my remote control.\n\n0:23:22\tSPEAKER_00\n I assume we're going to need a little speaker or something like that as well to beep.\n\n0:23:25\tSPEAKER_02\n That's true.\n\n0:23:26\tSPEAKER_00\n I guess a little tiny speaker is going to be quite cheap. It's not going to need quality as it is.\n\n0:23:33\tSPEAKER_02\n Oh yeah, it'll be really cheap.\n\n0:23:36\tSPEAKER_01\n Maybe you could like have a smellorama, you know, you push a button and it puts out a stink.\n\n0:23:43\tSPEAKER_03\n Maybe not.\n\n0:23:45\tSPEAKER_00\n Makes here 11 and more fresh.\n\n0:23:49\tSPEAKER_00\n Okay, we're doing well for time here. We've got about another 10 minutes.\n\n0:23:56\tSPEAKER_02\n So the scroll wheel?\n\n0:23:58\tSPEAKER_02\n Inner out.\n\n0:24:00\tSPEAKER_00\n My personal preference is out.\n\n0:24:03\tSPEAKER_00\n I don't think the cost is justified for a little bit more uniqueness when we already have that.\n\n0:24:07\tSPEAKER_00\n And I don't think it's obvious and natural how it would be used.\n\n0:24:10\tSPEAKER_03\n Yeah, I think we have like it's not very usable and it will bring down the robustness of the whole thing.\n\n0:24:16\tSPEAKER_03\n Yeah, it breaks down easier.\n\n0:24:19\tSPEAKER_02\n For me, I think the scroll wheel actually might not be so bad.\n\n0:24:21\tSPEAKER_02\n I don't know exactly what the increased cost is going to be, but I think he does have a point.\n\n0:24:25\tSPEAKER_02\n It might push somebody over the edge when they're looking at our remote versus something else when they see this one has a scroll wheel to go up and down on the channels.\n\n0:24:34\tSPEAKER_02\n I think it might be kind of neat to be able to do it like that.\n\n0:24:38\tSPEAKER_00\n But then that surely depends a little on the TV because some TVs are quite slow, changing channels.\n\n0:24:44\tSPEAKER_00\n Sure. So if you've got a scroll here and you have to scroll it really, really slowly, just so that you're actually keeping in pace with the TV's ability to change channels or you have to go through and you wait for it, you scroll a bunch of times and then you wait for it.\n\n0:24:59\tSPEAKER_02\n I think what it would be is like this where it's maybe a digital wheel, where it's quantized into.\n\n0:25:09\tSPEAKER_02\n That was my intuition about the scroll wheel.\n\n0:25:14\tSPEAKER_02\n It's basically just a look and feel thing. It has the same exact functionality as two buttons.\n\n0:25:25\tSPEAKER_01\n I think there are so many people today that are surfing or television surfers.\n\n0:25:32\tSPEAKER_01\n And I see the scroll as a great mechanism for surfing instead of going to the button.\n\n0:25:40\tSPEAKER_01\n I really think that's a really cool thing for surfing.\n\n0:25:44\tSPEAKER_02\n Now just so you know though, you did bring up a point which is very valid.\n\n0:25:49\tSPEAKER_02\n A lot of TVs won't respond exactly the same. Some of them are going to be kind of slow switching.\n\n0:25:53\tSPEAKER_02\n So you may like queue up like 15 channel changes and it'll be like flip, flip, flip.\n\n0:26:00\tSPEAKER_00\n Well, necessarily you could basically make it so that it will.\n\n0:26:04\tSPEAKER_00\n It's just going to be sending a signal to the TV.\n\n0:26:07\tSPEAKER_00\n So if you send about five flip channels, if you do that, it's going to flip once.\n\n0:26:11\tSPEAKER_02\n It just might be frustrating where you can't make it go as fast as you want.\n\n0:26:15\tSPEAKER_02\n But I think once people get used to it, I do like the idea of the scroll wheel though.\n\n0:26:19\tSPEAKER_00\n And if we're marketing as a high niche product, then we're going to be selling it to people who are buying good TVs as well, yeah, presumably.\n\n0:26:25\tSPEAKER_01\n Yeah, I think so. I think so. The only thing on the interface side of it is that I see the dilemma.\n\n0:26:35\tSPEAKER_01\n But if we have the option of scrolling, any particular speed, or the option of jumping direct.\n\n0:26:45\tSPEAKER_01\n So I can go presuming I have on my television something that tells me what channel I'm on.\n\n0:26:53\tSPEAKER_01\n I can scroll direct from channel five to channel 32.\n\n0:26:58\tSPEAKER_01\n Shunk, I know what because it's on a television. The television tells me what channel it's on when I change it.\n\n0:27:04\tSPEAKER_01\n So I don't know that really that's going to be a problem because a television can go automatically from channel five to channel 32 with a push of a button.\n\n0:27:14\tSPEAKER_01\n So can we can we create that kind of interface within a scroll system? You understand what I'm saying?\n\n0:27:19\tSPEAKER_00\n I think I know what you might be getting it. Oh, I see. So if maybe if we had an LCD of the top that just had a number on it, right?\n\n0:27:26\tSPEAKER_02\n Or we could read on television. What about this? What about if you can program in your favorite channels into this scroll wheel and you can just like roll through your favorite channels?\n\n0:27:36\tSPEAKER_00\n That's quite cool. You need that display on the.\n\n0:27:39\tSPEAKER_00\n Why? It'll tell you when you flip the channel. The television can tell you. Can.\n\n0:27:44\tSPEAKER_00\n Oh, yeah, yeah. No, I see what you're talking about. Yeah, that's kind of cool. How would you program it though?\n\n0:27:49\tSPEAKER_02\n It's one extra button. You say program start and then type in because you still have the typing, you know, you still have the keypad where you can type it manually.\n\n0:27:57\tSPEAKER_02\n So program start 0, 1 enter 0, 5 enter 38 enter program end.\n\n0:28:04\tSPEAKER_00\n Okay. And yeah, and that just basically flips between it and it'll go. It sends out 0, 5 and then 36 and then 0, 1, yeah, that's kind of cool. I like that.\n\n0:28:14\tSPEAKER_01\n And again, we have another another great marketing tool. We have about three. We have three or four things here.\n\n0:28:19\tSPEAKER_00\n That's not going to be too expensive because that's going to be you're going to be able to nab that off of computer mouse manufacturers really.\n\n0:28:25\tSPEAKER_00\n You can basically come up with a partnership to be able to produce that quite cheaply.\n\n0:28:30\tSPEAKER_01\n I don't know. And maybe we maybe even have this as in house technology. This may be something that's available through our own through our own services.\n\n0:28:38\tSPEAKER_00\n But that that's not going to be such a cost they feature. The problem we're going to have is making it robust.\n\n0:28:43\tSPEAKER_02\n Well, we also have to determine in some manner how to switch between modes between going through your favors list and just hitting up one up to we go directional.\n\n0:28:53\tSPEAKER_01\n We go this we go this we go this we go this way for one we go this way for the other because you want to be able to go up and down to the channel.\n\n0:29:00\tSPEAKER_01\n Yeah, people are going to start a whether they do that. Well, then you just have you have a different you have a mode switch.\n\n0:29:06\tSPEAKER_02\n We'll need a mode switch, but then if we have a mode switch, we're going to need some kind of indicator.\n\n0:29:11\tSPEAKER_02\n It's a white. And then I'll be in the light buttons. Maybe. Okay.\n\n0:29:15\tSPEAKER_00\n Okay, we have five minutes. So right details that we've talked about here are that we want a scroll wheel.\n\n0:29:27\tSPEAKER_00\n We want a mode indicator.\n\n0:29:33\tSPEAKER_00\n We want backlit buttons.\n\n0:29:39\tSPEAKER_00\n And if we're making backlit buttons period, do we want that just for the mode indicator or maybe to indicate what button you're pressing at the time so that you know if it's actually pressed or not seen some remote to do that.\n\n0:29:49\tSPEAKER_02\n Okay, just so you know, I think I mean it was my understanding that before we were going to stay in the mid market range.\n\n0:29:55\tSPEAKER_02\n It seems we're kind of approaching a higher.\n\n0:30:00\tSPEAKER_01\n We have more money for this.\n\n0:30:04\tSPEAKER_00\n It's not that we have more money, we can push up the price. That's what I mean. We can increase the cost.\n\n0:30:09\tSPEAKER_01\n Okay. So I don't know. I don't know.\n\n0:30:12\tSPEAKER_02\n Does everybody's on board with it? Yeah.\n\n0:30:16\tSPEAKER_00\n So we really need to be sure as to what we can push the cost up to though we haven't got to stage where we're ready to pin down the price of components.\n\n0:30:22\tSPEAKER_00\n But say what sort of price are we looking to do it ourselves and like that and what sort of price can we make it for?\n\n0:30:27\tSPEAKER_01\n Well, I think the design and technology has to come back and say okay, to create this product we see it's going to cost us this much for this volume.\n\n0:30:35\tSPEAKER_01\n Because we do have a volume target of 50 million profit.\n\n0:30:39\tSPEAKER_00\n Yeah, no, I think that's where we really should be more flexible than anything else because as we said in the last meeting, our management is really looking for us to push our brand.\n\n0:30:47\tSPEAKER_00\n We're entering a new market here. So I think the profit expectation for this one product is maybe not as important as being able to.\n\n0:30:54\tSPEAKER_01\n Okay, I'm okay with that. I guess what I just want to me. The next step is for these guys to come come in with the design proposal with the cost estimate attached.\n\n0:31:04\tSPEAKER_01\n And then we have to take this to the next level.\n\n0:31:06\tSPEAKER_00\n That's a ballpark cast of what we'd be able to sell something.\n\n0:31:08\tSPEAKER_02\n Well, yeah, let's let's find out how much would you pay for with all these features.\n\n0:31:13\tSPEAKER_02\n How much would you pay if you went to the store and you were in the market to replace your TV remote?\n\n0:31:18\tSPEAKER_02\n How much would you pay for that?\n\n0:31:20\tSPEAKER_00\n Well, you know, the thing who our target market is because I'm not our target market. I'm a student.\n\n0:31:25\tSPEAKER_00\n But if on the other hand, I would think with my project manager, salary, I you could probably think, yeah, I could probably afford this.\n\n0:31:36\tSPEAKER_00\n Would I buy it? Maybe if I had a cool new TV and this was looking really slick and it had the dog can it had the scroll wheel, which I think is a really cool idea. That would sell me on it a little.\n\n0:31:45\tSPEAKER_00\n Then maybe, you know, I don't think I'd go over 100 years certainly.\n\n0:31:50\tSPEAKER_00\n Oh, no, no, not too much. But the I would be happy paying over 40 for it, I guess.\n\n0:31:57\tSPEAKER_02\n I would say 35 to 40.\n\n0:31:59\tSPEAKER_01\n Yeah, I was going to say 35 to 50.\n\n0:32:01\tSPEAKER_00\n Okay, 35 to 50 years is a sales bracket.\n\n0:32:04\tSPEAKER_00\n Okay, okay.\n\n0:32:05\tSPEAKER_01\n One of the things we're marketing about this product is this is the last one you will ever need to buy for the television.\n\n0:32:11\tSPEAKER_01\n It's one of the marketing features in this.\n\n0:32:13\tSPEAKER_00\n That's why the scroll needs to be really robust.\n\n0:32:16\tSPEAKER_03\n Okay, so welcome up with some to be between 35 and 50.\n\n0:32:19\tSPEAKER_03\n That is rug the rubber, robust with scroll wheel, with the new facilities of the scroll wheel like favorite stuff, favorite channels.\n\n0:32:29\tSPEAKER_03\n With a cradle, radio transmitter and the locator.\n\n0:32:32\tSPEAKER_02\n And backlit buttons and it's going to look sexy.\n\n0:32:36\tSPEAKER_02\n Or not.\n\n0:32:37\tSPEAKER_02\n Or not. It might look like clay.\n\n0:32:39\tSPEAKER_02\n Okay.\n\n0:32:40\tSPEAKER_03\n So you can market.\n\n0:32:43\tSPEAKER_01\n Yeah, that's easy.\n\n0:32:44\tSPEAKER_01\n That's not a touch of check.\n\n0:32:47\tSPEAKER_01\n Because we have about six, six, seven features in that alone.\n\n0:32:53\tSPEAKER_01\n Yep.\n\n0:32:54\tSPEAKER_01\n Under the title of uniqueness is.\n\n0:32:57\tSPEAKER_00\n Okay, the next meeting starts in 30 minutes.\n\n0:32:59\tSPEAKER_00\n Although does it, it starts at 321, the next meeting.\n\n0:33:04\tSPEAKER_00\n So we've got more than 30 minutes.\n\n0:33:07\tSPEAKER_01\n What? Like 50.\n\n0:33:10\tSPEAKER_01\n It's like 321, it's the next meeting.\n\n0:33:12\tSPEAKER_00\n The next meeting is 321, yeah.\n\n0:33:14\tSPEAKER_01\n That's almost 50 minutes.\n\n0:33:17\tSPEAKER_00\n Yeah, that is.\n\n0:33:18\tSPEAKER_00\n You guys can change the times from the presentations.\n\n0:33:21\tSPEAKER_01\n You guys can create a...\n\n0:33:24\tSPEAKER_02\n Probably we'll let you know when we're done.\n\n0:33:26\tSPEAKER_02\n If we can go earlier.\n\n0:33:28\tSPEAKER_00\n Thanks, yeah.\n\n0:33:29\tSPEAKER_00\n Okay, so you guys will be getting your modeling done now.\n\n0:33:33\tSPEAKER_00\n And, okay, are there any other questions with regards to what this thing is going to do?\n\n0:33:39\tSPEAKER_00\n Look like how it's going to work that need to be addressed before we really look at this in a lot of detail.\n\n0:33:47\tSPEAKER_02\n I don't think so.\n\n0:33:48\tSPEAKER_02\n If you have any questions, we'll just email you, I guess.\n\n0:33:51\tSPEAKER_00\n Okay.\n\n0:33:52\tSPEAKER_03\n Yeah, I think pretty much everything's covered.\n\n0:33:55\tSPEAKER_00\n Okay.\n\n0:33:56\tSPEAKER_00\n This one was quite easy.\n\n0:33:58\tSPEAKER_00\n Caribbean Wars.\n\n0:34:00\tSPEAKER_00\n It's always the optimist.\n\n0:34:02\tSPEAKER_00\n Yes, okay.\n\n0:34:03\tSPEAKER_00\n Thanks guys.\n\n0:34:04\tSPEAKER_01\n Thank you.\n\n0:34:05\tSPEAKER_01\n I don't have any emails.\n\n0:34:07\tSPEAKER_01\n This means I can go home.\n\n0:34:09\tSPEAKER_00\n It's going to be easy actually.\n\n0:34:13\tSPEAKER_01\n Oh, we are leaving.\n\n0:34:16\tNone\n Maybe I just keep going.\n\n0:34:22\tNone\n Maybe I just keep going on walking to the bathroom.\n\n0:34:29\tNone\n I'm on the mother's nose.\n\n0:34:36\tNone\n Yeah, but these are better because they're not ours.\n\n", "summary": [{"summary_text": "SPEAKER and his colleagues are meeting for a conceptual design meeting. They need to retrain Mike on how to put his mic on. They are going to do a presentation and make some decisions. They will let people talk before they make any decisions. Speaker will go first."}]}