{"filename": "./data/IS1007c.txt", "transcript": "0:00:30\tNone\n Uainometer 2 A\n\n0:00:57\tNone\n Jt Uain Am\n\n0:00:59\tNone\n a h In the last meeting we have discussed the functional design.\n\n0:01:07\tSPEAKER_02\n Now we will talk about the conceptual design.\n\n0:01:13\tSPEAKER_03\n I think I will see the details to my presentation on the components concept.\n\n0:01:27\tSPEAKER_03\n So can you please open I'm participant 2.\n\n0:01:39\tSPEAKER_03\n I will talk about the design.\n\n0:01:49\tSPEAKER_03\n The first thing I have done is to make a review together with the Manufactural department which components were available to build remote control.\n\n0:02:07\tSPEAKER_03\n So for energy sources we have to choose between the soror energy, hand in ammo and kinetic and the kinetic technique to store the energy.\n\n0:02:25\tSPEAKER_03\n We also can put regular battery in the remote control.\n\n0:02:31\tSPEAKER_02\n This is what we have decided in the last meeting.\n\n0:02:35\tSPEAKER_02\n But if we use battery.\n\n0:02:37\tSPEAKER_03\n Yes, well I meant by battery I meant I would not have a wire between the remote control and the energy source.\n\n0:02:51\tSPEAKER_03\n But I didn't, we didn't decide yet which kind of battery we will put inside the remote.\n\n0:03:01\tSPEAKER_03\n It's a point to this sketch.\n\n0:03:03\tSPEAKER_03\n Then the case material we have also several choices like wood, rubber, titanium or latex.\n\n0:03:13\tSPEAKER_03\n But well it's not a real issue for the technical point of view.\n\n0:03:25\tSPEAKER_03\n Concerning the interface we can put simple buttons or scrolls or buttons much more complicated.\n\n0:03:35\tSPEAKER_03\n But it also requires that the chip to process the button is more complicated.\n\n0:03:43\tSPEAKER_03\n So this is the last point.\n\n0:03:47\tSPEAKER_03\n Let's choose the chips.\n\n0:03:49\tSPEAKER_03\n So what I have found is that I think basic battery or kinetic energy collection is the better way to provide energy.\n\n0:04:01\tSPEAKER_03\n Because I think soror energy won't work in the catalan environment.\n\n0:04:09\tSPEAKER_03\n So I think we can start with these two main things.\n\n0:04:17\tSPEAKER_03\n For the case, well I think that titanium is a good choice because it's trendy.\n\n0:04:27\tSPEAKER_03\n It's modern and user will be very happy to have a nice remote.\n\n0:04:41\tSPEAKER_03\n For the interface, I think that we can achieve all the desired functionalities by just using rubber buttons, simple buttons.\n\n0:04:53\tSPEAKER_03\n And just this allow to use a regular chip.\n\n0:04:57\tSPEAKER_03\n That's how I will cheaper.\n\n0:05:01\tSPEAKER_03\n And so we can move to the next slide.\n\n0:05:07\tSPEAKER_01\n What is the single curved?\n\n0:05:11\tSPEAKER_03\n It's the shape of the remote.\n\n0:05:17\tSPEAKER_03\n The curve will fit into your hand when you grab it.\n\n0:05:25\tSPEAKER_01\n When you hold on it, it's comfortable to hold.\n\n0:05:27\tSPEAKER_03\n It's more comfortable that if it is completely flat.\n\n0:05:33\tSPEAKER_01\n And the battery is a rechargeable or it doesn't matter.\n\n0:05:39\tSPEAKER_03\n That's the point.\n\n0:05:41\tSPEAKER_03\n The kinetic one is you can recharge by the...\n\n0:05:45\tSPEAKER_01\n That's what it means by...\n\n0:05:49\tSPEAKER_03\n Just by moving your arm, the remote will accumulate energy.\n\n0:05:57\tSPEAKER_03\n But I don't know if it is feasible because I don't know if the user will move enough to provide the remote or the necessary energy.\n\n0:06:13\tSPEAKER_01\n We might check with our R&D department to see if they have this product.\n\n0:06:21\tSPEAKER_01\n Ready for market.\n\n0:06:23\tSPEAKER_03\n Can you go to the next slide, please.\n\n0:06:27\tSPEAKER_03\n That's summarized what I have said.\n\n0:06:33\tSPEAKER_03\n You're right.\n\n0:06:37\tSPEAKER_03\n We can see our R&D department.\n\n0:06:41\tSPEAKER_03\n If the kinetic method is sufficient to provide enough energy, that's it.\n\n0:07:11\tSPEAKER_01\n So I'll keep in touch with the R&D department.\n\n0:07:15\tSPEAKER_03\n Oh yeah, I take care.\n\n0:07:19\tSPEAKER_01\n So the Titanium case is the normal case.\n\n0:07:27\tSPEAKER_01\n I'll show you some pictures that I have.\n\n0:07:29\tSPEAKER_01\n And you tell me whether they are Titanium case or not.\n\n0:07:33\tSPEAKER_01\n I'm very sure that they are plastic, Titanium or whatever.\n\n0:07:41\tSPEAKER_01\n The point I want to make is that the work you have seen in my presentation later on.\n\n0:07:47\tSPEAKER_01\n I'll point out some white buttons.\n\n0:07:49\tSPEAKER_01\n Not the only ways you can use.\n\n0:07:57\tSPEAKER_02\n Maybe we will work it.\n\n0:08:01\tSPEAKER_01\n So the user interface is...\n\n0:08:29\tSPEAKER_01\n This is the aspect of a computer system, a problem which can be seen or hurt.\n\n0:08:37\tSPEAKER_01\n Otherwise perceived by the human user and the commands and mechanism, the user uses to control its operation and input data.\n\n0:08:47\tSPEAKER_01\n So it just gives you the ways to input the data.\n\n0:08:51\tSPEAKER_01\n We have more... we have emphasized more on the graphical user interface here.\n\n0:08:55\tSPEAKER_01\n The idea is to represent buttons as figures, diagrams, symbols and so on.\n\n0:09:03\tSPEAKER_01\n So you can easily... when you look at the symbols, you understand what it is doing.\n\n0:09:07\tSPEAKER_01\n What's the function of this?\n\n0:09:09\tSPEAKER_01\n Yeah.\n\n0:09:11\tSPEAKER_02\n I think it makes the EHF1 sphere easy to use.\n\n0:09:17\tSPEAKER_01\n It's on the next one.\n\n0:09:21\tSPEAKER_01\n It's function 5.\n\n0:09:25\tSPEAKER_01\n So I can use the mouse.\n\n0:09:27\tSPEAKER_02\n I can easily use the interface.\n\n0:09:31\tSPEAKER_01\n So the next...\n\n0:09:33\tSPEAKER_01\n So here are some examples.\n\n0:09:37\tSPEAKER_01\n So they clustered the buttons together.\n\n0:09:39\tSPEAKER_01\n They grouped in to color them.\n\n0:09:43\tSPEAKER_01\n And they have different forms as well.\n\n0:09:49\tSPEAKER_01\n But these interface are kind of confusing.\n\n0:09:53\tSPEAKER_01\n Basically, there are too many buttons.\n\n0:09:57\tSPEAKER_01\n Next one.\n\n0:09:59\tSPEAKER_01\n So some people are a proposed voice recognition.\n\n0:10:05\tSPEAKER_01\n So by the way, I received an email from one of our departments saying that the voice recognition has been used in the coffee machine.\n\n0:10:15\tSPEAKER_01\n This is by a company.\n\n0:10:19\tSPEAKER_01\n When you tell the... you say, good morning coffee machine and the machine will reply to you.\n\n0:10:23\tSPEAKER_01\n So I just got an email saying that.\n\n0:10:25\tSPEAKER_01\n And it seems like this voice recognition technology is ready to be used.\n\n0:10:29\tSPEAKER_01\n So we might consider that.\n\n0:10:31\tSPEAKER_01\n Yeah, of course.\n\n0:10:33\tSPEAKER_01\n The next one.\n\n0:10:39\tSPEAKER_01\n So some people use... some people use a spinning wheel with the LC display.\n\n0:10:45\tSPEAKER_01\n So instead of using the buttons, you have an LC display screen.\n\n0:10:49\tSPEAKER_01\n And then there you can...\n\n0:10:53\tSPEAKER_01\n You can use that as buttons.\n\n0:10:55\tSPEAKER_01\n You can use that as wheel.\n\n0:10:57\tSPEAKER_01\n So that could be an option as well.\n\n0:11:00\tSPEAKER_01\n Touch screen.\n\n0:11:02\tSPEAKER_01\n Next one.\n\n0:11:05\tSPEAKER_01\n And some people propose a scroll button integrated with push button.\n\n0:11:11\tSPEAKER_01\n So you may have scroll button instead of just the push button.\n\n0:11:15\tSPEAKER_01\n Like the one we have here.\n\n0:11:17\tSPEAKER_01\n Next one.\n\n0:11:23\tSPEAKER_01\n So...\n\n0:11:27\tSPEAKER_01\n So there are a few aspects that I collected here.\n\n0:11:33\tSPEAKER_01\n So basically these deals with special users.\n\n0:11:38\tSPEAKER_01\n Children, handicapped people, old people, and...\n\n0:11:47\tSPEAKER_01\n And basically they are programmable, especially for children.\n\n0:11:51\tSPEAKER_01\n And...\n\n0:11:55\tSPEAKER_01\n Yeah.\n\n0:11:57\tSPEAKER_01\n And then they also secure covers to protect...\n\n0:12:02\tSPEAKER_01\n Secured and hidden programming and battery covers.\n\n0:12:05\tSPEAKER_01\n They will protect your settings.\n\n0:12:09\tSPEAKER_01\n But we don't have to integrate all these complicated features.\n\n0:12:13\tSPEAKER_01\n I'm just saying that currently in the market, they are...\n\n0:12:17\tSPEAKER_01\n They are controlled.\n\n0:12:19\tSPEAKER_01\n They are remote controllers.\n\n0:12:22\tSPEAKER_01\n Customizable for different people.\n\n0:12:25\tSPEAKER_01\n So that's the point.\n\n0:12:27\tSPEAKER_01\n Next one.\n\n0:12:34\tSPEAKER_01\n And you see this is the one where you have the protection cover.\n\n0:12:38\tSPEAKER_01\n It may be useful for children.\n\n0:12:41\tSPEAKER_01\n They only see the buttons outside.\n\n0:12:44\tSPEAKER_01\n And for adults where you have more control, you can see the one inside.\n\n0:12:48\tSPEAKER_01\n So the adults might want to have a key to lock that.\n\n0:12:51\tSPEAKER_01\n So children will not touch the button inside.\n\n0:12:55\tSPEAKER_03\n So good idea.\n\n0:12:58\tSPEAKER_01\n The next one.\n\n0:13:00\tSPEAKER_01\n So this guy, this is another company that provides big buttons.\n\n0:13:05\tSPEAKER_01\n I see that it's useful for all people and then you don't get lost.\n\n0:13:10\tSPEAKER_01\n But for our product, we don't need a big one.\n\n0:13:13\tSPEAKER_01\n Because you have voice recognition.\n\n0:13:16\tSPEAKER_01\n Eventually it is used.\n\n0:13:18\tSPEAKER_01\n And you can call your remote controller if you don't know where it is.\n\n0:13:22\tSPEAKER_01\n TV remote controller, where are you?\n\n0:13:25\tSPEAKER_01\n And then you have beeps and to say that I'm here.\n\n0:13:29\tSPEAKER_01\n For example, is it possible?\n\n0:13:32\tSPEAKER_02\n We should be in good speed, it is.\n\n0:13:34\tSPEAKER_04\n In this case, no?\n\n0:13:36\tSPEAKER_03\n Yes, but as Norman says, there is a radio commercial product available to do this.\n\n0:13:43\tSPEAKER_03\n We can check it to integrate it in two hours on newer remote control.\n\n0:13:49\tSPEAKER_01\n And this is another one where you can...\n\n0:13:55\tSPEAKER_01\n The patch, there's a V standing for the volume.\n\n0:13:59\tSPEAKER_01\n So there's an up arrow and a down arrow.\n\n0:14:02\tSPEAKER_01\n But you see that in the V, the V appears to be the down arrow on the top.\n\n0:14:06\tSPEAKER_01\n On the top, up arrow.\n\n0:14:09\tSPEAKER_01\n If you up arrow, there's a V.\n\n0:14:10\tSPEAKER_01\n Like, SUV is turning down, so it's confusing in the face.\n\n0:14:14\tSPEAKER_01\n So I want to avoid this kind of thing in the design.\n\n0:14:18\tSPEAKER_01\n And here is a short summary that I compile.\n\n0:14:22\tSPEAKER_01\n After the findings I found, big buttons are convenient, voice recognition helps.\n\n0:14:28\tSPEAKER_01\n Push buttons, scroll buttons, spinning wheels can be used as navigation tools.\n\n0:14:34\tSPEAKER_01\n And I use the customizable, it's important.\n\n0:14:37\tSPEAKER_01\n And finally, simplicity, simplicity is the key.\n\n0:14:41\tSPEAKER_01\n So we have many concepts there, but we have to choose later on.\n\n0:14:47\tSPEAKER_01\n Which ones are important to be used?\n\n0:14:50\tSPEAKER_03\n Well, I think you...\n\n0:14:54\tSPEAKER_03\n It's fine, you are reviewed all the possibilities.\n\n0:14:59\tSPEAKER_03\n But if we consider that the user interface is displayed on the TV screen, I don't think we need much buttons in the remote.\n\n0:15:14\tSPEAKER_03\n Since we just have to navigate and to have a OK or an ENTER key or things like that.\n\n0:15:22\tSPEAKER_03\n Because adding wheels or scrolls makes the thing more complicated and more expensive.\n\n0:15:31\tSPEAKER_02\n Or maybe we can include the user, Maria in the remote mode itself.\n\n0:15:39\tSPEAKER_02\n And we should have just a button like help and you say, you press the button help and maybe you see the user.\n\n0:15:49\tSPEAKER_03\n That's a good idea to have a help button.\n\n0:15:53\tSPEAKER_01\n A help button.\n\n0:15:54\tSPEAKER_01\n So you are deep-spare on the screen.\n\n0:15:56\tSPEAKER_01\n On the TV screen, on the TV screen, you just use the button.\n\n0:16:00\tSPEAKER_01\n How to use your remote.\n\n0:16:02\tSPEAKER_01\n OK, so that eliminates all the complicated documentation.\n\n0:16:08\tSPEAKER_00\n OK, but people are offered of looking at the help.\n\n0:16:11\tSPEAKER_00\n Once they see the help button, they see, or this is the complicated stuff.\n\n0:16:15\tSPEAKER_00\n No, in the case where they need the...\n\n0:16:18\tSPEAKER_02\n It's a psychology.\n\n0:16:20\tSPEAKER_02\n Where they need the marketing.\n\n0:16:21\tSPEAKER_00\n OK, and let us see what the market demands.\n\n0:16:24\tSPEAKER_00\n We could just go to my presentation.\n\n0:16:26\tSPEAKER_02\n It's just for user, that's too much, you know.\n\n0:16:29\tSPEAKER_02\n Yeah, that's fine.\n\n0:16:30\tSPEAKER_02\n For kids or out people.\n\n0:16:33\tSPEAKER_00\n I mean, you just showed us the remote with a cap, which could be used for kids and if you remodeled...\n\n0:16:39\tSPEAKER_00\n So it's the same remote with some...\n\n0:16:42\tSPEAKER_02\n It can be used by both kids and out people.\n\n0:16:47\tSPEAKER_01\n Well, what I propose is that, you know, a remote controller...\n\n0:16:54\tSPEAKER_01\n It could be a cube.\n\n0:16:56\tSPEAKER_01\n It's a small device that looks like a cube.\n\n0:17:00\tSPEAKER_01\n And maybe you can just change the buttons.\n\n0:17:05\tSPEAKER_01\n If you turn one side, you get one button.\n\n0:17:08\tSPEAKER_01\n You turn the other side, you get the other buttons.\n\n0:17:11\tSPEAKER_01\n So for maybe new generation people who get used to the computer, they want lots of controls.\n\n0:17:17\tSPEAKER_02\n Maybe for kids.\n\n0:17:19\tSPEAKER_02\n Kids they like.\n\n0:17:20\tSPEAKER_02\n Small.\n\n0:17:21\tSPEAKER_02\n Small too.\n\n0:17:22\tSPEAKER_03\n Let's see what the market demands.\n\n0:17:25\tSPEAKER_01\n One, the kind of side what the market demands.\n\n0:17:27\tSPEAKER_01\n Yes, yes.\n\n0:17:50\tSPEAKER_00\n So we just made a marketing survey of what people need from our remotes and how it could be special from the other remotes.\n\n0:18:01\tSPEAKER_00\n And we got based on the responses from the questionnaires.\n\n0:18:06\tSPEAKER_00\n We also have some prizes for the most creative suggestions.\n\n0:18:09\tSPEAKER_00\n And we found the following suggestions, which we could...\n\n0:18:13\tSPEAKER_00\n Which would be helpful for our design.\n\n0:18:15\tSPEAKER_00\n So 75% of the users, they find the remote controls very ugly.\n\n0:18:20\tSPEAKER_00\n They don't find it pleasant to use in the size or usage or anything.\n\n0:18:25\tSPEAKER_00\n And 80% of the people, they are always...\n\n0:18:29\tSPEAKER_00\n I mean, they are willing to spend more money if the remote control would look fancy.\n\n0:18:35\tSPEAKER_00\n And the current remote controls do not match well the operating behavior of the user.\n\n0:18:41\tSPEAKER_00\n And 75% of the users said there's a lot.\n\n0:18:47\tSPEAKER_00\n And 50% said they use only 10% of the buttons.\n\n0:18:51\tSPEAKER_00\n So the rest of the 90% of the buttons, they are not used most of the times.\n\n0:18:56\tSPEAKER_00\n So this was the findings which we found.\n\n0:18:59\tSPEAKER_00\n And also these are the frustrations with the present remote controls.\n\n0:19:04\tSPEAKER_00\n Most of 50% of the time the remote controls are lost somewhere in the room.\n\n0:19:08\tSPEAKER_00\n And people are always searching for them rather than watching the TV.\n\n0:19:13\tSPEAKER_00\n And while the time they found the remote control, the program is finished.\n\n0:19:17\tSPEAKER_00\n So they frustrated a lot.\n\n0:19:20\tSPEAKER_00\n And if the remote control is too complicated, it takes much time to learn the functionality of it.\n\n0:19:28\tSPEAKER_00\n So you can just see the percentage, 50%.\n\n0:19:32\tSPEAKER_00\n People that responded that they always lose their remorse and 34%.\n\n0:19:36\tSPEAKER_00\n They say that it's quite difficult to learn if it's too complex.\n\n0:19:41\tSPEAKER_00\n So keeping in view all these findings and the frustrations, I think this should be the solution for them.\n\n0:19:50\tSPEAKER_00\n We should have an LCD on the remote control.\n\n0:19:55\tSPEAKER_03\n Oh.\n\n0:19:57\tSPEAKER_03\n Well, I don't really see the advantage of having LCD on the remote control.\n\n0:20:02\tSPEAKER_03\n If we have a big screen.\n\n0:20:04\tSPEAKER_03\n A big screen and the display on the screen.\n\n0:20:07\tSPEAKER_03\n Yeah, of course it's fancy, trendy and so on.\n\n0:20:10\tSPEAKER_03\n But it's expensive to produce.\n\n0:20:13\tSPEAKER_03\n And it's not true.\n\n0:20:16\tSPEAKER_00\n As our service is that people are willing to pay more if your remotes are fancy.\n\n0:20:21\tSPEAKER_00\n So if you have an LCD on the remote, rather than looking onto the TV, you just look into your remote and navigate it.\n\n0:20:28\tSPEAKER_00\n You just say menu.\n\n0:20:30\tSPEAKER_00\n As we saw that iPod remote control.\n\n0:20:33\tSPEAKER_03\n They just play around.\n\n0:20:35\tSPEAKER_03\n Yeah, but when you play with the iPad, you don't have a big screen in front of you.\n\n0:20:39\tSPEAKER_02\n And you use the screen instead of the PC.\n\n0:20:43\tSPEAKER_01\n If you use the existing screen, you eliminate the LCD.\n\n0:20:46\tSPEAKER_01\n After all, the LCD is just to display.\n\n0:20:49\tSPEAKER_01\n And if you have the colorful screen, you can make the display colorful, fancy, as fancy as the one on the LCD.\n\n0:20:56\tSPEAKER_01\n It may be even better.\n\n0:20:58\tSPEAKER_00\n I mean, those were the points which we got from the market demands.\n\n0:21:04\tSPEAKER_03\n So I think we can focus on the fancy look.\n\n0:21:10\tSPEAKER_01\n More on the fancy design.\n\n0:21:13\tSPEAKER_03\n On the speech recognition, if the technology is available, but I think LCD will make us spend a lot of money for not so big results.\n\n0:21:25\tSPEAKER_01\n Remember we have a budget for the cost of producing the remote controller.\n\n0:21:31\tSPEAKER_02\n Yeah.\n\n0:21:32\tSPEAKER_01\n So the thing is, you can find out how much an LCD will cost.\n\n0:21:37\tSPEAKER_01\n And then we will decide again.\n\n0:21:39\tSPEAKER_00\n I mean, that should be found out by the industry designers.\n\n0:21:43\tSPEAKER_01\n We can find out the price until we have the same time.\n\n0:21:47\tSPEAKER_03\n So price of LCD display.\n\n0:21:50\tSPEAKER_00\n And it's always good to have an voice recognition for the remote controller.\n\n0:21:54\tSPEAKER_01\n And also the cost for the speech recognition.\n\n0:21:57\tSPEAKER_02\n As our R&D department.\n\n0:21:59\tSPEAKER_02\n It's just for sport vocabulary.\n\n0:22:01\tSPEAKER_00\n It's not only for a limited vocabulary.\n\n0:22:03\tSPEAKER_00\n It's a 80 commands also.\n\n0:22:05\tSPEAKER_01\n And also the scroller button, how much will it cost?\n\n0:22:09\tSPEAKER_03\n Well, compared to the simple, simple, simple button.\n\n0:22:15\tSPEAKER_00\n The scroll button, anywhere from the survey, we never see that people would like to have some scrolling button.\n\n0:22:21\tSPEAKER_00\n They're just frightened to use the scrollings or help button.\n\n0:22:26\tSPEAKER_03\n I think that, as we have seen in the presentation, about 50% of the percentage.\n\n0:22:36\tSPEAKER_03\n Then use the button.\n\n0:22:37\tSPEAKER_03\n Don't use the button.\n\n0:22:38\tSPEAKER_03\n So I think to have a simple button is sufficient for our functionality.\n\n0:22:44\tSPEAKER_02\n It doesn't mean that the other buttons are not in the CREO or in port.\n\n0:22:50\tSPEAKER_02\n Yeah, but they are just getting used to it.\n\n0:22:53\tSPEAKER_00\n They're not too smart.\n\n0:22:54\tSPEAKER_03\n The thing is, is that we can add a functionality on the TV screen, like a list of functions.\n\n0:23:04\tSPEAKER_03\n And then you choose with the button to navigate.\n\n0:23:08\tSPEAKER_02\n So maybe we can make this 10% of button more bigger than the others.\n\n0:23:17\tSPEAKER_03\n Yeah, but if we could have a display, a user interface that is very complete on the TV screen, I think that just five buttons are sufficient.\n\n0:23:33\tSPEAKER_03\n We want to go up, left, right down and enter.\n\n0:23:37\tSPEAKER_03\n And you just select the functionality you want to access, or things like that.\n\n0:23:42\tSPEAKER_03\n You don't have to switch to a channel to another room.\n\n0:23:48\tSPEAKER_00\n Or it could be like this, as the people say, if they have an LCD on the remote, not on the television.\n\n0:23:53\tSPEAKER_00\n Because when you have the LCD on to the television screen, you miss the picture in the background.\n\n0:24:00\tSPEAKER_00\n We are most focused on the commands.\n\n0:24:02\tSPEAKER_00\n So if you have an LCD in the remote, you just have a menu and increasing and lower the signs here to change the programs.\n\n0:24:11\tSPEAKER_00\n And this menu, when you press the menu, in the ulcerative displays, as you go on pressing the menu, it first displays volume, then the program, then the brightness, contrast, and all this stuff.\n\n0:24:23\tSPEAKER_00\n And accordingly, you can just increase or decrease.\n\n0:24:26\tSPEAKER_03\n Yeah, but if you look at the LCD, you don't look at the TV screen.\n\n0:24:30\tSPEAKER_03\n So it's not really worth to have the image if you don't look at it.\n\n0:24:35\tSPEAKER_02\n And I think it's the cost of the remote control.\n\n0:24:39\tSPEAKER_02\n Yeah, that has to be checked.\n\n0:24:41\tSPEAKER_01\n I think there is no contradiction here.\n\n0:24:43\tSPEAKER_01\n Because if there are few buttons, you don't have to look at your controller anymore because you know where the buttons are.\n\n0:24:50\tSPEAKER_01\n So if you want to control the screen, sharpness, you just say sharpness.\n\n0:24:56\tSPEAKER_01\n And then you just press left, increase or decrease button.\n\n0:25:01\tSPEAKER_01\n And the same for the volume.\n\n0:25:03\tSPEAKER_01\n And the channel, if you have the speech recognition day, just shout your channel, just tell your channel.\n\n0:25:10\tSPEAKER_01\n And then you don't even have to look at the controller.\n\n0:25:13\tSPEAKER_01\n So finally, that will eliminate the need for LCD.\n\n0:25:17\tSPEAKER_01\n With the help of speech recognition, you can...\n\n0:25:20\tSPEAKER_00\n I mean, it would be better if you could just check out the cost with LCD and also with the speech recognition.\n\n0:25:26\tSPEAKER_00\n And then we could find which would be more suitable for NISCAS.\n\n0:25:30\tSPEAKER_01\n Yeah.\n\n0:25:31\tSPEAKER_00\n And the third problem was to find the remote control.\n\n0:25:35\tSPEAKER_00\n So 50% of the people say they lose the remote.\n\n0:25:39\tSPEAKER_03\n So we can think about where the vocal command like find and when the remote control is assigned to a people.\n\n0:25:50\tSPEAKER_03\n Or just to make him be...\n\n0:25:53\tSPEAKER_00\n Yeah, that's right.\n\n0:25:54\tSPEAKER_00\n That's exactly what I mean by voice command there.\n\n0:25:56\tSPEAKER_00\n Or it could be also something like this.\n\n0:25:59\tSPEAKER_00\n It's always boring to change the batteries of the remote control.\n\n0:26:03\tSPEAKER_00\n So we have someone charger there.\n\n0:26:05\tSPEAKER_00\n And whenever we don't use the remote control, we put it in the charger.\n\n0:26:09\tSPEAKER_00\n Yeah.\n\n0:26:10\tSPEAKER_00\n And when we are using that remote and if you miss plug somewhere, in the charger we have a small button.\n\n0:26:16\tSPEAKER_00\n And just by pressing the button in the charger, the remote control beeps, wherever it is.\n\n0:26:21\tSPEAKER_03\n And that's a good idea, that's simple.\n\n0:26:24\tSPEAKER_03\n Yeah.\n\n0:26:25\tSPEAKER_00\n I mean, it also doesn't require a voice command.\n\n0:26:27\tSPEAKER_00\n Because there are problems with the voice command.\n\n0:26:29\tSPEAKER_02\n Because we have to move the charger.\n\n0:26:31\tSPEAKER_00\n Yeah, yeah, yeah.\n\n0:26:33\tSPEAKER_00\n Because it's always with the electricity plug.\n\n0:26:35\tSPEAKER_03\n Yeah, if there is not enough battery.\n\n0:26:38\tSPEAKER_03\n Also, and the remote is less.\n\n0:26:42\tSPEAKER_01\n Yeah, that's right.\n\n0:26:43\tSPEAKER_01\n What we can do is we can program a function whereby when you press the switch off TV button, the off button, the remote there will be an instruction on the screen.\n\n0:26:53\tSPEAKER_01\n Please charge me.\n\n0:26:55\tSPEAKER_01\n You never get it lost because every time you're off the computer, the TV, the remote control will tell you to put it back to the charger.\n\n0:27:06\tSPEAKER_00\n It's a good reminder, yeah, that's right.\n\n0:27:08\tSPEAKER_01\n So you never get lost TV.\n\n0:27:10\tSPEAKER_01\n Okay.\n\n0:27:11\tNone\n Yeah.\n\n0:27:12\tSPEAKER_02\n That before some people, but former lazy people.\n\n0:27:16\tSPEAKER_01\n Yeah, because everything is programmed inside.\n\n0:27:19\tSPEAKER_01\n Yeah.\n\n0:27:20\tSPEAKER_01\n So it's all about strategy.\n\n0:27:24\tSPEAKER_00\n And of course, the final point is the fancy look.\n\n0:27:27\tSPEAKER_00\n As we have seen earlier, the remote which were displayed by Norman, they were fancy.\n\n0:27:34\tSPEAKER_00\n Very big or something.\n\n0:27:37\tSPEAKER_00\n With lot of buttons.\n\n0:27:39\tSPEAKER_00\n I think we should have something.\n\n0:27:41\tSPEAKER_03\n Well, the last one with the...\n\n0:27:44\tSPEAKER_03\n Yeah, we did two parts with the entire original...\n\n0:27:48\tSPEAKER_00\n I mean, it's like that.\n\n0:27:51\tSPEAKER_00\n Even a kid who wants to have a control, he could just plug it and use it.\n\n0:27:57\tSPEAKER_00\n He can't avoid him.\n\n0:27:58\tSPEAKER_00\n But you can have a button for child lock.\n\n0:28:01\tSPEAKER_04\n Yeah.\n\n0:28:02\tSPEAKER_00\n Yeah.\n\n0:28:03\tSPEAKER_00\n So just by pressing the button with some code, you put a lock onto the remote so that he can't use even fun.\n\n0:28:09\tSPEAKER_03\n No, we can think about having on the user interface when you switch on the TV.\n\n0:28:16\tSPEAKER_03\n You can write a code or choose a category.\n\n0:28:22\tSPEAKER_03\n If it is kids...\n\n0:28:25\tSPEAKER_02\n Yeah.\n\n0:28:26\tSPEAKER_02\n That's right.\n\n0:28:27\tSPEAKER_02\n Or maybe you have to choose some specific programs for kids.\n\n0:28:32\tSPEAKER_02\n And then...\n\n0:28:34\tSPEAKER_01\n Oh, these are...\n\n0:28:36\tSPEAKER_02\n Yeah.\n\n0:28:37\tSPEAKER_02\n Just push the kids button.\n\n0:28:39\tSPEAKER_02\n So it's automatically...\n\n0:28:42\tSPEAKER_02\n I'm sorry.\n\n0:28:44\tSPEAKER_02\n So if we can resume what we...\n\n0:28:47\tSPEAKER_00\n I think these are the four points where the market demands.\n\n0:28:50\tSPEAKER_00\n And so it's for the user interface design and industrial design.\n\n0:28:55\tSPEAKER_03\n So for my part, I will check the prices, the prices difference of what to use, where to use it.\n\n0:29:05\tSPEAKER_00\n Yeah, I think it's a bit clearer for us in the next meeting that this possibility is going to be included.\n\n0:29:10\tSPEAKER_01\n I think we need to define also the set of vocabularies for the speech organizer.\n\n0:29:16\tSPEAKER_01\n Yeah.\n\n0:29:17\tSPEAKER_01\n Because if you want us to say we can sort by channels or sort by TV programs, you have to decide the category of vocabularies for them.\n\n0:29:29\tSPEAKER_01\n If numbers, they are easy.\n\n0:29:31\tSPEAKER_01\n But if you want to name the channel by name...\n\n0:29:34\tSPEAKER_03\n Well, I think we can...\n\n0:29:36\tSPEAKER_03\n We can have just numbers for the channels and you can say to your remote control like sports and then on the TV, you have a list with sports program playing now.\n\n0:29:50\tSPEAKER_00\n No, we have a problem there.\n\n0:29:52\tSPEAKER_00\n You say, if you have a voice comments and you are watching a score on a basketball score or something and if the score comes 25 or 35, you just say 25.\n\n0:30:03\tSPEAKER_00\n And suddenly the channel goes to 25.\n\n0:30:07\tSPEAKER_00\n So I think there should be a prefix to some numbers.\n\n0:30:11\tSPEAKER_03\n Well, every possible world has a probability to come about of the TVs.\n\n0:30:17\tSPEAKER_00\n I mean, you just check out the probability that saying TV 25 and just ordinary 25.\n\n0:30:23\tSPEAKER_00\n Ordinary 25, you're almost there is a probability of being set on 60-70%.\n\n0:30:29\tSPEAKER_00\n And TV 25, I don't know, it should be around 1 or 2%.\n\n0:30:34\tSPEAKER_00\n So it's better to have some prefix code before the number.\n\n0:30:38\tSPEAKER_01\n But I think that the user would like to associate the channel, we'll call the channel rather than the number.\n\n0:30:44\tSPEAKER_01\n Yeah, something, some code.\n\n0:30:46\tSPEAKER_01\n You say number, channel number 5 of your TV correspond to something else in the channel.\n\n0:30:51\tSPEAKER_01\n So some people may want to say, I want to see this channel.\n\n0:30:55\tSPEAKER_00\n That would be too big and it would be difficult for the vocabulary also.\n\n0:31:00\tSPEAKER_01\n Check with the RND department, the capability of our connoisseur.\n\n0:31:04\tSPEAKER_02\n The name of the channel, it would be difficult to say just the name of the channel.\n\n0:31:10\tSPEAKER_02\n Well, it's convenient for the user.\n\n0:31:12\tSPEAKER_02\n Yeah, but you have to have all the name of the channel in your vocabulary.\n\n0:31:18\tSPEAKER_00\n Or it might be you just forgot the channel name, you'd only know the number.\n\n0:31:23\tSPEAKER_02\n Or maybe the user can create his own vocabulary.\n\n0:31:28\tSPEAKER_02\n Just pronouncing the name of the channel.\n\n0:31:31\tSPEAKER_01\n I think there's another way you can do is that when the user press a button to choose the channel, for example, then what you can do is that you can make the TV screen to split them into small little squares of images.\n\n0:31:53\tSPEAKER_01\n Where you have a snapshot of every channel. So let's say it's a 4x4 matrix of the images.\n\n0:32:00\tSPEAKER_01\n So now what you do is looking at all the 16 channels available at one time, you just use the control button there.\n\n0:32:07\tSPEAKER_01\n You just choose the option you want and then you just hit the button and then you'll go to that channel.\n\n0:32:13\tSPEAKER_02\n Or let's the user create his own vocabulary.\n\n0:32:19\tSPEAKER_01\n So you don't use the spiritual colonizer in that way.\n\n0:32:22\tSPEAKER_02\n No, just you have in the beginning you have to train, you have to create a vocabulary.\n\n0:32:31\tSPEAKER_02\n Oh, okay.\n\n0:32:33\tSPEAKER_02\n I also say I think each channel with name.\n\n0:32:38\tSPEAKER_03\n I also think about another problem if there is more than one person who is watching TV.\n\n0:32:46\tSPEAKER_03\n Well, the spiritual colonizer should be able to distinguish between the two.\n\n0:32:53\tSPEAKER_03\n Because I remember when I was a young child with my sister.\n\n0:33:00\tSPEAKER_03\n We always want to watch different emissions at the same time.\n\n0:33:06\tSPEAKER_03\n So it could be a problem if well.\n\n0:33:10\tSPEAKER_03\n If someone passes by when you are watching TV and say, oh TV, 30.\n\n0:33:17\tSPEAKER_00\n And in the same lines we would have one more problem.\n\n0:33:21\tSPEAKER_00\n If you are using the television in the different environment, say in the factories or in the shops, there is lot of noise.\n\n0:33:28\tSPEAKER_00\n And this voice comments if they fail to work, that would bring a bad name by repetition for our company.\n\n0:33:34\tSPEAKER_00\n So I think we should specify some prerequisites if we want to use the voice comments.\n\n0:33:40\tSPEAKER_00\n Say that it should be used in silent, homely environment or something.\n\n0:33:46\tSPEAKER_02\n Or we can switch on or switch off the spatial.\n\n0:33:50\tSPEAKER_02\n Yeah, that should be an option.\n\n0:33:52\tSPEAKER_03\n Yeah, that's why I think that's a good option because it's simple and simple to implement.\n\n0:33:59\tSPEAKER_00\n And these are the practical problems. So many protector of them in the design.\n\n0:34:05\tSPEAKER_02\n We will discard them in the next meeting. It's time to close this meeting.\n\n0:34:10\tSPEAKER_01\n We will stay at 5 minutes.\n\n0:34:12\tSPEAKER_01\n Oh, it came around 3 minutes back.\n\n0:34:14\tSPEAKER_00\n So we are only 5 minutes back.\n\n0:34:16\tSPEAKER_00\n I think we can just press the...\n\n0:34:18\tSPEAKER_00\n Okay.\n\n0:34:22\tSPEAKER_03\n So we will see you out.\n\n0:34:24\tSPEAKER_00\n Save another 30 minutes.\n\n0:34:32\tSPEAKER_02\n It's a great meeting place.\n\n0:34:34\tNone\n Order or after the meeting.\n\n0:34:37\tNone\n What is it?\n\n0:34:38\tSPEAKER_02\n When we are going to meet.\n\n0:34:40\tNone\n I'll do it.\n\n0:34:41\tNone\n One pack, that one.\n\n0:34:42\tNone\n No, I'll do it.\n\n0:34:43\tNone\n Is it an ordinary person?\n\n0:34:44\tNone\n Yeah, it's an ordinary person.\n\n0:34:46\tNone\n Okay.\n\n0:34:56\tSPEAKER_04\n Okay.\n\n", "summary": [{"summary_text": "In the last meeting, Speaker discussed the functional design of the remote control and the conceptual design. Speaker made a review of the components available to build remote control. For the case material, he thinks that titanium is a good choice because it's trendy. The case material can be wood, rubber, titanium or latex. The interface can be achieved by using rubber buttons or simple buttons. The chip to process the buttons is more complicated, so Speaker decides to use a regular chip."}]}