{"filename": "./data/IS1000c.txt", "transcript": "0:00:00\tNone\n I'm being put out.\n\n0:00:12\tSPEAKER_02\n Right, first time this time.\n\n0:00:14\tNone\n There it is.\n\n0:00:20\tSPEAKER_02\n There it is. There's nothing complicated, but I get it right every time.\n\n0:00:50\tSPEAKER_00\n I think it's a word just written for Matthew.\n\n0:01:02\tSPEAKER_00\n I'm really looking for it.\n\n0:01:33\tSPEAKER_03\n So I suggest we start a meeting without Matthew.\n\n0:01:38\tSPEAKER_03\n Okay. He's obviously late for some reason.\n\n0:01:46\tSPEAKER_03\n Good. Today we will talk about conceptual design.\n\n0:01:53\tSPEAKER_03\n I hope we both did some work concerning the conceptual design.\n\n0:02:01\tSPEAKER_03\n This will be the agenda for the meeting.\n\n0:02:07\tSPEAKER_03\n I will take some minutes again.\n\n0:02:13\tSPEAKER_03\n We will have presentations of different team members.\n\n0:02:19\tSPEAKER_03\n And then try to come to the decisions about the concepts you have presented.\n\n0:02:25\tSPEAKER_03\n We have 40 minutes to complete this.\n\n0:02:35\tSPEAKER_03\n Who is this?\n\n0:02:39\tSPEAKER_00\n I think Matthew is important to me.\n\n0:02:47\tSPEAKER_00\n It's really a team project with a team. If someone is not here then we cannot make it.\n\n0:02:59\tSPEAKER_02\n I would say I value this file for my presentation.\n\n0:03:05\tSPEAKER_03\n You have presentation already?\n\n0:03:19\tNone\n I'm seeing my light too.\n\n0:03:23\tSPEAKER_03\n So did you manage?\n\n0:03:29\tSPEAKER_01\n Yes, I sent you the slides.\n\n0:03:35\tSPEAKER_01\n I see them.\n\n0:03:39\tSPEAKER_01\n Okay.\n\n0:04:03\tSPEAKER_02\n Okay.\n\n0:04:15\tSPEAKER_02\n This is just a presentation on the trends that we are going to use to make the products stand out from the rest of the products out there at the moment.\n\n0:04:31\tSPEAKER_02\n We have to work out what we can do with our product to make it stand out and make it so people want to buy it.\n\n0:04:39\tSPEAKER_02\n This is to do this.\n\n0:04:43\tSPEAKER_02\n We will not turn on the microphone.\n\n0:04:47\tSPEAKER_02\n We basically use some focus group surveys which I went through with the last time, the main results of that.\n\n0:04:55\tSPEAKER_02\n We have to work out what we can do to make it stand out.\n\n0:05:03\tSPEAKER_02\n We have to work out what we can do to make it stand out.\n\n0:05:13\tSPEAKER_02\n It is very different from everything else out there.\n\n0:05:25\tSPEAKER_02\n It needs to be not functional like the rest of the things out there at the moment.\n\n0:05:31\tSPEAKER_02\n That was twice as important as the next item on here which has to be technologically innovative.\n\n0:05:37\tSPEAKER_02\n There is something else, apart from just the look at it, people have to think about it and say there is something there that I want.\n\n0:05:43\tSPEAKER_02\n That is a really cool feature and it has to make them want to buy it again.\n\n0:05:47\tSPEAKER_02\n Firm the list and innovative was twice as important as its last aspect.\n\n0:05:53\tSPEAKER_02\n It has to be easy to use.\n\n0:05:55\tSPEAKER_02\n They have to be able to look at and have some intuitive idea of how to use it.\n\n0:06:01\tSPEAKER_02\n Drawing on the fashion trends at the moment are fruit and vegetables.\n\n0:06:09\tSPEAKER_02\n This is basically talking about the feel of it.\n\n0:06:11\tSPEAKER_02\n Probably not the smell of it, but the bright colors eye catching really bold designs.\n\n0:06:17\tSPEAKER_02\n The spongy feel.\n\n0:06:19\tSPEAKER_02\n I had to talk to the design people about this but having a remote that is tactile that feels different.\n\n0:06:23\tSPEAKER_02\n That would be really cool.\n\n0:06:25\tSPEAKER_02\n That would make it stand out.\n\n0:06:27\tSPEAKER_00\n Can you repeat and be more precise about what you just said?\n\n0:06:33\tSPEAKER_00\n What is the feeling?\n\n0:06:35\tSPEAKER_02\n Well, not the spongy is the current thing.\n\n0:06:41\tSPEAKER_02\n The spongy is the current texture.\n\n0:06:43\tSPEAKER_02\n Basically there are no reports that are not the right to the moment which are spongy or tactile at all.\n\n0:06:49\tSPEAKER_02\n So if you make it maybe fairy or soft or something, it will be something that sits at the pan.\n\n0:06:53\tSPEAKER_02\n Rather than just be a plastic which they will all out at the moment.\n\n0:06:59\tSPEAKER_02\n So as far as design goes, the most important aspect was the design to the customers.\n\n0:07:07\tSPEAKER_02\n Going with the fruit and vegetable idea, we got the bright colors.\n\n0:07:11\tSPEAKER_02\n It makes it stand out.\n\n0:07:13\tSPEAKER_02\n The oranges and the bright yellows and the fluorescent colors.\n\n0:07:17\tSPEAKER_02\n Going back to the idea of taking inspiration from mobile phones.\n\n0:07:21\tSPEAKER_02\n They have a lot of them have the changeable covers so you can choose what color the outside is.\n\n0:07:27\tSPEAKER_02\n That is one way of looking at it.\n\n0:07:29\tSPEAKER_02\n Textured feel we just talked about.\n\n0:07:33\tSPEAKER_02\n Maybe it is another way of doing that.\n\n0:07:35\tSPEAKER_02\n So if it is part of the changeable covers, maybe they can choose a different texture.\n\n0:07:39\tSPEAKER_02\n The spongy one or soft one or something like that.\n\n0:07:41\tSPEAKER_02\n So they can choose that as they want to.\n\n0:07:45\tSPEAKER_02\n That is a really good idea.\n\n0:07:47\tSPEAKER_02\n They are looking for a living room or a sports team or whatever.\n\n0:07:53\tSPEAKER_02\n And yes, still taking inspiration from mobile phone design.\n\n0:07:57\tSPEAKER_02\n So functionality, the way mobile phones work, the way the keypad looks.\n\n0:08:01\tSPEAKER_02\n Also, the way that a lot of industrial design has gone into mobile phones at the moment.\n\n0:08:05\tSPEAKER_02\n The big selling items.\n\n0:08:08\tSPEAKER_02\n People have put a lot of thought into that so we can leverage that.\n\n0:08:11\tSPEAKER_02\n And we can start using some of their ideas.\n\n0:08:16\tSPEAKER_02\n Back to technology innovation.\n\n0:08:19\tSPEAKER_02\n Not quite as important but still a big issue.\n\n0:08:22\tSPEAKER_02\n We talked about having a way of finding the remote control if it has been lost.\n\n0:08:27\tSPEAKER_02\n That is one thing we could look at.\n\n0:08:30\tSPEAKER_02\n There are other aspects like LCD screens and speech recognition which won't.\n\n0:08:35\tSPEAKER_02\n I don't think my personal opinion going to be worth the extra expense and the extra effort that we will go into them.\n\n0:08:40\tSPEAKER_02\n I think we are better doing something basic like this which is very important and would be a really cool feature to put in.\n\n0:08:48\tSPEAKER_02\n Easiest.\n\n0:08:50\tSPEAKER_02\n I had no real specific ideas for this.\n\n0:08:53\tSPEAKER_02\n Maybe just basic idea of having your core functions big and at the top maybe by themselves.\n\n0:08:59\tSPEAKER_02\n Maybe that you can get more information.\n\n0:09:02\tSPEAKER_02\n The finer details of buttons you don't use as much either hidden away or completely separate.\n\n0:09:08\tSPEAKER_02\n That is the presentation.\n\n0:09:11\tSPEAKER_03\n Very clear.\n\n0:09:17\tSPEAKER_02\n So they don't have any comments or ideas on that?\n\n0:09:20\tSPEAKER_03\n Maybe we can decide later on.\n\n0:09:29\tSPEAKER_03\n The look and feel of I was a good idea maybe to let the people choose.\n\n0:09:37\tSPEAKER_03\n Yes, they are changeable covers.\n\n0:09:41\tSPEAKER_03\n But on the other hand I don't know whether my superiors would be so glad with it because you have to introduce a complete new line of supplies.\n\n0:09:53\tSPEAKER_03\n It would be very complicated organizational.\n\n0:09:57\tSPEAKER_02\n We are selling so many units of this.\n\n0:09:59\tSPEAKER_02\n This is going to be a mess market of product.\n\n0:10:01\tSPEAKER_00\n We need four to have two or three different designs at least.\n\n0:10:04\tSPEAKER_00\n A set of three or four different aspects.\n\n0:10:08\tSPEAKER_00\n That fits.\n\n0:10:10\tSPEAKER_03\n Of course it will be we get if it works.\n\n0:10:14\tSPEAKER_03\n We get after sales.\n\n0:10:16\tSPEAKER_03\n That would be very good.\n\n0:10:18\tSPEAKER_03\n Those covers could go for three, five euro.\n\n0:10:24\tSPEAKER_03\n That is a very good idea.\n\n0:10:28\tSPEAKER_03\n Maybe we can go as a few presentations.\n\n0:10:34\tSPEAKER_01\n We could discuss later.\n\n0:10:38\tSPEAKER_01\n We can put all the ideas together.\n\n0:10:40\tSPEAKER_01\n Together in the details.\n\n0:10:42\tSPEAKER_03\n You might have some information on the easy to use.\n\n0:10:46\tSPEAKER_00\n Your part is very related to mine.\n\n0:10:49\tSPEAKER_00\n When you suggest something that it has to be related.\n\n0:10:52\tSPEAKER_01\n I will go with that.\n\n0:11:16\tSPEAKER_01\n The idea of having a remote is that you have different keys and different structures, different forms.\n\n0:11:28\tSPEAKER_01\n They could be buttons or like triangle.\n\n0:11:34\tSPEAKER_01\n They could be of varying sizes if you want to basic name for size.\n\n0:11:42\tSPEAKER_01\n They could be more than other.\n\n0:11:46\tSPEAKER_01\n Maybe you can have different colors.\n\n0:11:50\tSPEAKER_01\n For example, having the red for the on-off switching on and off the button.\n\n0:11:54\tSPEAKER_01\n This is a general trend to the method they do.\n\n0:12:00\tSPEAKER_01\n What I found was that the conventional, mostly that the TVVCR music system operated once.\n\n0:12:11\tSPEAKER_01\n They are very specific to each other.\n\n0:12:14\tSPEAKER_01\n But there are some common keys.\n\n0:12:17\tSPEAKER_01\n If you want to forward a VTR and if you want to forward a strong track.\n\n0:12:25\tSPEAKER_01\n You can have a common thing.\n\n0:12:31\tSPEAKER_01\n There is also speech recognition.\n\n0:12:35\tSPEAKER_01\n You can have multiple functionality.\n\n0:12:45\tSPEAKER_01\n You can program the keys if you want to certain keys or even the channel information.\n\n0:12:55\tSPEAKER_02\n The idea of having speech recognition for the name of the channel.\n\n0:12:59\tSPEAKER_01\n You can have a number of different keys.\n\n0:13:05\tSPEAKER_01\n As more and more channels come, you have more and more problems.\n\n0:13:13\tSPEAKER_01\n Even if you are in the channel, however, you still have the problem.\n\n0:13:21\tSPEAKER_00\n What functionality do you suggest for that?\n\n0:13:25\tSPEAKER_01\n It should be limited one.\n\n0:13:29\tSPEAKER_01\n In the present market, I saw that something like 80-word thing.\n\n0:13:35\tSPEAKER_01\n We shouldn't be that difficult to implement like 80-200 words.\n\n0:13:42\tSPEAKER_01\n Basically, you don't want to store all the channels in the remote control.\n\n0:13:47\tSPEAKER_01\n You want to store your favorite channels.\n\n0:13:50\tSPEAKER_01\n Yeah, some 10-12 channel information. You don't want to store all the channels in that.\n\n0:13:57\tSPEAKER_01\n Basically, it depends on the remote with LCD display for browsing.\n\n0:14:03\tSPEAKER_01\n You have multiple functionalities.\n\n0:14:05\tSPEAKER_01\n For example, you are watching a movie and you are having a universal remote control.\n\n0:14:12\tSPEAKER_01\n You don't know which functionality is very important.\n\n0:14:18\tSPEAKER_01\n I am using the TV every time.\n\n0:14:22\tSPEAKER_01\n For example, I can use a simple toggle switch and a display.\n\n0:14:28\tSPEAKER_01\n I press it so that the display says, I am in TV or DVD or whatever it is.\n\n0:14:33\tSPEAKER_01\n Instead of having three keys, four or four keys, more of the functionalities will increase actually for you and you don't want separate keys for all of them.\n\n0:14:45\tSPEAKER_01\n There can be children friendly where you can program your remote so that they are not allowed to browse certain channels which you can block them and you can operate them.\n\n0:14:59\tSPEAKER_01\n These are the things presently which are seen in the market scenario.\n\n0:15:04\tSPEAKER_01\n Personally, I would look at things like having a universal remote is a good idea.\n\n0:15:15\tSPEAKER_01\n Instead of having individual ones for all of them, you can think of having multiple functionality.\n\n0:15:24\tSPEAKER_01\n Possibly with speech recognition, I got a mail from the coffee machine interface unit that they have integrated the speech recognition into the coffee machine.\n\n0:15:38\tSPEAKER_01\n If you say, hello coffee machine, it is a high Joe or something like that.\n\n0:15:44\tSPEAKER_02\n The coffee machine does not have too many words of using with that.\n\n0:15:48\tSPEAKER_01\n It is a limited vocabulary thing and maybe isolated word.\n\n0:15:52\tSPEAKER_01\n It is interesting and basically storing the channel through voice or other ways of programming your keys on display for the browsing which is again and maybe having something like a blinking thing.\n\n0:16:11\tSPEAKER_01\n It could indicate what is called the battery in your remote.\n\n0:16:25\tSPEAKER_01\n At the same time, if it is a dark room, it can be used to locate the remote also.\n\n0:16:33\tSPEAKER_00\n You want to let the user programming the keys, some of them.\n\n0:16:42\tSPEAKER_00\n You can let them do that.\n\n0:16:44\tSPEAKER_00\n It is not difficult.\n\n0:16:47\tSPEAKER_00\n I don't know if we still want the RC to be easy to use.\n\n0:16:52\tSPEAKER_01\n It depends on the easyness like the user how much effort he can put.\n\n0:16:58\tSPEAKER_01\n For example, I would like to store in certain way.\n\n0:17:03\tSPEAKER_01\n If you want to give the full freedom to the user or you want to keep some constraints and let the user use it with their constraint.\n\n0:17:12\tSPEAKER_02\n You can do it both ways.\n\n0:17:14\tSPEAKER_02\n You can pick it up and use it straight away without customizing it.\n\n0:17:18\tSPEAKER_02\n Or if they want to, they have the option of using these extra pages.\n\n0:17:23\tSPEAKER_03\n Maybe you can give hints to us because I am not sure whether we can implement that for 12-50 cents.\n\n0:17:33\tSPEAKER_03\n I am sorry to have every time I have to come down on a price again.\n\n0:17:40\tSPEAKER_03\n This might be a little limiting for your creativity.\n\n0:17:44\tSPEAKER_03\n It is a real... we have to consider it. Do you think this idea is my speech recognition?\n\n0:17:56\tSPEAKER_03\n Maybe it is possible for 12 euro, then it will be at cost of other functionality.\n\n0:18:02\tSPEAKER_03\n We might implement the furry case of the...\n\n0:18:10\tSPEAKER_00\n I would say that for programming keys, it could be easily done within the package of 12 euros.\n\n0:18:23\tSPEAKER_00\n But for the ASR system, I am not sure if it is feasible to have this.\n\n0:18:30\tSPEAKER_01\n We can talk with the coffee unit and you can check how much.\n\n0:18:35\tSPEAKER_00\n If it is a low-over-covered read, it is already implemented.\n\n0:18:40\tSPEAKER_01\n Maybe we can talk to them and we can come with that.\n\n0:18:46\tSPEAKER_01\n You can think of having a... since you have a...\n\n0:18:49\tSPEAKER_01\n You know something more, maybe if you add a little bit of even display, you may need to keep checking the battery.\n\n0:18:56\tSPEAKER_01\n So you need some kind of indicator.\n\n0:18:58\tSPEAKER_01\n So it could be a blinking option of LED.\n\n0:19:02\tSPEAKER_01\n It could actually be used to detect also.\n\n0:19:05\tSPEAKER_01\n If it is in a dark room, you can basically detect it also.\n\n0:19:09\tSPEAKER_02\n Well, yeah, to be able to use the remote in the dark.\n\n0:19:12\tSPEAKER_02\n So either having the buttons so you can feel the difference between them or...\n\n0:19:16\tSPEAKER_01\n No, actually...\n\n0:19:17\tSPEAKER_01\n It is like... it can be for two purposes.\n\n0:19:22\tSPEAKER_01\n If you have a NLCD display and all those things, it is not going to be the standard remote.\n\n0:19:27\tSPEAKER_01\n Which is having... we need just six volts, sorry, three volts DC.\n\n0:19:35\tSPEAKER_01\n It may need more actually.\n\n0:19:37\tSPEAKER_01\n So you may need to check your battery usage.\n\n0:19:41\tSPEAKER_01\n And then you need that some functionality to indicate the battery limit.\n\n0:19:46\tSPEAKER_01\n And then if the battery limit is indicated, it could be indicated to a blinking something.\n\n0:19:52\tSPEAKER_01\n And it can change the color depending on how much is the battery.\n\n0:19:58\tSPEAKER_01\n Well, that is good enough to even locate it even if you want to.\n\n0:20:02\tSPEAKER_01\n You know?\n\n0:20:03\tSPEAKER_01\n Very good.\n\n0:20:04\tSPEAKER_00\n Yeah, so...\n\n0:20:05\tSPEAKER_00\n I don't know if I have time to talk about...\n\n0:20:07\tSPEAKER_01\n Yes, you have time some more?\n\n0:20:10\tSPEAKER_03\n Yes, yes, you can.\n\n0:20:13\tSPEAKER_01\n Sure, you can, you know.\n\n0:20:17\tSPEAKER_00\n Okay.\n\n0:20:23\tSPEAKER_00\n So what I'm going to present here is very...\n\n0:20:30\tSPEAKER_00\n Yeah, basic knowledge about the components that are inside Rc and remote control.\n\n0:20:39\tSPEAKER_00\n And how is it manufactured?\n\n0:20:42\tSPEAKER_00\n What is the process?\n\n0:20:43\tSPEAKER_00\n It's to explain you.\n\n0:20:46\tSPEAKER_00\n So the method is...\n\n0:20:48\tSPEAKER_00\n There is a set of components in remote control, like everywhere.\n\n0:20:54\tSPEAKER_00\n And what cost...\n\n0:20:56\tSPEAKER_00\n The components in themselves do not cost a lot, but the way to assemble everything costs, obviously.\n\n0:21:04\tSPEAKER_00\n And I will show you my preferences at the end.\n\n0:21:10\tSPEAKER_00\n So there are two different types of...\n\n0:21:16\tSPEAKER_00\n different ways of using the components for making a remote control.\n\n0:21:22\tSPEAKER_00\n The basic way is to use an integrated circuit and some transistors, resonator resistors, that aims at communicating the message to send the message to the lead that will transmit to the receiver.\n\n0:21:40\tSPEAKER_00\n And either the components and the circuit board, boring buttons and for a lead, etc. for the components.\n\n0:21:53\tSPEAKER_00\n So it's not in finding just to say that the chip can detect when a key is pressed and then it translates to the key to a sequence, something like MOSCode, as you know, with the different sequence for each key.\n\n0:22:11\tSPEAKER_00\n And with the components we will use, we will have different messages, different sequences.\n\n0:22:18\tSPEAKER_00\n And the chipsense, that signal to the transistor that amplify to make it stronger.\n\n0:22:27\tSPEAKER_00\n So electronic parts are assembled onto printed boards, because it's easier to mass produce an assemble.\n\n0:22:38\tSPEAKER_00\n So I think for our design we want some programmable VLSI or FPGA high technology.\n\n0:22:50\tSPEAKER_00\n And this is important, so we will use in any high tech devices a chip of fiberglass to solve them and connect them.\n\n0:23:04\tSPEAKER_00\n So my personal design, we need to find a solution.\n\n0:23:09\tSPEAKER_00\n What is the material of the cover we want to use?\n\n0:23:15\tSPEAKER_00\n If it's plastic or you said that you had some ideas like footwear or...\n\n0:23:23\tSPEAKER_03\n Well maybe we can give the case a very normal case, but with a changeable cover to fancy it up.\n\n0:23:35\tSPEAKER_03\n So like a normal chip plus the case, which can be covered up in, for instance, a wooden case.\n\n0:23:42\tSPEAKER_00\n Yeah, like they do it with cars, I think, inside the car.\n\n0:23:48\tSPEAKER_00\n So they also emailed me that they have available a bunch of different buttons, like squirrel wheels, integrated push buttons, such as a modern computer mouse.\n\n0:24:02\tSPEAKER_00\n And very cheap LCDs, so a liquid crystal display.\n\n0:24:07\tSPEAKER_00\n So I'm doing, I think, we might be able to integrate LCD into our RC.\n\n0:24:14\tSPEAKER_00\n And the final point is we have, yeah, there are some compromises to do.\n\n0:24:23\tSPEAKER_00\n So we have to know that the push button requires a simple chip, but the squirrel wheel and that kind of higher high-tech stuff needs more money, which is a higher price range, right?\n\n0:24:40\tSPEAKER_00\n And the display requires an advanced chip, which in turn is more expensive, that we've got our chip, but I think with 12 euros, and if it's made for four million items, then I think we could be able to under that.\n\n0:25:02\tSPEAKER_00\n So to sum up, we need, yeah, so I just said that the components, the list of components has to be listed and assembly is an important process, it has to be taken into account.\n\n0:25:22\tSPEAKER_00\n And for the designing of the cover layout, then it's better to maybe see that with the UI expert, so that we can, it's really a team working.\n\n0:25:36\tSPEAKER_00\n So I cannot design something without your agreement, right?\n\n0:25:40\tSPEAKER_01\n Sure, of course, for example, I wanted to know, like if you want to have, if you want to have the LCD display over there, or if you want to store the programs with the keys, what kind of things you need inside your things?\n\n0:26:02\tSPEAKER_00\n Yeah, it's kind of simple FPGA programmable device, and we have to insert.\n\n0:26:09\tSPEAKER_00\n I think we could insert one that could under the several functions of.\n\n0:26:14\tSPEAKER_01\n Okay, so in that case, you can even look at the technology, what the mobile phone is trying to use with the PGA card.\n\n0:26:20\tSPEAKER_01\n Exactly, yeah, for customizing.\n\n0:26:23\tSPEAKER_00\n Yeah, with that, actually.\n\n0:26:24\tSPEAKER_01\n Okay.\n\n0:26:25\tSPEAKER_01\n How cost-effective it would be to put that card, chip into it and do that programmable things.\n\n0:26:32\tSPEAKER_03\n So I think we should come to some decisions now about this.\n\n0:26:40\tSPEAKER_03\n So I understand when we want this play, we need an expensive chip, but when we want a scrolling wheel, we also need the expensive chip.\n\n0:26:51\tSPEAKER_03\n So can we use the same chip?\n\n0:26:54\tSPEAKER_03\n With one expensive chip, we can implement several complicated or as far as future.\n\n0:27:02\tSPEAKER_00\n Exactly, yeah, that's a very good idea.\n\n0:27:04\tSPEAKER_00\n We could have one main chip that could handle, it's called FPGA chip, that could under both like scrolling wheels, as well as LCD.\n\n0:27:18\tSPEAKER_03\n So when the more expensive chip you mentioned there is possible in the given budget, maybe we should go for the more expensive chip.\n\n0:27:27\tSPEAKER_03\n So all features which you mentioned can be implemented in the same chip.\n\n0:27:33\tSPEAKER_03\n Yes.\n\n0:27:35\tSPEAKER_03\n Well, do you think that's feasible?\n\n0:27:39\tSPEAKER_01\n I don't know if it will fit into our cost of 25 euro.\n\n0:27:44\tSPEAKER_03\n You think it's possible.\n\n0:27:46\tSPEAKER_03\n Is it possible to fit in it?\n\n0:27:48\tSPEAKER_00\n I think both if we had a budget of 20 euros, it would be okay.\n\n0:27:56\tSPEAKER_00\n But we need specific costings then,\n\n0:28:00\tSPEAKER_02\n actually do maybe two designs and then cost them out and see which one is going to fit in our budget better. Yeah, that's an excellent idea.\n\n0:28:09\tSPEAKER_03\n When you make a design, you can next meeting, you can give an exact cost price.\n\n0:28:16\tSPEAKER_00\n Yeah, because right now I don't have the price in head, but for next meeting I'm sure we have a good time.\n\n0:28:23\tSPEAKER_01\n That's something which I wanted to ask you also, what will be the cost of it?\n\n0:28:29\tSPEAKER_01\n For example, if you want to put wood, I wouldn't suggest for wood.\n\n0:28:34\tSPEAKER_01\n I think it's much easier to use a plastic or a wood.\n\n0:28:41\tSPEAKER_01\n In the other than wood, it will be much more expensive, though it's the most natural thing.\n\n0:28:48\tSPEAKER_03\n Yes, but I think we can just use more cheap plastic for basic addition than people can fancy it up with more expensive materials.\n\n0:29:01\tSPEAKER_03\n We can give the preference to them,\n\n0:29:06\tSPEAKER_01\n but with plastic or the rubber or whatever it is, it's much better with that, rather than going for it.\n\n0:29:16\tSPEAKER_00\n It's a detailed plastic versus wood.\n\n0:29:21\tSPEAKER_00\n We need maybe to center our discussion on really what buttons, what functionality we want to offer to the user.\n\n0:29:32\tSPEAKER_00\n Maybe with graphs, I don't know, as an user interface designer, you could maybe have a plus on that.\n\n0:29:42\tSPEAKER_03\n I think for next meeting we, you two can present a real design.\n\n0:29:51\tSPEAKER_03\n So drawing is on the board.\n\n0:29:54\tSPEAKER_00\n Perfect.\n\n0:29:55\tSPEAKER_03\n Then we now only have to decide the general function.\n\n0:30:06\tSPEAKER_03\n Let's say in next meeting you produce two designs.\n\n0:30:12\tSPEAKER_03\n Yes, less advanced and more advanced than with the cost price.\n\n0:30:18\tSPEAKER_03\n Furthermore, we go for the basic plastic case, which can be laid fancy up with additional, how do you call them, these mobile telephones you can put a cover over.\n\n0:30:36\tSPEAKER_03\n But that can be done later.\n\n0:30:38\tSPEAKER_03\n We now can concentrate on the basic remote control.\n\n0:30:43\tSPEAKER_01\n We can give them smooth keys.\n\n0:30:50\tSPEAKER_01\n With bigger eyes so that you know, the problem most of the time you see in the case is that it's small.\n\n0:31:02\tSPEAKER_01\n Every time you have to be very, but if you go to a different ways of designing those keys, then you can merge them together.\n\n0:31:13\tSPEAKER_02\n Is there any of these you're looking at?\n\n0:31:16\tSPEAKER_01\n Actually, for example, if you see they're quite small over here.\n\n0:31:21\tSPEAKER_01\n Now you can, for example, as I was telling you, if you make them big, it may change the look of them thing also to the people at the same time.\n\n0:31:32\tSPEAKER_01\n It is more interesting for people who are having this RSI and all this.\n\n0:31:38\tSPEAKER_01\n Big keys, it's very good for them actually.\n\n0:31:42\tSPEAKER_01\n I agree.\n\n0:31:43\tSPEAKER_00\n Not too many keys, of course.\n\n0:31:46\tSPEAKER_02\n One I've had before, I remember I was at a home, there's actually a cover on the bottom, so the bottom bit is just half the keys most of the time.\n\n0:31:54\tSPEAKER_02\n And you can start the cover back to get to the more advanced keys.\n\n0:31:58\tSPEAKER_03\n But then you have still have, when you don't use it, you have such an extent of your remote control, which you don't use.\n\n0:32:08\tSPEAKER_03\n So maybe it's possible, I don't know whether you can indicate this.\n\n0:32:12\tSPEAKER_03\n That you can ask to where, open your remote control and on the inside are buttons you don't use that much.\n\n0:32:20\tSPEAKER_02\n I've seen that before too.\n\n0:32:21\tSPEAKER_02\n Another like the, it flips up and then you've got another low button underneath.\n\n0:32:26\tSPEAKER_01\n Yeah, so it's something like this, the model here.\n\n0:32:29\tSPEAKER_01\n But you can put the key in.\n\n0:32:32\tSPEAKER_02\n I've seen also with keys and buttons on the top of here as well.\n\n0:32:35\tSPEAKER_03\n That's what it means.\n\n0:32:36\tSPEAKER_03\n So I mean something like a book.\n\n0:32:40\tSPEAKER_02\n I like the shape of this one.\n\n0:32:43\tSPEAKER_02\n Can we have, think about maybe having a non-mortem, not non-mortem tagging on one.\n\n0:32:48\tSPEAKER_02\n So it's not just the straight little box.\n\n0:32:50\tSPEAKER_02\n So maybe curved or something.\n\n0:32:52\tSPEAKER_00\n Maybe we need to make a decision on how big we want to be and how many buttons we should make.\n\n0:33:01\tSPEAKER_00\n Is this for the next meeting?\n\n0:33:02\tSPEAKER_02\n No, I think it might be our time.\n\n0:33:04\tSPEAKER_02\n Our time for this meeting.\n\n0:33:05\tSPEAKER_01\n Yeah, next meeting we should make two designs.\n\n0:33:08\tSPEAKER_03\n Yeah, that's different upon a second.\n\n0:33:10\tSPEAKER_03\n And then we can decide between those designs.\n\n0:33:13\tSPEAKER_03\n Yeah.\n\n0:33:14\tSPEAKER_01\n Okay.\n\n0:33:15\tSPEAKER_01\n Perfect.\n\n0:33:16\tSPEAKER_03\n So anyone, any questions?\n\n0:33:19\tSPEAKER_03\n No, no.\n\n0:33:20\tSPEAKER_01\n I don't have.\n\n0:33:23\tSPEAKER_02\n So is there anything else I need to do from a marketing point of view for the next meeting?\n\n0:33:27\tSPEAKER_03\n Yes, I come to that.\n\n0:33:31\tSPEAKER_01\n Maybe it would be interesting if you could look for the cost inventories of other devices if you're using the speed to the ignition or something like that.\n\n0:33:44\tSPEAKER_03\n Yes, well, maybe I don't know more than this possible.\n\n0:33:48\tSPEAKER_03\n Maybe you can start evaluating their work somehow.\n\n0:33:52\tSPEAKER_03\n Okay.\n\n0:33:53\tSPEAKER_02\n Oh, is this made a designing away to evaluate it?\n\n0:33:56\tSPEAKER_02\n So I think you have had to set up test groups and things.\n\n0:34:00\tSPEAKER_03\n I don't know whether that's possible in a given time, but as far as possible.\n\n0:34:05\tSPEAKER_03\n Okay.\n\n0:34:07\tSPEAKER_03\n So you two will be together working on two prototypes.\n\n0:34:12\tSPEAKER_00\n Yeah.\n\n0:34:13\tSPEAKER_03\n And further instructions will be sent to you by E2.\n\n0:34:16\tSPEAKER_03\n Two or three prototypes.\n\n0:34:18\tSPEAKER_00\n Two.\n\n0:34:19\tSPEAKER_01\n One for the cost and the one with higher rent.\n\n0:34:23\tSPEAKER_00\n Okay.\n\n0:34:24\tSPEAKER_01\n And then we can be reconpiring them.\n\n0:34:28\tSPEAKER_01\n And find a compromise between both of them.\n\n0:34:31\tSPEAKER_01\n Yeah.\n\n0:34:32\tSPEAKER_01\n Okay.\n\n0:34:33\tSPEAKER_03\n Let's go all this way in.\n\n0:34:35\tSPEAKER_01\n Okay.\n\n0:34:36\tSPEAKER_03\n Thanks, guys.\n\n0:34:37\tNone\n Thanks.\n\n0:34:38\tSPEAKER_01\n So we have done...\n\n0:34:40\tSPEAKER_01\n For now.\n\n0:34:43\tNone\n Oh, yeah.\n\n0:34:53\tNone\n Oh, yeah.\n\n0:34:55\tNone\n Yeah.\n\n", "summary": [{"summary_text": "Today's meeting is about conceptual design. Speaker's presentation is on the trends that they are going to use to make the products stand out from the rest of the products out there at the moment. They have 40 minutes to complete this presentation. They will not turn on the microphone."}]}