{"filename": "./data/IS1000b.txt", "transcript": "0:00:00\tNone\n Yes, this one?\n\n0:00:07\tNone\n This light.\n\n0:00:09\tNone\n Yeah.\n\n0:00:10\tNone\n Here are my slides.\n\n0:00:11\tNone\n Yeah.\n\n0:00:12\tNone\n But this is free, technical.\n\n0:00:14\tNone\n Yeah, in fact.\n\n0:00:15\tNone\n Yeah.\n\n0:00:16\tSPEAKER_03\n Yeah.\n\n0:00:17\tSPEAKER_03\n I'm going to work on this one.\n\n0:00:23\tNone\n Yeah.\n\n0:00:24\tNone\n I have to carry on this kit.\n\n0:00:27\tNone\n You should have been able to do this.\n\n0:00:34\tNone\n Thank you.\n\n0:00:37\tNone\n Thank you.\n\n0:00:38\tNone\n Okay, I can just get a message to that.\n\n0:00:44\tNone\n It's a guy who wants to go out for me.\n\n0:00:48\tNone\n Yes.\n\n0:00:49\tNone\n I just serve it just in cleaner wipe and put it back.\n\n0:01:00\tNone\n Yes.\n\n0:01:01\tNone\n I'm a bestie.\n\n0:01:02\tNone\n I need it with me between these.\n\n0:01:05\tNone\n Okay.\n\n0:01:21\tNone\n You have to save my name.\n\n0:01:25\tNone\n I'll send it to you.\n\n0:01:27\tNone\n Like you made.\n\n0:01:29\tNone\n Okay.\n\n0:01:30\tNone\n Okay.\n\n0:01:37\tNone\n So I'll just open it or say it.\n\n0:01:40\tNone\n You can switch it.\n\n0:01:41\tNone\n Yes.\n\n0:01:42\tNone\n And maybe start.\n\n0:01:48\tNone\n So where?\n\n0:01:50\tNone\n Should I start or?\n\n0:01:51\tNone\n I'm going to start.\n\n0:01:52\tNone\n Okay.\n\n0:01:53\tNone\n Oh, I will.\n\n0:01:54\tNone\n Okay.\n\n0:01:55\tNone\n Okay.\n\n0:02:02\tNone\n Okay.\n\n0:02:05\tNone\n Okay.\n\n0:02:12\tNone\n Okay.\n\n0:02:19\tNone\n Okay.\n\n0:02:26\tNone\n Okay.\n\n0:02:33\tNone\n Okay.\n\n0:02:37\tNone\n Okay.\n\n0:02:46\tNone\n Okay.\n\n0:02:53\tNone\n Okay.\n\n0:03:00\tNone\n Okay.\n\n0:03:13\tNone\n Is it around the runway?\n\n0:03:16\tNone\n Yes.\n\n0:03:17\tNone\n It's good.\n\n0:03:22\tSPEAKER_01\n Okay.\n\n0:03:23\tSPEAKER_01\n So I see all of the bodies here.\n\n0:03:25\tSPEAKER_01\n Okay.\n\n0:03:26\tSPEAKER_01\n Nope.\n\n0:03:27\tSPEAKER_02\n You can start meeting.\n\n0:03:30\tSPEAKER_02\n Okay.\n\n0:03:31\tSPEAKER_02\n What's the agenda for this meeting?\n\n0:03:32\tSPEAKER_01\n I will present the agenda with slides.\n\n0:03:37\tSPEAKER_01\n I guess.\n\n0:03:38\tSPEAKER_01\n Okay.\n\n0:03:45\tSPEAKER_01\n So first, just to mention, I will take notes of this meeting.\n\n0:03:55\tSPEAKER_01\n And I'll try to work them out and give them to you.\n\n0:03:57\tSPEAKER_01\n I've also made notes of their previous meeting.\n\n0:04:00\tSPEAKER_01\n And I was about to send them you.\n\n0:04:03\tSPEAKER_01\n But then I had to go to this meeting.\n\n0:04:07\tSPEAKER_01\n So you will get them to.\n\n0:04:13\tSPEAKER_00\n You are the secretary.\n\n0:04:15\tSPEAKER_00\n Yes.\n\n0:04:16\tSPEAKER_01\n Okay.\n\n0:04:17\tSPEAKER_01\n Indeed.\n\n0:04:21\tSPEAKER_01\n Then I hope you all have worked out.\n\n0:04:25\tSPEAKER_01\n Perfect.\n\n0:04:26\tSPEAKER_01\n Some presentations about, well, you did the task given to you in the previous meeting.\n\n0:04:36\tSPEAKER_01\n We will, in a minute, we will start with them.\n\n0:04:47\tSPEAKER_01\n We will see which order we will handle them off.\n\n0:04:51\tSPEAKER_01\n Then I will bring in some new requirements.\n\n0:04:56\tSPEAKER_01\n I got from the account manager.\n\n0:04:59\tSPEAKER_01\n I tried to work them out.\n\n0:05:01\tSPEAKER_01\n They were quite abstract.\n\n0:05:02\tSPEAKER_01\n We can have, maybe, have come from discussion about the functions.\n\n0:05:08\tSPEAKER_01\n Well, in this meeting, we should really try to reach the decision about the target group and the functionality of the.\n\n0:05:19\tSPEAKER_00\n You mean the social target group?\n\n0:05:21\tSPEAKER_00\n Yes, I mean well.\n\n0:05:22\tSPEAKER_01\n Yes.\n\n0:05:23\tSPEAKER_01\n Who are we going to get?\n\n0:05:25\tSPEAKER_01\n The customers.\n\n0:05:26\tSPEAKER_01\n The customers.\n\n0:05:27\tSPEAKER_01\n Indeed.\n\n0:05:28\tSPEAKER_01\n Yes.\n\n0:05:29\tSPEAKER_01\n I think that's important.\n\n0:05:32\tSPEAKER_01\n So, and then we will close this meeting and after this meeting, we will have a lunch.\n\n0:05:44\tSPEAKER_01\n Good.\n\n0:05:47\tSPEAKER_01\n Maybe.\n\n0:05:53\tSPEAKER_01\n Why Anna, do you have a press?\n\n0:05:56\tSPEAKER_01\n No, I don't.\n\n0:05:57\tSPEAKER_02\n I was in.\n\n0:05:59\tSPEAKER_01\n No.\n\n0:06:00\tSPEAKER_01\n You were not able to.\n\n0:06:01\tSPEAKER_01\n I can talk about it.\n\n0:06:02\tSPEAKER_01\n I have no exaggeration.\n\n0:06:03\tSPEAKER_01\n Yes, maybe, maybe, you can just talk about it or maybe you can use the whiteboard if necessary.\n\n0:06:09\tSPEAKER_02\n Well, I've just been presented with some research who have done it in a small focus group.\n\n0:06:13\tSPEAKER_02\n So, a hundred people, just asked them about their remote control usage habits and what they want in their remote control.\n\n0:06:21\tSPEAKER_02\n It's probably can't email us to you.\n\n0:06:28\tSPEAKER_02\n I've just got a web page with some data on it.\n\n0:06:30\tSPEAKER_02\n Basically, it's saying that users generally dislike the look and feel of their remote controls.\n\n0:06:36\tSPEAKER_02\n 75% of users find most remote controls ugly.\n\n0:06:43\tSPEAKER_02\n 80% of users would spend more money when a remote control would look fancy.\n\n0:06:49\tSPEAKER_02\n Current remote controls do not match well the operating behavior of the user.\n\n0:06:54\tSPEAKER_02\n 75% of users said there's app a lot.\n\n0:06:56\tSPEAKER_02\n So, the user remote control quite frequently while they're watching television.\n\n0:07:01\tSPEAKER_02\n 50% of users say that they only use 10% of the buttons.\n\n0:07:04\tSPEAKER_02\n So, they've got a remote control with a lot of functionality, but really most of the time they only use a small part of that.\n\n0:07:13\tSPEAKER_01\n Do you have this information on the web page?\n\n0:07:16\tSPEAKER_01\n I have a web page, yes.\n\n0:07:17\tSPEAKER_01\n Maybe you can send an email to me later.\n\n0:07:20\tSPEAKER_02\n Yep, sure.\n\n0:07:22\tSPEAKER_01\n About this.\n\n0:07:24\tSPEAKER_02\n So, basically, there's a breakdown of how to actually use the different functions on a remote control.\n\n0:07:30\tSPEAKER_02\n Power and volume selection are only used a few times within this per hour.\n\n0:07:37\tSPEAKER_02\n Channel selection is used 168 times.\n\n0:07:43\tSPEAKER_02\n And then there's things like channel settings, audio settings, which are only used very frequently.\n\n0:07:49\tSPEAKER_02\n Kelly Tex has used 14 times in the hour.\n\n0:07:53\tSPEAKER_02\n So, it is used, but not nearly as much as the channel selection is used.\n\n0:08:00\tSPEAKER_02\n An interesting thing that this report has brought up is that 50% of users report that the remote control gets lost a lot of the time in the room.\n\n0:08:10\tSPEAKER_02\n So, some of the locations in the remote control would be very useful to a lot of users.\n\n0:08:17\tSPEAKER_02\n 34% said it takes too long to learn to use the remote control.\n\n0:08:22\tSPEAKER_02\n That's what's easier to use straight away, more intuitive, perhaps.\n\n0:08:27\tSPEAKER_00\n It's easy to learn, or do you say it's easier?\n\n0:08:29\tSPEAKER_02\n 34% said it took too much time to learn to use new ones.\n\n0:08:35\tSPEAKER_02\n 36% said remote controls are bad for RSI.\n\n0:08:40\tSPEAKER_02\n I don't know how we just go about combating that.\n\n0:08:43\tSPEAKER_02\n Well, RSI is better prepared to strain injury.\n\n0:08:46\tSPEAKER_02\n Okay.\n\n0:08:49\tSPEAKER_01\n I think that our doctor says, is the opinion of the user?\n\n0:08:55\tSPEAKER_02\n Yes, that's what the report says.\n\n0:08:58\tSPEAKER_02\n And then it's got a demographic breakdown.\n\n0:09:01\tSPEAKER_00\n So, you cannot put this webpage online under...\n\n0:09:05\tSPEAKER_02\n I should be able to actually, if I email to you now.\n\n0:09:08\tSPEAKER_03\n You can just connect it then.\n\n0:09:10\tSPEAKER_00\n You can maybe just...\n\n0:09:11\tSPEAKER_00\n It's a webpage on the C, it's a file.\n\n0:09:14\tSPEAKER_00\n Otherwise, you can connect this one.\n\n0:09:18\tSPEAKER_03\n You can connect this one.\n\n0:09:20\tSPEAKER_03\n Or to your computer.\n\n0:09:24\tSPEAKER_00\n So, these are important numbers that Matthew and I need to take into account for...\n\n0:09:35\tSPEAKER_00\n I need to look around with this.\n\n0:09:37\tSPEAKER_02\n It's probably easier if you put on yours and they're just emailed to you.\n\n0:09:40\tSPEAKER_02\n It's just a web link.\n\n0:09:50\tSPEAKER_03\n Okay.\n\n0:09:51\tSPEAKER_00\n Yeah, these numbers have to be taken into account for both user interface and functional design.\n\n0:10:01\tSPEAKER_02\n One thing it goes on to talk about, which is interesting, is the...\n\n0:10:06\tSPEAKER_00\n Because there are many numbers and we need to select to constraint our design based on what is more important.\n\n0:10:15\tSPEAKER_02\n Yeah. One thing is interesting is talking about...\n\n0:10:22\tSPEAKER_02\n Speed recognition in a remote control.\n\n0:10:25\tSPEAKER_00\n Speed recognition in.\n\n0:10:27\tSPEAKER_02\n And who would pay more for that and whether people would find it useful.\n\n0:10:30\tSPEAKER_02\n Did you have numbers on that?\n\n0:10:32\tSPEAKER_02\n Yes, I'll just get this up.\n\n0:10:35\tSPEAKER_00\n So, they would not need any button on the one side?\n\n0:10:39\tSPEAKER_00\n Or potentially, yeah.\n\n0:10:40\tSPEAKER_00\n Or a button speech.\n\n0:10:42\tSPEAKER_00\n I think even for...\n\n0:10:45\tSPEAKER_02\n Interesting idea.\n\n0:10:46\tSPEAKER_02\n Yeah, I think that would not work so well.\n\n0:10:48\tSPEAKER_00\n You wouldn't have both options.\n\n0:10:51\tNone\n Okay.\n\n0:10:56\tSPEAKER_01\n Well, it would be a solution for when your remote control is lost.\n\n0:11:04\tSPEAKER_01\n I mean, when it has speed recognition then...\n\n0:11:08\tSPEAKER_01\n It doesn't matter where it is, well, it's... we should be in range.\n\n0:11:12\tSPEAKER_01\n Or maybe it can respond and produce sound, so say where it is.\n\n0:11:17\tSPEAKER_01\n Yeah.\n\n0:11:18\tSPEAKER_01\n But these are all quite fancy future times.\n\n0:11:20\tSPEAKER_01\n Not sure whether...\n\n0:11:22\tSPEAKER_01\n We will...\n\n0:11:23\tSPEAKER_01\n We can make this for 12 euro for 15 cents.\n\n0:11:27\tSPEAKER_00\n No, you can't.\n\n0:11:28\tSPEAKER_00\n And we don't know where the state of the other speech recognition is.\n\n0:11:31\tSPEAKER_00\n Maybe you know...\n\n0:11:33\tSPEAKER_03\n Well, it depends, you know, like...\n\n0:11:37\tSPEAKER_03\n There is... it's a very small vocabulary.\n\n0:11:40\tSPEAKER_03\n And you want to do the...\n\n0:11:42\tSPEAKER_03\n Applations, like...\n\n0:11:43\tSPEAKER_03\n You want to say, on, off...\n\n0:11:46\tSPEAKER_03\n One, two...\n\n0:11:47\tSPEAKER_03\n But it's quite noisy.\n\n0:11:48\tSPEAKER_00\n You think there is the TV?\n\n0:11:49\tSPEAKER_00\n Yeah, yeah.\n\n0:11:50\tSPEAKER_03\n Yeah, it's not going to be...\n\n0:11:52\tSPEAKER_03\n It's so easy, but...\n\n0:11:55\tSPEAKER_03\n Usually, it's going to be more of an isolated...\n\n0:11:58\tSPEAKER_03\n Do you have some more...\n\n0:12:00\tSPEAKER_01\n Okay, but it's...\n\n0:12:01\tSPEAKER_03\n But I don't know.\n\n0:12:02\tSPEAKER_03\n It's only for each...\n\n0:12:03\tSPEAKER_00\n Well...\n\n0:12:04\tSPEAKER_00\n So, I get to summarize maybe the...\n\n0:12:05\tSPEAKER_02\n This is now talking about who would pay for speech recognition in a remote control...\n\n0:12:09\tSPEAKER_02\n Who would pay more for it.\n\n0:12:12\tSPEAKER_02\n 90% of the 15 to 25-year-old markets said that they would pay more.\n\n0:12:17\tSPEAKER_02\n It goes down from there.\n\n0:12:19\tSPEAKER_02\n 76% for 25 to 35...\n\n0:12:21\tSPEAKER_02\n 35% for 35 to 45...\n\n0:12:23\tSPEAKER_02\n 22% for 45 to 55...\n\n0:12:26\tSPEAKER_02\n And then...\n\n0:12:27\tSPEAKER_02\n Okay, it's a big claim.\n\n0:12:29\tSPEAKER_02\n Yeah, it really depends where we're going to be targeting this product.\n\n0:12:34\tSPEAKER_02\n Which we'll be talking about later, I think.\n\n0:12:37\tSPEAKER_01\n Yes, we will talk about it later.\n\n0:12:39\tSPEAKER_01\n Did you get the email?\n\n0:12:47\tSPEAKER_02\n Yeah, that one.\n\n0:12:50\tSPEAKER_02\n Just follow that link.\n\n0:12:51\tSPEAKER_02\n Okay.\n\n0:12:55\tSPEAKER_00\n You'll be in a different window.\n\n0:12:58\tSPEAKER_02\n There's left.\n\n0:13:00\tSPEAKER_02\n That one.\n\n0:13:01\tSPEAKER_02\n Yeah.\n\n0:13:02\tSPEAKER_00\n Okay, perfect.\n\n0:13:08\tSPEAKER_02\n So, that's the figure I was just talking about there for the different demographics.\n\n0:13:12\tSPEAKER_02\n Another thing it's talking about there is the LCD screen, but there's no figures apparently on that.\n\n0:13:18\tSPEAKER_01\n Okay.\n\n0:13:19\tSPEAKER_01\n Okay.\n\n0:13:20\tSPEAKER_01\n Maybe, Mal, can you give your presentation?\n\n0:13:34\tSPEAKER_00\n Okay, I stay.\n\n0:13:39\tSPEAKER_03\n No, you can move, I think, yeah.\n\n0:13:41\tSPEAKER_01\n You can move.\n\n0:13:43\tSPEAKER_00\n You can move as far as...\n\n0:13:45\tSPEAKER_00\n Maybe I take your chair?\n\n0:13:48\tSPEAKER_00\n Yes, you can take my chair.\n\n0:13:51\tSPEAKER_01\n So, tell us a little bit about that.\n\n0:13:54\tSPEAKER_03\n Thank you.\n\n0:13:55\tSPEAKER_00\n So, I think as everybody knows, I'm the industrial designer.\n\n0:14:06\tSPEAKER_00\n And in this presentation, this quick presentation, it's going to focus on the working design of the remote control.\n\n0:14:19\tSPEAKER_00\n And I'd like first to give a quick, simple introduction, how does it work so that everybody knows, even if you don't have a very technical background, or it is it, I think, in the project it's important.\n\n0:14:33\tSPEAKER_00\n So, basically, the basic function of remote control is to send messages to another system that is fixed.\n\n0:14:42\tSPEAKER_00\n And so, an energy source feeds an integrated circuit, the chip, that can compose messages, usually through infrared bits.\n\n0:14:54\tSPEAKER_00\n And the user interface controls the chip and according to the messages.\n\n0:15:00\tSPEAKER_00\n Right?\n\n0:15:01\tSPEAKER_00\n So, my method for designing the work design, first, the main point is that I would wish to make a really functional project.\n\n0:15:17\tSPEAKER_00\n I would prefer to have very functional capabilities, whether than fancy stuff that, in fact, is not used and doesn't work.\n\n0:15:26\tSPEAKER_00\n So, for that, yeah, as is important to take into account the user requirements from the marketing expert, Anna.\n\n0:15:35\tSPEAKER_00\n And we should agree on what are the technical functions for the remote control.\n\n0:15:46\tSPEAKER_00\n And I'll show you the working design.\n\n0:15:49\tSPEAKER_00\n So, basically, here is a very large view of what we want.\n\n0:15:58\tSPEAKER_00\n On off button, it can be simple, but it's important. And also, in a way linked to broad channels, as well as other buttons that come after.\n\n0:16:12\tSPEAKER_00\n So, the components I quickly draw here is that in this part you have the remote control, the sender, and the other part the receiver.\n\n0:16:24\tSPEAKER_00\n So, my method is, what my aim would be to design and choose the chips and the infrared components to build the remote control right.\n\n0:16:39\tSPEAKER_00\n So, of course, we need energy sources and other receiver.\n\n0:16:47\tSPEAKER_00\n This is a really quick design. You stop me or interrupt me if you don't agree on it on that.\n\n0:16:57\tSPEAKER_00\n So, what I found, after a lot of work, actually, I draw this.\n\n0:17:04\tSPEAKER_00\n I draw for you this schema that can be maybe too technical for you, but it's really important for me.\n\n0:17:12\tSPEAKER_00\n You do a long time, okay? I'm not a one. I'm a one.\n\n0:17:19\tSPEAKER_00\n And it's it, so I won't go into details about that, but these are my preferences to use the kind of components.\n\n0:17:28\tSPEAKER_01\n And why do you want this kind of component? I mean, are they cheap or are they reliable? What were your...\n\n0:17:36\tSPEAKER_00\n So, the main components you see here are the cheapest I found.\n\n0:17:43\tSPEAKER_00\n You have always compromised with reliability and ethics expensive, but these ones are also really reliable.\n\n0:17:56\tSPEAKER_00\n So, yeah, that's it for the working design. I hope you get clear review on what we're remote control is in terms of technical components, but maybe...\n\n0:18:13\tSPEAKER_01\n It's more clear now, I think.\n\n0:18:19\tSPEAKER_03\n But is it getting just by the top market and plugging it in, or you want to...\n\n0:18:26\tSPEAKER_00\n No, no, no. This is a preference, but we can always change.\n\n0:18:30\tSPEAKER_01\n What I was thinking about the schema about the scanner and the receiver, can you get back to it?\n\n0:18:41\tSPEAKER_01\n Yeah, the receiver is of course already in the television and we are not able to change it.\n\n0:18:49\tSPEAKER_01\n Of course, yeah.\n\n0:18:50\tSPEAKER_01\n You must adapt to the receiver. I suppose there is a standard way of communicating to televisions.\n\n0:18:57\tSPEAKER_00\n Yeah, we will use infrared protocol using infrared.\n\n0:19:04\tSPEAKER_00\n Of course, we need to adapt to that protocol that already exists, but what we can do is adapting the chips inside to the best chips and infrared bolts.\n\n0:19:23\tSPEAKER_00\n Yes, okay.\n\n0:19:29\tSPEAKER_03\n Thank you. It's just we had a chain of frequencies.\n\n0:19:34\tSPEAKER_00\n The frequencies? Yeah, yeah. Of course, yeah. In the chip, you have an ear.\n\n0:19:39\tSPEAKER_03\n But you should be careful people are sometimes becoming problem like a guy has recently designed a remote with YouTube's top any other TVs.\n\n0:19:51\tSPEAKER_03\n So basically through all the things, so maybe you should think of... Of course, yeah, we should take that into account.\n\n0:19:59\tSPEAKER_02\n Just check the TV in the next apartment through the lab.\n\n0:20:02\tSPEAKER_03\n So you can just watch the seat and then switch off everyone's TV and you can just walk away.\n\n0:20:07\tSPEAKER_03\n You don't have to be near the TV at all. I like that idea.\n\n0:20:11\tSPEAKER_01\n I think my will consider this, that it thinks maybe we can go to your presentation.\n\n0:20:18\tSPEAKER_01\n Yes, I assume you were finished. Yes.\n\n0:20:23\tSPEAKER_03\n Okay.\n\n0:20:25\tSPEAKER_03\n So I can take a think of mine over there.\n\n0:20:29\tSPEAKER_03\n Okay. So...\n\n0:20:34\tSPEAKER_03\n I can take mine. It's okay.\n\n0:20:38\tSPEAKER_03\n Okay.\n\n0:20:50\tSPEAKER_01\n Sorry. I know where it is. It's on the desktop. It's technical.\n\n0:20:58\tSPEAKER_03\n Okay. Let's show. So I'm going to talk a little bit about the technical function.\n\n0:21:08\tSPEAKER_03\n So actually it's about what is the user going to do? I assume I just presented what is going inside.\n\n0:21:15\tSPEAKER_03\n Yeah. So what's the user is going to see from the outside and how he's going to use it?\n\n0:21:20\tSPEAKER_03\n So well the approach is that basically the idea is to send a message to the TV set.\n\n0:21:28\tSPEAKER_03\n I have some might have found it and it will be decoded by the TV.\n\n0:21:32\tSPEAKER_03\n And usually it is easier to have keys or buttons with which people can press and then changing a button will basically change the message which is being sent to the TV.\n\n0:21:48\tSPEAKER_03\n And basically it's sent in front of the signal and decoded by the receiver.\n\n0:21:55\tSPEAKER_03\n So Anna has said that these people are interested in things which are...\n\n0:22:03\tSPEAKER_03\n You don't need to press the keys. People can have this feature recognition.\n\n0:22:07\tSPEAKER_03\n But this is a question which we have to see later.\n\n0:22:11\tSPEAKER_03\n But in the present scenario is that you have certain keys and you press it like your phone and it sends message to the TV.\n\n0:22:23\tSPEAKER_03\n So generally I don't have some figures. Sorry but there are two kinds of remote if you popularly in the household.\n\n0:22:34\tSPEAKER_03\n Actually so you have a standard TV remote where you have just an on-off button and a volume change and keys for the number and more than one digit option.\n\n0:22:46\tSPEAKER_03\n And if you see for example right now even the one more than one digit option is for two digit channel which is like 99.\n\n0:22:56\tSPEAKER_03\n But tomorrow you might have 150 channels to browse or 200 channels to browse who knows.\n\n0:23:04\tSPEAKER_03\n But then there is a standard one without any fancy thing.\n\n0:23:09\tSPEAKER_03\n It doesn't have to let the option. It's a very simple thing which you can browse.\n\n0:23:18\tSPEAKER_03\n And then you have a video remote which is usually it has almost all the keys over there but then it has other options like staff and then you play the movie or for fast forward the movie or something like that.\n\n0:23:38\tSPEAKER_03\n So these are the standard commonly found remote controls and the market. And then which is generally used by the people and then for personal preferences I would basically think of having a kind of aim for the next generation thing where we could have both the TV and the remote.\n\n0:24:07\tSPEAKER_03\n And then we could have a video remote control because some of the keys in the videos remote control and the TV they could be integrated together so that we could aim for the like in the coming future.\n\n0:24:22\tSPEAKER_02\n So that's the application. So we've got maybe a vcr and a TV to separate. So on my one home I've got a vcr which then changes the channel on the vcr and then the TV. So is it going to be like a switch on the remote that says use the TV or use the vcr or is it no which one you want to use.\n\n0:24:43\tSPEAKER_03\n You could you could think of having you can have a key which could tell it could go to the video thing but you still can't in that case when you use that the function should be able to take up the vcr option and you could play it or you can also think about having like in a few days you will be in in few coming years.\n\n0:25:12\tSPEAKER_03\n You might even have a system where you have a separate sitting setup box and you have something like you don't you don't you suppose you're not able to watch some program and actually it downloading all the time for you and you can just you know when you come back you could just switch on that thing and watch the program in that case you want to browse fast or browse though you want to have those kind of functionalities.\n\n0:25:40\tSPEAKER_03\n This is our kind of next generation. It's an next generation thing but it is going to come in a couple of years. It's already there. I mean the artists record us.\n\n0:25:50\tSPEAKER_03\n I've seen them in the show. So it's going to record your things and you need basically the functionalities what you need in both video as well as in the standard TV thing.\n\n0:26:01\tSPEAKER_03\n But I don't think we're trying to make a universal reminder. No, we are not making a new settlement. We are just looking at giving a scenario. I have a TV and tomorrow I'm going to have a setup box which is going to sit there and it's going to do this.\n\n0:26:15\tSPEAKER_01\n Because for me we need to decide on on on and how far we go to in this.\n\n0:26:21\tSPEAKER_01\n I mean can go pretty far I think with which functions and possible future. Yeah. So it's good to keep in mind.\n\n0:26:33\tSPEAKER_03\n Okay, so that ends my presentation. Well, so we can always discuss about it. For example, the presently the video market actually this demand video or demand or what we call it as.\n\n0:26:50\tSPEAKER_03\n It's presently booming up actually. So it is like people are providing like things like movies you can select actually. So you want to watch a movie and the provider gives a list of movies and then you select those list.\n\n0:27:09\tSPEAKER_03\n And it basically you go off with downloads and movie it gives for you. And then when you come you want to watch it on your TV. Or even you don't need to download it's streamed online.\n\n0:27:23\tSPEAKER_03\n Yeah, it can be streamed online for you and you can say what time I want to was.\n\n0:27:30\tSPEAKER_01\n Yeah, so I have received some some some some well points of thinking over of my account manager and I would like to share them with you.\n\n0:27:42\tSPEAKER_01\n First thing is a teletext is a well known feature of televisions but it's getting used less and less.\n\n0:27:51\tSPEAKER_01\n That's that's especially because of the internet of course. So we should think about it. Do we include it and do we give it a prominent prominent place on the on the on the remote control itself.\n\n0:28:11\tSPEAKER_01\n And I indicated it's not used well very much but it is still used.\n\n0:28:22\tSPEAKER_01\n Further, yes, we must think do we stay to television now only the television as we all know it with broadcasting signals and you can't go back or do we go further as Matthew indicated by supporting recording devices.\n\n0:28:45\tSPEAKER_01\n So DVDs and BCS indeed indeed and in the hardest recorders.\n\n0:28:52\tSPEAKER_01\n Furthermore, we need really need to interest younger customers and then with younger customers I mean people below the age of 40.\n\n0:29:09\tSPEAKER_01\n How current customers are mainly 40 plus which 1440.\n\n0:29:18\tSPEAKER_01\n So this is a market but they will grow older and they always need to have the future with younger people.\n\n0:29:32\tSPEAKER_01\n Therefore, younger people like friendly, trendy designs. So that we should make our RV as trendy as possible but it should also have a reliable image.\n\n0:29:49\tSPEAKER_01\n So when it looks to spacey or to fancy people will think well does it work at all.\n\n0:29:56\tSPEAKER_03\n Well, you can borrow the ideas how you want to keep the keys.\n\n0:30:03\tSPEAKER_03\n If you take it you have like 0, 1, 2, 3 like keys separately but suppose if you take the present trend of mobile phones there are big thick keys.\n\n0:30:17\tSPEAKER_03\n So the present is the top, it takes one number, it takes another number and basically so the space covered so you don't see two separate keys there actually.\n\n0:30:29\tSPEAKER_03\n So it is like maybe you can draw it on the board.\n\n0:30:37\tSPEAKER_02\n I think taking the idea of getting inspiration from mobile phones is interesting especially if we are going after a younger market.\n\n0:30:43\tSPEAKER_02\n Yes, mobile is already used to that. The new and the funky things.\n\n0:30:48\tSPEAKER_02\n There are lots of very pretty mobile phones not too many.\n\n0:30:50\tSPEAKER_02\n Pretty rare American Charles.\n\n0:30:52\tSPEAKER_01\n And they are skilled by using it.\n\n0:30:55\tSPEAKER_03\n So for example, for example you have a key like 1, 2, 3 like this actually and 4, 5, 6 like that.\n\n0:31:22\tSPEAKER_03\n You can have keys like this form like keys like that.\n\n0:31:29\tSPEAKER_02\n How strong have we got for the meeting by the way?\n\n0:31:31\tSPEAKER_02\n I think so.\n\n0:31:32\tSPEAKER_02\n Because we have to put down your graphic at all and it is a very important issue.\n\n0:31:35\tSPEAKER_03\n So you can have keys like which are like so.\n\n0:31:48\tSPEAKER_03\n So you basically don't change the original order of them but then the keys are more spacious.\n\n0:31:55\tSPEAKER_03\n So there is a very slight thing.\n\n0:32:00\tSPEAKER_03\n So if you press on the top it takes the one, it takes the three, four, four here, five or six.\n\n0:32:08\tSPEAKER_03\n So the keys can be, it looks you know not very much cluttered but it looks nice.\n\n0:32:16\tSPEAKER_03\n You don't have too many keys but you can have a lot of options.\n\n0:32:20\tSPEAKER_03\n I think now the idea is clear.\n\n0:32:23\tSPEAKER_01\n We should now try to decide on our target group.\n\n0:32:31\tSPEAKER_02\n Which I think is quite tricky.\n\n0:32:34\tSPEAKER_02\n Basically we are trying to get people to buy our American Charles.\n\n0:32:38\tSPEAKER_02\n Wouldn't they already have our American Charles with the television when they buy one?\n\n0:32:41\tSPEAKER_01\n Of course they have already one.\n\n0:32:43\tSPEAKER_01\n So our remote control has to be better.\n\n0:32:46\tSPEAKER_02\n It's not going to have more functionality because it's only a low market as a cheap end or a control.\n\n0:32:51\tSPEAKER_02\n We can't beat more functionality.\n\n0:32:53\tSPEAKER_02\n We might, we'll be able to beat them on the look of it, the design of it but that's not a big sell or it.\n\n0:32:59\tSPEAKER_02\n They're not going to just go and buy a new remote control which is clear.\n\n0:33:02\tSPEAKER_02\n It looks pretty.\n\n0:33:03\tSPEAKER_02\n They have to actually need it as well.\n\n0:33:05\tSPEAKER_02\n So I'm not sure how we can get people to buy this thing.\n\n0:33:10\tSPEAKER_01\n Well I think many people set in your research the appearance of the RC is important when they're buying one.\n\n0:33:22\tSPEAKER_02\n But why they're buying one in the first place?\n\n0:33:24\tSPEAKER_02\n Indeed.\n\n0:33:25\tSPEAKER_01\n So that will be about functionality.\n\n0:33:32\tSPEAKER_02\n But if people are buying your remote control for functionality they'll buy a universal remote.\n\n0:33:37\tSPEAKER_02\n I've got friends who've got so many things they need a universal remote.\n\n0:33:40\tSPEAKER_02\n Otherwise they're using five different modes for their other things.\n\n0:33:43\tSPEAKER_02\n In that case they wouldn't buy our product because it doesn't give them what they need in terms of functionality.\n\n0:33:48\tSPEAKER_01\n So you think we should go for a more universal?\n\n0:33:53\tSPEAKER_02\n Well we can't with the price range.\n\n0:33:55\tSPEAKER_02\n We're not building a universal remote, we're not building a high end product.\n\n0:33:59\tSPEAKER_00\n But you will think about what might.\n\n0:34:01\tSPEAKER_00\n We have 12.5 euros for RC.\n\n0:34:08\tSPEAKER_00\n And I think with this, now you know that chips are very cheap.\n\n0:34:14\tSPEAKER_00\n And we can include it in our control some new features.\n\n0:34:22\tSPEAKER_00\n But yeah.\n\n0:34:23\tSPEAKER_02\n If we're getting to universal remote territory we're getting to LCD screens and things like that which would drive the cost up a lot.\n\n0:34:29\tSPEAKER_01\n I don't know whether that's necessary.\n\n0:34:31\tSPEAKER_01\n I don't think the university is not necessary.\n\n0:34:35\tSPEAKER_01\n I think this could be a market because universal remote controls tend to be quite expensive.\n\n0:34:44\tSPEAKER_01\n And quite complicated.\n\n0:34:45\tSPEAKER_01\n So we can try to go in between and offer a product which is not as expensive and not as expected.\n\n0:34:54\tSPEAKER_01\n But still people have the idea this is more functional than a normal...\n\n0:35:01\tSPEAKER_01\n...universal RC because it has more...\n\n0:35:05\tSPEAKER_01\n...it's some kind universal.\n\n0:35:08\tSPEAKER_02\n But if we're going for those say 15 to 25 age group then not many there will actually own TVs to use your remote control on.\n\n0:35:17\tSPEAKER_01\n Yes, we are targeting I think more on the 20 to 40 group.\n\n0:35:23\tSPEAKER_01\n So people would just have or already have a job and have the money.\n\n0:35:31\tSPEAKER_01\n But maybe not want to spend that much money on a universal.\n\n0:35:38\tSPEAKER_02\n I don't know really what the price range of remote controls is.\n\n0:35:41\tSPEAKER_02\n Are we going to be at the very bottom of the price range or are we kind of middle to bottom?\n\n0:35:46\tSPEAKER_02\n I don't know.\n\n0:35:47\tSPEAKER_01\n Well, I think when we think about graphic, we are trying to offer a kind of universal control for less money.\n\n0:35:59\tSPEAKER_01\n Yeah.\n\n0:36:02\tSPEAKER_01\n So do you agree?\n\n0:36:06\tSPEAKER_03\n Well, it's fine with me.\n\n0:36:08\tSPEAKER_03\n Like the price as long as it is not too expensive.\n\n0:36:11\tSPEAKER_00\n Yeah, because we have to take into account that we have an asset around 4 million.\n\n0:36:19\tSPEAKER_00\n So when we speak about these numbers, the price of a chip is very cheap.\n\n0:36:28\tSPEAKER_00\n So I'm okay for designing a kind of universal RC.\n\n0:36:37\tSPEAKER_01\n You think it's possible for the 12 euro 50.\n\n0:36:43\tSPEAKER_01\n So then we decide on going to this more universal kind of control.\n\n0:36:50\tSPEAKER_03\n That's what we need.\n\n0:36:54\tSPEAKER_03\n That's needed right now.\n\n0:36:56\tSPEAKER_02\n Basically you can look through the standard.\n\n0:36:58\tSPEAKER_02\n And if we want to get the market, we need that.\n\n0:37:01\tSPEAKER_02\n I guess what I'd like from a universal remote is maybe choosing between three devices.\n\n0:37:07\tSPEAKER_02\n I'd switch between them.\n\n0:37:10\tSPEAKER_02\n And I'd be stereo, VCR and TV.\n\n0:37:12\tSPEAKER_02\n Exactly.\n\n0:37:13\tSPEAKER_03\n And just be able to use them all from the same remote, but not at the same time.\n\n0:37:17\tSPEAKER_03\n You can also browse through all the standards.\n\n0:37:19\tSPEAKER_03\n You know, better limited standards for all of them.\n\n0:37:22\tSPEAKER_01\n And you can just browse through them.\n\n0:37:24\tSPEAKER_01\n So given we are going for this universal type, maybe it's good when you try to find out which components.\n\n0:37:30\tSPEAKER_01\n You definitely need it.\n\n0:37:31\tSPEAKER_01\n Yes.\n\n0:37:32\tSPEAKER_01\n You will try to get more specific user interface consent.\n\n0:37:37\tSPEAKER_01\n Okay.\n\n0:37:38\tSPEAKER_01\n And maybe you can look on what trends are in this type of market.\n\n0:37:44\tSPEAKER_03\n Well, no.\n\n0:37:47\tSPEAKER_01\n So, anyone has a point to bring in or shall we?\n\n0:37:55\tSPEAKER_03\n I don't have anything right now.\n\n0:37:57\tSPEAKER_03\n We'll go and we'll be sure we'll come up something good for you.\n\n0:38:04\tSPEAKER_01\n Yes.\n\n0:38:05\tSPEAKER_03\n We have an influence now.\n\n0:38:07\tSPEAKER_03\n So, yeah.\n\n0:38:08\tSPEAKER_01\n So, admit in what the next meeting will often learns you have.\n\n0:38:16\tSPEAKER_01\n We have a third manage of work and then we have the next meeting.\n\n0:38:22\tSPEAKER_01\n But you will be informed via the computer.\n\n0:38:25\tSPEAKER_03\n Okay.\n\n0:38:27\tSPEAKER_03\n Cool.\n\n0:38:28\tSPEAKER_03\n Perfect.\n\n0:38:29\tSPEAKER_00\n Okay.\n\n0:38:58\tNone\n Okay.\n\n", "summary": [{"summary_text": "SPEAKER will start the meeting. He will present slides and take notes. None will carry on the kit. None has to save his name. None needs to switch the switch. None should open the agenda or say it. None is going to start. "}]}