{"filename": "./data/IS1002b.txt", "transcript": "0:00:00\tNone\n I was the paper.\n\n0:00:02\tNone\n Yeah, it was the paper.\n\n0:00:04\tNone\n Maybe a paper which is used to give a presentation.\n\n0:00:08\tNone\n Who doesn't have to give a presentation?\n\n0:00:10\tNone\n We all do. We can switch around as that will keep these.\n\n0:00:14\tNone\n Okay. All right, just walk these.\n\n0:00:18\tNone\n No.\n\n0:00:19\tNone\n Okay.\n\n0:00:20\tNone\n I see that it moved too long.\n\n0:00:22\tSPEAKER_04\n Okay, so you'll click for me and stuff like that.\n\n0:00:26\tNone\n So you can stay seated for years.\n\n0:00:28\tSPEAKER_04\n Yeah.\n\n0:00:29\tNone\n Okay.\n\n0:00:30\tSPEAKER_04\n I hate these things.\n\n0:00:33\tSPEAKER_02\n Uh-huh.\n\n0:00:34\tNone\n That's a great opportunity then to learn how to be patient.\n\n0:00:39\tNone\n Not my thing.\n\n0:00:42\tNone\n Yeah.\n\n0:00:43\tNone\n It's a new thing to learn there, isn't it?\n\n0:00:45\tNone\n Yeah.\n\n0:00:46\tNone\n Sorry for holding a sunboss.\n\n0:00:47\tSPEAKER_03\n A couple of the tech guys got a little delayed there.\n\n0:00:52\tSPEAKER_00\n Sorry. I understand you guys have a lot of work to do.\n\n0:00:55\tSPEAKER_03\n That's right. We certainly do.\n\n0:00:56\tSPEAKER_03\n We boss.\n\n0:00:58\tNone\n Me, I'm not technically enough to work a clip.\n\n0:01:06\tNone\n It just clearly doesn't work.\n\n0:01:10\tSPEAKER_02\n Yeah. This thing.\n\n0:01:13\tNone\n Yeah, we understand why you're a project manager.\n\n0:01:15\tSPEAKER_04\n Not technical director, don't we?\n\n0:01:17\tSPEAKER_04\n Yes, we do.\n\n0:01:19\tNone\n Oh, that's meant to be in there.\n\n0:01:21\tNone\n Uh-huh.\n\n0:01:22\tNone\n I see.\n\n0:01:23\tNone\n Oh.\n\n0:01:24\tNone\n I know it clips.\n\n0:01:25\tNone\n That's so good.\n\n0:01:26\tNone\n Wow.\n\n0:01:27\tNone\n Cheers, guys.\n\n0:01:29\tSPEAKER_00\n Okay.\n\n0:01:31\tSPEAKER_00\n So, we are here to talk about functional design.\n\n0:01:37\tSPEAKER_00\n Now, hopefully we've all got a better idea from then we did leaving the last meeting as to what it is we are up to now.\n\n0:01:45\tSPEAKER_00\n So here's an agenda.\n\n0:01:48\tSPEAKER_00\n Uh-huh.\n\n0:01:49\tSPEAKER_00\n A lopen.\n\n0:01:50\tSPEAKER_00\n You should know that I'll be taking minutes during all the meetings because I was struggling to last time.\n\n0:01:55\tSPEAKER_00\n Uh-huh.\n\n0:01:56\tSPEAKER_00\n And that will be easier for me now because I'm not actually giving the whole presentation.\n\n0:01:59\tSPEAKER_00\n Uh-huh.\n\n0:02:00\tSPEAKER_00\n The additional points are just the stuff that we sent and it that I forwarded on from upper management, having a few bright ideas to make our lives painful.\n\n0:02:08\tSPEAKER_00\n Um-uh.\n\n0:02:09\tSPEAKER_00\n Now, you can all give your presentations.\n\n0:02:12\tSPEAKER_00\n We can talk about their requirements.\n\n0:02:14\tSPEAKER_00\n And hopefully come to some decisions.\n\n0:02:18\tSPEAKER_00\n Right.\n\n0:02:19\tSPEAKER_00\n 40 minutes for this meeting.\n\n0:02:20\tSPEAKER_00\n So I've got more time than the last one.\n\n0:02:22\tSPEAKER_00\n So here's the additional points.\n\n0:02:23\tSPEAKER_00\n I just wanted to put those in there to see if you guys had any comments on them.\n\n0:02:29\tSPEAKER_00\n Uh-uh.\n\n0:02:30\tSPEAKER_00\n Did you all receive that email?\n\n0:02:31\tSPEAKER_00\n Yeah.\n\n0:02:32\tSPEAKER_00\n So does anyone have any overall?\n\n0:02:36\tSPEAKER_02\n Well, I thought- What comes up for me is that if we're going to- if we're going to be marketing a product that is going to be, uh, having no teletext, people are very comfortable with the idea of having teletext and using teletext.\n\n0:02:52\tSPEAKER_02\n And so we're not- we're going to be a new product without something that people are very comfortable having right now.\n\n0:02:59\tSPEAKER_02\n So that's from a marketing perspective.\n\n0:03:01\tSPEAKER_02\n I-I see- I see a lack.\n\n0:03:04\tSPEAKER_02\n And so we have to go, I think in the other direction, what are we going to have that makes this thing better?\n\n0:03:09\tSPEAKER_00\n Well, that first point could also be an opportunity because in seeing that teletext becoming outdated, some sort of remote control that can work with the internet, there is the opportunity that's presented against.\n\n0:03:19\tSPEAKER_02\n Yeah, no, I agree with you.\n\n0:03:20\tSPEAKER_02\n So what I'm talking about is I see that one side we're eliminating something.\n\n0:03:23\tSPEAKER_02\n So we have to come up with another side which is what are we going to be targeting our market, uh, that identifies our product as better than because it doesn't have teletext, it has to have to- to that.\n\n0:03:33\tSPEAKER_02\n So that's- That's- that was my reaction.\n\n0:03:35\tSPEAKER_00\n Yeah, but we are sort of being dictated that this should only be for the television.\n\n0:03:39\tSPEAKER_00\n So we're quite fixed.\n\n0:03:40\tSPEAKER_00\n Yeah.\n\n0:03:41\tSPEAKER_00\n So they probably in terms of marketing are looking for something that's- that's a cost winner rather than a fantastic new featured product.\n\n0:03:48\tSPEAKER_00\n Okay.\n\n0:03:49\tSPEAKER_04\n Yeah, but we're designing only the remod.\n\n0:03:51\tSPEAKER_04\n We're not designing the T-E-V.\n\n0:03:52\tSPEAKER_04\n Hmm.\n\n0:03:53\tSPEAKER_04\n So we're going to be removing the teletext out of any T-V.\n\n0:03:56\tSPEAKER_04\n Yeah.\n\n0:03:57\tSPEAKER_04\n Yeah.\n\n0:03:58\tSPEAKER_04\n People use our remote with.\n\n0:03:59\tSPEAKER_04\n That's right.\n\n0:04:00\tSPEAKER_04\n I think so.\n\n0:04:01\tSPEAKER_00\n Which is- There's also the potential for market- There's a market here for lost text.\n\n0:04:05\tSPEAKER_00\n For example, someone that just goes to the shop that once a replacement, once it's- It's possible 25 euros is a selling price.\n\n0:04:12\tSPEAKER_00\n We really have to innovate here, I guess.\n\n0:04:14\tSPEAKER_02\n That's what I'm- That's what I'm talking about.\n\n0:04:16\tSPEAKER_02\n Is- Is that we have to find something that is going to be very attractive about this product because somebody- Some people are going to be happy- Unhappy because they- They can't access their teletext.\n\n0:04:25\tSPEAKER_02\n Hmm.\n\n0:04:26\tSPEAKER_02\n Okay.\n\n0:04:27\tSPEAKER_02\n Because we're talking about 80% or 90% or 95% of the televisions out there are- are teletexts.\n\n0:04:33\tNone\n Yeah.\n\n0:04:34\tSPEAKER_02\n So- So it's- It's nothing I'm criticizing the product at all.\n\n0:04:38\tSPEAKER_02\n It's just- When we eliminate that, then what do we bring?\n\n0:04:41\tSPEAKER_02\n What are we bringing to take the place of this?\n\n0:04:43\tSPEAKER_02\n And we have to- In my opinion, we have to double up.\n\n0:04:45\tSPEAKER_02\n If we lose one, we need to bring two.\n\n0:04:48\tSPEAKER_02\n Or three.\n\n0:04:49\tNone\n Okay.\n\n0:04:50\tSPEAKER_00\n I think that- That last point is probably quite straightforward.\n\n0:04:55\tSPEAKER_00\n Obviously, the- The- It has to be branded.\n\n0:04:59\tSPEAKER_04\n So the- The double-lar will be a- Or-\n\n0:05:02\tSPEAKER_00\n On the product, yeah. I think- Can you hand the-\n\n0:05:06\tNone\n Can you hand the- Can you hand the- I think Rolls Royce might mine, but don't worry.\n\n0:05:10\tSPEAKER_03\n I think- Yeah.\n\n0:05:12\tSPEAKER_03\n One of the things that we should also keep in mind when we're doing this- I mean, our company slogan is we put the fashion in electronics, right?\n\n0:05:19\tSPEAKER_03\n So I think our kind of- Our target here is to have some kind of very like sleek, nice looking remote.\n\n0:05:27\tSPEAKER_03\n And we want it to be functional as well.\n\n0:05:29\tSPEAKER_03\n But I think one of the main selling points is that we don't want it to be clunky like- Like this thing here.\n\n0:05:35\tSPEAKER_03\n We don't want a big clunker. We want something that looks nice and- It's fashionable and- So-\n\n0:05:42\tSPEAKER_02\n So you have this? Yeah.\n\n0:05:45\tSPEAKER_00\n So we have three presentations and I think we'll go in- Order of participant number here.\n\n0:05:53\tSPEAKER_00\n So we can have a look at the working design first.\n\n0:05:56\tSPEAKER_00\n From participant two. That's- Yes, we know if- That's fine.\n\n0:06:01\tSPEAKER_03\n Okay, so- And now- That's a click on us.\n\n0:06:10\tSPEAKER_03\n So you all know me. I'm the industrial designer.\n\n0:06:14\tSPEAKER_03\n And we have some basic components that our remote is going to need.\n\n0:06:18\tSPEAKER_03\n Just basically every remote will need them.\n\n0:06:20\tSPEAKER_03\n We need some kind of power- Power source.\n\n0:06:24\tSPEAKER_03\n We have to decide on our user interface, which is his department.\n\n0:06:27\tSPEAKER_03\n But the user interface is also a major component.\n\n0:06:31\tSPEAKER_03\n We need a programmable digital signal processor to- To take the input from the user and translate that into- Into electronic signal, which we pass to the infrared LED, Which you aim at the television, which- And it receives that signal.\n\n0:06:49\tSPEAKER_03\n You need an on-off switch.\n\n0:06:51\tSPEAKER_03\n I don't know how that got in there.\n\n0:06:53\tSPEAKER_03\n And we also need to- If we want a universal remote, we need to have encryption codes for the different makes of TVs.\n\n0:07:02\tSPEAKER_03\n So we need to know all the different signals.\n\n0:07:06\tSPEAKER_03\n And so that I'll require some memory as well.\n\n0:07:11\tSPEAKER_03\n So here's just a basic layout of how- How the remote would work.\n\n0:07:17\tSPEAKER_03\n You have the power sources in the upper right-hand corner there.\n\n0:07:21\tSPEAKER_03\n And you can see that we have the user interface here, Which is connected to the chip, which does all of our signal processing.\n\n0:07:28\tSPEAKER_03\n And then passes that signal on to the infrared LED.\n\n0:07:32\tSPEAKER_03\n And that signal is then emitted and received by the television at the photo transistor.\n\n0:07:38\tSPEAKER_03\n So those are the basic components that need to go into this.\n\n0:07:42\tSPEAKER_03\n And everything else is pretty much open to move around.\n\n0:07:47\tSPEAKER_02\n Would just be considered just a standard- I think any- This is not cutting edge technology we're talking here.\n\n0:07:57\tSPEAKER_02\n We're talking about existing technology.\n\n0:07:59\tSPEAKER_02\n Right. Nothing's been modified or upgraded or- Yeah, this is just-\n\n0:08:02\tSPEAKER_03\n New discoveries. This is just a basic layout of all the components that are going to be absolutely necessary to ever work in remote.\n\n0:08:10\tSPEAKER_03\n We can add things in like if we wanted some voice recognition.\n\n0:08:13\tSPEAKER_03\n I mean, that- I mean, that you can kind of say what- Would fall under the user interface in the digital signal processing chip.\n\n0:08:22\tSPEAKER_00\n Okay.\n\n0:08:23\tSPEAKER_00\n Do we have an idea of costs of different components?\n\n0:08:25\tSPEAKER_03\n Well, the most costly components are going to be the chip.\n\n0:08:29\tSPEAKER_03\n And the- It could also- Basically the user interface and the casing are going to be expensive as well.\n\n0:08:36\tSPEAKER_03\n The LED and the transistors and everything else are, you know, they're pretty cheap.\n\n0:08:41\tSPEAKER_03\n So depending on what we want our functionality to be, the chip could be expensive or it could be cheap.\n\n0:08:47\tSPEAKER_03\n Depending on the amount of memory we need in there and stuff like that.\n\n0:08:51\tSPEAKER_03\n Do we have any gold- Do you have any gold-park figures for that yet?\n\n0:08:56\tSPEAKER_03\n I don't have any figures right now.\n\n0:08:58\tSPEAKER_03\n Okay.\n\n0:08:59\tSPEAKER_03\n We have to wait until we get to more specific design phase for that.\n\n0:09:02\tSPEAKER_03\n Yeah.\n\n0:09:03\tSPEAKER_03\n But- And I think a significant part of the cost could be the actual- The actual casing itself and, you know, the- The buttons and things like that.\n\n0:09:16\tSPEAKER_03\n The shell.\n\n0:09:17\tSPEAKER_03\n Yeah, basically.\n\n0:09:18\tSPEAKER_03\n Okay.\n\n0:09:21\tSPEAKER_00\n Okay.\n\n0:09:23\tSPEAKER_03\n So yeah, that's all I have really.\n\n0:09:25\tSPEAKER_00\n Okay, thanks.\n\n0:09:30\tSPEAKER_00\n And we have participant three of which I believe is Pedro.\n\n0:09:34\tSPEAKER_03\n I-\n\n0:09:40\tSPEAKER_00\n You can give you that. Click on.\n\n0:09:44\tSPEAKER_00\n And you want to get- We were fighting over it.\n\n0:09:49\tSPEAKER_00\n It was almost more fun.\n\n0:09:50\tSPEAKER_00\n You're a slideshow.\n\n0:09:51\tSPEAKER_00\n It's what you want to do here.\n\n0:09:53\tSPEAKER_00\n Just go up to view.\n\n0:09:54\tSPEAKER_00\n Click down here.\n\n0:09:56\tSPEAKER_00\n Okay.\n\n0:09:57\tSPEAKER_04\n That's the one.\n\n0:09:59\tSPEAKER_04\n So yeah, function design.\n\n0:10:01\tSPEAKER_04\n You guys know me, Pedro.\n\n0:10:04\tSPEAKER_04\n And what I found is we want to do fashion.\n\n0:10:10\tSPEAKER_04\n And I think honestly we should keep technology low and just simple basically.\n\n0:10:15\tSPEAKER_04\n And try to aim for design.\n\n0:10:18\tSPEAKER_04\n It's basically a case will- Will cost the same if it looks good or bad.\n\n0:10:23\tSPEAKER_04\n So we have to make it look good.\n\n0:10:26\tSPEAKER_04\n Something cute and small.\n\n0:10:29\tSPEAKER_04\n The big chunk of remotes are dead in the 80s.\n\n0:10:32\tSPEAKER_04\n So we should just go for something that people like to actually look at.\n\n0:10:37\tSPEAKER_04\n And although most people will buy televisions and everything for- That have loads of loads of little functions and everything.\n\n0:10:47\tSPEAKER_04\n And they mostly end up using simple functions and little things.\n\n0:10:52\tSPEAKER_04\n And most of people won't get too mad of actually having to go to the- To the television to for instance tune in their stations.\n\n0:11:01\tSPEAKER_04\n There's no need to have that in the remote.\n\n0:11:03\tSPEAKER_04\n So as for what I would recommend for the- The interference design and I will change the colors on the logo.\n\n0:11:14\tSPEAKER_04\n But we should go for the user oriented device.\n\n0:11:19\tSPEAKER_04\n So simple controls and good ergonomics.\n\n0:11:22\tSPEAKER_04\n And although I still here recommending the teletext, so I'll remove that I guess.\n\n0:11:29\tSPEAKER_04\n But we should go for-\n\n0:11:31\tSPEAKER_00\n I think what the management recommendation was less that there's a worry that- The teletext would become outdated rather than we shouldn't have it.\n\n0:11:39\tSPEAKER_00\n So I still think of it's cheap enough functionality wise to include.\n\n0:11:43\tSPEAKER_00\n It really should be in there.\n\n0:11:45\tSPEAKER_00\n Because otherwise we're just going to- I mean even if it's necessary or not, if you're given the choice between a remote West teletext or without, when it really, if it isn't more expensive for us to make, because as far as I understand it, it can be operated with the same set of buttons.\n\n0:12:04\tSPEAKER_00\n Right, so it should be in there.\n\n0:12:06\tSPEAKER_03\n It's just the cost of an extra button.\n\n0:12:08\tSPEAKER_03\n I mean software wise there's really no difference.\n\n0:12:11\tSPEAKER_02\n Okay.\n\n0:12:12\tSPEAKER_02\n I have maybe a silly question.\n\n0:12:14\tSPEAKER_02\n In the very beginning it's said with the advent of computers there's going to be- it's going to be outmoded teletext.\n\n0:12:21\tSPEAKER_02\n I don't understand how those two things are connected.\n\n0:12:23\tSPEAKER_02\n How does computers and teletext, how, why is one eliminating the need of the other?\n\n0:12:30\tSPEAKER_02\n I don't understand that.\n\n0:12:31\tSPEAKER_00\n Well maybe what we're getting into here is the idea of internet through the TV, for example.\n\n0:12:36\tSPEAKER_00\n So that might clear on what we're doing.\n\n0:12:38\tSPEAKER_04\n Yeah, the doer basically aiming at saying that you would use a couple of years ago, teletext would be the easiest way to check like for scheduling, the scheduling in the next program and stuff like that.\n\n0:12:48\tSPEAKER_03\n It's not what you're watching even if there's commercials, you know.\n\n0:12:51\tSPEAKER_04\n Okay.\n\n0:12:52\tSPEAKER_04\n And now you can look at it internet, but I still think teletext is very more convenient until we have the same commodities.\n\n0:12:58\tSPEAKER_02\n Yeah, because I don't see the crossover between computers and television.\n\n0:13:01\tSPEAKER_02\n I mean I do see the crossover in some sense, but- But it's not happening yet.\n\n0:13:05\tSPEAKER_02\n Well, the remote is used for television.\n\n0:13:08\tSPEAKER_02\n So if we make the crossover and we're going to view television on computers, then we're losing the necessity of the remote.\n\n0:13:14\tSPEAKER_00\n Well, there is, for example, in digital TV systems, you have, you can press a button and you can buy things in Adverts, and you can view through a catalog, for example.\n\n0:13:23\tSPEAKER_00\n A family member remains, it's got a system where you just, and there's other features, for example, in other systems, where you can pause live TV and things like that.\n\n0:13:32\tSPEAKER_00\n It just features from the internet, from computers that are coming into the TV, start under the covers.\n\n0:13:38\tSPEAKER_00\n Okay.\n\n0:13:39\tSPEAKER_00\n But you still use it through a teletext, so- Okay.\n\n0:13:42\tSPEAKER_00\n And the things to think here are that there's going to be more functionality.\n\n0:13:45\tSPEAKER_04\n Yeah, but we're not, I mean, in command for that.\n\n0:13:48\tSPEAKER_04\n That's the thing, all of those require other commands with more complexity and more software.\n\n0:13:53\tSPEAKER_03\n I think a lot of this proprietary anyways, you're not going to be able to, you know, like, command a TV with our remote.\n\n0:13:59\tSPEAKER_00\n I don't think.\n\n0:14:00\tSPEAKER_00\n But still, there's an opportunity, if it's, for example, a trainable one, then we're just simply having looking up down the left right, an okay button or something like that, mate.\n\n0:14:09\tSPEAKER_00\n Mate, too, as well, and future-proofing it.\n\n0:14:12\tSPEAKER_04\n Yeah, but we wouldn't increase the price to try to make it a trainable one, so.\n\n0:14:17\tSPEAKER_04\n Okay.\n\n0:14:18\tSPEAKER_04\n Well, I don't know.\n\n0:14:19\tSPEAKER_04\n One way or the other teletext was there, but I guess we can remove it or, you know, make two separate.\n\n0:14:25\tSPEAKER_03\n I think if it's possible, you should try to, you know, have a talk with management about that, just, you know.\n\n0:14:31\tSPEAKER_02\n I don't see the logic.\n\n0:14:34\tSPEAKER_02\n I don't see the logic in elimination of teletext.\n\n0:14:37\tSPEAKER_02\n But I'm not a tech mind either.\n\n0:14:39\tSPEAKER_02\n I just don't see the crossover between computers and, and, and, we're designing something for a television.\n\n0:14:44\tSPEAKER_02\n Okay.\n\n0:14:45\tSPEAKER_00\n I'll communicate that back to those guys that, and the message really want to be sending to them is that although teletext may become outdated, there's no logic in not having it in there anyway.\n\n0:14:55\tSPEAKER_00\n If it doesn't affect the price.\n\n0:14:57\tSPEAKER_00\n We're selling it to an existing market.\n\n0:14:59\tSPEAKER_00\n So, the reason why I think that, is to words here, is in terms of thinking of ways to feature for a system for future systems that have something else other than teletext,\n\n0:15:09\tSPEAKER_04\n maybe. Yeah, but we're not putting something in the place of teletext.\n\n0:15:14\tSPEAKER_02\n Yeah, and, and, and we're also marketing a product.\n\n0:15:17\tSPEAKER_02\n What I'm seeing is, is a mid range cost product.\n\n0:15:20\tSPEAKER_02\n So, so we can't go and pump a whole bunch of technology into this thing, because all of a sudden we're going to have cost overruns.\n\n0:15:27\tSPEAKER_02\n So, we're going to have a whole bunch of teletext again.\n\n0:15:30\tSPEAKER_00\n What are we adding to the product that makes it marketable?\n\n0:15:33\tSPEAKER_00\n So, for keeping it basic, what we're looking to sell it basically is it's just being very easy to use, looking exceptionally good.\n\n0:15:41\tSPEAKER_00\n That sort of thing, because we really don't have anything else there, do we?\n\n0:15:45\tSPEAKER_02\n I don't, I don't see it.\n\n0:15:46\tSPEAKER_02\n And to me, if I'm going to market a product for, for beauty, for, for design, I'm going to, I'm going to try to market it at a much higher price.\n\n0:15:53\tSPEAKER_02\n I need to make it special with a high price tag.\n\n0:15:55\tSPEAKER_02\n I don't want to make it economically competitive.\n\n0:15:58\tSPEAKER_02\n I want, I want to market it as exclusive.\n\n0:16:01\tSPEAKER_02\n So, I would market this product at, at, at 89 euros and come up with some really beautiful exterior design.\n\n0:16:08\tSPEAKER_02\n Or something that, but, but I don't think we have that flexibility.\n\n0:16:11\tSPEAKER_00\n The same as cheap and functionality is basic.\n\n0:16:13\tSPEAKER_00\n Then, 25 euros is probably a high price for a commoner garden standard, standard TV.\n\n0:16:19\tSPEAKER_00\n So, the place, the place we're going to justify that cost is through, through design, through making it a, a sleek elegant, high priced, basic remote.\n\n0:16:30\tSPEAKER_00\n Does that make sense?\n\n0:16:32\tSPEAKER_02\n No, I, I understand what you're saying.\n\n0:16:34\tSPEAKER_02\n But what I, what I'm, okay, we probably need to move along.\n\n0:16:37\tSPEAKER_02\n Yeah, my concern is trying to find a marketing niche for this product.\n\n0:16:40\tSPEAKER_02\n And if I'm coming in with a, with, with 25 euros, which is mid market price, then what am I going to give these people for this?\n\n0:16:49\tSPEAKER_02\n Yeah.\n\n0:16:50\tSPEAKER_02\n So, that's just my question, but we can keep talking.\n\n0:16:52\tSPEAKER_00\n Okay. So, can I cut into you now?\n\n0:16:55\tSPEAKER_04\n Well, no, I would, I would advocate for continuous teletext and those would be the basic commands.\n\n0:17:01\tSPEAKER_04\n As for really the case of design, maybe I'll come up with more concrete ideas right now.\n\n0:17:06\tSPEAKER_04\n It's just the idea of simplicity and slickiness, right?\n\n0:17:11\tSPEAKER_03\n Right.\n\n0:17:12\tSPEAKER_03\n I'm just thinking, you know, with all these universal remotes that are out there, how many people, how many people actually use every feature that are, you know, like these trainable remotes and things like that, where, you know, it's just so confusing to do, to use all these functions, where I think the largest portion of the market is just going to, you know, they lost their TV remote, they need another one that will work with their TV, they want something that looks nice, that isn't going to break when they drop it, that, you know, that maybe it's, it's ergonomic, it feels good in your hand, something like that.\n\n0:17:48\tSPEAKER_03\n I think that's going to be where you're going to find the biggest, you know, market share.\n\n0:17:52\tSPEAKER_00\n So we're looking for something that looks good and just works, rather than looking for any special features.\n\n0:17:57\tSPEAKER_03\n I think the more bells and whistles we add, it's just going to cut into our, into our profits, because I think as we, as we add costs for things like, for, like, if we had the voice recognition and things like that, I think, you know, what percentage of the, of the, of the market is actually going to use that?\n\n0:18:15\tSPEAKER_03\n Maybe 5 percent.\n\n0:18:18\tSPEAKER_00\n Well, we can talk a lot more potentially in the market, actually in presentation about this.\n\n0:18:22\tSPEAKER_00\n Yeah, okay.\n\n0:18:23\tSPEAKER_00\n I'm sorry.\n\n0:18:24\tSPEAKER_00\n I'm sorry, boss.\n\n0:18:25\tSPEAKER_00\n I'm not the boss.\n\n0:18:27\tSPEAKER_02\n Okay.\n\n0:18:28\tSPEAKER_02\n Pedro, I just want to say quickly, I would really like it when you can come up with some more bells and whistles, huh?\n\n0:18:34\tSPEAKER_02\n You know, things come to my mind is something that's voice activated.\n\n0:18:41\tSPEAKER_02\n I know we're getting into some, some big money on this.\n\n0:18:44\tSPEAKER_00\n I think that's probably a question more for, is that for over here?\n\n0:18:47\tSPEAKER_00\n Yeah, yeah, yeah.\n\n0:18:48\tSPEAKER_02\n Okay.\n\n0:18:49\tSPEAKER_02\n Well, that's kind of both of us.\n\n0:18:50\tSPEAKER_02\n It's the interface.\n\n0:18:51\tSPEAKER_02\n Because, and I think, a voice activated, I think of, of, how many times I've, I've lost my, my remote and I can't find it.\n\n0:18:59\tSPEAKER_02\n So some way that I can, I can find my remote by, I think in a month.\n\n0:19:03\tSPEAKER_00\n Clapping my hands or something.\n\n0:19:04\tSPEAKER_02\n Oh, and so, so, but that's just something.\n\n0:19:09\tSPEAKER_02\n I'm trying to find some bells and whistles, because when I talk about, taking out teletext, it's like, what are we going to put in?\n\n0:19:15\tSPEAKER_02\n What makes this thing attractive?\n\n0:19:16\tSPEAKER_02\n And it's only for televisions.\n\n0:19:18\tSPEAKER_02\n So, every, our, our competition out there has got these, these multiple adapters, where they can use them for their VCRs, their DVDs, their, their televisions.\n\n0:19:28\tSPEAKER_02\n And we're coming out with one remote for television only.\n\n0:19:31\tSPEAKER_02\n And so, to me, we have to make this a really special product.\n\n0:19:34\tSPEAKER_02\n I, I don't, I really have to say, I don't see the market niche for this product.\n\n0:19:38\tSPEAKER_02\n At this price, I don't see it yet.\n\n0:19:40\tSPEAKER_02\n I, I go along with this because this is what we're given to try to market.\n\n0:19:43\tSPEAKER_02\n But I, I don't see the market niche for this product.\n\n0:19:46\tSPEAKER_02\n Without, without some really, something really special to identify it as, as unique in the market.\n\n0:19:54\tSPEAKER_04\n Well, that should be designed.\n\n0:19:56\tSPEAKER_04\n Yeah.\n\n0:19:57\tSPEAKER_04\n That should be the design, basically.\n\n0:19:58\tSPEAKER_04\n I think technology, we, we're not in the price range to do it.\n\n0:20:02\tSPEAKER_04\n We don't have the money to do it towards technology.\n\n0:20:07\tSPEAKER_04\n So we should, we should do it in the box.\n\n0:20:09\tSPEAKER_02\n Yeah.\n\n0:20:10\tSPEAKER_02\n Okay. Well.\n\n0:20:11\tSPEAKER_02\n So, so that's up to you then.\n\n0:20:13\tSPEAKER_02\n Just to make this box in something that's just absolutely extraordinary.\n\n0:20:16\tSPEAKER_02\n Okay.\n\n0:20:17\tSPEAKER_02\n We make it in the form of a gun.\n\n0:20:21\tSPEAKER_02\n We can sell it in the United States.\n\n0:20:23\tSPEAKER_00\n I have a question for you.\n\n0:20:26\tSPEAKER_00\n Does any of the features that Peter is spoken about here have any implications we might not have thought about it on in terms of just pure functionality?\n\n0:20:37\tSPEAKER_00\n I don't know.\n\n0:20:39\tSPEAKER_00\n I don't know the work or the cost of that.\n\n0:20:40\tSPEAKER_03\n I think all these things are pretty standard.\n\n0:20:41\tSPEAKER_03\n I think we'll be okay.\n\n0:20:42\tSPEAKER_03\n Okay.\n\n0:20:43\tSPEAKER_00\n Okay.\n\n0:20:44\tSPEAKER_00\n Cheers.\n\n0:20:45\tSPEAKER_00\n I need to put this one.\n\n0:20:53\tNone\n Right.\n\n0:20:54\tSPEAKER_02\n You know, for marketing, marketing for me is, and how do I go here?\n\n0:21:06\tSPEAKER_02\n Okay.\n\n0:21:07\tSPEAKER_02\n You can just click.\n\n0:21:08\tNone\n Go.\n\n0:21:09\tSPEAKER_04\n There.\n\n0:21:10\tSPEAKER_04\n You just get off that.\n\n0:21:11\tSPEAKER_04\n You just click.\n\n0:21:12\tSPEAKER_04\n Anyway.\n\n0:21:13\tSPEAKER_03\n Aha.\n\n0:21:14\tSPEAKER_03\n Yeah.\n\n0:21:15\tSPEAKER_02\n What for me is it's, I don't know what I'm marketing right now.\n\n0:21:22\tSPEAKER_02\n Okay.\n\n0:21:23\tSPEAKER_02\n Until you spoke and when I wrote this, I don't know what I'm marketing.\n\n0:21:25\tSPEAKER_02\n I just know that I was identified as a, we identified ourselves as a developer, as a manufacturer, and as a distributor to other wholesalers.\n\n0:21:38\tSPEAKER_02\n And so the 25 euros that we've identified as the sale price is a wholesale price, rather than a retail price.\n\n0:21:47\tSPEAKER_02\n That's what we decided here.\n\n0:21:50\tSPEAKER_02\n So what I did is I decided that this needs to be a product in a sense can market itself.\n\n0:21:58\tSPEAKER_02\n So what we've identified here as our main marketing strategy is in design.\n\n0:22:04\tSPEAKER_02\n We're making the most beautiful, attractive, whatever we decided is.\n\n0:22:09\tSPEAKER_02\n So that means we have about seven more minutes or ten minutes left.\n\n0:22:13\tSPEAKER_02\n So I would like to have a product that we can sell easily.\n\n0:22:20\tSPEAKER_02\n So I say inspiration.\n\n0:22:21\tSPEAKER_02\n So having something beauty, something attractive, something that in a sense will sell itself.\n\n0:22:27\tSPEAKER_02\n Innovation, I think, fits into what we're talking about here with design.\n\n0:22:32\tSPEAKER_02\n Cutting edge technology, I don't think we're going to have that.\n\n0:22:35\tSPEAKER_02\n These were ideas I was putting together, unless we come up with some new age product, as far as the casing is concerned.\n\n0:22:44\tSPEAKER_02\n I want to make this thing something that I can identify as special in some way.\n\n0:22:49\tSPEAKER_02\n So maybe we can have some, I talked about environmentally sensitive.\n\n0:22:53\tSPEAKER_02\n Maybe we have a product that can be identified in some way as advantageous in the home.\n\n0:22:58\tSPEAKER_02\n I don't know.\n\n0:23:00\tSPEAKER_02\n These are just thoughts.\n\n0:23:01\tSPEAKER_02\n I wanted to talk about who we are as a corporation.\n\n0:23:06\tSPEAKER_02\n That we're new, we're aggressive, we're competitive, we're trying to provide a product from a new perspective rather than from an old corporate line.\n\n0:23:15\tSPEAKER_02\n So to me, it's about selling our identity, our corporate identity, along with the product.\n\n0:23:22\tSPEAKER_02\n What I found is that the projected costs are competitive.\n\n0:23:30\tSPEAKER_02\n We're kind of in the middle of the market.\n\n0:23:33\tSPEAKER_02\n But what I'm seeing is that the market is ready for, I identified new technology.\n\n0:23:38\tSPEAKER_02\n But again, because what I see is budget restrictions and limitations, I don't know that we can bring any new technology into this thing.\n\n0:23:45\tSPEAKER_02\n If we could have a technological something.\n\n0:23:49\tSPEAKER_02\n I have an idea.\n\n0:23:50\tSPEAKER_03\n Please.\n\n0:23:52\tSPEAKER_03\n And it's kind of along the lines of environmentally sensitive.\n\n0:23:54\tSPEAKER_03\n And it may even fit into ergonomics and even kind of address the issue of losing the remote.\n\n0:24:01\tSPEAKER_03\n What we are saying is a kind of an issue.\n\n0:24:04\tSPEAKER_03\n What we can do is, well, you know that batteries throwing, robots run through batteries like crazy.\n\n0:24:10\tSPEAKER_03\n Yeah.\n\n0:24:11\tSPEAKER_03\n And solar.\n\n0:24:12\tSPEAKER_03\n For some people, well, maybe not a solar remote.\n\n0:24:15\tSPEAKER_03\n But instead, what about if we had like a power cradle?\n\n0:24:18\tSPEAKER_03\n Like a cradle that is there to hold the remote when you're not using it.\n\n0:24:23\tSPEAKER_03\n So you'll always know where the remote is because you have to put it back there to charge the remote.\n\n0:24:27\tSPEAKER_03\n And we can instead of having, instead of having replaceable batteries, we'll just have a power cell that stays there for the life of the remote.\n\n0:24:34\tSPEAKER_03\n You never have to go through all these different batteries.\n\n0:24:40\tSPEAKER_03\n And also, you can, I think it's a good opportunity for the user design, not just for the user design, but also for the look and feel of the remote as a whole.\n\n0:24:52\tSPEAKER_03\n You know, you could have some kind of neat little, you know, a sexy design for a cradle and the remote itself.\n\n0:25:00\tSPEAKER_03\n Well, I like it.\n\n0:25:01\tSPEAKER_02\n I like the idea, but we're talking about in cost is going to probably double.\n\n0:25:05\tSPEAKER_03\n It would increase the cost.\n\n0:25:06\tSPEAKER_02\n But boy, we can sell this thing because there's no batteries.\n\n0:25:09\tSPEAKER_02\n It's environmentally sensitive.\n\n0:25:10\tSPEAKER_02\n We can identify it as a safer product in some form.\n\n0:25:13\tSPEAKER_03\n And you could page through a moat if you lose it.\n\n0:25:15\tSPEAKER_03\n Maybe there's a button on the cradle.\n\n0:25:16\tSPEAKER_03\n Yeah, that's right.\n\n0:25:17\tSPEAKER_02\n I really see.\n\n0:25:18\tSPEAKER_00\n But the question is, can we make this for less than 1250?\n\n0:25:22\tSPEAKER_02\n No, no, no, we have to change the end cost.\n\n0:25:24\tSPEAKER_00\n I don't necessarily have to change the end cost because can we do that without changing it 1250 per product if we basically can sell more based on this?\n\n0:25:38\tSPEAKER_01\n Yeah, that's going to be up to these guys.\n\n0:25:40\tSPEAKER_01\n Well, my reaction is no.\n\n0:25:42\tSPEAKER_03\n What I can do is I can look into how we'll page around.\n\n0:25:45\tSPEAKER_03\n I can look into how much this might increase our costs.\n\n0:25:48\tSPEAKER_03\n And you can look into what kind of effect an increased cost is going to have on our final numbers.\n\n0:25:55\tSPEAKER_00\n Yeah, they can certainly push for more expensive products.\n\n0:25:58\tSPEAKER_02\n Well, see, I'm an advocate to make this an exclusive product.\n\n0:26:02\tSPEAKER_02\n You know, let's sell this thing wholesale for 50 euros.\n\n0:26:06\tSPEAKER_02\n 60 euros.\n\n0:26:07\tSPEAKER_02\n Let's make this thing really exclusive, environmentally sensitive, high tech design, ergonomics, all of this.\n\n0:26:14\tSPEAKER_02\n Just make this thing, yeah, the Rolls-Royce of remote controls.\n\n0:26:19\tSPEAKER_02\n Every home's got to have, if you don't have one, hey, what kind of remote do you have?\n\n0:26:23\tSPEAKER_02\n Oh, you've got one of those.\n\n0:26:25\tSPEAKER_02\n Oh, fantastic.\n\n0:26:26\tSPEAKER_02\n I want one of those, too.\n\n0:26:27\tSPEAKER_02\n I just don't have enough money right now.\n\n0:26:29\tSPEAKER_03\n I just don't know about that because in order to do that, in order to price it at that kind of level, I think we need to have every functionality that all the other competitors are offering, like being able to operate, you know, the DVD player and, you know, the stereo system and all that, which is a pretty basic function that we've opted out of.\n\n0:26:50\tSPEAKER_03\n And additionally, we're maybe not supporting teletext.\n\n0:26:55\tSPEAKER_00\n Now, I think we can see with certainty now that we are supporting teletext.\n\n0:26:59\tSPEAKER_03\n I do think there are some basic features that we don't have that a lot of other remotes are going to have.\n\n0:27:05\tSPEAKER_02\n One thing I don't understand is they've given us this package, okay?\n\n0:27:10\tSPEAKER_02\n Now, in my opinion, we need to give them a package back, okay?\n\n0:27:13\tSPEAKER_02\n They say, okay, here you go.\n\n0:27:15\tSPEAKER_02\n They gave us a foundation of what they want.\n\n0:27:19\tSPEAKER_02\n And it's our place to kind of analyze and evaluate.\n\n0:27:22\tSPEAKER_02\n I don't think it's our place to create their product for them.\n\n0:27:24\tSPEAKER_02\n Maybe it is.\n\n0:27:25\tSPEAKER_02\n I don't know what kind of role we have in a corporate ladder.\n\n0:27:29\tSPEAKER_02\n But to me, it's like, okay, here's our ideas, okay?\n\n0:27:33\tSPEAKER_02\n And then let them look at those ideas and they say, well, we can raise the price 20%.\n\n0:27:39\tSPEAKER_02\n You know, we like this idea, this idea, no.\n\n0:27:42\tSPEAKER_02\n But to me, it's about a choice.\n\n0:27:44\tSPEAKER_02\n Do we follow their directives or do we make presentations back and then discuss?\n\n0:27:51\tSPEAKER_02\n Because I do not see the market niche for the product that they're handing us right now.\n\n0:27:56\tSPEAKER_02\n I don't see it.\n\n0:27:57\tSPEAKER_03\n I have to disagree, though.\n\n0:27:59\tSPEAKER_03\n I think our market niche is basically people who have lost their remote or have broken their remote and don't want to send back to the manufacturer.\n\n0:28:09\tSPEAKER_03\n They just want to run out to the store and get a remote.\n\n0:28:11\tSPEAKER_03\n And then they're going to look on the shelf and they're going to see ours is the nicest looking remote.\n\n0:28:15\tSPEAKER_03\n It does what they need.\n\n0:28:16\tSPEAKER_03\n These aren't...\n\n0:28:17\tSPEAKER_00\n I think that... To get to back to another point, sorry, for cutting in, but I think it's important to remember that this remote has to work with multiple TVs, yeah, because it's selling on its own.\n\n0:28:27\tSPEAKER_00\n It's not going to be specifically for HITRASHI TVs or...\n\n0:28:30\tSPEAKER_00\n What are you going to do?\n\n0:28:31\tSPEAKER_00\n So technologically, if I understand that, TVs, TV remotes working exactly the same way as video remotes and DVD remotes.\n\n0:28:40\tSPEAKER_00\n All you need to do is train them to the individual one or all you need to do is know they're like some four-digit code.\n\n0:28:46\tSPEAKER_00\n So saying that it works with all TVs is equivalent to saying that it'll work with DVDs.\n\n0:28:51\tSPEAKER_02\n No, they've identified the product is not working for anything with televisions.\n\n0:28:55\tSPEAKER_02\n They've identified this product remote.\n\n0:28:56\tSPEAKER_02\n That's why I say I don't see the market niche for this.\n\n0:28:59\tSPEAKER_02\n If we were going to have a product that worked for DVDs, VCRs and everything, then I can see the market niche.\n\n0:29:06\tSPEAKER_02\n But we're only identified as going for televisions without teletext.\n\n0:29:11\tSPEAKER_02\n And it's like, whoa, in my opinion, we have to go with something that's extremely exclusive.\n\n0:29:15\tSPEAKER_02\n Well, here's the thing marketable because who wants just a television remote?\n\n0:29:19\tSPEAKER_02\n I don't.\n\n0:29:20\tSPEAKER_03\n Well, here's my thing about that.\n\n0:29:22\tSPEAKER_03\n If you're in the market for this ultimate remote, you're not going to go for just a television remote.\n\n0:29:28\tSPEAKER_03\n If it can't control your DVD player and if you can't get that all-in-one ultimate remote that just...\n\n0:29:37\tSPEAKER_03\n You can throw all your other remotes away.\n\n0:29:39\tSPEAKER_03\n I'm not going to buy a 75-year-old remote.\n\n0:29:43\tSPEAKER_02\n I have a tendency to agree with you.\n\n0:29:45\tSPEAKER_02\n I really do.\n\n0:29:46\tSPEAKER_02\n That's why I say I question the marketability of the product.\n\n0:29:49\tSPEAKER_02\n I really question where we create the demand.\n\n0:29:52\tSPEAKER_00\n We're looking for something basic.\n\n0:29:54\tSPEAKER_00\n One thing that you said really struck a chord with me here, and that we're carrying the corporate identity with the product, but we're actually looking for a large profit at the same time, where I've been inclined to go back to a reliable management and say, let's just cut down our profit, expect it on this product, because we are actually branding our company here, we're selling more than just the product.\n\n0:30:13\tSPEAKER_00\n We're trying to get MindShare about a real reaction to the people who are going to buy consumer electronics.\n\n0:30:19\tSPEAKER_00\n We want people to eventually say, oh, that's real reacting.\n\n0:30:22\tSPEAKER_00\n That's a good make. It's reliable.\n\n0:30:25\tSPEAKER_00\n And we're going to win MindShare by either being a fantastic product or for it working.\n\n0:30:32\tSPEAKER_00\n It just being good, reasonable price and solid.\n\n0:30:36\tSPEAKER_00\n So if we can put an emphasis here on not breaking, I think that's in itself.\n\n0:30:41\tSPEAKER_00\n That's extremely big.\n\n0:30:43\tSPEAKER_02\n If you drop the cost, now if you make good to the other side of the cost scale, and you make it less expensive, then all of a sudden now we're going into a new market area.\n\n0:30:53\tSPEAKER_02\n So we can say low cost, good design, beautiful, what did I do?\n\n0:31:00\tSPEAKER_02\n But what I'm saying is right now we're middle market.\n\n0:31:03\tSPEAKER_00\n It's 25 euros and mid market price for remote.\n\n0:31:07\tSPEAKER_02\n Yeah, for multi-function remote, that's a mid market price.\n\n0:31:11\tSPEAKER_02\n Interdiscount right now, you can buy them on sale sometimes for about 18, 19 euro.\n\n0:31:18\tSPEAKER_02\n And that's for the multi-functions, DVD, VCR, catchalls.\n\n0:31:23\tSPEAKER_02\n And they have them in a little box in the middle.\n\n0:31:26\tSPEAKER_02\n And this is the consciousness that most people have about replacement remote controls.\n\n0:31:31\tSPEAKER_02\n So to me, to market only a television remote control, we have to change consciousness.\n\n0:31:37\tSPEAKER_02\n We have to have something that will change people's thinking to identify this as advantageous.\n\n0:31:42\tSPEAKER_02\n And I don't know what that is.\n\n0:31:44\tSPEAKER_02\n It's got to be low cost or high cost with special design features.\n\n0:31:48\tSPEAKER_00\n Well, that would be inclined to say if we can make the design better than any comparable remote while reducing the cost, then that's the way we really should play it.\n\n0:31:58\tSPEAKER_00\n If we can take it down to 15 rather than 25 and make a low profit margin on it, but we're really doing that to sell the brand.\n\n0:32:07\tSPEAKER_00\n We have five minutes left.\n\n0:32:09\tSPEAKER_00\n Well, back to sell for real reactions.\n\n0:32:12\tSPEAKER_00\n And I can communicate this to the more senior people within the company here to get reactions.\n\n0:32:20\tSPEAKER_03\n What about the idea that I had with Cradle?\n\n0:32:24\tSPEAKER_03\n How do you feel about that?\n\n0:32:27\tSPEAKER_03\n Well, everybody feel that.\n\n0:32:29\tSPEAKER_02\n We're talking about the other end now.\n\n0:32:31\tSPEAKER_02\n I like it.\n\n0:32:32\tSPEAKER_02\n I like the idea.\n\n0:32:33\tSPEAKER_03\n We have to find out the other end.\n\n0:32:36\tSPEAKER_00\n The problem with that in my mind, I just think off hand is a consumer.\n\n0:32:40\tSPEAKER_00\n Would I want to buy that?\n\n0:32:41\tSPEAKER_00\n And I think maybe not because I've got a remote and I'll take it to different chairs.\n\n0:32:47\tSPEAKER_00\n I'll take it to different, I don't want to go over somewhere and put it down.\n\n0:32:50\tSPEAKER_00\n If it's going to be somewhere that you put it down, then it needs to be at the side of your armchair.\n\n0:32:55\tSPEAKER_00\n And that implies that there's only one TV user.\n\n0:32:58\tSPEAKER_00\n So it's very good for some people.\n\n0:33:00\tSPEAKER_03\n It would last for several hours on its own power.\n\n0:33:04\tSPEAKER_03\n But when you're done with it, you put it back in the crib.\n\n0:33:06\tSPEAKER_00\n But it takes away the ease of use of the remote to set an excuse.\n\n0:33:09\tSPEAKER_00\n You have to sort of remember.\n\n0:33:10\tSPEAKER_00\n You have to shift down the side of the couch to find it and put it back.\n\n0:33:13\tSPEAKER_00\n I think in my mind, it doesn't seem like something that, oh, I really want it because of that fact.\n\n0:33:23\tSPEAKER_00\n But I don't know, that's just my opinion.\n\n0:33:25\tSPEAKER_02\n Well, I think, again, we have a cost issue here.\n\n0:33:28\tSPEAKER_02\n If we're going to go in this direction to me, we're going to the other side of the cost range.\n\n0:33:32\tSPEAKER_02\n Are we going to make this selling the cost as a high tech, environmentally sensitive, whatever, are we going to go to the lower side of the range?\n\n0:33:43\tSPEAKER_02\n Again, I don't see our market niche in the middle for our product yet.\n\n0:33:47\tSPEAKER_00\n I don't see it yet.\n\n0:33:48\tSPEAKER_00\n So what do we think maybe we should petro, do you have any opinion on that?\n\n0:33:53\tSPEAKER_04\n We should keep it simple, medium-low cost area and make it look good.\n\n0:34:02\tSPEAKER_02\n A question I have in, because I think I agree with you on, we've got to make a debauches.\n\n0:34:08\tSPEAKER_02\n The box is going to sell it, I think, the outside casing.\n\n0:34:11\tSPEAKER_02\n Can we have multiple designs, have a modern, have a traditional, have a, you know, and so instead of them all looking the same, people can have maybe four or five different designs they can choose from.\n\n0:34:24\tSPEAKER_02\n I don't know what that creates cost or...\n\n0:34:26\tSPEAKER_03\n Well, the problem with that is we may end up with a whole bunch of inventory of a...\n\n0:34:31\tSPEAKER_03\n Yeah, one over another design.\n\n0:34:32\tSPEAKER_03\n...over another design.\n\n0:34:33\tSPEAKER_03\n Yeah, okay.\n\n0:34:34\tSPEAKER_04\n So, it's a bit complicated.\n\n0:34:36\tSPEAKER_03\n But what we could do is some kind of...\n\n0:34:41\tNone\n Well, I mean...\n\n0:34:44\tSPEAKER_03\n Yeah, we need to, I mean, have a few designs to look at and then come up with something that I think we all agree is, you know, the best fit.\n\n0:34:54\tSPEAKER_03\n I think what's really important is it has to look good, it has to feel...\n\n0:34:58\tSPEAKER_03\n It has to feel good in your hand, it has to be durable, it has to...\n\n0:35:02\tSPEAKER_03\n And I think it's really important that it doesn't look cheap.\n\n0:35:06\tSPEAKER_03\n I think we have to make sure that people look at it and feel like it's like a quality remote, even though the cost may be a lot.\n\n0:35:14\tSPEAKER_02\n What about a remote that doesn't maybe look like a remote?\n\n0:35:23\tSPEAKER_02\n Just an idea.\n\n0:35:24\tSPEAKER_02\n Just, okay, because I mean we all know what a remote looks like on the outside or selling these things everywhere.\n\n0:35:29\tSPEAKER_02\n Maybe that could be part of our design exclusivity as we make a remote that doesn't even look like a remote.\n\n0:35:34\tSPEAKER_02\n It opens like a telephone.\n\n0:35:36\tSPEAKER_03\n Or what if it looks like a pen?\n\n0:35:38\tSPEAKER_02\n Doesn't matter, yeah.\n\n0:35:39\tSPEAKER_02\n I'm just just talking about some point or something to make this thing unique.\n\n0:35:42\tSPEAKER_02\n That's the thing, I'm going to keep thumping up.\n\n0:35:44\tSPEAKER_02\n I'll sell whatever you guys designed.\n\n0:35:46\tSPEAKER_02\n I don't have a problem selling a product.\n\n0:35:47\tSPEAKER_02\n That's not the issue.\n\n0:35:48\tSPEAKER_02\n I give you ideas, you guys create a product.\n\n0:35:50\tSPEAKER_02\n Once you have the finished product, I'll find a way to sell it.\n\n0:35:53\tSPEAKER_02\n Don't worry about it.\n\n0:35:54\tSPEAKER_02\n I just give you these things now because these are my thoughts and feelings.\n\n0:35:57\tSPEAKER_03\n Just to touch on my point one last time that I had brought up, unless you guys are die hard against the fact that it's possible that it reduces the usability of the remote in the fact that you can't lose it on your own, I think it still might be a good idea to investigate having a power cradle.\n\n0:36:23\tSPEAKER_03\n Because in a certain sense, it almost, for me, I would want to have that just because I know at the end of when I'm done watching TV that when I'm done, oh, I better go find the remote and put it back where it belongs.\n\n0:36:36\tSPEAKER_03\n Maybe that's just some people that like that.\n\n0:36:38\tSPEAKER_00\n There's all sorts of remote controls.\n\n0:36:40\tSPEAKER_00\n I remember that this hasn't been done in a while, I think, but as a watch.\n\n0:36:45\tSPEAKER_00\n As a watch.\n\n0:36:46\tSPEAKER_00\n Yeah, there's remote control watches.\n\n0:36:48\tSPEAKER_00\n But I think there are, sorry, 80s things so it might not be easy to market in it.\n\n0:36:53\tSPEAKER_00\n But the two watches came along that it might be cheaper to make.\n\n0:36:56\tSPEAKER_00\n Now those things might have been expensive for all I know.\n\n0:36:59\tSPEAKER_02\n One thing I just thought about when you were saying that is it, our target market is going to be someone who has lost or broken.\n\n0:37:06\tSPEAKER_02\n That's what I was saying.\n\n0:37:07\tSPEAKER_02\n Who's lost or broken their remote.\n\n0:37:10\tSPEAKER_02\n So how many remotes do they want to buy?\n\n0:37:13\tSPEAKER_02\n Can we sell them a remote that can maybe guarantee they will not need to buy another one?\n\n0:37:20\tSPEAKER_02\n And so with this kind of system or a locator or something, to think about how have people been losing or breaking their remotes?\n\n0:37:28\tSPEAKER_02\n How does this happen?\n\n0:37:29\tSPEAKER_02\n In a small presumably.\n\n0:37:31\tSPEAKER_02\n And then design the product maybe some component of the product that can identify this as the last one you'll ever need to buy.\n\n0:37:38\tSPEAKER_00\n Well, if we're going down that, then we don't need to go.\n\n0:37:41\tSPEAKER_00\n It strikes me that the locator feature might actually be quite expensive to make.\n\n0:37:46\tSPEAKER_00\n Whereas actually just putting it in the power cradle might not be too expensive at all because that's just done with mobile phones.\n\n0:37:52\tSPEAKER_00\n We have the low-speed system.\n\n0:37:54\tSPEAKER_00\n So we have actually similar products that we can take from and potentially cut costs there.\n\n0:37:58\tSPEAKER_00\n We need to look into whether we can do that.\n\n0:38:01\tSPEAKER_00\n But I think we have some mobile phone based products checking quickly or internet.\n\n0:38:07\tSPEAKER_00\n We really need to finish up here.\n\n0:38:09\tSPEAKER_02\n We can make it in a shape of a coffee pot.\n\n0:38:13\tSPEAKER_00\n Yeah, we have the power adapter products.\n\n0:38:16\tSPEAKER_00\n We sell power adapter products.\n\n0:38:17\tSPEAKER_00\n So for example, there's nothing stopping us.\n\n0:38:20\tSPEAKER_02\n I think it's telling us to stop from meeting.\n\n0:38:22\tSPEAKER_02\n So we have the, we probably have online in our system.\n\n0:38:26\tSPEAKER_02\n We have the ability to create this we're talking about.\n\n0:38:29\tSPEAKER_00\n Yeah, without it being too, in fact we can cut costs through using the manufacturing that's already going to be in place.\n\n0:38:35\tSPEAKER_02\n If we can create this we have probably five or six or seven really strong marketing characteristics.\n\n0:38:40\tSPEAKER_03\n I think one of the things that we can put right on the boxes never buy another battery.\n\n0:38:44\tSPEAKER_03\n Yeah, you know, something like that.\n\n0:38:46\tSPEAKER_00\n Okay, thanks guys.\n\n0:38:50\tSPEAKER_02\n Oh, that's not what I want.\n\n0:38:54\tSPEAKER_02\n Oh, look at here.\n\n0:38:59\tNone\n We need to leave.\n\n0:39:01\tNone\n We have to leave.\n\n0:39:02\tNone\n But I don't want to leave.\n\n0:39:03\tNone\n I like it.\n\n", "summary": [{"summary_text": "None was the paper which is used to give a presentation. Speaker is a project manager. Speakers are here to talk about functional design. The agenda has been forwarded to the upper management. They are going to work on the project. Speakser is not technically enough to work a clip, so he has to learn to be patient."}]}