{"filename": "./data/IS1009d.txt", "transcript": "0:00:00\tSPEAKER_02\n Okay, okay.\n\n0:00:02\tSPEAKER_01\n I'm going to the arches go first.\n\n0:00:32\tSPEAKER_00\n I did a little this before.\n\n0:00:42\tSPEAKER_00\n Hello.\n\n0:00:44\tSPEAKER_00\n Like before, I have to reduce the meetings from the minutes from the last meeting.\n\n0:00:52\tSPEAKER_00\n And so here we go.\n\n0:01:02\tSPEAKER_00\n It was discussed in the last meeting, which was opened by the presentation from the interface designer that looks would be very important on this new remote.\n\n0:01:14\tSPEAKER_00\n And it is to send messages of course to the TV. It should have nine channel buttons, and next button, volume buttons, subtitle buttons, switch to control features, color, contrast, sharpness, etc.\n\n0:01:30\tSPEAKER_00\n It would have a memory switch, a mute button in case a telephone rings or something.\n\n0:01:34\tSPEAKER_00\n Speech recognition is one of her very favorite personal features she would like to be integrated in this new remote.\n\n0:01:52\tSPEAKER_00\n She would be a child-friendly design with few buttons, colorful, maybe with star-shaped or other-shaped buttons.\n\n0:02:02\tSPEAKER_00\n She presented also an oversized remote, which she guarantees nobody will ever be able to lose.\n\n0:02:10\tSPEAKER_00\n She was challenged on that point.\n\n0:02:16\tSPEAKER_00\n Her very personal favorite really she would very much like to see a speech recognizer integrated in this remote.\n\n0:02:24\tSPEAKER_00\n The industrial designer presented her thoughts on the issue.\n\n0:02:34\tSPEAKER_00\n She would like special pace made out of plastic that is very strong, not using any harmful materials. She would be recyclable and she would be colorful.\n\n0:02:46\tSPEAKER_00\n She would have an integrated circuit board that is highly sophisticated and temperature-resistant.\n\n0:02:52\tSPEAKER_00\n She would like to see a timer and or alarm facility integrated. Technically this thing would also have a resistor and a capacitor, diode, transistor, resonator, and if possibly rechargeable battery.\n\n0:03:12\tSPEAKER_00\n Of course the circuit board and how it works you press the button. The chip is more code-related to the generator amplification.\n\n0:03:30\tSPEAKER_00\n The circuit board is very inexpensive to build. She thinks this is a great feature to consider.\n\n0:03:42\tSPEAKER_00\n She would like this whole thing should be push buttons with a simple chip.\n\n0:03:48\tSPEAKER_00\n The scrolling method is more expensive and not practical anymore. She should be battery operated and of course she would have special cases.\n\n0:04:00\tSPEAKER_00\n The marketing expert who has to finally come up with to market this product has been watching the competition, has some research on the internet, and also has used her personal observations to come up with the fact that such a remote should be small, easy to use and it should be eye catching.\n\n0:04:28\tSPEAKER_00\n From her point of view of course one of the most important facts is that we should get to market before our competition does.\n\n0:04:38\tSPEAKER_00\n To do that maybe one or two features should be developed on which we could dwell on or in other words on which our campaign could be built on.\n\n0:04:51\tSPEAKER_00\n There are too many new features or too many points would only confuse matter. We prefer to have one or two features that can be really driven home.\n\n0:05:03\tSPEAKER_00\n It should have a fruit and vegetable design and should have a soft feel. She feels that's really what people want today.\n\n0:05:12\tSPEAKER_00\n The decision that we took last time was that this special feature we would like to see is a speech recognizer. The energy should be battery, should be on a chip, should be trendy design, compact and strong and should have buttons.\n\n0:05:32\tSPEAKER_00\n And that concludes the presentation from the last minutes from the last meeting.\n\n0:05:38\tSPEAKER_00\n Now we are ready for the presentation of the prototype.\n\n0:05:46\tSPEAKER_03\n Just to look like the button path I'll explain.\n\n0:05:56\tSPEAKER_04\n This is what we have made. This is a model of the remote controller which we are going to build. This is in a snail shape. It is attractive and it's blue in color bright.\n\n0:06:14\tSPEAKER_04\n It has yellow buttons and all the different color buttons. It will be easily fit into the hands and you can access all the buttons easily.\n\n0:06:32\tSPEAKER_04\n Good.\n\n0:06:34\tSPEAKER_04\n You used to have all the buttons.\n\n0:06:44\tSPEAKER_04\n The case is plastic and which is strong. The material is plastic and for the buttons it is soft rubber.\n\n0:07:04\tSPEAKER_04\n You will be touching the buttons more so it is soft when you touch it. For the lid for the light emitting diode it is a fluorescent green.\n\n0:07:16\tSPEAKER_04\n It is a bulb like an ordinary infrared.\n\n0:07:22\tSPEAKER_03\n The button path will be explained by Falsina. We decided upon including certain features and our remote.\n\n0:07:36\tSPEAKER_03\n These features include the signal emitting signal, it is the LED or LED, the infrared.\n\n0:07:46\tSPEAKER_03\n We have included the switch on and off button.\n\n0:07:54\tSPEAKER_03\n We have included another feature that is the mute button on the side of the model.\n\n0:08:04\tSPEAKER_03\n We have included one to nine buttons for controlling the different channels.\n\n0:08:18\tSPEAKER_03\n We have also included two buttons for increasing or decreasing the volume.\n\n0:08:28\tSPEAKER_03\n We also included two buttons for scrolling down the program channels.\n\n0:08:36\tSPEAKER_03\n Our model also contains a button which is called as the menu button.\n\n0:08:46\tSPEAKER_03\n We have included a button which is fluorescent green and this is the menu button which will control the brightness of the screen.\n\n0:09:00\tSPEAKER_03\n We have also included a button which is called as the swapping button.\n\n0:09:08\tSPEAKER_03\n This is a special feature which we have included. This button is an elongated shaped button and this is slightly flexible.\n\n0:09:20\tSPEAKER_03\n If it is turned towards the right, it will take to the previous channel.\n\n0:09:32\tSPEAKER_03\n This is a swapping button.\n\n0:09:40\tSPEAKER_01\n The next channel in the numeric pattern or...\n\n0:09:44\tSPEAKER_03\n Swapping is if you are watching the second channel and then you go to the 10th channel.\n\n0:09:50\tSPEAKER_03\n If you want to go back to the second channel, you can swap this button.\n\n0:10:00\tSPEAKER_03\n This remote has inbuilt voice recognizer which will recognize the user's voice and then it will act accordingly.\n\n0:10:14\tSPEAKER_03\n This is a proposed model.\n\n0:10:18\tSPEAKER_03\n The marketing expert has to give her suggestion when it will be celebrated or it will be cost-effective.\n\n0:10:28\tSPEAKER_01\n I really like it.\n\n0:10:32\tSPEAKER_01\n It is a very easy way to reach the whole thing with one thumb.\n\n0:10:38\tSPEAKER_01\n You don't need two hands and it is easily reachable even for someone with a small hand.\n\n0:10:48\tSPEAKER_01\n The buttons are all raised.\n\n0:10:56\tSPEAKER_01\n I really like that. You did a good job on that.\n\n0:11:00\tSPEAKER_01\n My little designers.\n\n0:11:04\tSPEAKER_01\n I like the idea that the on-off button is in a prominent place.\n\n0:11:10\tSPEAKER_01\n It sticks up.\n\n0:11:14\tSPEAKER_00\n You don't have to go like, oh, you are near it.\n\n0:11:18\tSPEAKER_01\n The color is very attractive.\n\n0:11:22\tSPEAKER_01\n These buttons around here are the mute buttons.\n\n0:11:28\tSPEAKER_03\n These are the front buttons.\n\n0:11:32\tSPEAKER_01\n On both sides.\n\n0:11:36\tSPEAKER_01\n This brings the menu up on the screen.\n\n0:11:42\tSPEAKER_03\n The orange ones are...\n\n0:11:46\tSPEAKER_03\n These two are to increase or decrease the volumes.\n\n0:11:50\tSPEAKER_03\n I will scroll the program channels.\n\n0:11:54\tSPEAKER_01\n I will scroll down the channels.\n\n0:11:58\tSPEAKER_01\n Looks like something I can sell.\n\n0:12:02\tSPEAKER_00\n I have one question.\n\n0:12:06\tSPEAKER_00\n Will there be anything written on the buttons?\n\n0:12:10\tSPEAKER_00\n People know or they have to learn that from a piece of paper.\n\n0:12:14\tSPEAKER_03\n These buttons will have the numbers and all the rest of the buttons will have symbols.\n\n0:12:18\tSPEAKER_03\n You know, it doesn't have to be first.\n\n0:12:22\tSPEAKER_00\n Good point.\n\n0:12:24\tSPEAKER_01\n We need the symbols because we are going into an international market.\n\n0:12:28\tSPEAKER_00\n We can't have anything with language dependent.\n\n0:12:32\tSPEAKER_00\n We can have symbols and text.\n\n0:12:36\tSPEAKER_04\n We can have on the keys.\n\n0:12:40\tSPEAKER_03\n We want to make sure that.\n\n0:12:42\tSPEAKER_03\n We have a holder for this remote.\n\n0:12:48\tSPEAKER_01\n A shell shape.\n\n0:12:50\tSPEAKER_01\n We have a shell.\n\n0:12:54\tSPEAKER_01\n We could do something really funny with this.\n\n0:12:58\tSPEAKER_01\n The snail is known to be slow.\n\n0:13:02\tSPEAKER_01\n We could have some sort of little comic effect on our marketing.\n\n0:13:06\tSPEAKER_01\n This is a rapid snail.\n\n0:13:10\tSPEAKER_00\n What are our special features for the marketing?\n\n0:13:14\tSPEAKER_00\n That's really the voice recognition.\n\n0:13:18\tSPEAKER_01\n Voice recognition is our selling point.\n\n0:13:22\tSPEAKER_00\n Nobody seems to have that in this press range.\n\n0:13:26\tSPEAKER_00\n And then the other thing would basically be shape or practicality of use.\n\n0:13:32\tSPEAKER_01\n Everybody is going to say their remote control is practical.\n\n0:13:36\tSPEAKER_01\n We have to dwell on their appearance.\n\n0:13:40\tSPEAKER_01\n You are going to have the best cutist remote control on the block.\n\n0:13:46\tSPEAKER_01\n I think we have to play with the image, play with the snail image, play with the visual and then the voice recognition.\n\n0:13:56\tSPEAKER_01\n Those are the two things to push.\n\n0:13:58\tSPEAKER_01\n The look and the voice recognition.\n\n0:14:00\tSPEAKER_01\n They are going to be our two selling points.\n\n0:14:04\tSPEAKER_00\n Having said that.\n\n0:14:06\tSPEAKER_00\n I am supposed to make a little presentation on it.\n\n0:14:08\tSPEAKER_00\n No, this was our evaluation criteria.\n\n0:14:12\tSPEAKER_00\n We are going to talk about financing.\n\n0:14:16\tSPEAKER_01\n In my instructions, I think it is possible to go to the board and do something.\n\n0:14:22\tSPEAKER_00\n Is there a production evaluation?\n\n0:14:24\tSPEAKER_00\n Yes, that is me.\n\n0:14:26\tSPEAKER_00\n That is after financing.\n\n0:14:28\tSPEAKER_01\n Sorry.\n\n0:14:30\tSPEAKER_00\n We had looks and voice recognition.\n\n0:14:40\tSPEAKER_00\n Now on the financing we bring up the...\n\n0:14:44\tSPEAKER_00\n There it is.\n\n0:14:48\tSPEAKER_00\n Energy source, we say that is battery.\n\n0:14:54\tSPEAKER_00\n That is right.\n\n0:14:56\tSPEAKER_00\n Now...\n\n0:15:00\tSPEAKER_00\n I guess we use one.\n\n0:15:04\tSPEAKER_03\n Yes.\n\n0:15:06\tSPEAKER_03\n What?\n\n0:15:10\tSPEAKER_00\n The seller chart.\n\n0:15:12\tSPEAKER_00\n You are trying to change his project.\n\n0:15:14\tSPEAKER_00\n That is nice.\n\n0:15:16\tSPEAKER_00\n He told me I could just change it here and that it does not work.\n\n0:15:22\tSPEAKER_01\n Can you just fill it in the other boxes?\n\n0:15:28\tSPEAKER_00\n Yes.\n\n0:15:30\tSPEAKER_00\n One.\n\n0:15:32\tSPEAKER_00\n I will go away.\n\n0:15:34\tSPEAKER_00\n Kinetic source.\n\n0:15:36\tSPEAKER_00\n That is in the energy source.\n\n0:15:38\tSPEAKER_00\n That is all we need.\n\n0:15:40\tSPEAKER_00\n Electronic simple chip on print.\n\n0:15:42\tSPEAKER_00\n Is that what we are using?\n\n0:15:44\tSPEAKER_00\n One of those.\n\n0:15:46\tSPEAKER_00\n One.\n\n0:15:48\tSPEAKER_00\n Regular chip on print?\n\n0:15:52\tSPEAKER_00\n No.\n\n0:15:54\tSPEAKER_00\n That is all we need.\n\n0:15:56\tSPEAKER_00\n The one case.\n\n0:15:58\tSPEAKER_00\n Uncurt flat single curved double curved.\n\n0:16:02\tSPEAKER_04\n This is a single curve.\n\n0:16:06\tSPEAKER_00\n I guess it is double curved.\n\n0:16:08\tSPEAKER_00\n Double curved.\n\n0:16:10\tNone\n One of those.\n\n0:16:12\tSPEAKER_00\n Case materials supplements.\n\n0:16:14\tSPEAKER_00\n Plastic.\n\n0:16:16\tSPEAKER_00\n Rubber.\n\n0:16:18\tSPEAKER_01\n Rubber because we are going to have the soft buttons.\n\n0:16:22\tSPEAKER_00\n Yes.\n\n0:16:24\tSPEAKER_04\n I think that is for rubber.\n\n0:16:26\tSPEAKER_04\n That is just for the case material.\n\n0:16:28\tSPEAKER_00\n Special color so.\n\n0:16:30\tSPEAKER_00\n We are having that.\n\n0:16:34\tSPEAKER_00\n Then we have the interface push buttons.\n\n0:16:40\tSPEAKER_00\n Scroll wheel now.\n\n0:16:44\tSPEAKER_00\n Integrated scroll wheel LC display.\n\n0:16:48\tSPEAKER_01\n No.\n\n0:16:50\tSPEAKER_01\n But we didn't put the clock in it after all.\n\n0:16:52\tSPEAKER_00\n No.\n\n0:16:54\tSPEAKER_00\n Spud and supplement special color.\n\n0:16:56\tSPEAKER_00\n Yes.\n\n0:16:58\tSPEAKER_00\n Special form.\n\n0:17:00\tSPEAKER_03\n Yes.\n\n0:17:02\tSPEAKER_00\n We do have special form.\n\n0:17:04\tSPEAKER_00\n And special material rubber wood.\n\n0:17:06\tSPEAKER_00\n Yes.\n\n0:17:08\tNone\n Okay.\n\n0:17:10\tSPEAKER_00\n Total 7.6.\n\n0:17:12\tSPEAKER_00\n Whatever that means.\n\n0:17:14\tSPEAKER_04\n I think that is the price.\n\n0:17:16\tSPEAKER_04\n That is the price.\n\n0:17:18\tSPEAKER_00\n 8.2.\n\n0:17:20\tSPEAKER_00\n 8.2.\n\n0:17:22\tSPEAKER_00\n Nice.\n\n0:17:26\tSPEAKER_00\n Nice.\n\n0:17:28\tSPEAKER_00\n Okay.\n\n0:17:30\tSPEAKER_00\n 8.2 right?\n\n0:17:32\tSPEAKER_00\n So we look like we are well within budget.\n\n0:17:36\tSPEAKER_00\n Okay.\n\n0:17:38\tSPEAKER_00\n Okay.\n\n0:17:40\tSPEAKER_00\n I guess I should save this.\n\n0:17:42\tSPEAKER_00\n I suppose.\n\n0:17:44\tNone\n Yes.\n\n0:17:46\tSPEAKER_02\n Oops.\n\n0:17:50\tNone\n Haha.\n\n0:17:54\tNone\n The desktop.\n\n0:17:58\tSPEAKER_00\n I just tried that.\n\n0:18:08\tSPEAKER_00\n My documents computer.\n\n0:18:10\tSPEAKER_00\n My computer.\n\n0:18:12\tNone\n Here it is.\n\n0:18:16\tSPEAKER_00\n Okay.\n\n0:18:18\tSPEAKER_00\n Fine.\n\n0:18:20\tSPEAKER_00\n Okay.\n\n0:18:22\tSPEAKER_00\n Good.\n\n0:18:24\tSPEAKER_00\n So that is the good news.\n\n0:18:26\tSPEAKER_00\n You are going to be popular.\n\n0:18:28\tSPEAKER_00\n So that I think financing was pretty simple.\n\n0:18:34\tSPEAKER_00\n Now we would like to have a presentation by the marketing expert on production evaluation.\n\n0:18:42\tSPEAKER_01\n Okay. I will take my file down so you can bring it up.\n\n0:18:58\tSPEAKER_01\n Okay.\n\n0:19:00\tNone\n Should be able to get it now.\n\n0:19:02\tSPEAKER_01\n Okay.\n\n0:19:04\tSPEAKER_01\n Why don't you move just to the next slide right away?\n\n0:19:06\tSPEAKER_01\n You want to go to the next slide?\n\n0:19:08\tSPEAKER_01\n Yeah.\n\n0:19:10\tSPEAKER_01\n Okay.\n\n0:19:12\tSPEAKER_01\n Well, obviously my method for the marketing of this thing is first to ask the big question.\n\n0:19:16\tSPEAKER_01\n Will it sell?\n\n0:19:18\tSPEAKER_01\n And I think we should show this prototype to people from various age and socioeconomic groups and see about any fine tuning that maybe little things that we haven't thought of.\n\n0:19:28\tSPEAKER_01\n We can't accept every suggestion of course, but maybe we just need to get a few and show the prototype to consider research groups who don't want somebody to suddenly come to us and tell us that this button is toxic and you know some child will swallow it and then we won't sell any.\n\n0:19:44\tSPEAKER_01\n So we have to get some input from those people.\n\n0:19:46\tSPEAKER_01\n And then after that we just have to go with our best intuition.\n\n0:19:48\tSPEAKER_01\n And you know, we like it.\n\n0:19:50\tSPEAKER_01\n We think it's good.\n\n0:19:52\tSPEAKER_01\n We're going to get behind it and sell it.\n\n0:19:54\tSPEAKER_01\n Next slide please.\n\n0:19:56\tSPEAKER_01\n Okay.\n\n0:19:58\tSPEAKER_01\n Now the things that I was thinking and my wish list has really been realized in this prototype.\n\n0:20:04\tSPEAKER_01\n I wanted the shape to be biomorphic.\n\n0:20:06\tSPEAKER_01\n I didn't want anything with angles on all square.\n\n0:20:08\tSPEAKER_01\n I wanted to be comfy and roundy.\n\n0:20:10\tSPEAKER_01\n So we got that size of small.\n\n0:20:13\tSPEAKER_01\n The color is bright and warm, which is what we wanted.\n\n0:20:16\tSPEAKER_01\n We wanted the feel to be as soft as possible.\n\n0:20:18\tSPEAKER_01\n We'll have the soft buttons.\n\n0:20:20\tSPEAKER_01\n And the way this is shaped even though it's going to be hard plastic.\n\n0:20:23\tSPEAKER_01\n It feels good in your hands, so that's nice.\n\n0:20:25\tSPEAKER_01\n And functionality I put last on my list because people aren't going to use it before they buy it.\n\n0:20:31\tSPEAKER_01\n So paradoxically the other features, in other words, the look, the feel, and the shape.\n\n0:20:38\tSPEAKER_01\n That's what people are going to get in the store.\n\n0:20:40\tSPEAKER_01\n They don't have a television in the store.\n\n0:20:42\tSPEAKER_01\n They can't play with it.\n\n0:20:43\tSPEAKER_01\n So they'll be our main selling points.\n\n0:20:46\tSPEAKER_01\n So those have been fulfilled by your prototype.\n\n0:20:51\tSPEAKER_01\n And go ahead to the next slide please.\n\n0:20:53\tSPEAKER_01\n Okay, so the shape, I think, is a one.\n\n0:20:59\tSPEAKER_01\n That's really excellent shape.\n\n0:21:02\tSPEAKER_01\n The size is small.\n\n0:21:05\tSPEAKER_01\n And these points are the importance for the marketing.\n\n0:21:10\tSPEAKER_01\n These aren't in how I feel.\n\n0:21:13\tSPEAKER_01\n I think that it's plenty small enough to sell.\n\n0:21:16\tSPEAKER_01\n But I think we're sort of right.\n\n0:21:18\tSPEAKER_01\n The scale is one to seven.\n\n0:21:20\tSPEAKER_01\n We're sort of right in the middle as far as other competitors.\n\n0:21:24\tSPEAKER_01\n And our color, I think, is great.\n\n0:21:26\tSPEAKER_01\n The colors are bright and warm, and we really do a great job there.\n\n0:21:30\tSPEAKER_01\n And given the constraints that we had, I think we got it as soft as possible.\n\n0:21:35\tSPEAKER_01\n And then functionality, I think you did a really good job on functionality.\n\n0:21:41\tSPEAKER_01\n Obviously we could have added different functions, but then we disturbed something else.\n\n0:21:46\tSPEAKER_01\n So we said that we got to a five out of seven on functionality.\n\n0:21:50\tSPEAKER_01\n So I think that basically we've got a great product and we can get off and running with it.\n\n0:21:55\tSPEAKER_00\n I just realized one thing.\n\n0:21:58\tSPEAKER_00\n In the financing, there was no room for our voice recognizer.\n\n0:22:03\tSPEAKER_00\n Yes.\n\n0:22:04\tSPEAKER_00\n And I don't know how we can evaluate that or how we can include that.\n\n0:22:11\tSPEAKER_01\n Well, we had what, eight euros, 20 as our cost?\n\n0:22:15\tSPEAKER_01\n Eight, eight, 20, yes.\n\n0:22:17\tSPEAKER_01\n And so we've got, we've got four euros to go to spend.\n\n0:22:21\tSPEAKER_00\n I mean, maximum, we have another four point three euros, I mean, four thirty.\n\n0:22:27\tSPEAKER_00\n But, I mean, we have no way of presenting that to management as, you know, as a finished product and saying, we said, always recognizer that costs so much. So we just have to be aware of that.\n\n0:22:46\tSPEAKER_00\n I mean, and know whether the four thirty will really cover that.\n\n0:22:51\tSPEAKER_01\n Well, as we know in today's technological world, you can do just about anything at any price, the problem is quality.\n\n0:22:59\tSPEAKER_01\n So we're just going to have to settle for whatever quality that will buy us.\n\n0:23:03\tSPEAKER_01\n And it may not be the greatest quality, but it may sell anyway.\n\n0:23:09\tSPEAKER_01\n Yeah.\n\n0:23:10\tSPEAKER_01\n As we've seen with so many of these kinds of products.\n\n0:23:14\tSPEAKER_00\n I'm sorry to interrupt them, but I just, I just remembered that there was no, that that was not included, that there was no room for any special features.\n\n0:23:27\tSPEAKER_00\n Okay. So to be aware of that, you want to go to this next slide, marketing expert.\n\n0:23:33\tSPEAKER_00\n Well, isn't this my last slide?\n\n0:23:35\tSPEAKER_01\n I don't know.\n\n0:23:36\tSPEAKER_00\n Good. Yes, it is.\n\n0:23:37\tSPEAKER_01\n It goes my last slide, yeah.\n\n0:23:39\tSPEAKER_01\n Okay.\n\n0:23:45\tSPEAKER_01\n And I'm supposed to present the scale on the whiteboard.\n\n0:23:50\tSPEAKER_01\n And we're supposed to talk about those things as a team now.\n\n0:23:53\tSPEAKER_01\n So if you put my last slide back up there.\n\n0:23:58\tSPEAKER_01\n Oh, I'm sorry.\n\n0:23:59\tSPEAKER_01\n I forgot to do that.\n\n0:24:02\tSPEAKER_00\n Wow. Why you need that up?\n\n0:24:06\tSPEAKER_01\n Well, because I can't remember what I put on there.\n\n0:24:12\tSPEAKER_01\n Okay.\n\n0:24:13\tSPEAKER_01\n Yeah, I'm supposed to see how long my leash is here.\n\n0:24:16\tSPEAKER_01\n I think you can make it there.\n\n0:24:18\tSPEAKER_01\n Okay.\n\n0:24:19\tSPEAKER_01\n You ready? So now we're all supposed to say what we think.\n\n0:24:24\tSPEAKER_01\n Okay. So on shape.\n\n0:24:29\tSPEAKER_01\n I gave it one.\n\n0:24:34\tSPEAKER_01\n What would you write?\n\n0:24:36\tSPEAKER_01\n One being good and seven being the worst.\n\n0:24:39\tSPEAKER_01\n What do you think the shape is?\n\n0:24:42\tSPEAKER_01\n One.\n\n0:24:43\tSPEAKER_01\n Okay. And that's it.\n\n0:24:45\tSPEAKER_00\n Yes, I think shape is one.\n\n0:24:47\tSPEAKER_01\n Okay.\n\n0:24:50\tSPEAKER_01\n Okay. And how about on size?\n\n0:24:57\tSPEAKER_01\n On size?\n\n0:24:58\tSPEAKER_01\n You gave it a four.\n\n0:24:59\tSPEAKER_01\n I gave it a four.\n\n0:25:00\tSPEAKER_01\n Yeah, I feel it's just average.\n\n0:25:03\tSPEAKER_00\n I don't know.\n\n0:25:05\tSPEAKER_00\n I think that would give you that at least a two.\n\n0:25:07\tSPEAKER_00\n Okay.\n\n0:25:10\tSPEAKER_03\n One.\n\n0:25:11\tSPEAKER_04\n Mm-hmm.\n\n0:25:12\tSPEAKER_04\n Yeah, even I think it is one.\n\n0:25:14\tSPEAKER_01\n Okay.\n\n0:25:15\tSPEAKER_01\n Here's the designer.\n\n0:25:17\tSPEAKER_01\n Of course you want to give it one.\n\n0:25:20\tSPEAKER_01\n And then how about how we're doing on color?\n\n0:25:25\tSPEAKER_02\n Color.\n\n0:25:26\tSPEAKER_02\n Color.\n\n0:25:27\tSPEAKER_01\n Color. I gave it one.\n\n0:25:28\tSPEAKER_01\n I really like all those nice bright warm colors.\n\n0:25:30\tSPEAKER_00\n I like the colors.\n\n0:25:31\tSPEAKER_00\n One.\n\n0:25:32\tSPEAKER_04\n Yeah.\n\n0:25:33\tSPEAKER_04\n One.\n\n0:25:34\tSPEAKER_01\n One.\n\n0:25:35\tSPEAKER_01\n Okay.\n\n0:25:36\tSPEAKER_01\n And how about the feel?\n\n0:25:41\tSPEAKER_01\n Taking into consideration texture and comfort in the hand.\n\n0:25:48\tSPEAKER_00\n I think I will give it a two.\n\n0:25:50\tSPEAKER_01\n Okay. I give it a three, two, and a three.\n\n0:25:54\tSPEAKER_01\n Three.\n\n0:25:55\tSPEAKER_04\n Maybe two.\n\n0:25:57\tSPEAKER_01\n Two.\n\n0:25:58\tSPEAKER_01\n Okay.\n\n0:25:59\tSPEAKER_01\n And the next is functionality.\n\n0:26:02\tSPEAKER_01\n Where I admit I was a little hard on our team here.\n\n0:26:06\tSPEAKER_01\n But.\n\n0:26:09\tSPEAKER_00\n Well, it's also you can't really try it out.\n\n0:26:12\tSPEAKER_00\n Yeah.\n\n0:26:13\tSPEAKER_00\n The other things you have more, it's more tangible.\n\n0:26:15\tSPEAKER_00\n So from that point of view.\n\n0:26:17\tSPEAKER_00\n But.\n\n0:26:21\tSPEAKER_00\n I'll give it a three.\n\n0:26:22\tSPEAKER_01\n Okay.\n\n0:26:26\tSPEAKER_01\n Two.\n\n0:26:27\tSPEAKER_01\n Two.\n\n0:26:28\tSPEAKER_04\n Okay.\n\n0:26:29\tSPEAKER_04\n Three.\n\n0:26:30\tSPEAKER_01\n Three.\n\n0:26:32\tSPEAKER_01\n Okay.\n\n0:26:34\tSPEAKER_01\n Well.\n\n0:26:38\tSPEAKER_01\n It looks like we've got ourselves a pretty good product.\n\n0:26:41\tSPEAKER_01\n Functionality is the only place where maybe we have to think about maybe having forbid having another meeting.\n\n0:26:53\tSPEAKER_01\n But otherwise I think we're ready to go with this product.\n\n0:27:00\tSPEAKER_01\n Anybody else have any other comments or any other things that we feel we should evaluate?\n\n0:27:07\tNone\n Yeah.\n\n0:27:10\tSPEAKER_00\n Here is what we're looking at.\n\n0:27:19\tSPEAKER_00\n Satisfaction on, for example, room for creativity.\n\n0:27:25\tSPEAKER_00\n Is there more room for creativity?\n\n0:27:31\tSPEAKER_00\n Or are we absolutely happy?\n\n0:27:35\tSPEAKER_04\n Maybe we can always improve.\n\n0:27:38\tSPEAKER_04\n Yes.\n\n0:27:39\tSPEAKER_04\n Yes.\n\n0:27:40\tSPEAKER_04\n Yes.\n\n0:27:41\tSPEAKER_04\n We can make the buttons, few buttons smaller.\n\n0:27:44\tSPEAKER_04\n I think they are quite big.\n\n0:27:47\tSPEAKER_04\n So I think we can just have small buttons and more buttons in that case.\n\n0:27:52\tSPEAKER_04\n If we want to have more features in that.\n\n0:27:56\tSPEAKER_01\n Well, then again if we're going to do the speech recognition thing, there are going to be some buttons that are going to have to be added for that, for the recording of the speech.\n\n0:28:08\tSPEAKER_01\n So that's where we're going to have to do, maybe we can eliminate one of the mute buttons instead of having two mute buttons.\n\n0:28:16\tSPEAKER_01\n And then maybe we can do something with the volume control.\n\n0:28:25\tSPEAKER_01\n Maybe we can put that all on one button and a couple of other, maybe consolidate some of the usage and see what we can do with that.\n\n0:28:38\tSPEAKER_01\n Yeah, obviously.\n\n0:28:39\tSPEAKER_00\n Bearing in mind that right now we are of course well within the budget.\n\n0:28:43\tSPEAKER_00\n And that we still, you know, we probably can't, with this particular item, we probably can't just add a whole lot of more things.\n\n0:28:53\tSPEAKER_00\n No.\n\n0:28:55\tSPEAKER_00\n We need, you know, we need to leave space money-wise for the voice recognizer.\n\n0:29:10\tSPEAKER_00\n So the question really is how do we feel with the project process?\n\n0:29:17\tSPEAKER_00\n Are we happy with the creativity that has passed here or we are not happy with the new product we created or that was created?\n\n0:29:28\tSPEAKER_00\n I think personally I think I'm pretty happy.\n\n0:29:32\tSPEAKER_00\n I'm pretty happy with the job.\n\n0:29:34\tSPEAKER_00\n That's something I think I can market.\n\n0:29:36\tSPEAKER_00\n Yeah.\n\n0:29:37\tSPEAKER_00\n And then the next question is are we happy with the leadership of this project?\n\n0:29:43\tSPEAKER_01\n I think you've done a good job misleading.\n\n0:29:47\tSPEAKER_00\n I think teamwork, I think was very, very good.\n\n0:29:50\tSPEAKER_00\n I think we are good together as a team.\n\n0:29:54\tSPEAKER_00\n And I think we are we happy with some means we used, we used whiteboard, we didn't use digital, well digital pens against these things.\n\n0:30:03\tSPEAKER_01\n Maybe we could have used the whiteboard a little bit more.\n\n0:30:07\tSPEAKER_00\n Yes, we could. It's maybe not in the best position in the room.\n\n0:30:14\tSPEAKER_00\n Sometimes it's positioned so that it's much better visible for everybody.\n\n0:30:19\tSPEAKER_00\n And I think from that point of view we sort of ignored it a little bit.\n\n0:30:22\tSPEAKER_01\n We used to slide because it was better positions.\n\n0:30:24\tSPEAKER_01\n Yes, I think so.\n\n0:30:25\tSPEAKER_00\n I think that's true.\n\n0:30:26\tSPEAKER_00\n And fortunately we all had slides presentation which made it a little easier.\n\n0:30:32\tSPEAKER_00\n Did we find new ideas? I think we did.\n\n0:30:35\tSPEAKER_00\n I think we were very good.\n\n0:30:37\tSPEAKER_00\n I think we did in more than one respect.\n\n0:30:42\tSPEAKER_00\n So I think we did very well here.\n\n0:30:46\tSPEAKER_00\n Okay.\n\n0:30:47\tSPEAKER_00\n Are the costs within budget? Yes, yes.\n\n0:30:49\tSPEAKER_00\n It's a project evaluated.\n\n0:30:52\tSPEAKER_00\n Yes, yes.\n\n0:30:53\tSPEAKER_00\n So, then celebration.\n\n0:30:56\tSPEAKER_01\n Today we have Apple juice and after we sell the million of them we have champagne.\n\n0:31:04\tSPEAKER_00\n So, I thank you all very much.\n\n0:31:08\tSPEAKER_00\n I think this was very good.\n\n0:31:10\tSPEAKER_00\n And I think we did come up with a new product that's feasible.\n\n0:31:16\tSPEAKER_00\n And feasible from the production point of view and feasible from a marketing point of view.\n\n0:31:22\tSPEAKER_00\n So, okay.\n\n0:31:23\tSPEAKER_00\n Thank you.\n\n0:31:24\tSPEAKER_00\n Thank you.\n\n0:31:25\tSPEAKER_00\n Okay.\n\n0:31:26\tSPEAKER_01\n What I have my cord behind you.\n\n0:31:29\tSPEAKER_01\n I think it.\n\n0:31:34\tSPEAKER_00\n I always get it on top of my getting it off.\n\n0:31:36\tSPEAKER_00\n It's a really good thing to have it on top of my own.\n\n0:31:41\tSPEAKER_03\n You have.\n\n0:31:42\tSPEAKER_03\n No, this is a couple minutes.\n\n0:31:44\tSPEAKER_03\n Oh, you have to have time.\n\n0:31:46\tSPEAKER_01\n But we were told we could end the final meeting at any time.\n\n0:31:49\tSPEAKER_01\n Yeah.\n\n0:31:50\tSPEAKER_01\n Whenever we thought we were finished.\n\n0:31:53\tNone\n I think we should get my microphone out for my next.\n\n0:32:03\tSPEAKER_01\n There we go.\n\n0:32:10\tNone\n Okay.\n\n", "summary": [{"summary_text": "In the last meeting, speakers discuss the design of a new TV remote. The interface designer would like to see a speech recognizer integrated in the remote. She would like it to be a child-friendly design with few buttons, colorful, maybe with star-shaped or other-shaped buttons. The industrial designer presented her thoughts on the issue."}]}