{"filename": "./data/IS1004c.txt", "transcript": "0:00:30\tSPEAKER_04\n Ok, we are going to have a good lunch.\n\n0:00:34\tSPEAKER_04\n Hope you have good lunch.\n\n0:00:36\tSPEAKER_01\n Yeah, we had for a lot of fun.\n\n0:00:38\tSPEAKER_04\n Oh, nice!\n\n0:00:40\tSPEAKER_04\n And you?\n\n0:00:42\tSPEAKER_02\n Yes, I had something similar, but non-vegetarian.\n\n0:00:48\tSPEAKER_04\n Ok, so today is our third meeting.\n\n0:00:54\tSPEAKER_04\n It will be about the conceptual design.\n\n0:00:58\tSPEAKER_04\n If I come back to the minutes of the last meetings, we decided not to go for speech recognition technologies, because of some reasons.\n\n0:01:10\tSPEAKER_04\n And we are not decided about the use of the screen on the remote control because of costs.\n\n0:01:18\tSPEAKER_04\n So maybe we would be able to clarify this question today.\n\n0:01:22\tSPEAKER_04\n The end of the meeting we should take decision on that point.\n\n0:01:27\tSPEAKER_04\n So I hope that your respective presentations will help us.\n\n0:01:33\tSPEAKER_04\n So each of you have some presentation to perform.\n\n0:01:39\tSPEAKER_04\n Who starts?\n\n0:01:43\tSPEAKER_00\n Ok, where is that?\n\n0:01:47\tSPEAKER_04\n So marketing.\n\n0:01:51\tSPEAKER_04\n So you saved your presentation somewhere?\n\n0:01:55\tSPEAKER_04\n Yeah.\n\n0:01:57\tSPEAKER_04\n So you four?\n\n0:01:59\tSPEAKER_04\n Four.\n\n0:02:01\tSPEAKER_04\n Which is trend-watch?\n\n0:02:07\tSPEAKER_04\n Ok, Mr. Marketing experts.\n\n0:02:11\tSPEAKER_00\n Yeah, that's me.\n\n0:02:13\tSPEAKER_00\n So good point.\n\n0:02:15\tSPEAKER_00\n Well, I investigate the preference.\n\n0:02:17\tSPEAKER_00\n I investigate deeper the preference of the users.\n\n0:02:21\tSPEAKER_00\n I ask you about the current investigation.\n\n0:02:25\tSPEAKER_00\n I am sorry, the current...\n\n0:02:29\tSPEAKER_00\n Then...\n\n0:02:31\tSPEAKER_00\n Current trends?\n\n0:02:33\tSPEAKER_00\n Yeah.\n\n0:02:35\tSPEAKER_00\n Okay.\n\n0:02:39\tSPEAKER_00\n Well, what I found...\n\n0:02:43\tSPEAKER_04\n Next slide?\n\n0:02:45\tSPEAKER_00\n Yeah.\n\n0:02:47\tSPEAKER_00\n Thank you.\n\n0:02:49\tSPEAKER_00\n From less to more important is that people want an easy to use device.\n\n0:02:57\tSPEAKER_00\n After they want something new, technologically speaking.\n\n0:03:05\tSPEAKER_00\n But the most...\n\n0:03:07\tSPEAKER_00\n What they find more interesting, more important is a fancy look and feel instead of the current...\n\n0:03:19\tSPEAKER_00\n The current trend, which was the functional look and feel.\n\n0:03:23\tSPEAKER_00\n So now, more cool aspect, a cooler aspect, rather than a device with many functions and many buttons.\n\n0:03:37\tSPEAKER_00\n Instead of a device which can do many things, a device which is pleasant to watch, to see.\n\n0:03:48\tSPEAKER_00\n Okay.\n\n0:03:50\tSPEAKER_00\n Also, in your...\n\n0:03:54\tSPEAKER_00\n In Paris and Milan, the...\n\n0:04:02\tSPEAKER_00\n In Paris and Milan, the current trend of clothes, furniture and all these...\n\n0:04:12\tSPEAKER_00\n All these fashion, it's...\n\n0:04:14\tSPEAKER_00\n It's free time, the theme is free time vegetables.\n\n0:04:18\tSPEAKER_00\n And also, in the USA, the current, the most popular feeling, it's a spongey.\n\n0:04:30\tSPEAKER_00\n A spongey means a spongey.\n\n0:04:32\tSPEAKER_00\n Yes.\n\n0:04:34\tSPEAKER_00\n So maybe we should think in these directions.\n\n0:04:37\tSPEAKER_02\n What do you mean by free time vegetables and spongey?\n\n0:04:41\tSPEAKER_02\n What do you mean to...\n\n0:04:43\tSPEAKER_00\n Free time vegetables, the new...\n\n0:04:45\tSPEAKER_00\n Have you seen the last exposition of clothes in Milan?\n\n0:04:49\tSPEAKER_02\n No, I missed that one.\n\n0:04:51\tSPEAKER_00\n Yeah, I didn't miss and...\n\n0:04:55\tSPEAKER_00\n I didn't miss and I saw that the free time, there are many pictures of free time vegetables in the world.\n\n0:05:01\tSPEAKER_02\n Oh, they're okay, so they're not like dressed as a carrot.\n\n0:05:03\tSPEAKER_02\n They just have...\n\n0:05:05\tSPEAKER_02\n Pictures of fruit on...\n\n0:05:07\tSPEAKER_02\n Yeah.\n\n0:05:09\tSPEAKER_02\n So we're not gonna have a remote control on the shape of a banana just maybe...\n\n0:05:13\tSPEAKER_00\n Visitor of the ex-sus and all these can...\n\n0:05:15\tSPEAKER_04\n Drawings of bananas.\n\n0:05:19\tSPEAKER_02\n Okay.\n\n0:05:21\tSPEAKER_01\n Yeah.\n\n0:05:23\tSPEAKER_01\n But what's your suggestion, how we can have some shape like that on the...\n\n0:05:27\tSPEAKER_04\n So this is the next leg, so I don't know.\n\n0:05:29\tSPEAKER_00\n No, it's nothing.\n\n0:05:31\tSPEAKER_00\n It's not.\n\n0:05:33\tSPEAKER_02\n So what's fruit are you thinking of?\n\n0:05:37\tSPEAKER_00\n No.\n\n0:05:39\tSPEAKER_00\n No, I haven't thought of any particular fruit, but the general aspect of the remote control...\n\n0:05:49\tSPEAKER_00\n May...\n\n0:05:51\tSPEAKER_00\n May...\n\n0:05:53\tSPEAKER_00\n Could remind some kind of vegetable, some kind of...\n\n0:05:57\tSPEAKER_00\n Instead of vegetable, some natural...\n\n0:05:59\tSPEAKER_00\n Natural object of something, but...\n\n0:06:03\tSPEAKER_00\n It depends on the...\n\n0:06:05\tSPEAKER_04\n If you can display the banana on the LCD...\n\n0:06:09\tSPEAKER_02\n I was thinking you want the remote control to be the shape of a fruit or...\n\n0:06:13\tSPEAKER_02\n You want just some kind of like fruit logo on the...\n\n0:06:17\tSPEAKER_02\n These buttons are the shape of fruits.\n\n0:06:19\tSPEAKER_01\n Yeah, maybe the shape buttons are in the shape of fruits or something.\n\n0:06:23\tSPEAKER_01\n Apple, banana or something like that.\n\n0:06:25\tSPEAKER_00\n No, not...\n\n0:06:27\tSPEAKER_00\n Not too much focus.\n\n0:06:29\tSPEAKER_00\n Not too much focus.\n\n0:06:31\tSPEAKER_00\n Not too similar to a fruit, because next year the tree...\n\n0:06:35\tSPEAKER_00\n The tree will be different.\n\n0:06:37\tSPEAKER_00\n So we shouldn't be really attached to...\n\n0:06:41\tSPEAKER_00\n To the tree.\n\n0:06:43\tSPEAKER_02\n So there's something that looks half like a fruit and half like an elephant.\n\n0:06:45\tSPEAKER_02\n For instance, yeah.\n\n0:06:47\tSPEAKER_00\n Africa has another thing.\n\n0:06:49\tSPEAKER_01\n That we can discuss afterwards.\n\n0:06:51\tSPEAKER_02\n Okay, I'm not really sure...\n\n0:06:53\tSPEAKER_02\n If that would really appeal to everyone, maybe just to fashion gurus.\n\n0:06:59\tSPEAKER_02\n Maybe just a little bit...\n\n0:07:01\tSPEAKER_02\n A little fruit picture somewhere in the corner, but I don't know about...\n\n0:07:05\tSPEAKER_02\n I don't know how ergonomic it will be.\n\n0:07:07\tSPEAKER_00\n Maybe we should first specify what target are we focusing.\n\n0:07:13\tSPEAKER_00\n I think in my opinion we should focus on young people...\n\n0:07:17\tSPEAKER_00\n Because they are more open to new devices and...\n\n0:07:21\tSPEAKER_00\n Also, yeah, according to the marketing report, 95% of young people...\n\n0:07:29\tSPEAKER_00\n Was able to buy a cooler remote control.\n\n0:07:39\tSPEAKER_02\n But this is very cool.\n\n0:07:43\tSPEAKER_04\n What?\n\n0:07:45\tSPEAKER_02\n That's a question.\n\n0:07:47\tSPEAKER_00\n What?\n\n0:07:49\tSPEAKER_00\n Is the new trend?\n\n0:07:53\tSPEAKER_02\n Well, I guess Apple has their iPods in mind.\n\n0:07:59\tSPEAKER_02\n Just because they have an Apple on the product doesn't mean fruit is cool.\n\n0:08:05\tSPEAKER_00\n No, I think we should think about a shape with a device with a shape of some...\n\n0:08:15\tSPEAKER_02\n Okay, but it has to be easy to use though and to hold.\n\n0:08:21\tSPEAKER_02\n You know, on a pair or a watermelon.\n\n0:08:25\tSPEAKER_00\n Then you think we can find a shape of a fruit which is handy?\n\n0:08:29\tSPEAKER_00\n Well, probably the only thing is a banana.\n\n0:08:33\tSPEAKER_02\n I don't think of a cucumber.\n\n0:08:35\tSPEAKER_02\n Maybe the log.\n\n0:08:37\tSPEAKER_02\n Maybe, to go in.\n\n0:08:39\tSPEAKER_02\n Maybe.\n\n0:08:41\tSPEAKER_02\n But I mean, you also have to also have fit all the buttons and...\n\n0:08:49\tSPEAKER_02\n The thing is, you have to normally with buttons, they have to be at some point attached to a circuit board.\n\n0:08:57\tSPEAKER_02\n So if you're going to have things like on a cylindrical kind of device, it may be difficult to build.\n\n0:09:05\tSPEAKER_00\n I like your idea that we shouldn't have a lot of buttons.\n\n0:09:11\tSPEAKER_04\n You will not have a lot of place to put a LCD on a banana also.\n\n0:09:17\tSPEAKER_00\n Are you on an LCD with 25 euros?\n\n0:09:21\tSPEAKER_04\n Well, you're a marketing expert.\n\n0:09:23\tSPEAKER_04\n You should tell us if you still have a slot.\n\n0:09:25\tSPEAKER_00\n Well, according to the report, people are more interested in a fancy look and feel than in a technological innovation.\n\n0:09:39\tSPEAKER_00\n So I would give more importance to the look and feel rather than the...\n\n0:09:45\tSPEAKER_04\n So you need to...\n\n0:09:47\tSPEAKER_00\n And also, I'm not convinced about this LCD because you need internet connection.\n\n0:09:53\tSPEAKER_00\n You need more things. It's not just buying a new control remote.\n\n0:09:57\tSPEAKER_00\n You need buying control remote, buying more things.\n\n0:10:01\tSPEAKER_04\n It's not so simple.\n\n0:10:03\tSPEAKER_04\n You are simply looking to remote control that looks like a banana with two buttons.\n\n0:10:09\tSPEAKER_00\n For giving an example.\n\n0:10:11\tSPEAKER_04\n Okay, good. So maybe you can go ahead.\n\n0:10:15\tSPEAKER_04\n Yeah, no, it's what I already said.\n\n0:10:19\tSPEAKER_04\n Thanks.\n\n0:10:21\tSPEAKER_04\n Okay, I'll give the floor.\n\n0:10:25\tSPEAKER_04\n So you're using the big guy.\n\n0:10:29\tSPEAKER_04\n Three?\n\n0:10:31\tSPEAKER_04\n Yeah.\n\n0:10:33\tSPEAKER_04\n And it's this one.\n\n0:10:35\tSPEAKER_04\n Yep.\n\n0:10:37\tSPEAKER_02\n Go for it.\n\n0:10:39\tSPEAKER_02\n Yep. Okay, so...\n\n0:10:41\tSPEAKER_02\n Next slide.\n\n0:10:43\tSPEAKER_02\n Okay, so I received an email and launched time.\n\n0:10:49\tSPEAKER_02\n Let me know that the brilliant minds of our technology division have developed an integrated programmable sample sensor, sample speaker unit.\n\n0:10:57\tSPEAKER_02\n Which is a way for you to have a conversation with your coffee machine\n\n0:11:01\tSPEAKER_01\n and or remote control.\n\n0:11:03\tSPEAKER_02\n It's just a speaker, right? No, what it is.\n\n0:11:07\tSPEAKER_02\n It's not a smartphone.\n\n0:11:09\tSPEAKER_02\n It has a microphone, it has a speaker, it's got a little chip.\n\n0:11:11\tSPEAKER_01\n And...\n\n0:11:13\tSPEAKER_01\n Actually, I'm not reading microphone there, so that's where you cannot have conversation.\n\n0:11:15\tSPEAKER_02\n Well, it's a sample speaker.\n\n0:11:17\tSPEAKER_02\n A sensor sample speaker.\n\n0:11:19\tSPEAKER_02\n A sample sensor sample speaker.\n\n0:11:21\tSPEAKER_02\n It means that it can recognize, it can do like a match on a certain phrase that you speak.\n\n0:11:25\tSPEAKER_02\n And then can play back a phrase in response to that.\n\n0:11:29\tSPEAKER_02\n But there's no kind of understanding of the phrase.\n\n0:11:33\tSPEAKER_02\n Okay.\n\n0:11:35\tSPEAKER_02\n So, I mean, you know, I guess you could build that in, you could...\n\n0:11:39\tSPEAKER_02\n You could link the recognition of a certain phrase to some function on the remote control.\n\n0:11:43\tSPEAKER_02\n But basically, the thing is we have this technology available.\n\n0:11:47\tSPEAKER_02\n In-house.\n\n0:11:49\tSPEAKER_02\n So...\n\n0:11:51\tSPEAKER_02\n But the thing is, obviously, there's still going to be a cost if you decided to integrate that because you still have to pay for the production of the components.\n\n0:11:57\tSPEAKER_02\n So...\n\n0:11:59\tSPEAKER_02\n But it basically means we can kind of consider this from a...\n\n0:12:03\tSPEAKER_02\n You know, a theoretical or usability kind of viewpoint without worrying too much about, you know, how to develop it because we have this already done.\n\n0:12:11\tSPEAKER_02\n Plus, you know, some people might get annoyed if we just dump it.\n\n0:12:15\tSPEAKER_04\n Something that I...\n\n0:12:17\tSPEAKER_04\n And clearly, really understanding...\n\n0:12:21\tSPEAKER_04\n Is this a technology that really creates keywords?\n\n0:12:25\tSPEAKER_02\n Speech keywords?\n\n0:12:27\tSPEAKER_02\n It's not... Well, it's... It will recognize, I guess, keywords.\n\n0:12:31\tSPEAKER_02\n But, you know, keywords in a certain order, like a phrase.\n\n0:12:33\tSPEAKER_02\n You train it for a certain phrase.\n\n0:12:37\tSPEAKER_02\n You say the example they said that they have up and running with their prototype is...\n\n0:12:41\tSPEAKER_02\n Although they actually integrate into the coffee machine that we're producing is...\n\n0:12:47\tSPEAKER_02\n You can say, good morning, the coffee machine, and you can recognize that phrase.\n\n0:12:49\tSPEAKER_02\n And it'll play back... Good morning.\n\n0:12:53\tSPEAKER_02\n How would you like your coffee?\n\n0:12:55\tSPEAKER_04\n There's just to play back something.\n\n0:12:57\tSPEAKER_02\n Yeah. So actually, that was a bad example because it doesn't actually ask how do you want your coffee because you can't really understand the response.\n\n0:13:01\tSPEAKER_04\n Yeah, yeah. So it's not really to do... to... to do control.\n\n0:13:07\tSPEAKER_02\n Only... Like, only in the sense that you can recognize the set...\n\n0:13:11\tSPEAKER_02\n Yeah.\n\n0:13:13\tSPEAKER_02\n A set target... This is just more like a...\n\n0:13:15\tSPEAKER_02\n It's design... It's designed as a fun kind of thing. But I guess you could use it as a... as a way to implement...\n\n0:13:21\tSPEAKER_02\n Yeah, right. It's... It's a... It's a...\n\n0:13:25\tSPEAKER_04\n It's a fancy thing that you can bring to... We can bring to the remote control that we not have any...\n\n0:13:33\tSPEAKER_04\n Completely pointless, yeah.\n\n0:13:35\tSPEAKER_04\n Yeah, completely pointless.\n\n0:13:37\tSPEAKER_04\n For the inter... From the interaction point of view.\n\n0:13:41\tSPEAKER_02\n Unless, you know, you're like having conversation with your remote control.\n\n0:13:43\tSPEAKER_02\n Okay.\n\n0:13:44\tSPEAKER_00\n Yeah, but can we use it for saying, okay, channel 50...\n\n0:13:48\tSPEAKER_02\n Well, yeah, that's a thing.\n\n0:13:50\tSPEAKER_02\n If... You can, but you have to... I think it's a fairly simple design.\n\n0:13:54\tSPEAKER_02\n So you would have to record into the device every possible combination.\n\n0:13:59\tSPEAKER_02\n You have to train it to learn channel 15, that whole thing, not just the word channel, and the word 15.\n\n0:14:04\tSPEAKER_02\n It doesn't have that kind of logic in it.\n\n0:14:06\tSPEAKER_04\n So this is much more than taking this technology, bringing it to the remote control.\n\n0:14:11\tSPEAKER_04\n Yeah, that would be sort of a development.\n\n0:14:13\tSPEAKER_04\n So this is out of discussion.\n\n0:14:16\tSPEAKER_04\n Yeah.\n\n0:14:17\tSPEAKER_04\n So if it is something that we can bring easily, and to put it into the banana remote control...\n\n0:14:23\tSPEAKER_00\n Mando.\n\n0:14:25\tSPEAKER_00\n Banana Mando.\n\n0:14:26\tSPEAKER_04\n Banana Mando, yeah.\n\n0:14:28\tSPEAKER_04\n Banana Mando, yeah.\n\n0:14:29\tSPEAKER_04\n Then it could be cool, yeah.\n\n0:14:34\tSPEAKER_01\n Okay, let's go ahead.\n\n0:14:36\tSPEAKER_02\n I... I... I... I think it's worth it.\n\n0:14:38\tSPEAKER_02\n I think it doesn't really add much to the functional design.\n\n0:14:42\tSPEAKER_02\n And it's not mature enough to use as a speed tracking engine.\n\n0:14:48\tSPEAKER_02\n Okay.\n\n0:14:49\tSPEAKER_02\n So... Yeah.\n\n0:14:51\tSPEAKER_02\n So if we can just move on to the next slide.\n\n0:14:53\tSPEAKER_02\n I've just done a quick mock-up of some of the features of our potential funky looking.\n\n0:15:00\tSPEAKER_02\n Yeah.\n\n0:15:01\tSPEAKER_02\n It doesn't seem like a banana, at all.\n\n0:15:03\tSPEAKER_02\n Well, you see, I was unaware at this point of the fruit focus.\n\n0:15:06\tSPEAKER_02\n Yeah.\n\n0:15:07\tSPEAKER_02\n So at the moment it looks like a fox focus.\n\n0:15:10\tSPEAKER_00\n You see now you can pick it up.\n\n0:15:12\tSPEAKER_00\n I try pick on fruit.\n\n0:15:13\tSPEAKER_00\n Yeah.\n\n0:15:14\tSPEAKER_02\n Yeah.\n\n0:15:15\tSPEAKER_02\n Well, this could be a genetically engineered fruit that's designed to be square so that it packs tighter in the boxes.\n\n0:15:21\tSPEAKER_02\n But I've just indicated here we could have actually two scroll wheels.\n\n0:15:25\tSPEAKER_02\n Because I think the scroll wheel is a fairly key part of it.\n\n0:15:30\tSPEAKER_02\n I think everyone knows that it could be quite a useful thing.\n\n0:15:35\tSPEAKER_02\n But I think it's important to have two scroll wheels because you want one for the channel, but you also want one for the volume because the volume is very handy for it to have an instant feedback and response.\n\n0:15:49\tSPEAKER_02\n So I've also included this turbo button because I think every design should have a turbo button.\n\n0:15:56\tSPEAKER_02\n What's a turbo button?\n\n0:15:58\tSPEAKER_02\n Well, you see this is a unique problem with televisions.\n\n0:16:01\tSPEAKER_02\n If you have this scroll wheel for the television, the tuner and the TV is not going to be able to switch between stations as fast as you can scroll.\n\n0:16:12\tSPEAKER_02\n So the person might want to have a...\n\n0:16:16\tSPEAKER_02\n You might want to be able to scroll past television stations without seeing what's on them, which gets it just waits until you stop scrolling and then you know, displays that station.\n\n0:16:26\tSPEAKER_02\n Or they might want to scroll and have a quick glimpse of it even if it lags behind what they're doing.\n\n0:16:32\tSPEAKER_00\n You've gone through this pit.\n\n0:16:34\tSPEAKER_02\n Yeah, so with the turbo button you can say skip over channels if I'm going...\n\n0:16:40\tSPEAKER_02\n If I'm scrolling past them and you know, you could have a little red light that comes up when they press it so they feel, you know, it's really going fast or whatever.\n\n0:16:50\tSPEAKER_02\n So yeah, that's... this is the two important features I think we need on the right.\n\n0:16:57\tSPEAKER_02\n But I mean we can discuss about what other kind of buttons we need.\n\n0:17:02\tSPEAKER_02\n You know, it could be, you know, if we want to have like a very cheap kind of device, I mean we could even consider that maybe we want to sell this as a very...\n\n0:17:12\tSPEAKER_02\n If it's going to be a banana, you know, as a pretty gimmicky kind of thing that doesn't have that much functionality as just, you know, a couple of scroll wheels on the button because it's hard to get so many buttons on the banana.\n\n0:17:23\tSPEAKER_02\n And it's still very... it may even be for most... for some people more functional than the current remote, but if they have these scroll wheels, so... you know, what other buttons do we want?\n\n0:17:36\tSPEAKER_02\n I mean we could have... well, you know, you can actually need an on and off switch, but you could turn it on by taking the top off the banana maybe.\n\n0:17:43\tSPEAKER_02\n Yeah, it's kind of like a spike and a flick thing. Sounds crazy, I like this idea.\n\n0:17:49\tSPEAKER_02\n That's why you're a marketing career. Yeah, of course.\n\n0:17:52\tSPEAKER_04\n It looks like we're going completely to forget about the LCD thing.\n\n0:17:57\tSPEAKER_02\n Well, that's the thing, as every decided that we can only spend 25 euro.\n\n0:18:03\tSPEAKER_02\n I think... Well, not spend, but you know, charge, 25 euro.\n\n0:18:07\tSPEAKER_00\n I think we could use somehow the coffee machine dialogue interface or so.\n\n0:18:16\tSPEAKER_04\n No, we can't use that.\n\n0:18:19\tSPEAKER_00\n We can't... we can't... We can't use that to communicate.\n\n0:18:24\tSPEAKER_04\n To command, to communicate is just a fit... We can say 1025.\n\n0:18:28\tSPEAKER_02\n No.\n\n0:18:29\tSPEAKER_02\n But then you have to have a template for every channel. For 100 channels you have to be able to recognize...\n\n0:18:34\tSPEAKER_02\n It's not allowed 100 templates. Well, I think it's probably more than our chicken handle.\n\n0:18:40\tSPEAKER_02\n Because it was designed for a coffee machine, you know, to say hello in the morning.\n\n0:18:43\tSPEAKER_00\n Ah, it's designed for a coffee machine.\n\n0:18:46\tSPEAKER_02\n Well, that's its current application now, for you in that it's kind of...\n\n0:18:50\tSPEAKER_02\n They wouldn't design it to handle 100 things.\n\n0:18:53\tSPEAKER_00\n Yeah. So...\n\n0:18:54\tSPEAKER_00\n Maybe you could ask the engineer in the department.\n\n0:18:58\tSPEAKER_00\n Yeah, if we could... Good thing.\n\n0:19:00\tSPEAKER_04\n You want to move to your slides? You have finished?\n\n0:19:03\tSPEAKER_02\n Well, I just made the point. I don't know that speech recognition is, you know, even if we can do it, I think it's not really appropriate for...\n\n0:19:10\tSPEAKER_02\n Yeah, I think so.\n\n0:19:11\tSPEAKER_02\n Television environment.\n\n0:19:12\tSPEAKER_02\n But I did have one thing from the previous meeting you were talking about...\n\n0:19:16\tSPEAKER_02\n Yeah.\n\n0:19:17\tSPEAKER_02\n Being able to find the remote control.\n\n0:19:19\tSPEAKER_02\n And I was talking about extending... being able to extend the remote control by having, you know, a base station that can control other things as well.\n\n0:19:25\tSPEAKER_02\n It might be useful to have some kind of base station, even if it's just...\n\n0:19:29\tSPEAKER_02\n You press the button on it and the remote control starts beeping, you know, this is a way of finding the remote.\n\n0:19:36\tSPEAKER_02\n In that case, maybe the speech recognition...\n\n0:19:39\tSPEAKER_02\n The speech thing could be useful just to say, I'm here.\n\n0:19:42\tSPEAKER_02\n But it's probably a bit of overkill if you could just have a...\n\n0:19:46\tSPEAKER_01\n So it's a speech synthesis kind of thing, something...\n\n0:19:49\tSPEAKER_01\n It's speech synthesis.\n\n0:19:50\tSPEAKER_02\n It's just a spoken out.\n\n0:19:51\tSPEAKER_02\n It's speech synthesis and speech kind of...\n\n0:19:54\tSPEAKER_02\n Not really speech recognition, but kind of pattern.\n\n0:19:56\tSPEAKER_04\n That's matching.\n\n0:19:59\tSPEAKER_04\n Okay, let's move on.\n\n0:20:03\tSPEAKER_04\n So you two...\n\n0:20:04\tSPEAKER_04\n That's right.\n\n0:20:09\tSPEAKER_01\n Okay.\n\n0:20:10\tSPEAKER_01\n This is going to be about the component design.\n\n0:20:12\tSPEAKER_01\n So first thing is we need power source for the remote control.\n\n0:20:16\tSPEAKER_01\n So I was of the idea that we can have two kind of power supplies.\n\n0:20:20\tSPEAKER_01\n One is the usual batteries, which are there.\n\n0:20:22\tSPEAKER_01\n They could be chargeable batteries if there is a basis station kind of thing.\n\n0:20:26\tSPEAKER_01\n And on top of that, we can have solar cells when the lighting conditions are good.\n\n0:20:30\tSPEAKER_01\n They can be used.\n\n0:20:31\tSPEAKER_01\n So it'll be pretty innovative kind.\n\n0:20:34\tSPEAKER_01\n Then we need plastic with some elasticity so that if the remote control falls, it's not broken directly into pieces.\n\n0:20:43\tSPEAKER_01\n There should be some flexibility in that.\n\n0:20:45\tSPEAKER_02\n I guess that fits in with the spongy design philosophy.\n\n0:20:48\tSPEAKER_01\n Yeah.\n\n0:20:49\tSPEAKER_01\n So we should think of something like that.\n\n0:20:53\tSPEAKER_01\n And then it should be double curve the sites for the ease of handling.\n\n0:20:58\tSPEAKER_01\n And there are some other issues why we need double curve.\n\n0:21:02\tSPEAKER_01\n Then controls for the traditional users, we can have the push buttons.\n\n0:21:07\tSPEAKER_01\n So that they don't feel that it's an alien thing for them.\n\n0:21:10\tSPEAKER_02\n So this one's like, when you say double curve, what do you actually mean?\n\n0:21:14\tSPEAKER_02\n You're looking at like drawers, I think, on the...\n\n0:21:17\tSPEAKER_01\n Double curve is you have curves on both the sites if I'm right.\n\n0:21:23\tSPEAKER_01\n So it's a symmetrical kind of thing, whatever it is.\n\n0:21:26\tSPEAKER_01\n Okay, but like, it could be curved.\n\n0:21:29\tSPEAKER_01\n So it could be convex concave, depending on what we want.\n\n0:21:34\tSPEAKER_01\n So there are flats, there are single curve and there are double curves.\n\n0:21:38\tSPEAKER_01\n These are the three things.\n\n0:21:39\tSPEAKER_01\n And there are different materials with plastic.\n\n0:21:41\tSPEAKER_01\n You can have double curve, but with certain other materials, we cannot have double curve.\n\n0:21:46\tSPEAKER_01\n So there were many other materials like wood, titanium and all those things.\n\n0:21:51\tSPEAKER_01\n But plastic, I think, is the most appropriate one.\n\n0:21:54\tSPEAKER_01\n It'll bring the cost down.\n\n0:21:56\tSPEAKER_02\n Also, wood could be a quite a stylish option.\n\n0:22:02\tSPEAKER_02\n If you take like nice quality kind of wood that's got a nice grain and you kind of put some...\n\n0:22:08\tSPEAKER_04\n But there is no elasticity.\n\n0:22:11\tSPEAKER_02\n Which wood in pieces?\n\n0:22:12\tSPEAKER_02\n Well, it depends.\n\n0:22:13\tSPEAKER_02\n I mean, you have...\n\n0:22:14\tSPEAKER_02\n The wood itself is not going to break, so you don't have to worry too much about the case being broken.\n\n0:22:18\tSPEAKER_00\n It could come from the inside.\n\n0:22:19\tSPEAKER_02\n But inside, you know, you can still have some kind of cushioning that's not visible to the user.\n\n0:22:24\tSPEAKER_04\n Very too expensive to do.\n\n0:22:27\tSPEAKER_02\n And I mean, you could also...\n\n0:22:29\tSPEAKER_02\n You can't have just a very thin veneer of wood as well.\n\n0:22:32\tSPEAKER_04\n Yeah, but it's more easier to do with banana in plastic than in wood.\n\n0:22:37\tSPEAKER_02\n That's true.\n\n0:22:38\tSPEAKER_02\n But are we set on the banana idea?\n\n0:22:42\tSPEAKER_04\n Actually, I was thinking that the shape of a banana is not really handy.\n\n0:22:51\tSPEAKER_04\n Yes, do you?\n\n0:22:54\tSPEAKER_00\n I don't know the name in English.\n\n0:23:04\tSPEAKER_00\n It's not a fruit, it's a vegetable.\n\n0:23:07\tSPEAKER_02\n It's like a pumpkin, no?\n\n0:23:09\tSPEAKER_04\n Yeah, pumpkin.\n\n0:23:10\tSPEAKER_00\n Green.\n\n0:23:12\tSPEAKER_04\n Green.\n\n0:23:14\tSPEAKER_04\n Yes, I see.\n\n0:23:16\tSPEAKER_00\n And you put in the salad?\n\n0:23:18\tSPEAKER_04\n Pepe looney.\n\n0:23:20\tSPEAKER_02\n Oh, yeah, it's... what's that in French?\n\n0:23:22\tSPEAKER_00\n Pogol.\n\n0:23:24\tSPEAKER_00\n Oh, it says that.\n\n0:23:25\tSPEAKER_02\n Okay, so it capsicum or pepper.\n\n0:23:28\tSPEAKER_04\n Pepper.\n\n0:23:29\tSPEAKER_04\n But...\n\n0:23:31\tSPEAKER_00\n And it also sweets with the double cure for easy-off.\n\n0:23:37\tSPEAKER_02\n I don't know, it seems a little bit kind of bulky for me.\n\n0:23:40\tSPEAKER_00\n No, I mean, in a...\n\n0:23:42\tSPEAKER_02\n It's not really...\n\n0:23:43\tSPEAKER_04\n You think it's really fancy and fun?\n\n0:23:46\tSPEAKER_04\n You think that young people...\n\n0:23:47\tSPEAKER_04\n I'm sure it's fun.\n\n0:23:49\tSPEAKER_04\n More than in banana.\n\n0:23:51\tSPEAKER_00\n But banana is not so handy.\n\n0:23:54\tSPEAKER_01\n I think that's more handy...\n\n0:23:55\tSPEAKER_01\n Compared to this, I think.\n\n0:23:57\tSPEAKER_01\n And two capsicum.\n\n0:23:59\tSPEAKER_02\n But, you know, like a banana, you can be holding like this and have the scroll wheel kind of on top.\n\n0:24:04\tSPEAKER_02\n Roll it back and forth like that.\n\n0:24:07\tSPEAKER_02\n I don't know how you hold the capsicum.\n\n0:24:09\tSPEAKER_04\n It's really ergonomic.\n\n0:24:10\tSPEAKER_04\n It fits in the hand.\n\n0:24:12\tSPEAKER_04\n And you add a lot of surface to...\n\n0:24:16\tSPEAKER_04\n To put the control...\n\n0:24:18\tSPEAKER_04\n Okay, let's move on.\n\n0:24:20\tSPEAKER_04\n Yeah, right.\n\n0:24:21\tSPEAKER_01\n So, time is running.\n\n0:24:22\tSPEAKER_01\n Okay, so push buttons were the traditional users so that they don't feel they are alinated.\n\n0:24:26\tSPEAKER_01\n Just...\n\n0:24:27\tSPEAKER_01\n And a scroll button with push technology for channel selection, volume control and teletext browsing.\n\n0:24:32\tSPEAKER_01\n These are the three scroll buttons which are already available with us.\n\n0:24:35\tSPEAKER_01\n And the company and we can go ahead with that.\n\n0:24:38\tSPEAKER_01\n Okay.\n\n0:24:39\tSPEAKER_01\n Yeah, we can go to the next slide.\n\n0:24:41\tSPEAKER_01\n Then there are different kind of chips.\n\n0:24:43\tSPEAKER_01\n One is the basic chip and the regular chip and then it's an advanced chip.\n\n0:24:48\tSPEAKER_01\n So we can have regular chip for control.\n\n0:24:50\tSPEAKER_01\n Pricing is a factor for us.\n\n0:24:52\tSPEAKER_01\n That's why we will go for the regular chip.\n\n0:24:54\tSPEAKER_01\n And regular chip supports, speaker support.\n\n0:24:57\tSPEAKER_01\n So this functionality could be used for tracing the mobile phone, which has been missed.\n\n0:25:02\tSPEAKER_02\n So, is that...\n\n0:25:03\tSPEAKER_02\n Wouldn't you say speakers report?\n\n0:25:04\tSPEAKER_02\n You mean it just has some output pins which...\n\n0:25:06\tSPEAKER_02\n Which kind of...\n\n0:25:07\tSPEAKER_02\n It could be a beep kind of thing.\n\n0:25:09\tSPEAKER_02\n Okay, but the speaker is actually attached to the chip in some way or is it just the signal?\n\n0:25:13\tSPEAKER_02\n Yes, that's right.\n\n0:25:14\tSPEAKER_01\n It's on to the chip.\n\n0:25:16\tSPEAKER_01\n Most...\n\n0:25:18\tSPEAKER_01\n Most probably.\n\n0:25:19\tSPEAKER_01\n Not 100% sure about that.\n\n0:25:21\tSPEAKER_02\n So, are there any issues where we place this chip to make sure you can actually hear the speaker from the outside of the banana?\n\n0:25:28\tSPEAKER_01\n That will be the volume control, I think, which a user...\n\n0:25:33\tSPEAKER_01\n It should be already predefined.\n\n0:25:35\tSPEAKER_01\n It should be...\n\n0:25:36\tSPEAKER_01\n Whatever will be the case, the chip is always going to be sitting inside.\n\n0:25:39\tSPEAKER_02\n Yeah, but the speaker, if the speaker is actually on the chip, then if it's too far away from the casing or if the casing is too thick, then you may not hear the speaker.\n\n0:25:49\tSPEAKER_01\n So we can have it at one of the boundaries so that things are slightly better.\n\n0:25:53\tSPEAKER_01\n Yes.\n\n0:25:54\tSPEAKER_01\n As far as hearing is concerned, or we can have some gap at some place.\n\n0:25:58\tSPEAKER_01\n Yeah.\n\n0:25:59\tSPEAKER_02\n So some may have to keep in mind with the actual physical design as to keep the speaker close enough to the outside?\n\n0:26:05\tSPEAKER_01\n Yeah.\n\n0:26:06\tSPEAKER_01\n So these were the components selection in these things.\n\n0:26:09\tSPEAKER_01\n We can go to the next slide.\n\n0:26:12\tSPEAKER_01\n And these were the findings which I saw with the web.\n\n0:26:17\tSPEAKER_01\n The user wants to have control more than one device, so control more than one device from the same remote control.\n\n0:26:24\tSPEAKER_01\n So our TV remote can have little extra things to support additional devices like VCR, DVD players, which are usually attached with the TV.\n\n0:26:32\tSPEAKER_01\n Because users are like this, that they don't want to have one remote control for everything.\n\n0:26:36\tSPEAKER_01\n So with this additional little, we might be having slightly better market for us.\n\n0:26:41\tSPEAKER_02\n It depends.\n\n0:26:42\tSPEAKER_02\n If we are concentrating on a fruit design, and maybe we want to sell a collection of fruit, we have a different fruit for each device.\n\n0:26:52\tSPEAKER_02\n Sometimes people like to collect other things that are similar.\n\n0:26:58\tSPEAKER_00\n I think that will be funny at the beginning, but after one month, you will be tired of being surrounded off fruit.\n\n0:27:06\tSPEAKER_02\n Well, you've only wanted to do fruit enough.\n\n0:27:08\tSPEAKER_00\n No, but I think just one fruit to control everything.\n\n0:27:11\tSPEAKER_02\n Like a power fruit.\n\n0:27:12\tSPEAKER_00\n A power, a supermando fruit.\n\n0:27:16\tSPEAKER_01\n And as far as I could see on the web, there is a scroll button that's becoming really hot thing.\n\n0:27:24\tSPEAKER_01\n And we should have it on the remote.\n\n0:27:27\tSPEAKER_00\n I didn't understand very well this trace speaker lost control.\n\n0:27:32\tSPEAKER_01\n So you are having a bassist station.\n\n0:27:35\tSPEAKER_01\n Usually your remote sits on that.\n\n0:27:38\tSPEAKER_01\n And that's why it can have chargeable batteries.\n\n0:27:41\tSPEAKER_01\n Now let's say you have to buy two things,\n\n0:27:43\tSPEAKER_00\n the banana and the bassist station.\n\n0:27:46\tSPEAKER_04\n It's the same as with the thing. You both do the same.\n\n0:27:50\tSPEAKER_01\n It's like a telephone handset is there and the bassist station for the telephone handset is there.\n\n0:27:55\tSPEAKER_01\n So now, what user gets additionally, he doesn't have to buy batteries.\n\n0:27:59\tSPEAKER_01\n They are rechargeable batteries.\n\n0:28:00\tSPEAKER_01\n So or the period of time he will recover the cost.\n\n0:28:04\tSPEAKER_01\n So you are having the bassist station and there is a button.\n\n0:28:06\tSPEAKER_01\n If you press that button, wherever the remote is, it will start beeping.\n\n0:28:10\tSPEAKER_01\n So you know where the remote is.\n\n0:28:12\tSPEAKER_02\n I think it's a pretty handy feature.\n\n0:28:14\tSPEAKER_02\n I think it's kind of people would find it worth it even if it wasn't a recharging station even if they didn't have to buy extra batteries.\n\n0:28:23\tSPEAKER_00\n I might be worried about the budget.\n\n0:28:26\tSPEAKER_01\n This is, bassist station is nothing more.\n\n0:28:29\tSPEAKER_01\n It's a wire which is coming from the main cable.\n\n0:28:33\tSPEAKER_01\n And you are having one socket on which the things are.\n\n0:28:37\tSPEAKER_02\n So you do need to include RF kind of...\n\n0:28:40\tSPEAKER_02\n That's right.\n\n0:28:41\tSPEAKER_01\n But all these things are usually in-house.\n\n0:28:43\tSPEAKER_01\n So we don't have much problems.\n\n0:28:45\tSPEAKER_01\n So component cost is going to be the least.\n\n0:28:47\tSPEAKER_01\n Anyway, we are not using the advanced technology.\n\n0:28:50\tSPEAKER_01\n LCT has already been ruled out.\n\n0:28:51\tSPEAKER_01\n ASR has been ruled out.\n\n0:28:52\tSPEAKER_01\n So it's the basic thing, but very trendy.\n\n0:28:55\tSPEAKER_01\n And very user friendly.\n\n0:28:58\tSPEAKER_01\n I'm just wondering, actually,\n\n0:29:00\tSPEAKER_02\n because you know, this whole first thing with the banana, it seems like a first seems a bit kind of niche.\n\n0:29:09\tSPEAKER_02\n Like only a few people would really want a banana.\n\n0:29:11\tSPEAKER_02\n But what if it was kind of a stylized banana?\n\n0:29:14\tSPEAKER_02\n You are rather than having it kind of yellow and really looking exactly like a banana.\n\n0:29:20\tSPEAKER_02\n You could make it kind of silver.\n\n0:29:22\tSPEAKER_02\n And to give you kind of the idea of a banana, but without it looking, you know, completely...\n\n0:29:30\tSPEAKER_02\n KITCH.\n\n0:29:32\tSPEAKER_02\n One for better work, you know?\n\n0:29:34\tSPEAKER_04\n You're saying that yellow is KITCH.\n\n0:29:37\tSPEAKER_02\n Well, you know, I don't know how many...\n\n0:29:40\tSPEAKER_04\n You make something that looks like a banana.\n\n0:29:42\tSPEAKER_04\n No, it's a color of a banana.\n\n0:29:44\tSPEAKER_01\n Yeah, the way it looks.\n\n0:29:46\tSPEAKER_01\n Otherwise...\n\n0:29:47\tSPEAKER_01\n You don't get anything like that.\n\n0:29:49\tSPEAKER_01\n It's neither a banana nor a...\n\n0:29:50\tSPEAKER_02\n Yeah, like this color.\n\n0:29:52\tSPEAKER_02\n Maybe...\n\n0:29:54\tSPEAKER_02\n Maybe, like still in the shape of a banana.\n\n0:29:57\tSPEAKER_04\n Roughly.\n\n0:29:59\tSPEAKER_02\n No, exactly.\n\n0:30:01\tSPEAKER_02\n Exactly.\n\n0:30:03\tSPEAKER_02\n But, you know, just maybe...\n\n0:30:07\tSPEAKER_02\n Maybe not exactly the same texture as a banana.\n\n0:30:10\tSPEAKER_02\n And just kind of...\n\n0:30:12\tSPEAKER_02\n You know, because the thing is, it's going to be a little bit difficult to make.\n\n0:30:17\tSPEAKER_02\n To give like the texture of a banana anyway, and to have the exact shape.\n\n0:30:22\tSPEAKER_02\n I think if you're going to not be able to do it properly, you may as well do it in a stylized way that just looks a bit more kind of, you know,\n\n0:30:28\tSPEAKER_04\n 21st century rather than 60s or 70s. Let's move on.\n\n0:30:33\tSPEAKER_04\n Yeah, before handing the meeting, I'd like to draw some sketch about the future prototype.\n\n0:30:40\tSPEAKER_04\n Go for it.\n\n0:30:42\tSPEAKER_04\n Well, no, not you.\n\n0:30:44\tSPEAKER_04\n You can finish your slides.\n\n0:30:46\tSPEAKER_01\n Okay, so, anyway, users will be...\n\n0:30:48\tSPEAKER_01\n So, the findings will be very interested in our locator divide to find their misplaced remotes.\n\n0:30:53\tSPEAKER_01\n Okay.\n\n0:30:54\tSPEAKER_01\n So, that was very...\n\n0:30:55\tSPEAKER_01\n I thought it's a very good suggestion by everybody.\n\n0:30:57\tSPEAKER_04\n Okay, that's all.\n\n0:30:58\tSPEAKER_04\n Yeah.\n\n0:30:59\tSPEAKER_04\n So, we're done for the presentations.\n\n0:31:02\tSPEAKER_04\n So, we need to take some decisions about what we're going to do.\n\n0:31:08\tSPEAKER_04\n So, I propose that you go to the whiteboard.\n\n0:31:11\tSPEAKER_04\n Yeah.\n\n0:31:12\tSPEAKER_04\n And we're going to report all the ideas we had during these presentations.\n\n0:31:19\tSPEAKER_04\n Just to draw some sketch about what would be the final product and our super mango banana.\n\n0:31:26\tSPEAKER_04\n And with the basis extra functionalities, such as wheels, the speaker you need...\n\n0:31:37\tSPEAKER_04\n Not too lost the device.\n\n0:31:40\tSPEAKER_04\n I don't remember the basis station.\n\n0:31:43\tSPEAKER_04\n The basis station, yeah.\n\n0:31:45\tSPEAKER_04\n So, we're going for a stylish banana shape.\n\n0:31:52\tSPEAKER_02\n Yeah, so, I guess, you want to hold...\n\n0:31:56\tSPEAKER_02\n Like, the end of the banana, you want to hold.\n\n0:31:59\tSPEAKER_02\n You want to hold like a gun rather than...\n\n0:32:01\tSPEAKER_02\n Because you don't want it to point towards the floor.\n\n0:32:04\tSPEAKER_02\n Right.\n\n0:32:05\tSPEAKER_02\n So, you know, so, if you have...\n\n0:32:09\tSPEAKER_00\n What about this shape?\n\n0:32:12\tSPEAKER_00\n More or less.\n\n0:32:14\tSPEAKER_01\n Well, there's less space on this to put the buttons.\n\n0:32:17\tSPEAKER_01\n Yeah, that's really bad.\n\n0:32:19\tSPEAKER_04\n The starting is good, but it should have more the shape of a banana.\n\n0:32:25\tSPEAKER_04\n If you want to point really at us, think if you don't want to do that movement, which is difficult, if you don't have to do it, in fact, it's better.\n\n0:32:36\tSPEAKER_04\n So, the timing is running.\n\n0:32:38\tSPEAKER_04\n We have to move forward.\n\n0:32:40\tSPEAKER_04\n So, let's skip to this ID.\n\n0:32:46\tSPEAKER_02\n Okay, so...\n\n0:32:50\tSPEAKER_04\n So, where have these?\n\n0:32:52\tSPEAKER_04\n We have a basis...\n\n0:32:53\tSPEAKER_04\n How do you call it, really?\n\n0:32:55\tSPEAKER_01\n The base station.\n\n0:32:56\tSPEAKER_04\n A base station.\n\n0:32:57\tSPEAKER_04\n We have a base station extra on the side.\n\n0:33:01\tSPEAKER_02\n Okay, so, I guess we need, you know, something that can fit a banana shaped object.\n\n0:33:09\tSPEAKER_04\n Yeah.\n\n0:33:10\tSPEAKER_04\n We have RF for B-Ping.\n\n0:33:16\tSPEAKER_04\n That's right.\n\n0:33:17\tSPEAKER_01\n Yeah, we need that.\n\n0:33:18\tSPEAKER_04\n We need RF to be...\n\n0:33:20\tSPEAKER_04\n So, that means we need a button on the basis...\n\n0:33:26\tSPEAKER_01\n Yeah, basis station.\n\n0:33:28\tSPEAKER_04\n Basis station.\n\n0:33:29\tSPEAKER_04\n Thank you.\n\n0:33:31\tSPEAKER_02\n All right, so we need...\n\n0:33:33\tSPEAKER_02\n Okay.\n\n0:33:40\tSPEAKER_04\n Can you go quickly please?\n\n0:33:45\tSPEAKER_04\n Okay, so we are going to head also...\n\n0:33:49\tSPEAKER_04\n As you suggested, some wheels to control the volumes on channels.\n\n0:33:54\tSPEAKER_04\n And your turbo...\n\n0:33:57\tSPEAKER_04\n Yeah, turbo button.\n\n0:33:58\tSPEAKER_02\n I think it's probably best actually on the underneath of the device.\n\n0:34:02\tSPEAKER_02\n So, you have...\n\n0:34:03\tSPEAKER_02\n Maybe here.\n\n0:34:04\tSPEAKER_04\n And the wheel at the level of the thumb, for instance.\n\n0:34:08\tSPEAKER_02\n Yeah, so you have the thumb kind of here.\n\n0:34:10\tSPEAKER_02\n And you have two wheels.\n\n0:34:11\tSPEAKER_02\n So, yeah, you need one here and one on the other side.\n\n0:34:15\tSPEAKER_02\n Okay, right.\n\n0:34:16\tSPEAKER_02\n So, you get volume and channel.\n\n0:34:18\tSPEAKER_02\n Good.\n\n0:34:19\tSPEAKER_04\n And...\n\n0:34:20\tSPEAKER_04\n No, LCD.\n\n0:34:21\tSPEAKER_02\n No, LCD.\n\n0:34:22\tSPEAKER_04\n Okay, great.\n\n0:34:23\tSPEAKER_04\n Very good.\n\n0:34:27\tSPEAKER_04\n Okay.\n\n0:34:28\tSPEAKER_02\n Oh, we need the power on off switch as well.\n\n0:34:32\tSPEAKER_01\n Yeah.\n\n0:34:33\tSPEAKER_01\n For the remote.\n\n0:34:34\tSPEAKER_01\n Yeah.\n\n0:34:35\tSPEAKER_02\n Oh, just remote.\n\n0:34:36\tSPEAKER_04\n No, for the TV.\n\n0:34:37\tSPEAKER_04\n Yeah.\n\n0:34:38\tSPEAKER_04\n Okay.\n\n0:34:39\tSPEAKER_01\n So, you know, that will be controlled by the...\n\n0:34:41\tSPEAKER_01\n Those buttons will be there already here.\n\n0:34:44\tSPEAKER_01\n Where?\n\n0:34:45\tSPEAKER_01\n Means on the side.\n\n0:34:47\tSPEAKER_01\n Because remote is going to have both the interfaces, scroll as well as buttons.\n\n0:34:52\tSPEAKER_01\n They are not going to cost you much.\n\n0:34:54\tSPEAKER_01\n Everything is in-house.\n\n0:34:56\tSPEAKER_01\n And now, you don't want the traditional users to be apprehensive of this.\n\n0:35:01\tSPEAKER_02\n Well, I don't know if the traditional user is going to buy an open-owner or what?\n\n0:35:06\tSPEAKER_02\n Oh, the first place.\n\n0:35:08\tSPEAKER_01\n That's another issue which I can think of.\n\n0:35:10\tSPEAKER_02\n You need to kind of keep it...\n\n0:35:12\tSPEAKER_01\n But, you know, targets are very high.\n\n0:35:15\tSPEAKER_01\n Means, 15 million euros is the profit which we want.\n\n0:35:19\tSPEAKER_02\n What about...\n\n0:35:20\tSPEAKER_02\n Yeah, how many of these do we want to sell?\n\n0:35:21\tSPEAKER_01\n I can't remember.\n\n0:35:22\tSPEAKER_01\n 12.5 is the profit on one.\n\n0:35:25\tSPEAKER_02\n Yeah, but how many units do we need to sell?\n\n0:35:28\tSPEAKER_01\n 40.4 million.\n\n0:35:31\tSPEAKER_01\n 4.4 million.\n\n0:35:32\tSPEAKER_02\n 4.4 million.\n\n0:35:34\tSPEAKER_02\n 4.4 million.\n\n0:35:36\tSPEAKER_02\n That's a lot of fruit.\n\n0:35:38\tNone\n Yeah.\n\n0:35:39\tSPEAKER_04\n And the market.\n\n0:35:40\tSPEAKER_04\n What about...\n\n0:35:41\tSPEAKER_04\n Well, no.\n\n0:35:42\tSPEAKER_04\n Time is running.\n\n0:35:43\tSPEAKER_04\n We have to close the meeting in a few minutes.\n\n0:35:45\tSPEAKER_04\n Okay.\n\n0:35:46\tSPEAKER_04\n The next step you can come back to is...\n\n0:35:48\tSPEAKER_04\n The next step is to go for...\n\n0:35:51\tSPEAKER_04\n Is to go to building a prototype based on this.\n\n0:35:56\tSPEAKER_04\n Okay.\n\n0:35:57\tSPEAKER_04\n Okay.\n\n0:35:58\tSPEAKER_04\n So, next meeting, you guys have to prepare the fully things.\n\n0:36:02\tSPEAKER_04\n You have to work on the look and feel design and you have to work on the user interface.\n\n0:36:08\tSPEAKER_04\n In fact, you have to work together to model the first prototype.\n\n0:36:14\tSPEAKER_04\n Marketing experts have to go to product evaluation.\n\n0:36:19\tSPEAKER_00\n Okay.\n\n0:36:21\tSPEAKER_00\n What about adding this world spotting...\n\n0:36:26\tSPEAKER_00\n Key world spotting recognition, saying or volume up, volume down?\n\n0:36:31\tSPEAKER_00\n It's too difficult.\n\n0:36:33\tSPEAKER_00\n It's too difficult, but people like innovation.\n\n0:36:37\tSPEAKER_00\n And that's really innovative.\n\n0:36:40\tSPEAKER_00\n And I don't know if it would cost a lot.\n\n0:36:43\tSPEAKER_00\n Just a few five words.\n\n0:36:46\tSPEAKER_04\n It will not be possible to implement it for the next prototype.\n\n0:36:50\tSPEAKER_04\n So, it's in the next prototype.\n\n0:36:52\tSPEAKER_04\n So, let's keep it...\n\n0:36:54\tSPEAKER_01\n Okay.\n\n0:36:55\tSPEAKER_01\n For the future prototypes.\n\n0:36:56\tSPEAKER_04\n Yeah.\n\n0:36:57\tSPEAKER_04\n Maybe, if it works well, we will go for...\n\n0:37:00\tSPEAKER_04\n That can be not the turbo banana plus plus.\n\n0:37:03\tSPEAKER_02\n Yes.\n\n0:37:04\tSPEAKER_04\n Or another fruit.\n\n0:37:05\tSPEAKER_00\n Maybe objective banana.\n\n0:37:06\tSPEAKER_00\n Okay.\n\n0:37:07\tSPEAKER_04\n Thanks very much.\n\n0:37:10\tSPEAKER_04\n We'll see you next meeting.\n\n0:37:12\tSPEAKER_01\n So, meeting over?\n\n0:37:13\tSPEAKER_02\n Yeah.\n\n0:37:14\tSPEAKER_02\n We have to go down the prototype.\n\n0:37:16\tSPEAKER_01\n Okay.\n\n0:37:17\tSPEAKER_01\n Thank you.\n\n0:37:18\tSPEAKER_01\n Thank you.\n\n0:37:19\tNone\n Thank you.\n\n0:37:25\tSPEAKER_01\n The problem is after all this meeting that is down.\n\n0:37:29\tSPEAKER_01\n It's a meeting day.\n\n", "summary": [{"summary_text": "Today is the third meeting about conceptual design of the watch. The current trend is to focus on the functional look and feel instead of the current trend of the device. People want an easy to use device. The use of the screen on the remote control is not decided yet."}]}