{"filename": "./data/IS1006b.txt", "transcript": "0:00:00\tNone\n So, I hope you're ready.\n\n0:00:24\tSPEAKER_03\n For this functional design team.\n\n0:00:34\tSPEAKER_03\n So, I will take the minutes.\n\n0:00:40\tSPEAKER_03\n You three are going to the presentation.\n\n0:00:44\tSPEAKER_03\n And we want to know, at the end, to know the new project's requirement.\n\n0:00:51\tSPEAKER_03\n So, we need to know the user needs that we want to fulfill.\n\n0:01:01\tSPEAKER_03\n From the technical part, we want to know how it's going to work.\n\n0:01:06\tSPEAKER_03\n And the part, I don't remember.\n\n0:01:14\tSPEAKER_03\n So, it's not very good.\n\n0:01:21\tSPEAKER_03\n Of course, how to design this.\n\n0:01:25\tSPEAKER_03\n Nice stuff.\n\n0:01:29\tSPEAKER_03\n So, let's go for the presentation.\n\n0:01:34\tSPEAKER_03\n So, for the marketing expert.\n\n0:01:38\tSPEAKER_05\n Okay.\n\n0:01:46\tSPEAKER_05\n So, it's being modified.\n\n0:01:49\tSPEAKER_05\n Do you want to open it?\n\n0:01:52\tSPEAKER_05\n I hope I saved it.\n\n0:01:56\tSPEAKER_05\n So, this is my name.\n\n0:02:01\tSPEAKER_05\n So, as you know, I think you already know me.\n\n0:02:04\tSPEAKER_05\n I'm a very Benjou. I'm the expert in marketing.\n\n0:02:08\tSPEAKER_05\n And I want to tell you about what people won't.\n\n0:02:12\tSPEAKER_05\n And this like in remote controls.\n\n0:02:16\tSPEAKER_05\n And I hope this is going to help you to design it correctly.\n\n0:02:20\tSPEAKER_05\n So, next please.\n\n0:02:27\tSPEAKER_00\n The full page presentation.\n\n0:02:29\tSPEAKER_05\n I spend a lot of time doing this presentation.\n\n0:02:36\tSPEAKER_05\n Okay.\n\n0:02:39\tSPEAKER_05\n So, basically, what I suggest is that instead of deciding ourselves what could be and what should be good remote control, let's ask people who are users of remote controls, how they feel about the correct remote controls, what they like, what they don't like, and what they do with them, by the way, because they're supposed to be useful.\n\n0:03:01\tSPEAKER_05\n Don't forget about that.\n\n0:03:03\tSPEAKER_05\n So, we've conducted a survey on the use of remote controls.\n\n0:03:10\tSPEAKER_05\n And I'd like to show you some of the results we found on this survey.\n\n0:03:16\tSPEAKER_05\n Next please.\n\n0:03:19\tSPEAKER_05\n Yeah. So, basically, what we found was that there are several things that the user don't like in remote controls.\n\n0:03:30\tSPEAKER_05\n First of all, they find it very ugly.\n\n0:03:33\tSPEAKER_05\n Current remote controls, as you know, they are the same as this one.\n\n0:03:38\tSPEAKER_05\n They're not nice color, not nice shape.\n\n0:03:42\tSPEAKER_05\n They're all the same.\n\n0:03:44\tSPEAKER_05\n And they're not good looking.\n\n0:03:48\tSPEAKER_05\n What is interesting is that, in fact, it seems that people are ready to pay for a nice and fancy looking remote control.\n\n0:03:56\tSPEAKER_05\n So, I think we should spend lots of time in effort in that.\n\n0:04:03\tSPEAKER_05\n And the other thing is that the correct remote controls are not so easy to use.\n\n0:04:09\tSPEAKER_05\n And the current facilities that they offer do not match what people really want to use their remote controls.\n\n0:04:17\tSPEAKER_05\n For instance, we see that the zap very often.\n\n0:04:23\tSPEAKER_05\n So, I think this is a very important functionality.\n\n0:04:27\tSPEAKER_05\n It should be easy for them to zap in one way or another.\n\n0:04:33\tSPEAKER_05\n And most of the buttons on current remote controls are not used.\n\n0:04:37\tSPEAKER_05\n So, I think we should design something where some of the buttons, which are those that are used, should be easier to see and use than others that only a couple of people are using.\n\n0:04:50\tSPEAKER_05\n Next, please.\n\n0:04:53\tSPEAKER_05\n Now, people are very frustrated with their remote controls.\n\n0:05:00\tSPEAKER_05\n For instance, they don't even find it.\n\n0:05:05\tSPEAKER_05\n It's often lost somewhere in your home and nobody knows where it is.\n\n0:05:12\tSPEAKER_05\n Maybe if we have something where we could ask the remote control, please, where are you?\n\n0:05:17\tSPEAKER_05\n Like, I think some of the phones have some of these kind of functionality.\n\n0:05:24\tSPEAKER_05\n Of course, phone you can always phone your phone, but you can't phone your phone.\n\n0:05:30\tSPEAKER_05\n But why not?\n\n0:05:33\tSPEAKER_05\n And because of the fact that there are so many buttons in these remote controls that nobody use, in fact, they don't even know how to use them.\n\n0:05:40\tSPEAKER_05\n So, most of the people say they don't know how to use properly their remote controls.\n\n0:05:47\tSPEAKER_05\n And they are bad for RSI, but I don't remember what is RSI.\n\n0:05:54\tSPEAKER_05\n So, I think they are bad.\n\n0:05:58\tSPEAKER_02\n That's not right.\n\n0:06:04\tSPEAKER_05\n Nobody has any idea about that?\n\n0:06:06\tSPEAKER_05\n Well, I'll check it with my...\n\n0:06:08\tSPEAKER_00\n Ultramagnetic waves or something.\n\n0:06:11\tSPEAKER_00\n I think it's a technical thing, because infrared uses some ultramagnetic.\n\n0:06:17\tSPEAKER_04\n So, it's just an extra sound.\n\n0:06:20\tSPEAKER_04\n It's another people fault.\n\n0:06:22\tSPEAKER_05\n Concept that we don't know.\n\n0:06:24\tSPEAKER_05\n But we have to take this into account.\n\n0:06:26\tSPEAKER_05\n It's a different force.\n\n0:06:29\tSPEAKER_04\n People really like some of us knows.\n\n0:06:32\tSPEAKER_05\n So, anyway, that's for what the biggest frustration of the user.\n\n0:06:38\tSPEAKER_05\n What else do I have?\n\n0:06:40\tSPEAKER_05\n Next slide.\n\n0:06:43\tSPEAKER_05\n So, we've listed a couple of functions that may be used by the user in the current available remote controls.\n\n0:06:55\tSPEAKER_05\n The table is not very nice to read, but what is important is to understand that the power button is not used often, because in general you use it only once per session, but it is very relevant.\n\n0:07:12\tSPEAKER_05\n People want to have a power button.\n\n0:07:15\tSPEAKER_05\n So, the internal selection is often used, very often used, and indeed very relevant.\n\n0:07:27\tSPEAKER_05\n Now I remember what is RSI.\n\n0:07:34\tSPEAKER_05\n It's rapid-tvt stress injury.\n\n0:07:39\tSPEAKER_05\n We have to be careful with that word.\n\n0:07:43\tSPEAKER_05\n Anyway, I got into my presentation.\n\n0:07:46\tSPEAKER_05\n So, yeah, channel selection is very important, very often used.\n\n0:07:51\tSPEAKER_05\n Volume is not often used, but people want to have control and volume, and that makes sense, of course.\n\n0:07:58\tSPEAKER_05\n And then you have things which are very much less often used, like the settings, audio settings, screen settings, even teletext and channel settings.\n\n0:08:08\tSPEAKER_05\n They are not often used, and they are more or less relevant. It seems that people find teletext relevant, even if I personally never use it, but it seems that it's average relevant at least.\n\n0:08:22\tSPEAKER_03\n I've been told that we don't consider teletext that it's out of date because of internet.\n\n0:08:30\tSPEAKER_05\n I can tell you that in a scale between 1 and 10, not relevant to relevant people scored 6 on this, which is not as these two ones had, I think, 10.\n\n0:08:44\tSPEAKER_05\n But if you compare with these ones, I think they scored a 1 or 2, not very relevant.\n\n0:08:51\tSPEAKER_05\n If there are good reason not to put teletext, it's okay, but just know that people find it somehow relevant.\n\n0:09:00\tSPEAKER_05\n That's for the main functions, I think.\n\n0:09:02\tSPEAKER_05\n And then we can ask ourselves what people don't have that may be useful, for instance, I think net-next slide.\n\n0:09:12\tSPEAKER_05\n One of the things that the trend that you are probably aware of is the possibility, the eventual possibility of having special recognition in your remote control.\n\n0:09:21\tSPEAKER_05\n So you wouldn't have to tap in your buttons, but just tell your remote control or whatever you need to have what you want.\n\n0:09:30\tSPEAKER_05\n So we've conducted a survey about whether people would like or not to have this kind of functionality in their remote control.\n\n0:09:38\tSPEAKER_05\n And as we can see, it really depends on the age.\n\n0:09:42\tSPEAKER_05\n Young people, probably because it's a buzzword, find it very relevant.\n\n0:09:47\tSPEAKER_05\n And as the age goes up, the relevance goes down.\n\n0:09:54\tSPEAKER_05\n So now it really depends on the kind of targeting, who are we targeting with this remote control?\n\n0:10:01\tSPEAKER_05\n I think if we're targeting young people, then it's probably something we have to consider.\n\n0:10:05\tSPEAKER_05\n If we're targeting young people, this is something that we don't know why this should be.\n\n0:10:12\tSPEAKER_05\n So now this is of course depends on that.\n\n0:10:16\tSPEAKER_05\n And I don't have any conclusion, I didn't have time, the meeting was very tight.\n\n0:10:21\tSPEAKER_05\n So that's basically my findings.\n\n0:10:24\tSPEAKER_05\n If you have any question.\n\n0:10:26\tSPEAKER_03\n I think it's good, okay?\n\n0:10:29\tSPEAKER_05\n I can really give you one question.\n\n0:10:31\tSPEAKER_04\n Yeah, one question.\n\n0:10:32\tSPEAKER_04\n You're a market expert, so should we aim at young people or not?\n\n0:10:37\tSPEAKER_05\n I think we should aim at young people.\n\n0:10:39\tSPEAKER_05\n But I think there are those who might be more interested in the new device.\n\n0:10:47\tSPEAKER_05\n And generally, the early adopters of new device are young people less than...\n\n0:10:52\tSPEAKER_05\n Okay, more than...\n\n0:10:53\tSPEAKER_05\n...central text is useless.\n\n0:10:55\tSPEAKER_05\n Then the text is useless for the money, because they have other means of finding their information.\n\n0:11:02\tSPEAKER_05\n That's a good point.\n\n0:11:05\tSPEAKER_05\n Okay.\n\n0:11:06\tSPEAKER_05\n Thank you.\n\n0:11:11\tSPEAKER_03\n So now I think it's the turn of the...\n\n0:11:18\tSPEAKER_03\n I'm not sure.\n\n0:11:29\tSPEAKER_03\n Of the technical function?\n\n0:11:32\tSPEAKER_03\n So...\n\n0:11:33\tSPEAKER_00\n I think it's you.\n\n0:11:36\tSPEAKER_00\n No.\n\n0:11:38\tSPEAKER_00\n What if you...\n\n0:11:39\tSPEAKER_05\n You are a requirement.\n\n0:11:43\tSPEAKER_00\n I have to do working design too.\n\n0:11:49\tSPEAKER_04\n I'll start with number three.\n\n0:11:52\tSPEAKER_04\n Yes.\n\n0:11:55\tSPEAKER_04\n So my name is Mark Dwight, and I'm responsible for user interface design.\n\n0:12:09\tSPEAKER_04\n However, the project manager asked me to give you some presentation about technical functions design.\n\n0:12:18\tSPEAKER_04\n I'm a more anarchist.\n\n0:12:21\tSPEAKER_04\n That's going to be less technical functions, but more user interface and current intentions.\n\n0:12:27\tSPEAKER_04\n Everything which is linked to this.\n\n0:12:30\tSPEAKER_04\n So, next slide please.\n\n0:12:32\tSPEAKER_04\n And the general method which seems to be very useful for our task is not to forget about the outcome razor.\n\n0:12:41\tSPEAKER_04\n We should never complicate things too much.\n\n0:12:44\tSPEAKER_04\n We should only make a remote control.\n\n0:12:47\tSPEAKER_04\n Nothing more.\n\n0:12:48\tSPEAKER_04\n Nothing more than this.\n\n0:12:49\tSPEAKER_04\n Just remote control.\n\n0:12:51\tSPEAKER_04\n Because current remote controls, they are never easy enough to use.\n\n0:12:58\tSPEAKER_04\n So, make a click this.\n\n0:13:02\tSPEAKER_04\n So, here is the remote control.\n\n0:13:06\tSPEAKER_04\n It's quite a standard one, but it's not from a TV.\n\n0:13:10\tSPEAKER_04\n It's from a much easier device like air condition or something.\n\n0:13:17\tSPEAKER_04\n But you know, we can use it for a TV easily.\n\n0:13:23\tSPEAKER_04\n Only buttons when it is on off, volume, channels, and maybe some options or something else.\n\n0:13:33\tSPEAKER_04\n And please make a click.\n\n0:13:36\tSPEAKER_04\n Compared to this one.\n\n0:13:39\tSPEAKER_04\n Which one would you prefer?\n\n0:13:42\tSPEAKER_04\n I guess this.\n\n0:13:43\tSPEAKER_05\n I would say the simplest one as long as I find the buttons that I need every time I need a button.\n\n0:13:49\tSPEAKER_04\n Sure.\n\n0:13:50\tSPEAKER_00\n Maybe it can be middle of between those two.\n\n0:13:54\tSPEAKER_04\n And our method is going to be provide simple, simple desires into simple actions.\n\n0:14:02\tSPEAKER_05\n Nice.\n\n0:14:03\tSPEAKER_05\n Nice sentence.\n\n0:14:07\tSPEAKER_04\n Fudding.\n\n0:14:08\tSPEAKER_04\n Oh, sorry.\n\n0:14:11\tSPEAKER_04\n Our question is a style.\n\n0:14:13\tSPEAKER_04\n We should remember that our company puts fashion into electronics.\n\n0:14:23\tSPEAKER_04\n And we should never forget about it.\n\n0:14:28\tSPEAKER_04\n Concept.\n\n0:14:31\tSPEAKER_04\n Simple.\n\n0:14:33\tSPEAKER_04\n The simple and you lean on this market.\n\n0:14:36\tSPEAKER_04\n Market of remote controls, you know it better.\n\n0:14:39\tSPEAKER_04\n It's very... wow.\n\n0:14:43\tSPEAKER_04\n It's not an easy feel to play, you know.\n\n0:14:49\tSPEAKER_04\n So be simple.\n\n0:14:53\tSPEAKER_04\n For personal preferences.\n\n0:14:55\tSPEAKER_04\n I think that to make a baby proof remote control, it got to be a titanium.\n\n0:15:02\tSPEAKER_04\n It's a really good style.\n\n0:15:04\tSPEAKER_04\n It's going to be look like this.\n\n0:15:09\tSPEAKER_04\n It is unbreakable and it is very universal.\n\n0:15:16\tSPEAKER_04\n We'll have a screen with a backlight that can change colors.\n\n0:15:21\tSPEAKER_04\n And we can put all the options into the screen.\n\n0:15:25\tSPEAKER_04\n We'll need only few buttons.\n\n0:15:27\tSPEAKER_04\n All the other things can be controlled through the screen.\n\n0:15:33\tSPEAKER_04\n And all these buttons should be easy to find and to click.\n\n0:15:36\tSPEAKER_04\n Because when you watch a movie and you want to change something, you always try to find a good button and click it.\n\n0:15:44\tSPEAKER_04\n But you should do it by touching it and finally easily just by touching.\n\n0:15:49\tSPEAKER_04\n So...\n\n0:15:53\tSPEAKER_04\n I would propose this concept for design.\n\n0:16:00\tSPEAKER_04\n Just few buttons, a screen with a backlight, which can change colors.\n\n0:16:05\tSPEAKER_04\n To tan you, think and what else.\n\n0:16:10\tSPEAKER_04\n I could just wear a few good ideas.\n\n0:16:14\tSPEAKER_04\n We need power and volume.\n\n0:16:17\tSPEAKER_04\n And let us include two nice features into this device.\n\n0:16:21\tSPEAKER_04\n First, power on and off can be made fully automatic.\n\n0:16:26\tSPEAKER_04\n When you go to the sofa, take your control and point it to the TV.\n\n0:16:31\tSPEAKER_03\n It turns on.\n\n0:16:33\tSPEAKER_04\n The TV turns on.\n\n0:16:35\tSPEAKER_05\n And when does it turn off?\n\n0:16:37\tSPEAKER_04\n When you don't touch the control, but you go out of it for enough time.\n\n0:16:43\tSPEAKER_05\n Sensing sensor machine that...\n\n0:16:46\tSPEAKER_04\n It's a question to our technical design hour to engineers.\n\n0:16:52\tSPEAKER_04\n And another nice feature that I would like to implement is the volume control.\n\n0:16:57\tSPEAKER_04\n Suppose you set up some volume and then you move out or you move to the other corner of the room and take your control with you.\n\n0:17:08\tSPEAKER_04\n Like you want to change the chair or you want to move to the armchair from the sofa or...\n\n0:17:14\tSPEAKER_04\n You want to...\n\n0:17:15\tSPEAKER_04\n Something.\n\n0:17:16\tSPEAKER_04\n And then the volume changes.\n\n0:17:18\tSPEAKER_04\n It's easy to do.\n\n0:17:20\tSPEAKER_04\n And then you control the...\n\n0:17:22\tSPEAKER_05\n According to your distance.\n\n0:17:24\tSPEAKER_05\n And the angle maybe if you have a...\n\n0:17:26\tSPEAKER_05\n Yeah.\n\n0:17:27\tSPEAKER_05\n Yeah.\n\n0:17:28\tSPEAKER_05\n I'm not sure about the screen.\n\n0:17:30\tSPEAKER_05\n What is the usefulness of the screen?\n\n0:17:32\tSPEAKER_05\n Is it a touch screen, by the way?\n\n0:17:35\tSPEAKER_04\n I think it can be just a menu which can be controlled with the left right, up, down and down.\n\n0:17:40\tSPEAKER_05\n So it gives instructions but it has to be then backlight somehow.\n\n0:17:45\tSPEAKER_04\n So it's main purpose in fact is the backlight.\n\n0:17:49\tSPEAKER_04\n Which change colors, which makes it easy to find.\n\n0:17:55\tSPEAKER_04\n And it can respond for your voice like it can turn on the light for you just to find it easily.\n\n0:18:06\tSPEAKER_04\n Okay.\n\n0:18:10\tSPEAKER_04\n So basically that's it.\n\n0:18:12\tSPEAKER_03\n And I see that you target several applications not only TV but like we talk about universal remote control.\n\n0:18:22\tSPEAKER_04\n It can be easily done because you got simple designs.\n\n0:18:26\tSPEAKER_04\n We should put it to simple actions.\n\n0:18:29\tSPEAKER_04\n Let it be universal.\n\n0:18:31\tSPEAKER_04\n So you want to use it for your high-fi system.\n\n0:18:34\tSPEAKER_04\n You want to change tracks and you want to just volume.\n\n0:18:39\tSPEAKER_04\n Just few actions.\n\n0:18:42\tSPEAKER_04\n Few actions for everything.\n\n0:18:44\tSPEAKER_04\n Also rest we will put it into this menu on the screen.\n\n0:18:50\tSPEAKER_03\n Since we were targeting a really soon date for the issue of this remote control, I think we will only concentrate on TV for the moment.\n\n0:19:04\tSPEAKER_03\n Okay.\n\n0:19:05\tSPEAKER_04\n But it's quite universal.\n\n0:19:07\tSPEAKER_04\n We can just extend it to any device.\n\n0:19:09\tSPEAKER_05\n For instance, if I want to go directly to channel 25, how would I do?\n\n0:19:13\tSPEAKER_05\n Can I do that with this?\n\n0:19:15\tSPEAKER_05\n 25.\n\n0:19:16\tSPEAKER_05\n Yeah, let's say I'm on channel 8 now.\n\n0:19:18\tSPEAKER_05\n You know, these days we have hundreds of channels.\n\n0:19:20\tSPEAKER_05\n That's not so easy to go just next, next, next when you have hundreds of channels.\n\n0:19:25\tSPEAKER_04\n In fact, I would propose another solution.\n\n0:19:27\tSPEAKER_04\n Basically you use just four or five channels.\n\n0:19:30\tSPEAKER_04\n Most people, yeah.\n\n0:19:32\tSPEAKER_04\n So set up your TV set like channels that you use.\n\n0:19:39\tSPEAKER_04\n They are one, two, three, and five.\n\n0:19:42\tSPEAKER_04\n And you will never have to go to a 25.\n\n0:19:44\tSPEAKER_05\n In fact, in one remote control that I've seen, instead of doing that, you could just say these are the channel 3, 28, 48, and 64.\n\n0:19:57\tSPEAKER_05\n Are those that I want to be cycled with my next button?\n\n0:20:01\tSPEAKER_05\n Yeah, it's the same solution.\n\n0:20:03\tSPEAKER_00\n But even we can have some LCD display that you can go to channel 35.\n\n0:20:10\tSPEAKER_05\n But on the number one thing is that as I said in my presentation, people really do like to zap.\n\n0:20:16\tSPEAKER_05\n So even if they are only watching four or five channels, I think they want to zap out of the 100 channels just because this is one kind of thing they do.\n\n0:20:26\tSPEAKER_03\n Yeah, and zap it's only next, next, next, next.\n\n0:20:29\tSPEAKER_05\n So that you have to go to this button here.\n\n0:20:32\tSPEAKER_04\n Okay.\n\n0:20:33\tSPEAKER_04\n Next, next.\n\n0:20:34\tSPEAKER_04\n Or say this can be back.\n\n0:20:38\tSPEAKER_00\n But otherwise we can put some display on numbers and then they can just press.\n\n0:20:42\tSPEAKER_00\n So it was two five, they just press two and five and then.\n\n0:20:46\tSPEAKER_03\n Maybe we can make different modes for each button.\n\n0:20:51\tSPEAKER_03\n You can change the zapping mode or...\n\n0:20:54\tSPEAKER_03\n How are you?\n\n0:20:55\tSPEAKER_03\n Curiently.\n\n0:20:57\tSPEAKER_00\n We were focusing only on TV remote control.\n\n0:21:00\tSPEAKER_00\n So we can have more functions for TV.\n\n0:21:03\tSPEAKER_00\n If you want to go for universal then we have to limit for functions for each of our devices.\n\n0:21:10\tSPEAKER_00\n Okay.\n\n0:21:11\tSPEAKER_04\n Could we carry out some research if we really need this?\n\n0:21:15\tSPEAKER_04\n Like how many people really need to go to channel number 25 and then to 64?\n\n0:21:20\tSPEAKER_05\n Oh, I could...\n\n0:21:22\tSPEAKER_05\n Could have a look at that.\n\n0:21:24\tSPEAKER_05\n Maybe.\n\n0:21:25\tSPEAKER_05\n I'll check in my department if there's someone specialist in that.\n\n0:21:31\tSPEAKER_05\n Although I don't know.\n\n0:21:33\tSPEAKER_04\n Thanks for your attention.\n\n0:21:35\tSPEAKER_03\n Okay.\n\n0:21:37\tSPEAKER_03\n So now the technical aspects of this new device.\n\n0:22:05\tSPEAKER_03\n Sorry, but first...\n\n0:22:07\tSPEAKER_00\n Yes.\n\n0:22:08\tSPEAKER_00\n I'm Mr. Ramaro.\n\n0:22:11\tSPEAKER_00\n I'm an expert in industrial design of all electronic devices.\n\n0:22:16\tSPEAKER_00\n I've previously devised many digital calculators and electronic calculators.\n\n0:22:24\tSPEAKER_00\n So now I briefly describe the working design of our remote control.\n\n0:22:33\tSPEAKER_00\n Well, as you know the basic function of remote control is sending some message to the device like TV or VCR or DVD player etc.\n\n0:22:46\tSPEAKER_00\n So we will have a portable device which will send message to the main device like TV.\n\n0:22:54\tSPEAKER_00\n So we need to have some energy source to do what... to do the functions what we want on this portable device.\n\n0:23:03\tSPEAKER_00\n And usually this...\n\n0:23:06\tSPEAKER_00\n So to do these functions we need an interface.\n\n0:23:09\tSPEAKER_00\n It's basically some kind of pressing buttons or keys or like moving jack or something like that.\n\n0:23:16\tSPEAKER_00\n And then these messages, these key buttons can be transferred into some kind of message and then it will process by the chip.\n\n0:23:26\tSPEAKER_00\n And then it will generate some information to the main device.\n\n0:23:31\tSPEAKER_00\n It's generally in the form of infrared or some kind of sensor information.\n\n0:23:38\tSPEAKER_00\n Then we will have the main control in the main device to do the particular action what we want.\n\n0:23:49\tSPEAKER_00\n So basically we need... since we are focusing on our interface device that's our remote control.\n\n0:23:56\tSPEAKER_00\n We need few components, mainly the energy source, like the battery.\n\n0:24:01\tSPEAKER_00\n And then we have user interface like the keypad and buttons we want.\n\n0:24:08\tSPEAKER_00\n And then we have some chip, it's mainly distal signal processing chip because since we are...\n\n0:24:15\tSPEAKER_00\n I want doing mostly distal devices we have to have some kind of processor which take care of all these functions and put it in some distal format.\n\n0:24:26\tSPEAKER_00\n And then we will have the infrared LED source which sends the information to the main device.\n\n0:24:33\tSPEAKER_00\n Then we will have switch in our main device to do particular operations.\n\n0:24:39\tSPEAKER_00\n And we have to do different codes for different TVs.\n\n0:24:43\tSPEAKER_00\n So some TVs will have different encryption codes for doing channel changing and these things.\n\n0:24:51\tSPEAKER_03\n So we need to make it a universal device.\n\n0:24:56\tSPEAKER_00\n Because people don't use one particular band so at least we have more than five bands which are really good.\n\n0:25:03\tSPEAKER_00\n So we need to check their specifications and do their encryption that's passing information to the TV device.\n\n0:25:11\tSPEAKER_00\n So we need to have particular encryption codes.\n\n0:25:16\tSPEAKER_00\n Then components, so we have the main energy source and then we will have some buttons.\n\n0:25:24\tSPEAKER_00\n And then we will have infrared source and then we have some inside some chip in the device.\n\n0:25:33\tSPEAKER_00\n Since I don't have much time so I didn't put the connection to all these components.\n\n0:25:40\tSPEAKER_00\n And since I also want to know feedback from our marketing expert and user interface.\n\n0:25:47\tSPEAKER_00\n So if you want to add some more components we can incorporate them.\n\n0:25:52\tSPEAKER_03\n From the discussion we had, can you make it on the whiteboard?\n\n0:25:57\tSPEAKER_00\n Yeah, I'm sure because since our user interface engineers suggesting speech recognition and also marketing expert found that speech recognition is really handy.\n\n0:26:11\tSPEAKER_00\n So we can have another simple speech recognition on our DSP chip.\n\n0:26:18\tSPEAKER_00\n Since we have some kind of energy this is our normal battery.\n\n0:26:25\tSPEAKER_00\n So this battery once you switch on it will take power and we can have some speech recognition and in our generally small digital signal processing chip.\n\n0:26:36\tSPEAKER_00\n So that and we will put other small simple speech recognition.\n\n0:26:41\tSPEAKER_00\n And we can also try and this speech recognition for a particular user.\n\n0:26:46\tSPEAKER_00\n So you just...\n\n0:26:48\tSPEAKER_00\n I need to.\n\n0:26:49\tSPEAKER_00\n Yeah, such which issues simple...\n\n0:26:52\tSPEAKER_00\n True contacts.\n\n0:26:54\tSPEAKER_05\n But very good to sell.\n\n0:26:57\tSPEAKER_00\n Yeah, you can find even simple mobile device like any mobile brand you can have this voice, dealers or these things.\n\n0:27:06\tSPEAKER_05\n For all these young people who would love to say that this remote control only works for them.\n\n0:27:11\tSPEAKER_05\n And you cannot choose my remote control because it started it to me.\n\n0:27:15\tSPEAKER_03\n And what about the price of this component?\n\n0:27:19\tSPEAKER_00\n Maybe we can make within 5 euros and even less than that because we want to have billions and in bulk so we can make really simple.\n\n0:27:30\tSPEAKER_00\n And we want to make really simple device because we have only very few words like like power switch on or some like then we will have something like this.\n\n0:27:43\tSPEAKER_00\n We will have volume and then we will have particular channel.\n\n0:27:49\tSPEAKER_00\n So users can...\n\n0:27:51\tSPEAKER_05\n So user will just be able to say please can you pop up the volume or it will be something like volume up.\n\n0:28:00\tSPEAKER_00\n The user can use any kind of sentiment but they should have this prompted words volume and...\n\n0:28:06\tSPEAKER_03\n With a keyword.\n\n0:28:07\tSPEAKER_00\n Yeah, volume and decrease or increase. So we try to only recognize code words and because we can't really say user to say same word and then it becomes more mechanical.\n\n0:28:18\tSPEAKER_00\n And then we can have channel they can say okay I want 8 because we don't know like users have different programs.\n\n0:28:26\tSPEAKER_00\n They don't really follow same channels, we just want channel number.\n\n0:28:31\tSPEAKER_00\n We don't want like BBC or CNN or...\n\n0:28:34\tSPEAKER_00\n Of course it has to be complicated. So we will have only this 3 main basic.\n\n0:28:41\tSPEAKER_00\n Anyway volume is not really speech recognition problem it will be takeer of our main.\n\n0:28:48\tSPEAKER_04\n No, it's a conceptual question because now I see this is the picture in front of my eyes like a user taking his remote control and shouting him to it.\n\n0:28:57\tSPEAKER_04\n But I think he's coming no he's really not with this.\n\n0:29:04\tSPEAKER_05\n First of all I think this is not a functionality that is going to be instead of using the buttons.\n\n0:29:11\tSPEAKER_05\n On top of using the button.\n\n0:29:13\tSPEAKER_04\n Okay for this budget like 12 euros.\n\n0:29:16\tSPEAKER_04\n Well I don't know.\n\n0:29:18\tSPEAKER_00\n Actually we can have one switch to like switch on and off this day's be processor and this really parallel to the suppose like here.\n\n0:29:26\tSPEAKER_00\n We have our main chip which controls power volume and this buttons and this DSP.\n\n0:29:31\tSPEAKER_00\n Again these two have some interaction like suppose people use DSP then it vertically sends some information to the chip like in some form like volume increase or like this key.\n\n0:29:44\tSPEAKER_00\n So it will not be like very expensive because since we are only focusing on TV remote controls and we have only few things here.\n\n0:29:53\tSPEAKER_03\n Okay.\n\n0:29:56\tSPEAKER_04\n Did you consider as a gesture recognition like if I want to put volume up I like to take my remote control do something like volume up or volume down.\n\n0:30:08\tSPEAKER_00\n At this point we didn't consider because it's very expensive.\n\n0:30:11\tSPEAKER_00\n It's very expensive because our target is only like 12.5 euros.\n\n0:30:16\tSPEAKER_03\n What about the idea of automatic on off on?\n\n0:30:19\tSPEAKER_00\n Yeah even automatic on off is also a bit problematic because different criteria for different people like so suppose people are really they just they don't touch the remote and you don't know how much time you need to switch on or switch off and should we target a user personalized the remote control.\n\n0:30:42\tSPEAKER_05\n So in a given room there might be more than one remote control we would have each one. Yeah and with our own personal settings.\n\n0:30:51\tSPEAKER_00\n Yeah that can be possible especially for power settings so user can say okay.\n\n0:30:57\tSPEAKER_00\n Suppose they're watching a tennis match or something then they can say okay after one hour.\n\n0:31:02\tSPEAKER_00\n They can make addons.\n\n0:31:06\tSPEAKER_05\n Yeah I want to the object.\n\n0:31:09\tSPEAKER_05\n That's the problem we will sell more.\n\n0:31:12\tSPEAKER_02\n We can increase the settings.\n\n0:31:16\tSPEAKER_02\n Exactly.\n\n0:31:17\tSPEAKER_02\n You can buy more.\n\n0:31:20\tSPEAKER_04\n Yeah that's more.\n\n0:31:23\tSPEAKER_04\n Okay.\n\n0:31:26\tSPEAKER_03\n You have something else to say.\n\n0:31:30\tSPEAKER_00\n Not very much.\n\n0:31:32\tSPEAKER_00\n Okay.\n\n0:31:33\tSPEAKER_03\n Thanks.\n\n0:31:34\tSPEAKER_02\n Thank you.\n\n0:31:37\tSPEAKER_02\n Thank you.\n\n0:31:39\tSPEAKER_02\n So.\n\n0:31:42\tSPEAKER_03\n I think.\n\n0:31:45\tSPEAKER_03\n Okay.\n\n0:31:46\tSPEAKER_03\n We're just on time.\n\n0:31:54\tSPEAKER_03\n So we are now going to have the lunch break.\n\n0:31:59\tSPEAKER_03\n Great.\n\n0:32:01\tSPEAKER_03\n Okay.\n\n0:32:08\tSPEAKER_03\n We will work again for 30 minutes individual work and we will meet again for the next meeting.\n\n0:32:15\tSPEAKER_03\n And in this one we want to be more focused on the individual actions on the components.\n\n0:32:26\tSPEAKER_03\n So.\n\n0:32:34\tSPEAKER_03\n You will focus on the component concept.\n\n0:32:41\tSPEAKER_03\n Of course the UID mark will be focused on the user interface concept.\n\n0:32:48\tSPEAKER_03\n And our market expert, Sami Benjo, on the train watching.\n\n0:32:59\tSPEAKER_03\n Of course, before specific instruction will be sent to you by your personal coach.\n\n0:33:07\tSPEAKER_03\n I think that's all.\n\n0:33:10\tSPEAKER_03\n And we have maybe we have to we say only for TV not a late text.\n\n0:33:18\tSPEAKER_03\n I think automatic on off control.\n\n0:33:22\tSPEAKER_03\n It's not possible.\n\n0:33:24\tSPEAKER_00\n It's a current price.\n\n0:33:26\tSPEAKER_03\n Yeah.\n\n0:33:27\tSPEAKER_03\n Maybe in the next step if we make it work.\n\n0:33:33\tSPEAKER_00\n But speech recognition can be possible.\n\n0:33:36\tSPEAKER_03\n Okay. We can think about that.\n\n0:33:41\tSPEAKER_03\n Do you see something else?\n\n0:33:44\tSPEAKER_04\n No.\n\n0:33:48\tSPEAKER_04\n Should it be equipped with speakers?\n\n0:33:57\tSPEAKER_05\n Speakers.\n\n0:33:58\tSPEAKER_04\n Like you want to find it.\n\n0:34:00\tSPEAKER_04\n You shout.\n\n0:34:01\tSPEAKER_04\n Yeah.\n\n0:34:02\tSPEAKER_04\n Control.\n\n0:34:03\tSPEAKER_04\n And it answers.\n\n0:34:06\tSPEAKER_05\n It just beeps.\n\n0:34:09\tSPEAKER_03\n Or maybe you want to phone him.\n\n0:34:12\tSPEAKER_05\n But it's now expensive.\n\n0:34:16\tSPEAKER_00\n Especially the power.\n\n0:34:18\tSPEAKER_00\n It really consumes because it should be all the time on.\n\n0:34:22\tSPEAKER_05\n And I heard of devices where you just whistle them.\n\n0:34:26\tSPEAKER_05\n And because of the frequency.\n\n0:34:29\tSPEAKER_05\n I can't answer to that.\n\n0:34:31\tSPEAKER_05\n We don't know.\n\n0:34:33\tSPEAKER_05\n Or a clap.\n\n0:34:34\tSPEAKER_05\n You can clap.\n\n0:34:35\tSPEAKER_02\n Clap.\n\n0:34:36\tSPEAKER_05\n Clap.\n\n0:34:37\tSPEAKER_05\n It's good.\n\n0:34:38\tSPEAKER_02\n Thank you.\n\n0:34:40\tSPEAKER_01\n Yeah.\n\n0:34:43\tSPEAKER_05\n Just what about us?\n\n0:34:46\tSPEAKER_05\n We have only one hand.\n\n0:34:49\tSPEAKER_00\n He's another target people.\n\n0:34:52\tSPEAKER_00\n But it's a good feature.\n\n0:34:54\tSPEAKER_00\n We need to think about how to incorporate.\n\n0:34:58\tSPEAKER_04\n We don't interfere with other devices.\n\n0:35:02\tSPEAKER_04\n Because always people do that the lights are turning on with clapping.\n\n0:35:07\tSPEAKER_04\n Oh.\n\n0:35:08\tSPEAKER_05\n That already exists.\n\n0:35:09\tSPEAKER_05\n Yeah.\n\n0:35:10\tSPEAKER_05\n I got to touch my phone.\n\n0:35:11\tSPEAKER_01\n Oh, yeah.\n\n0:35:12\tSPEAKER_05\n You do have.\n\n0:35:13\tSPEAKER_03\n Just handy.\n\n0:35:16\tSPEAKER_03\n So let's think.\n\n0:35:17\tSPEAKER_03\n Think about it.\n\n0:35:18\tSPEAKER_03\n Yeah.\n\n0:35:19\tSPEAKER_03\n I think that could be the component concept.\n\n0:35:23\tSPEAKER_03\n Yes.\n\n0:35:25\tSPEAKER_05\n Okay.\n\n0:35:26\tSPEAKER_03\n Good.\n\n0:35:29\tNone\n Great.\n\n0:35:30\tSPEAKER_03\n Yeah.\n\n0:35:31\tSPEAKER_03\n Let's go to my team.\n\n0:35:32\tSPEAKER_03\n Thank you very much.\n\n0:35:33\tSPEAKER_00\n Thank you.\n\n0:35:34\tSPEAKER_00\n Thank you.\n\n0:35:35\tSPEAKER_00\n Thank you very much.\n\n0:35:36\tSPEAKER_03\n Thank you.\n\n", "summary": [{"summary_text": "The functional design team is going to the presentation. They need to know the new project's requirement. They want to know how it's going to work. The current remote controls are ugly, they are the same as the current one and they're not nice color, not nice shape, and in fact, people are ready to pay for a nice remote control. The presentation includes a survey on the use of remote controls. "}]}