{"filename": "./data/IS1008b.txt", "transcript": "0:00:00\tNone\n I was supposed to change seats.\n\n0:00:03\tNone\n I see you now, since when?\n\n0:00:05\tNone\n It did.\n\n0:00:06\tNone\n I hope it disappeared.\n\n0:00:08\tNone\n I did it no longer somewhere.\n\n0:00:10\tSPEAKER_01\n And it disappeared.\n\n0:00:12\tSPEAKER_01\n And who's the thing in the jadez this?\n\n0:00:15\tSPEAKER_01\n There you go.\n\n0:00:16\tSPEAKER_01\n Me too.\n\n0:00:17\tNone\n I should be sure.\n\n0:00:19\tNone\n Okay.\n\n0:00:34\tSPEAKER_03\n Okay.\n\n0:00:36\tSPEAKER_03\n Agnes, you can help me for the spite when I talk to you.\n\n0:00:40\tSPEAKER_03\n Okay.\n\n0:00:41\tSPEAKER_03\n Welcome back.\n\n0:00:43\tSPEAKER_03\n I hope you have fresh air and fresh time.\n\n0:00:48\tSPEAKER_03\n Now the meeting actually we gathering here to discuss about the functional design meeting.\n\n0:00:59\tSPEAKER_03\n Okay.\n\n0:01:00\tSPEAKER_03\n And we receive some information from all of you.\n\n0:01:04\tSPEAKER_03\n And it's in the, I think, in the sharing folder.\n\n0:01:08\tSPEAKER_03\n And I will invite the Christine and the aid and Agnes to discuss about on the various subjects.\n\n0:01:17\tSPEAKER_03\n So can you go to the next slide?\n\n0:01:20\tSPEAKER_03\n Yeah.\n\n0:01:21\tSPEAKER_03\n The agent of the meeting is opening.\n\n0:01:24\tSPEAKER_03\n Then I'm going to talk about the project management, what I'm going to do.\n\n0:01:29\tSPEAKER_03\n And of course, I'm doing the project management and secretary both to take the minutes of the meeting.\n\n0:01:35\tSPEAKER_03\n And there are three presentations.\n\n0:01:37\tSPEAKER_03\n One is new project requirements.\n\n0:01:40\tSPEAKER_03\n And the second one about decision on remote control functions.\n\n0:01:44\tSPEAKER_03\n And finally, we are closing and the meeting time will be 40 minutes.\n\n0:01:49\tSPEAKER_03\n So you have to be very quick.\n\n0:01:52\tSPEAKER_03\n And I have come up with management, come with the new proposal.\n\n0:01:56\tSPEAKER_03\n Okay.\n\n0:01:57\tSPEAKER_03\n And I have to discuss a few points on this.\n\n0:01:59\tSPEAKER_03\n Burt says new insights in the aim of your project.\n\n0:02:05\tSPEAKER_03\n The one is the teletext becomes outmodel.\n\n0:02:10\tSPEAKER_03\n Okay, because of the computer systems and new technology.\n\n0:02:15\tSPEAKER_03\n So we don't need to consider really about the teletext and all in our new project design.\n\n0:02:21\tSPEAKER_03\n And the second one is about the remote control.\n\n0:02:26\tSPEAKER_03\n Should be used only for the TV.\n\n0:02:29\tSPEAKER_03\n That's what our management says.\n\n0:02:33\tSPEAKER_03\n And the third point, it's very, very important to establish or marketing or corporate image with this new project or new product.\n\n0:02:49\tSPEAKER_03\n So I will invite Agnes, can you go to the third slide?\n\n0:02:54\tSPEAKER_02\n No, this is the third slide.\n\n0:02:57\tSPEAKER_03\n Okay, this is it.\n\n0:02:59\tSPEAKER_03\n So I will invite Christine to discuss about the functional design.\n\n0:03:05\tSPEAKER_01\n Okay, do you want to open the ear part?\n\n0:03:15\tSPEAKER_02\n Disadvant.\n\n0:03:16\tSPEAKER_01\n Number two.\n\n0:03:19\tSPEAKER_01\n That's it.\n\n0:03:24\tSPEAKER_02\n John Thomas or John Mita?\n\n0:03:26\tSPEAKER_02\n I'll do it.\n\n0:03:27\tSPEAKER_01\n I'll see.\n\n0:03:28\tSPEAKER_01\n Thanks.\n\n0:03:31\tSPEAKER_01\n So, well, I figured we should identify some user requirements.\n\n0:03:39\tSPEAKER_01\n And from my experience, I want to, and from research I did, the device has to turn the television on and off.\n\n0:03:49\tSPEAKER_01\n The first time you press on the big button, you can't have like waffling on this point.\n\n0:03:55\tSPEAKER_01\n You know, really, and needs to be able to find it because one of the biggest problems with remote control is finding them.\n\n0:04:04\tSPEAKER_01\n So, I also, since we have to establish our corporate image on the basis of this new product, that would better look at things that are popular and go beyond those, as I said, in first meeting.\n\n0:04:17\tSPEAKER_01\n And then we might want to talk eventually about the materials that are appropriate to use in the construction, especially in the outside of the product so that it gives the appearance and is reliable and so forth.\n\n0:04:33\tSPEAKER_01\n I did a little history on the remote controls and when they were invented and so forth.\n\n0:04:40\tSPEAKER_01\n So, I guess this guy at Zenith created the Flashmatic, which I kind of liked the idea because it made me think of, maybe the remote control made a big flash when you turn the TV on and off, that might be interesting.\n\n0:04:54\tSPEAKER_01\n And so, it was highly directional flashlight that you could turn the picture on and off and the sound on and off and change channels.\n\n0:05:06\tSPEAKER_01\n So, I think those are still requirements we have today, 50 years later.\n\n0:05:13\tSPEAKER_01\n And it was really a pioneering innovation but it was sensitive to the sun so that it would start off by the, it would easily cause some problems.\n\n0:05:27\tSPEAKER_01\n So, I, in addition to looking at the functional grinds, so all these devices are examples of where they represent examples that are available today.\n\n0:05:43\tSPEAKER_01\n I think the one in the middle is really something to keep in mind.\n\n0:05:48\tSPEAKER_01\n It'd be easy to find and it would, you could throw it at things if the TV didn't turn on and off, you could use it for something else.\n\n0:06:01\tSPEAKER_01\n And since I'm not really an industrial designer, I didn't really know what to do with this slide.\n\n0:06:07\tSPEAKER_01\n But I just took some different schematics and I put them into this and I guess this is what a slide might look like if you were doing a circuit board.\n\n0:06:19\tSPEAKER_01\n I don't know why we were asked to do this.\n\n0:06:23\tSPEAKER_01\n So, personal preferences, I think we could, I'm really thinking outside the box here and I think that we should consider perhaps having a size, a remote control that changes in size depending on the user preference.\n\n0:06:40\tSPEAKER_01\n So, something that's very, very flexible and inflatable and then you could shrink it.\n\n0:06:44\tSPEAKER_01\n I think you could either be, you could go either one extreme, be very colorful or you could make it clear and kind of blend in with things.\n\n0:06:53\tSPEAKER_01\n So, you didn't have to have a problem with the decoration of the user's home.\n\n0:07:01\tSPEAKER_01\n I think it needs to be waterproof because sometimes they fall into cups and you know, it might be out by the swimming pool or something like that.\n\n0:07:12\tSPEAKER_01\n If you, one of my requirements was about it needs to tell you when it's done its job or not because after time I keep pushing on the remote control and I don't know if it's actually understood my message.\n\n0:07:24\tSPEAKER_01\n So, I think it should give you some sort of an oral cue and of course I never want to replace the battery.\n\n0:07:30\tSPEAKER_01\n So, those are my preferences and that's my presentation.\n\n0:07:34\tSPEAKER_03\n Let me interrupt you. If you can add other facilities, other future like, unbreakable.\n\n0:07:41\tSPEAKER_03\n Yes.\n\n0:07:42\tSPEAKER_03\n Because especially today you know, you have the family and the kids, the kids throughout and they play with the remote.\n\n0:07:50\tSPEAKER_03\n Run over it with the car.\n\n0:07:51\tSPEAKER_03\n Yes.\n\n0:07:52\tSPEAKER_03\n Okay, so if you can add the future for your fabric whatever in your outline design with unbreakable.\n\n0:08:00\tSPEAKER_03\n I think that will give a lot of advantage for our product.\n\n0:08:04\tSPEAKER_03\n Good idea.\n\n0:08:05\tSPEAKER_01\n Good idea.\n\n0:08:06\tSPEAKER_01\n I'll, I'll, I'll, I'll, I'll, you can add it in that.\n\n0:08:08\tSPEAKER_01\n Yes.\n\n0:08:09\tSPEAKER_01\n Okay.\n\n0:08:10\tSPEAKER_03\n Okay. Thank you, Christine.\n\n0:08:21\tSPEAKER_03\n And any questions or clarifications or any discussion on the functional design?\n\n0:08:30\tSPEAKER_02\n Do you have any preconceived ideas in terms of materials?\n\n0:08:36\tSPEAKER_02\n Because for example, in the unbreakable thing doing something plastic would be harder where it's having something like, I know, steal our titanium.\n\n0:08:45\tSPEAKER_02\n It's not titanium, it's economically viable.\n\n0:08:49\tSPEAKER_01\n Be heavy too.\n\n0:08:50\tSPEAKER_01\n Yeah.\n\n0:08:51\tSPEAKER_01\n No, I haven't really, I want to feedback.\n\n0:08:56\tSPEAKER_01\n I think we need to rate rank these.\n\n0:08:58\tSPEAKER_01\n Yeah.\n\n0:08:59\tSPEAKER_01\n But we'll see what your personal preferences are in your thoughts.\n\n0:09:01\tSPEAKER_02\n No, I was wondering whether that you had any.\n\n0:09:04\tSPEAKER_01\n I like titanium. It's light.\n\n0:09:06\tSPEAKER_01\n Yeah.\n\n0:09:07\tSPEAKER_02\n Expensive.\n\n0:09:08\tSPEAKER_02\n Yeah.\n\n0:09:09\tSPEAKER_01\n Marketing comes from the process.\n\n0:09:11\tSPEAKER_01\n Who said we were, you know, nobody told me how much what our financial objective is.\n\n0:09:15\tSPEAKER_01\n So, I'm.\n\n0:09:16\tSPEAKER_01\n Yeah.\n\n0:09:17\tSPEAKER_01\n It'd be hard to inflate something and made out titanium.\n\n0:09:20\tSPEAKER_03\n Yeah, the, I'm sorry because the last meeting we supposed to discuss about the financial thing.\n\n0:09:25\tSPEAKER_03\n Let me go quickly.\n\n0:09:26\tSPEAKER_03\n Maybe if I can go back.\n\n0:09:28\tSPEAKER_03\n I know what a project plan and the budget.\n\n0:09:33\tSPEAKER_03\n So, I can close this until.\n\n0:09:39\tSPEAKER_03\n I'm closing there.\n\n0:09:42\tNone\n Okay.\n\n0:10:10\tNone\n So, let me see where this file.\n\n0:10:17\tSPEAKER_03\n That's Christine's.\n\n0:10:24\tSPEAKER_00\n This is Christine.\n\n0:10:51\tSPEAKER_03\n That's mine.\n\n0:10:58\tSPEAKER_00\n I think we're.\n\n0:11:01\tSPEAKER_00\n I will say you may.\n\n0:11:02\tSPEAKER_03\n Okay.\n\n0:11:03\tSPEAKER_03\n The project may be the project.\n\n0:11:05\tSPEAKER_03\n A. Okay.\n\n0:11:06\tSPEAKER_03\n Or the end of the day.\n\n0:11:07\tSPEAKER_03\n The company wants to make at least the 50 million euro.\n\n0:11:12\tSPEAKER_03\n Okay.\n\n0:11:13\tSPEAKER_03\n And of course, the price will be very reasonable on the sale side.\n\n0:11:18\tSPEAKER_03\n Okay. That may be you.\n\n0:11:21\tSPEAKER_03\n They will talk to you about how much of the price and what's the, how much it's cost for the manufacturing and how much it's going to be.\n\n0:11:26\tSPEAKER_03\n We sell in the market.\n\n0:11:28\tSPEAKER_03\n Okay.\n\n0:11:29\tSPEAKER_03\n Then you can come back with your feedback.\n\n0:11:31\tSPEAKER_03\n And I have one maybe the suggestion or opinion.\n\n0:11:35\tSPEAKER_03\n This remote control.\n\n0:11:36\tSPEAKER_03\n Okay.\n\n0:11:37\tSPEAKER_03\n It can be for like a universal to use for any TV.\n\n0:11:42\tSPEAKER_03\n Okay.\n\n0:11:43\tSPEAKER_03\n And it will be slip.\n\n0:11:45\tSPEAKER_03\n Okay.\n\n0:11:46\tSPEAKER_03\n Not fat.\n\n0:11:48\tSPEAKER_03\n Not fat.\n\n0:11:49\tSPEAKER_01\n Not fat.\n\n0:11:52\tSPEAKER_01\n It might be hard to find them.\n\n0:11:55\tSPEAKER_03\n But let's try it.\n\n0:11:56\tSPEAKER_03\n Okay.\n\n0:11:57\tSPEAKER_03\n Okay.\n\n0:11:58\tSPEAKER_03\n With the different the designs.\n\n0:11:59\tSPEAKER_03\n Okay.\n\n0:12:00\tSPEAKER_03\n The functional designs.\n\n0:12:01\tSPEAKER_03\n Okay.\n\n0:12:02\tSPEAKER_03\n So any other questions?\n\n0:12:05\tSPEAKER_00\n From her side, I don't think there's too many more questions.\n\n0:12:09\tSPEAKER_00\n Okay.\n\n0:12:10\tSPEAKER_03\n Thank you, Christine.\n\n0:12:11\tSPEAKER_03\n For time being.\n\n0:12:12\tSPEAKER_03\n So then.\n\n0:12:14\tSPEAKER_03\n Okay.\n\n0:12:16\tSPEAKER_00\n From the marketing side, just to give an idea what the management is looking for.\n\n0:12:21\tSPEAKER_00\n They're looking for a remote control to have a.\n\n0:12:27\tSPEAKER_00\n I have a sales price of 25 euro.\n\n0:12:31\tSPEAKER_00\n With a production price of a 12 and a half euro.\n\n0:12:37\tSPEAKER_00\n For what?\n\n0:12:38\tSPEAKER_00\n I think for what we're trying to find which one we're looking for.\n\n0:12:41\tSPEAKER_00\n I don't think that price is exactly in the market.\n\n0:12:45\tSPEAKER_00\n Okay.\n\n0:12:46\tSPEAKER_00\n I'll explain myself here now in a sense that in a in the recent surveys.\n\n0:12:53\tSPEAKER_00\n From the ages from 15 to 35 80 percent are willing to spend more money for something as fancy as trendy.\n\n0:13:00\tSPEAKER_00\n 25 euros.\n\n0:13:02\tSPEAKER_00\n That's a pretty reasonable price.\n\n0:13:04\tSPEAKER_00\n That's a market price right now.\n\n0:13:06\tSPEAKER_00\n Now if we're going to take a risk.\n\n0:13:08\tSPEAKER_00\n And push this up a bit, make it more expensive.\n\n0:13:11\tSPEAKER_00\n But give them added things that they don't have now.\n\n0:13:14\tSPEAKER_00\n Yep.\n\n0:13:15\tSPEAKER_00\n Then it could possibly sell.\n\n0:13:16\tSPEAKER_00\n Obviously the risk is there.\n\n0:13:18\tSPEAKER_00\n Too expensive.\n\n0:13:19\tSPEAKER_00\n They're not going to buy.\n\n0:13:20\tSPEAKER_00\n But I think there's one other thing interesting.\n\n0:13:24\tSPEAKER_00\n Two things that are interesting.\n\n0:13:26\tSPEAKER_00\n Is that from the 15 to 35 year old group, which always spends more money on trendy new things.\n\n0:13:33\tSPEAKER_00\n Speech recognition is requested.\n\n0:13:36\tSPEAKER_00\n We're talking between 75 to 90 percent of this group is willing to pay for a speech recognition on a remote.\n\n0:13:45\tSPEAKER_00\n Obviously we can't make a remote into a computer, but maybe simple commands.\n\n0:13:50\tSPEAKER_00\n I don't know.\n\n0:13:51\tSPEAKER_00\n The louder, softer, on, off.\n\n0:13:56\tSPEAKER_00\n That might be a possibility, even though a customer to be the first on the market to produce this.\n\n0:14:02\tSPEAKER_00\n 35 percent say they're too difficult to use.\n\n0:14:06\tSPEAKER_00\n So we have to figure out a way of making it more user friendly.\n\n0:14:10\tSPEAKER_00\n 50 percent say they can't find the remote half of the time.\n\n0:14:15\tSPEAKER_00\n So maybe one word speech recognition command say remote.\n\n0:14:19\tSPEAKER_00\n And there's a BB beep and they can find it through ten tons of newspapers, magazines, whatever you have at home.\n\n0:14:26\tSPEAKER_00\n But in the cost that the management is looking for, that's not going to be possible.\n\n0:14:31\tSPEAKER_00\n But if it's trendy, if it's fancy, it's got some color to it.\n\n0:14:34\tSPEAKER_00\n It's very easy to use.\n\n0:14:36\tSPEAKER_00\n If it's got simple remote speech remote control, like I said, louder, softer, change channel, on, off.\n\n0:14:45\tSPEAKER_00\n Remote and it goes BB beep.\n\n0:14:46\tSPEAKER_00\n I can find my remote without spending half a day looking for it and getting all upset because I can't turn the TV on.\n\n0:14:52\tSPEAKER_00\n So we have to look at it in this global idea with the ideas of the industrial design.\n\n0:15:00\tSPEAKER_00\n But price obviously we have to talk about.\n\n0:15:03\tSPEAKER_03\n Yeah.\n\n0:15:04\tSPEAKER_03\n So what do you think about the design statistic?\n\n0:15:09\tSPEAKER_03\n Do you think you can make it or?\n\n0:15:14\tSPEAKER_01\n I'm sorry.\n\n0:15:16\tSPEAKER_03\n What do you think about the design, what he was talking about?\n\n0:15:21\tSPEAKER_03\n Speech recognition.\n\n0:15:23\tSPEAKER_01\n Well, training is always an issue with commands.\n\n0:15:31\tSPEAKER_01\n So we can perhaps do it if the user is willing to spend some time in the training process, it could reduce the overall cost.\n\n0:15:50\tSPEAKER_01\n Not sure how.\n\n0:15:52\tSPEAKER_01\n But anyway, I think also that this might impact the battery life.\n\n0:16:01\tSPEAKER_01\n And so maybe what we'll have to do is add something where you can recharge it wirelessly.\n\n0:16:13\tSPEAKER_01\n So that you know, send power to it.\n\n0:16:17\tSPEAKER_01\n Or maybe set it out in the sun and it gets from the light, a solar cell inside there so that you have enough juice to do all these fancy things.\n\n0:16:31\tSPEAKER_02\n It seems also like with the speech recognition, yeah, it's a great feature, but if you're watching TV, there's a lot of ambient sound and it's words.\n\n0:16:39\tSPEAKER_02\n It's not just noise is like something hitting.\n\n0:16:42\tSPEAKER_02\n It's actual speech, so then you have to make sure that the speech recognizer is good enough to filter out the TV speech and the user speech.\n\n0:16:52\tSPEAKER_02\n Otherwise, you can say remote.\n\n0:16:54\tSPEAKER_02\n But if someone on the screen is saying the same thing, all of a sudden you have someone in a movie saying off and your screen dies because they've triggered the remote control and it's turned off your TV.\n\n0:17:05\tSPEAKER_02\n So I think if we can find a speech recognizer that can handle those types of problems, then yeah, if you're a really good marketing gimmick, but I think we seriously need to consider how that would impact the situation.\n\n0:17:19\tSPEAKER_02\n Very good point.\n\n0:17:21\tSPEAKER_00\n Well, with speech recognition, I'm not that good at that idea, but if it's a one word recognition, because I know with telephones and cars and things, I've seen it in the States, a guy friend of mine says, call mom and it calls up mom.\n\n0:17:39\tSPEAKER_00\n The radio can be on and everything, because I think with speech recognition, if the remote or like the telephone, it has exact word that it has to hear.\n\n0:17:51\tSPEAKER_00\n I don't think it would come through a sentence on a television.\n\n0:17:54\tSPEAKER_00\n If somebody's speaking on the television, they're not going to stop and say, remote.\n\n0:17:59\tSPEAKER_00\n So I think that something could be designed to recognize single word. Like the great idea if we can design it.\n\n0:18:08\tSPEAKER_00\n This is years ago in the United States, we're driving down and he's called home on the telephone called immediately.\n\n0:18:13\tSPEAKER_00\n So that's kind of cute.\n\n0:18:17\tSPEAKER_03\n What I can suggest you, Christian, if you need some technical feedback or some training about this facility, especially for the speech recognition, I can recommend you some companies like Inter or IBM, because they're already in this speech recognition part.\n\n0:18:41\tSPEAKER_03\n You can maybe have some technical backup from them, some kind of technical tie up.\n\n0:18:48\tSPEAKER_03\n If you want, I can coordinate to get some information.\n\n0:18:53\tSPEAKER_03\n You can let me know.\n\n0:18:55\tSPEAKER_03\n So what kind of details you require to add this future in this project? I don't think it's the difficult.\n\n0:19:13\tSPEAKER_03\n We need to know how much is the time frame you need to download, apart from what you have today.\n\n0:19:21\tSPEAKER_01\n Okay, we'll find that out.\n\n0:19:25\tSPEAKER_00\n From your side, you're going to have to go back to management and be more precise. What do they want?\n\n0:19:32\tSPEAKER_00\n A risk, take a risk on the market, something that's going to cost more, but could very easily make a boom in the market.\n\n0:19:39\tSPEAKER_00\n Because it has to be something totally different, it has to be totally new, something that nobody has right now.\n\n0:19:45\tSPEAKER_03\n It's going to cost. But end of the day, you're the sales guy. So I will come back and sit on your head because you're going to do your sales position.\n\n0:19:54\tSPEAKER_03\n Of course, it's good to tell the management how much it's cost is and how much you're going to benefit.\n\n0:20:01\tSPEAKER_03\n So I don't mind to convey the management to spend some more money on the project, if you can make out of it.\n\n0:20:11\tSPEAKER_03\n Obviously, the money from the bottom line is positive.\n\n0:20:15\tSPEAKER_03\n I don't mind to convince the management. The management says, they don't want certain facilities, which it's already world.\n\n0:20:24\tSPEAKER_03\n They want something new. I think a speech recognition, definitely they're likely.\n\n0:20:29\tSPEAKER_03\n I don't think they say no for that. I hope I can convince the management on that.\n\n0:20:36\tSPEAKER_03\n So if you have any new ideas, you can always come up and tell me if you need any special coordination between any technical companies which you can hide the technology backup for your functional design or technical design.\n\n0:20:55\tSPEAKER_03\n Then I'm ready to do that. And what's your comments about?\n\n0:21:07\tSPEAKER_02\n Well, I mean, maybe if I go through my presentation, you can sort of see what the user perspective is and how it ties into the other two comments.\n\n0:21:15\tSPEAKER_03\n So you finish it so I can handle to a technique.\n\n0:21:27\tSPEAKER_03\n Where are you here? Participant 3.\n\n0:21:37\tSPEAKER_02\n No, you're in trouble.\n\n0:21:47\tSPEAKER_02\n Okay. So it would be hard.\n\n0:22:08\tSPEAKER_02\n Okay. So basically the method that we usually use in user interface design is that we need to look at what people don't like about existing products in our case existing remote controls.\n\n0:22:21\tSPEAKER_02\n And then what the good ideas are and what the bad ideas are and why they're bad and good, which isn't always as obvious.\n\n0:22:27\tSPEAKER_02\n We seem to have intuitions about why things are good or things are bad, but when you look technically at how it works, sometimes that's not the case.\n\n0:22:36\tSPEAKER_02\n Then we need to decide what functionalities we really want to keep because that'll feed into both ed's work and Christine's work.\n\n0:22:44\tSPEAKER_02\n And then what the remote control should look like obviously once we've got a good idea of what the functionalities are.\n\n0:22:51\tSPEAKER_02\n So in terms of the functionalities that we need, you obviously need to be able to turn the TV on and off.\n\n0:22:55\tSPEAKER_02\n You need to change channels both by directly going to a specific channel or by channel surfing.\n\n0:23:00\tSPEAKER_02\n You need to be able to control the volume and then control any menus on the TV to regulate contrast or whatever.\n\n0:23:12\tSPEAKER_02\n So the problems that people have expressed is that there's too many buttons on remote controls in general.\n\n0:23:17\tSPEAKER_02\n The buttons it's not clear what they're supposed to do.\n\n0:23:21\tSPEAKER_02\n Often you need to know specific button sequences to get certain functionalities done, which you don't necessarily always remember, especially if it's a functionality that you don't use very often.\n\n0:23:33\tSPEAKER_02\n And that the buttons are too small.\n\n0:23:36\tSPEAKER_02\n So here we've got two examples where here on the left hand side you can see a remote control that has lots and lots of buttons.\n\n0:23:45\tSPEAKER_02\n And a lot of cases are tiny. They're hard to see. And okay, they're labeled, but the labels don't necessarily tell you too much.\n\n0:23:54\tSPEAKER_02\n Whereas on the other side you have a much simpler remote control that I think basically has the minimum functionalities that are needed.\n\n0:24:03\tSPEAKER_02\n And it sort of looks simpler and just less imposing when you first look at it.\n\n0:24:08\tSPEAKER_02\n So I would be inclined to go sort of towards this in terms of design rather than this. And if there's specific functionalities that require more buttons, then we can figure out how to do it with existing buttons.\n\n0:24:21\tSPEAKER_02\n So my personal preferences are to keep the number of buttons to limit or to a minimum, sorry, make frequently used buttons bigger and more strategically placed.\n\n0:24:30\tSPEAKER_02\n So like the on button being really obvious when the channel changing and the volume and to keep the design basically sleek and simple, which I think ties into what Christina and Ed have both said fairly reasonably.\n\n0:24:46\tSPEAKER_02\n So that's pretty much it.\n\n0:24:50\tSPEAKER_02\n I don't know if you guys have any questions or.\n\n0:24:58\tSPEAKER_01\n It seems very understandable clearly your research in an hours, heading in the same direction.\n\n0:25:08\tSPEAKER_01\n And the only thing that I saw missing from your research that we found was this ability to find the dog on thing when you need it.\n\n0:25:21\tSPEAKER_01\n So that's true. So you know, but that's okay. That's why we're all here at the table. So that if we think of it and our research should indicate certain things and.\n\n0:25:30\tSPEAKER_01\n Yeah, it's complimentary.\n\n0:25:32\tSPEAKER_01\n I also think that.\n\n0:25:36\tSPEAKER_01\n The the the feel of it is when you hold it is something that was expressed more in in in my design.\n\n0:25:51\tSPEAKER_01\n And that's logical and normal because those are the parameters that industrial designers more thinking about the look in the field.\n\n0:25:59\tSPEAKER_02\n And that's definitely a very important factor, especially to use or you're going to be buying the thing and I'm using it almost on a daily basis in a lot of cases, I think.\n\n0:26:11\tSPEAKER_01\n Okay, so I don't have any questions. Sounds good.\n\n0:26:15\tSPEAKER_03\n So anybody need any help for time being on this subject. So please come back to me and Christian, maybe I can try to help you to get some the technical.\n\n0:26:30\tSPEAKER_03\n The companies to help you for make a design slim.\n\n0:26:34\tSPEAKER_03\n Okay, and to add some futures like what we're talking about the speech recognition at all.\n\n0:26:40\tSPEAKER_02\n Should we maybe make a decision about what features we actually want to include because we throw in a lot of features onto the table, but.\n\n0:26:47\tSPEAKER_02\n Do we actually want to incorporate all of them or.\n\n0:26:52\tSPEAKER_01\n Have we missed anything? Do you want to go back and look at the closing slide? Maybe that would provide some guidance.\n\n0:26:58\tSPEAKER_01\n Sure.\n\n0:27:13\tSPEAKER_01\n Doesn't really tell us.\n\n0:27:15\tSPEAKER_03\n Not a lady.\n\n0:27:17\tSPEAKER_01\n Well, it says individual actions. It says user, so I'm supposed to do the components concept. Supposed to work on the user interface concept and you're supposed to keep watching the trends.\n\n0:27:31\tSPEAKER_01\n And specific instructions will be sent by our coach.\n\n0:27:35\tSPEAKER_01\n I think we should do as many features as start with all of them right now and eliminate them later in the process. That's my suggestion.\n\n0:27:45\tSPEAKER_03\n Okay, that would be great.\n\n0:27:48\tSPEAKER_03\n And I'll send you the minutes of.\n\n0:27:50\tSPEAKER_02\n You can object if you want.\n\n0:27:52\tSPEAKER_02\n No, I'm just thinking in terms of time.\n\n0:27:54\tSPEAKER_02\n I'm just.\n\n0:27:55\tSPEAKER_00\n Yes, now I'm objecting.\n\n0:27:57\tSPEAKER_02\n No, I mean, I was just thinking is it really practical to start designing something with features that we're just going to end up throwing away?\n\n0:28:04\tSPEAKER_02\n I mean, it takes a lot of time and effort for everyone to consider different features.\n\n0:28:13\tSPEAKER_02\n And if we spend that time and effort on features that we're not going to use, maybe it's better to spend it on the thinking more about features that we actually do want.\n\n0:28:23\tSPEAKER_01\n I don't get it.\n\n0:28:24\tNone\n We get it.\n\n0:28:24\tSPEAKER_01\n I'm for after the meeting because our meeting time has run out.\n\n0:28:27\tSPEAKER_01\n Somebody else has got to use this room and you know, we can't hang out here.\n\n0:28:30\tSPEAKER_01\n Yeah, talk about this.\n\n0:28:31\tSPEAKER_03\n So.\n\n0:28:32\tSPEAKER_03\n Okay, what will this love will take for lunch break?\n\n0:28:34\tSPEAKER_03\n Okay, then we can discuss further more.\n\n0:28:37\tSPEAKER_03\n Okay, with our ideas and then we will come back again in the next meeting.\n\n0:28:41\tSPEAKER_03\n So thanks for coming and I'll send you minutes of meeting and please put your all information in the sharing folder so everybody can share the information.\n\n0:28:51\tSPEAKER_03\n Okay, so let's go for lunch time.\n\n0:28:54\tSPEAKER_03\n Agreed.\n\n0:28:55\tSPEAKER_02\n Agreed.\n\n0:29:12\tNone\n Okay.\n\n", "summary": [{"summary_text": "The meeting is about the functional design meeting. Speaker is doing the project management and secretary both to take the minutes of the meeting and to discuss the various subjects. The meeting is closing and the meeting time will be 40 minutes. Speaker has come up with management and come with the new proposal. "}]}