{"filename": "./data/IS1005a.txt", "transcript": "0:00:30\tSPEAKER_00\n Okay, I'll go for the body.\n\n0:00:59\tSPEAKER_00\n I guess you all know what is it about? You all received the email, I guess. We are actually doing this meeting to start a new project, which is about designing remote control. So I'm going to be the project manager of this project and so I'm present myself. I'm Fabian Cardino and I guess you can present yourself.\n\n0:01:28\tSPEAKER_02\n I don't know you can start. Okay, so my name is Petre Fossik, you can call me Petre here or Peter if you like. My name is Bob Marseille.\n\n0:01:39\tSPEAKER_02\n In the project, I'm supposed to be the technique. So my name is Bob Marseille.\n\n0:01:47\tSPEAKER_03\n I'm the marketing expert for this project. Bob.\n\n0:01:51\tSPEAKER_01\n Okay, my name is Hamid Ketabdar and I'm going to be an interface designer in this project.\n\n0:02:03\tSPEAKER_00\n Okay. So today we are doing a short meeting to present the project. So we are going to present the tool we are going to use during all this project. We are talking about the project plan and we are going to discuss about our first ideas and so on. So we have around 25 minutes to do this meeting. So what is the goal of this project is to design a new remote control. So it should be of course new and original and it should be 20 and user friendly.\n\n0:02:55\tSPEAKER_00\n That means it's a very challenging project and so we will try to do our best and hopefully come with something very new and that people want to buy. So what are we going to do during this project? So it's small like we are going to do individual work or in our specialities and we are going to meet each other quite often to discuss and to find a good way.\n\n0:03:43\tSPEAKER_00\n Yeah and everything will be like this. So now we are going to get used to the tools. We are going to use all during all this project. So we can try to use the whiteboard here. So for example we can try to write what is our favorite animal and writes of our favorite characteristics about it.\n\n0:04:34\tSPEAKER_00\n So So I will ask you all to do the same, just to get used to the white box.\n\n0:05:16\tSPEAKER_02\n So I'm probably trying to draw the animal.\n\n0:05:21\tSPEAKER_02\n Well, you should have drawn the picture of the animal.\n\n0:05:24\tSPEAKER_02\n Yeah, yeah, yeah, go ahead.\n\n0:05:28\tSPEAKER_02\n Okay, so...\n\n0:05:42\tSPEAKER_02\n Okay, American.\n\n0:05:47\tSPEAKER_02\n How would you use the bird?\n\n0:05:54\tSPEAKER_02\n So I tried to sketch it out.\n\n0:05:59\tSPEAKER_02\n I had to first write it down because I'm not absolutely sure if I can draw it but...\n\n0:06:08\tSPEAKER_02\n Oh.\n\n0:06:11\tSPEAKER_02\n Can you recognize it?\n\n0:06:16\tSPEAKER_02\n Okay, go turn.\n\n0:06:19\tNone\n So I think my favorite animal would be a cat.\n\n0:06:26\tSPEAKER_03\n Oh.\n\n0:06:48\tSPEAKER_03\n That's it's head.\n\n0:06:50\tSPEAKER_03\n I probably like cats the most because they're cuddly and furry and playful.\n\n0:06:57\tSPEAKER_01\n Okay.\n\n0:07:02\tSPEAKER_01\n The noise probably should go in the upstairs.\n\n0:07:09\tSPEAKER_04\n I'm sorry.\n\n0:07:12\tSPEAKER_03\n I'm sorry.\n\n0:07:13\tSPEAKER_03\n Maybe put it on the desk or something.\n\n0:07:20\tSPEAKER_02\n Yeah.\n\n0:07:23\tSPEAKER_02\n I should get used to the tools.\n\n0:07:28\tSPEAKER_02\n Just wait a little bit.\n\n0:07:31\tSPEAKER_02\n Could we put it here?\n\n0:07:35\tSPEAKER_01\n I probably need to find a way to explain this.\n\n0:07:40\tSPEAKER_03\n You're a pale marker, thanks for a laugh.\n\n0:07:47\tSPEAKER_02\n Are you left handed?\n\n0:07:48\tSPEAKER_01\n Nope.\n\n0:07:50\tSPEAKER_01\n Okay.\n\n0:07:51\tSPEAKER_01\n Should I clean?\n\n0:07:56\tSPEAKER_01\n Okay, I think like horses because they are strung and beautiful.\n\n0:08:05\tSPEAKER_01\n So if I want to write it here...\n\n0:08:12\tSPEAKER_04\n I think I can...\n\n0:08:17\tSPEAKER_02\n Maybe it's better if you leave it.\n\n0:08:20\tSPEAKER_03\n Yeah, maybe we should just continue.\n\n0:08:23\tSPEAKER_03\n Yeah, I don't worry about it.\n\n0:08:27\tNone\n Oh, no.\n\n0:08:34\tNone\n Okay.\n\n0:08:41\tNone\n You can draw it.\n\n0:08:48\tNone\n I don't know if I can.\n\n0:08:55\tNone\n Okay.\n\n0:08:58\tSPEAKER_02\n You can draw it.\n\n0:09:03\tSPEAKER_02\n I don't know if I can.\n\n0:09:06\tSPEAKER_01\n Just try it.\n\n0:09:09\tSPEAKER_01\n It may be like a color.\n\n0:09:15\tSPEAKER_01\n I'm not good, very good in drawing.\n\n0:09:20\tSPEAKER_01\n So this is very...\n\n0:09:22\tSPEAKER_01\n It's a bird, I think.\n\n0:09:24\tSPEAKER_01\n I don't know what is it.\n\n0:09:26\tSPEAKER_02\n I think it's clean.\n\n0:09:32\tSPEAKER_01\n It's good.\n\n0:09:39\tSPEAKER_01\n Okay.\n\n0:09:46\tSPEAKER_01\n Yeah.\n\n0:09:47\tSPEAKER_01\n I'm shameful.\n\n0:09:49\tSPEAKER_01\n It's okay.\n\n0:09:50\tSPEAKER_02\n It's good.\n\n0:09:51\tSPEAKER_02\n It's in the beautiful.\n\n0:09:52\tSPEAKER_03\n I'm strong.\n\n0:09:56\tSPEAKER_01\n Okay.\n\n0:10:01\tSPEAKER_02\n I'm not strong enough.\n\n0:10:08\tSPEAKER_00\n So good.\n\n0:10:12\tSPEAKER_00\n So let's talk about Monet.\n\n0:10:15\tSPEAKER_00\n We are going to sell...\n\n0:10:18\tSPEAKER_00\n We want to sell this remote control for 25 euros.\n\n0:10:25\tSPEAKER_00\n And our expected profit will be around 50 million euros.\n\n0:10:34\tSPEAKER_00\n And we are trying to have a market all around the world.\n\n0:10:42\tSPEAKER_00\n So notice not only for Switzerland, but for the world.\n\n0:10:49\tSPEAKER_00\n So we expect a production cost of maximum 12.50 euros.\n\n0:11:03\tSPEAKER_02\n Per unit, I guess.\n\n0:11:05\tSPEAKER_00\n Yeah, of course.\n\n0:11:12\tSPEAKER_00\n So we can start today to have a first idea of what we want to do, what are our experiments with remote control and any idea.\n\n0:11:21\tSPEAKER_00\n So if you have some experience good or bad with remote control, you can share it and say what is your idea or anything.\n\n0:11:34\tSPEAKER_03\n Well, from experience, I've had remote controls in the past that I've had lots and lots of buttons and they've been very small.\n\n0:11:44\tSPEAKER_03\n And it's been very hard to use because there's so many buttons.\n\n0:11:49\tSPEAKER_03\n And it's very hard to see which buttons do what.\n\n0:11:53\tSPEAKER_03\n And the buttons are very small and very hard to press.\n\n0:11:57\tSPEAKER_03\n And normally you only ever use...\n\n0:11:59\tSPEAKER_03\n On a TV remote, you only ever use mostly four or six buttons.\n\n0:12:09\tSPEAKER_03\n So it's frustrated me in the past.\n\n0:12:14\tSPEAKER_02\n Okay, I have also some points, maybe two points.\n\n0:12:18\tSPEAKER_02\n First would be that in current remote control, there's no big light.\n\n0:12:23\tSPEAKER_02\n So if you're playing with this in the dark room, it's probably worse to have something like a big light.\n\n0:12:34\tSPEAKER_02\n And maybe it could be also dependent on the amount of light in the room.\n\n0:12:41\tSPEAKER_02\n So that if it's in the day, it doesn't need to be big light.\n\n0:12:45\tSPEAKER_02\n It's because it works on the battery.\n\n0:12:48\tSPEAKER_02\n So something like this.\n\n0:12:49\tSPEAKER_02\n And the second thing, the second point for me, would be that in normal remote controls, there are two buttons for volume control.\n\n0:12:59\tSPEAKER_02\n But I prefer like a potentiometer or something like...\n\n0:13:03\tSPEAKER_03\n Ah, okay.\n\n0:13:04\tSPEAKER_02\n You know, some slider.\n\n0:13:06\tSPEAKER_02\n Not just two discrete buttons for volume, but something which...\n\n0:13:11\tSPEAKER_03\n Is that because of the discrete volume levels?\n\n0:13:16\tSPEAKER_02\n Yeah, but I can reach in a one second, I can mute it down.\n\n0:13:20\tSPEAKER_00\n I'm not afraid that if you take your remote control, you can move the slide and the volume can grow very quickly.\n\n0:13:30\tSPEAKER_02\n If it drops to the floor, then it passes through.\n\n0:13:33\tSPEAKER_00\n Yeah, when you take the remote control, for example, on the table, you take it and you push the button and everything is very loud.\n\n0:13:42\tSPEAKER_02\n You have a loud sound.\n\n0:13:44\tSPEAKER_02\n It depends what you feel about that.\n\n0:13:48\tSPEAKER_02\n Okay.\n\n0:13:52\tSPEAKER_02\n Yeah, we can think of these things afterwards, but if matter, you have some loud sound.\n\n0:14:00\tSPEAKER_01\n Yeah, just a simple experience.\n\n0:14:03\tSPEAKER_01\n I prefer remote control working with radio waves because remote control working with infrared wave, you should keep it in a specific direction and then try it...\n\n0:14:16\tSPEAKER_01\n Without a few corners.\n\n0:14:18\tSPEAKER_04\n Okay.\n\n0:14:25\tSPEAKER_00\n Let's continue.\n\n0:14:27\tSPEAKER_00\n I have a meeting in five minutes, so...\n\n0:14:29\tSPEAKER_00\n Okay, you should hurry.\n\n0:14:31\tSPEAKER_00\n Okay.\n\n0:14:34\tSPEAKER_00\n So, we will close this meeting.\n\n0:14:37\tSPEAKER_00\n So, we will have a next meeting in 30 minutes.\n\n0:14:49\tSPEAKER_00\n So, I will ask you to do some work.\n\n0:14:53\tSPEAKER_00\n The interface developer will work on the design of the remote control and start to have new ID.\n\n0:15:04\tSPEAKER_02\n Which is how met with the bug case?\n\n0:15:06\tSPEAKER_03\n Is the industrial designer?\n\n0:15:08\tSPEAKER_02\n No, you are the industrial designer.\n\n0:15:10\tSPEAKER_03\n I am the technical designer.\n\n0:15:12\tSPEAKER_03\n Yeah, I think that's the first deal.\n\n0:15:14\tSPEAKER_03\n The ID, industrial designer.\n\n0:15:16\tSPEAKER_02\n And the second one is the user interface designer.\n\n0:15:19\tSPEAKER_03\n And then the last one is marketing, which is me.\n\n0:15:22\tSPEAKER_00\n So, for the user interface designer, which is a met, you are going to work on the technical functions of the remote control.\n\n0:15:37\tSPEAKER_00\n And for the marketing manager, which is Bob, you are going to try to find the user requirements for the remote control.\n\n0:16:00\tSPEAKER_00\n You will receive by email the specific instructions and by your personal coach.\n\n0:16:15\tSPEAKER_00\n So, I see you in 30 minutes.\n\n0:16:18\tSPEAKER_00\n Great, okay.\n\n0:16:19\tSPEAKER_00\n Thanks guys.\n\n0:16:21\tSPEAKER_00\n Bye.\n\n0:16:22\tSPEAKER_00\n Let's go back to the real work.\n\n0:16:48\tNone\n Thank you.\n\n", "summary": [{"summary_text": "Fabian Cardino, Petre Fossik, Bob Marseille, Hamid Ketabdar and Speaker are going to start a new project about designing a new remote control. They have around 25 minutes to present their ideas. Speaker's favorite animal is a cat."}]}