{"filename": "./data/TS3003c.txt", "transcript": "0:00:00\tSPEAKER_03\n Just received a little beep.\n\n0:00:09\tSPEAKER_03\n I don't know what it was.\n\n0:00:14\tNone\n Okay.\n\n0:00:17\tSPEAKER_03\n Not good afternoon.\n\n0:00:22\tSPEAKER_03\n This is our third meeting already.\n\n0:00:27\tSPEAKER_03\n I hope you enjoyed your lunch.\n\n0:00:31\tSPEAKER_03\n I did.\n\n0:00:34\tSPEAKER_03\n Anyway.\n\n0:00:39\tSPEAKER_03\n Presentation 3.\n\n0:00:43\tSPEAKER_03\n Okay. This is the second phase.\n\n0:00:46\tSPEAKER_03\n We're going to discuss today.\n\n0:00:48\tSPEAKER_03\n That's the conceptual design meeting.\n\n0:00:51\tSPEAKER_03\n And a few points of interest in this meeting are the conceptual specification of components, conceptual specification of design, and also trend-watching.\n\n0:01:07\tSPEAKER_03\n These are hopefully the points you addressed in your presentations.\n\n0:01:13\tSPEAKER_03\n You're going to show me in a few minutes.\n\n0:01:18\tSPEAKER_03\n But first, I'll show you the agenda.\n\n0:01:22\tSPEAKER_03\n First, the opening.\n\n0:01:24\tSPEAKER_03\n Then we have three presentations.\n\n0:01:26\tSPEAKER_03\n After that, we have to come to a decision on remote control concepts.\n\n0:01:31\tSPEAKER_03\n How are we going to make it?\n\n0:01:34\tSPEAKER_03\n And then we're closing.\n\n0:01:36\tSPEAKER_03\n We have about 40 minutes.\n\n0:01:39\tSPEAKER_03\n So I suggest let's get started.\n\n0:01:42\tSPEAKER_03\n Did someone encounter any problems during the preparation?\n\n0:01:49\tSPEAKER_03\n No. Everything fine?\n\n0:01:52\tSPEAKER_03\n That's nice.\n\n0:01:55\tSPEAKER_03\n Then a little thing about the last meeting.\n\n0:02:02\tSPEAKER_03\n These are the points we agreed on.\n\n0:02:05\tSPEAKER_03\n The requirements and the target market.\n\n0:02:08\tSPEAKER_03\n The requirements are data text, docking station, audio signal, small screen, with some extra button information.\n\n0:02:18\tSPEAKER_03\n We're going to use default materials.\n\n0:02:22\tSPEAKER_03\n Does somebody have any comments on these requirements?\n\n0:02:27\tSPEAKER_03\n Maybe.\n\n0:02:28\tSPEAKER_03\n These are just the things we thought of.\n\n0:02:31\tSPEAKER_03\n So maybe if you figured something else or thought of something else, just let me know.\n\n0:02:36\tSPEAKER_03\n Maybe you can work it out.\n\n0:02:38\tSPEAKER_03\n And we're going to target the 62 to 80-year-old customers.\n\n0:02:45\tSPEAKER_03\n So now I've already noticed what we're doing.\n\n0:02:49\tSPEAKER_03\n And I suggest let's get started with presentations.\n\n0:02:55\tSPEAKER_03\n So we keep the same lineup as last time.\n\n0:03:00\tSPEAKER_03\n Sure.\n\n0:03:01\tSPEAKER_03\n Okay.\n\n0:03:02\tSPEAKER_01\n I'll start off then.\n\n0:03:03\tSPEAKER_01\n Okay.\n\n0:03:24\tSPEAKER_01\n I'm going to inform you about the trend watching I've done over the past few days.\n\n0:03:30\tSPEAKER_01\n We've done some market research.\n\n0:03:33\tSPEAKER_01\n We distributed some more UNCAT questionnaires.\n\n0:03:38\tSPEAKER_01\n And besides that, I deployed some trend watchers to Milan and Paris.\n\n0:03:44\tSPEAKER_01\n To, well, get all of the news trends.\n\n0:03:47\tSPEAKER_01\n And I've consulted some additional trend watchers after the original trend watchers return to the market.\n\n0:04:00\tSPEAKER_01\n About what the best design would be.\n\n0:04:03\tSPEAKER_01\n Okay.\n\n0:04:04\tSPEAKER_01\n These are some overall findings.\n\n0:04:08\tSPEAKER_01\n The most important thing is the fancy design.\n\n0:04:12\tSPEAKER_01\n The research indicated that that was by far the most important factor.\n\n0:04:18\tSPEAKER_01\n Inovitiveness was about half as important as the fancy design.\n\n0:04:23\tSPEAKER_01\n This means functions which are not featured in other remote controls.\n\n0:04:29\tSPEAKER_01\n About half as important as the inovitiveness was easy to use.\n\n0:04:38\tSPEAKER_01\n For our group, we're focusing on the people of 60 to 80 years old.\n\n0:04:46\tSPEAKER_01\n This is, these factors are slightly more equal.\n\n0:04:55\tSPEAKER_01\n Okay. These are some more group specific findings.\n\n0:04:58\tSPEAKER_01\n The older people prefer dark colors.\n\n0:05:01\tSPEAKER_01\n They like recognizable shapes.\n\n0:05:04\tSPEAKER_01\n And familiar material and our surveys have indicated that especially wood is pretty much the material for older people.\n\n0:05:17\tSPEAKER_01\n This is, this image will give you a little bit of an impression about the look and feel that the remote you have.\n\n0:05:32\tSPEAKER_01\n This leads us to some personal preferences.\n\n0:05:35\tSPEAKER_01\n The remote control and the docking station should blend in the room.\n\n0:05:43\tSPEAKER_01\n So this would mean no eye catching designs.\n\n0:05:48\tSPEAKER_01\n Just keep it simple.\n\n0:05:52\tSPEAKER_01\n The docking station and the small screen would be our main points of interest because this would be the inovitiveness in the remote control.\n\n0:06:04\tSPEAKER_01\n So this would be very important that we at least include these features.\n\n0:06:11\tSPEAKER_01\n Well, the trend watchers, I consulted, advised that it should be the remote control and the docking station should be telephone shaped.\n\n0:06:19\tSPEAKER_01\n So you could imagine that the remote control will be standing up straight in the docking station.\n\n0:06:25\tSPEAKER_01\n This is not really, this is pretty much a new shape to older people.\n\n0:06:31\tSPEAKER_01\n So they would prefer a design where the remote control just lies flat in the docking station.\n\n0:06:39\tSPEAKER_01\n So it would be kind of more telephone shaped.\n\n0:06:43\tSPEAKER_01\n Besides that, we would advise to bring two additions.\n\n0:06:47\tSPEAKER_01\n One with a wood like collar and maybe feel.\n\n0:06:51\tSPEAKER_01\n And one with a gray black collar.\n\n0:06:53\tSPEAKER_01\n The wood like for the more exclusive people.\n\n0:06:58\tSPEAKER_01\n People with more money.\n\n0:07:01\tSPEAKER_01\n The gray black collar for, well, people with less means.\n\n0:07:10\tSPEAKER_01\n That would be all.\n\n0:07:13\tSPEAKER_03\n Okay, thank you.\n\n0:07:15\tSPEAKER_03\n Any questions about the trends?\n\n0:07:22\tSPEAKER_03\n Okay, we're going to the next one.\n\n0:07:29\tSPEAKER_00\n Okay, yeah, this is some of my research about designing of intvates.\n\n0:07:55\tSPEAKER_00\n Last meeting we had about using a few bit.\n\n0:08:03\tSPEAKER_00\n That's what I want to do in our design.\n\n0:08:12\tSPEAKER_00\n Finding a directive way to control the remote control.\n\n0:08:20\tSPEAKER_00\n I found something about speech recognition.\n\n0:08:25\tSPEAKER_00\n Maybe we can use that.\n\n0:08:30\tSPEAKER_00\n And using a little display.\n\n0:08:35\tSPEAKER_00\n Findings.\n\n0:08:38\tSPEAKER_00\n You have just a focus on the primary functions.\n\n0:08:43\tSPEAKER_00\n You can only button the sound for on off shifting up a channel or down shifting ground.\n\n0:08:58\tSPEAKER_00\n We need some new interactive functions which attract people for using it.\n\n0:09:13\tSPEAKER_00\n Like speech recognition and special button for selecting sub titles.\n\n0:09:19\tSPEAKER_00\n Just what we mentioned last meeting.\n\n0:09:24\tSPEAKER_00\n And overall, use a friendly, so using large bitters.\n\n0:09:35\tSPEAKER_00\n It's possible to make a quite cheap system for speech recognition.\n\n0:09:42\tSPEAKER_00\n You can think about when you lost your remote control.\n\n0:09:47\tSPEAKER_00\n You can call it a signal.\n\n0:09:53\tSPEAKER_00\n And for shifting up a channel or for putting out the sound or something, you can just give a sound off.\n\n0:10:11\tSPEAKER_00\n And the television of the sound off.\n\n0:10:20\tSPEAKER_00\n I was thinking about a special button for sub titles.\n\n0:10:25\tSPEAKER_00\n Just one button.\n\n0:10:27\tSPEAKER_00\n To keep it simple.\n\n0:10:30\tSPEAKER_00\n One push on the button.\n\n0:10:34\tSPEAKER_00\n Double push.\n\n0:10:37\tSPEAKER_00\n Double click.\n\n0:10:39\tSPEAKER_00\n You get big sub titles for people.\n\n0:10:46\tSPEAKER_00\n You can read small sub titles.\n\n0:10:53\tSPEAKER_00\n We have to keep in general buttons.\n\n0:10:58\tSPEAKER_00\n The buttons we have to use.\n\n0:11:00\tSPEAKER_00\n The sound is higher and lower.\n\n0:11:03\tSPEAKER_00\n The numbers are 0 to 9.\n\n0:11:09\tSPEAKER_00\n And the general button, one button for shifting down a channel.\n\n0:11:16\tSPEAKER_00\n Also, we want to use a little display for displaying the functions of the buttons.\n\n0:11:27\tSPEAKER_00\n We can build in a function which shows the channel or which the television is on.\n\n0:11:40\tSPEAKER_00\n We can put an off button in this corner.\n\n0:11:59\tSPEAKER_00\n Almost all remote controls are using an off button on that place.\n\n0:12:07\tSPEAKER_00\n So people will recognize the buttons.\n\n0:12:15\tSPEAKER_00\n Display, or just a small display, you can put it on top.\n\n0:12:25\tSPEAKER_00\n It's the most blazer people most often look at.\n\n0:12:34\tSPEAKER_00\n And special button for shifting down a channel.\n\n0:12:41\tSPEAKER_00\n On the top of the button, you can easily shift up or shift down.\n\n0:12:52\tSPEAKER_00\n You can use a little display for the buttons.\n\n0:13:05\tSPEAKER_00\n And overall design, we have to discuss about the form of it.\n\n0:13:15\tSPEAKER_03\n Thank you.\n\n0:13:28\tSPEAKER_02\n Okay.\n\n0:13:51\tSPEAKER_02\n The docking station would become obsolete, so I don't think it's really an option.\n\n0:13:58\tSPEAKER_02\n For the casing, the manufacturing department can deliver a flat casing.\n\n0:14:05\tSPEAKER_02\n Single or double curved casing.\n\n0:14:09\tSPEAKER_02\n It's really up to the design that we're going to use.\n\n0:14:12\tSPEAKER_02\n It doesn't imply any technical restrictions.\n\n0:14:16\tSPEAKER_02\n I thought of that later, a rubber belt like an anti-slip.\n\n0:14:23\tSPEAKER_02\n For the buttons, we can use plastic or rubber.\n\n0:14:26\tSPEAKER_02\n And the chip set.\n\n0:14:28\tSPEAKER_02\n It's as simple here, but it should be advanced because we're using an LCD screen.\n\n0:14:34\tSPEAKER_02\n And as the trend watch presentation showed, people like wood, but it raises the price and it doesn't really fit the image.\n\n0:14:43\tSPEAKER_02\n Unless we would start two product lines.\n\n0:14:47\tSPEAKER_02\n The form should follow function overall.\n\n0:14:51\tSPEAKER_02\n Well, the kinetic energy source is rather fancy, but depends on what we want.\n\n0:14:58\tSPEAKER_02\n I think we should discuss that.\n\n0:15:01\tSPEAKER_02\n For the case, the supplement and the buttons really depends on the designer.\n\n0:15:06\tSPEAKER_02\n And the chip set really should be advanced because otherwise, it would really be a simple remote control.\n\n0:15:15\tSPEAKER_03\n That's it.\n\n0:15:17\tSPEAKER_03\n Thank you.\n\n0:15:20\tSPEAKER_03\n So that brings us to the discussion about our concepts.\n\n0:15:26\tSPEAKER_03\n Okay.\n\n0:15:45\tSPEAKER_03\n So these are the points we have to discuss.\n\n0:15:52\tSPEAKER_03\n First, I think we can talk about the energy source since that's has a pretty big influence on production price and image.\n\n0:16:09\tSPEAKER_03\n So I think first of all, we have to see it is possible to introduce kinetic energy.\n\n0:16:18\tSPEAKER_02\n Yes, there are four options. We could use the basic normal battery, a hand dynamo, but I don't think that's really an option.\n\n0:16:27\tSPEAKER_02\n You don't want to swing before you can watch television.\n\n0:16:31\tSPEAKER_02\n Solar cells, but not every room is very light, so it's not a very good option or the kinetic energy.\n\n0:16:39\tSPEAKER_03\n Yeah.\n\n0:16:41\tSPEAKER_01\n And how exactly does the kinetic energy work?\n\n0:16:44\tSPEAKER_01\n You basically shake your remote and then it powers up.\n\n0:16:49\tSPEAKER_01\n Yeah.\n\n0:16:50\tSPEAKER_01\n Well, personally, I don't think that older people like to shake their remote control before they use it.\n\n0:16:57\tSPEAKER_01\n Yeah, that's true.\n\n0:16:59\tSPEAKER_01\n And besides that, you mentioned it would make the docking station obsolete.\n\n0:17:05\tSPEAKER_01\n And I think our docking station could be one of the marketing issues with which we could get great popularity for a product.\n\n0:17:18\tSPEAKER_00\n Yeah.\n\n0:17:19\tSPEAKER_00\n What's the function?\n\n0:17:21\tSPEAKER_00\n Yeah, for allowing up the batteries.\n\n0:17:24\tSPEAKER_01\n Yeah, you could load up the batteries.\n\n0:17:26\tSPEAKER_01\n You could insert the, find the lost remote control function in there.\n\n0:17:33\tSPEAKER_00\n Okay, but I won't use much energy.\n\n0:17:38\tSPEAKER_00\n I believe just a small display, so I believe it will run on one battery for six months or more.\n\n0:17:50\tSPEAKER_00\n I believe one battery is just enough.\n\n0:17:54\tSPEAKER_03\n Well, I think elderly people just like to have everything in place.\n\n0:18:01\tSPEAKER_03\n And I don't think they like remote just playing everywhere in their rooms.\n\n0:18:07\tSPEAKER_03\n So maybe a docking station will help them give the remote a place.\n\n0:18:12\tSPEAKER_03\n And also what you said, you can introduce a voice recognition by finding back your remote.\n\n0:18:21\tSPEAKER_03\n But I think it's more efficient and cheaper to put it in the docking station.\n\n0:18:29\tSPEAKER_03\n So you have a button on your docking station which you can push and then it starts beeping.\n\n0:18:34\tSPEAKER_00\n Okay.\n\n0:18:36\tSPEAKER_03\n And then we can still use the voice recognition, but maybe then for only the channels.\n\n0:18:43\tSPEAKER_01\n I'm wondering, what will the voice recognition mean for the production price?\n\n0:18:50\tSPEAKER_03\n Yeah, that's a good point.\n\n0:18:52\tSPEAKER_02\n I don't have any informational pricing, so I'll have to ask the manufacturing department.\n\n0:18:57\tSPEAKER_01\n Because in our earlier market research, if you'd allow me to push your flat board, go ahead.\n\n0:19:11\tSPEAKER_01\n So it was open here.\n\n0:19:13\tSPEAKER_01\n We also asked if people would pay more for speed recognition in a remote control.\n\n0:19:23\tSPEAKER_01\n Like you can see here, our target group would not do that.\n\n0:19:28\tSPEAKER_01\n So if that would increase the price for which we're selling our remote control, I would greatly advise not to do it.\n\n0:19:36\tSPEAKER_01\n I think that would be better to insert in our other product that is meant for the younger people.\n\n0:19:45\tSPEAKER_02\n But that would also go for the LCD screen then, I guess.\n\n0:19:49\tSPEAKER_02\n It's a bit higher percentage, but.\n\n0:19:54\tSPEAKER_01\n Well, this is, yeah, but this is here. The question was, would you prefer it?\n\n0:19:59\tSPEAKER_01\n So that doesn't really mean they wouldn't pay extra for it.\n\n0:20:02\tSPEAKER_01\n And on top of that, the LCD screen would help in making the remote control easier to use.\n\n0:20:12\tSPEAKER_01\n Yeah, and I think a voice recognition function would not make the remote control much easier to use.\n\n0:20:18\tSPEAKER_03\n No, I think that's a good point.\n\n0:20:20\tSPEAKER_00\n But it's a rich here about a large LCD display or just a small one we want to use.\n\n0:20:31\tSPEAKER_01\n Well, this was for like an LCD screen like you would have on the most advanced mobile phones.\n\n0:20:38\tSPEAKER_01\n Okay, so pretty large.\n\n0:20:43\tSPEAKER_03\n I personally think the LCD screen we want to use with the extra information, I think nobody has anything against it.\n\n0:20:50\tSPEAKER_03\n Because it's just some extra information and it's easy to ignore as well.\n\n0:20:55\tSPEAKER_03\n So if you don't want to use it, you just don't use it.\n\n0:20:58\tSPEAKER_03\n And, yeah, I think maybe we have to discard the voice recognition because it will increase cost significantly.\n\n0:21:14\tSPEAKER_03\n And I don't think it will be a lot easier to use as well.\n\n0:21:21\tSPEAKER_03\n So that brings us back to the energy if we don't have voice recognition.\n\n0:21:26\tSPEAKER_03\n It will, it won't use a lot of energy to use.\n\n0:21:33\tSPEAKER_03\n So in that case we could use kinetic energy, but I think just a simple battery which you can reload on a docking station is just as good and much cheaper as well.\n\n0:21:45\tSPEAKER_03\n And that's the best choice.\n\n0:21:48\tSPEAKER_03\n Okay, let me just choose for the battery.\n\n0:21:53\tSPEAKER_03\n That brings us to the chip.\n\n0:21:55\tSPEAKER_02\n Well, there isn't any choice there because we're using the display so it's got to be advanced.\n\n0:22:01\tSPEAKER_03\n Okay, that's what's the funst chip.\n\n0:22:10\tSPEAKER_03\n And then we get to the point of the case which brings us a little bit back to the marketing as well.\n\n0:22:22\tSPEAKER_03\n If you want to choose for wood or the black and grey or both.\n\n0:22:30\tSPEAKER_03\n As we saw there is not, wood is a lot more expensive to produce.\n\n0:22:39\tSPEAKER_03\n But I think it will attract elderly people when they have something exclusive which they can show off to their grandkids.\n\n0:22:50\tSPEAKER_03\n They have a new remote control.\n\n0:22:54\tSPEAKER_01\n I think the most important factor there is the wooden collar. So it wouldn't actually have to be wood.\n\n0:23:01\tSPEAKER_01\n Yeah, it's just wood colored.\n\n0:23:06\tSPEAKER_03\n But wood collar was a lot more expensive?\n\n0:23:09\tSPEAKER_02\n I don't know.\n\n0:23:11\tSPEAKER_02\n I'll have to.\n\n0:23:12\tSPEAKER_03\n I think so because it's a lot more difficult to handle and to get in the right shape.\n\n0:23:21\tSPEAKER_00\n Is it possible to make a changeable case?\n\n0:23:27\tSPEAKER_00\n You've got mobile phones.\n\n0:23:32\tSPEAKER_00\n Like Nokia mobile phones.\n\n0:23:35\tSPEAKER_00\n When you can change the case of it.\n\n0:23:38\tSPEAKER_00\n It's the case.\n\n0:23:39\tSPEAKER_00\n Yeah, maybe it's possible.\n\n0:23:41\tSPEAKER_00\n Possibility.\n\n0:23:44\tSPEAKER_00\n You have just to make one standard remote control.\n\n0:23:52\tSPEAKER_03\n You can sell the case.\n\n0:23:55\tSPEAKER_03\n I think that's a very good option.\n\n0:23:58\tSPEAKER_03\n Because then you can advertise as well with the...\n\n0:24:02\tSPEAKER_03\n Give your grandfather a new case for his remote control or whatever.\n\n0:24:08\tSPEAKER_03\n Because it's something extra.\n\n0:24:11\tSPEAKER_03\n And then you can make a new one.\n\n0:24:14\tSPEAKER_03\n And then you can make a new one.\n\n0:24:17\tSPEAKER_03\n And then you can make a new one.\n\n0:24:20\tSPEAKER_03\n And then you can make a new one.\n\n0:24:23\tSPEAKER_01\n And then you can make a new one.\n\n0:24:26\tSPEAKER_01\n We would have to look carefully into the design though.\n\n0:24:29\tSPEAKER_01\n Because we would have to make one control which would fit in with a wooden cover and a plastic cover.\n\n0:24:38\tSPEAKER_01\n Or a original one.\n\n0:24:41\tSPEAKER_03\n Or a standard one.\n\n0:24:44\tSPEAKER_03\n So you should just be designed two different telephones.\n\n0:24:49\tSPEAKER_03\n Or which you can supply remote control.\n\n0:24:53\tSPEAKER_03\n Or which you can apply different case covers.\n\n0:24:56\tSPEAKER_01\n Well, no, I think so.\n\n0:24:59\tSPEAKER_01\n We should then just design one remote.\n\n0:25:03\tSPEAKER_01\n But it would have to be fancy with either a wood cover or a plastic one.\n\n0:25:10\tSPEAKER_01\n Okay.\n\n0:25:11\tSPEAKER_01\n But that shouldn't be too much of a problem.\n\n0:25:14\tSPEAKER_03\n So everybody is okay with the changing covers?\n\n0:25:18\tSPEAKER_03\n That's a good option.\n\n0:25:23\tSPEAKER_03\n Changing case covers.\n\n0:25:26\tSPEAKER_01\n I heard our industrial designer talk about a flat single and double curved.\n\n0:25:30\tSPEAKER_01\n Yes. Could you explain it a little more?\n\n0:25:33\tSPEAKER_02\n Well, the general, like most older remotes are flat, just straight.\n\n0:25:40\tSPEAKER_02\n And are the manufacturing department can also do they have a single curved or double curved case?\n\n0:25:47\tSPEAKER_01\n And would single curves and double curved mean?\n\n0:25:52\tSPEAKER_02\n It would just only affect the form for as far as I know.\n\n0:25:56\tSPEAKER_02\n So it's really just up to the design department what we're going to use.\n\n0:26:00\tSPEAKER_02\n It doesn't really matter for the price or the functionality.\n\n0:26:03\tSPEAKER_01\n So we can pretty much just pick one you like.\n\n0:26:07\tSPEAKER_01\n Okay. That's good.\n\n0:26:10\tSPEAKER_03\n But the form has to be, it has to be possible to stand up.\n\n0:26:17\tSPEAKER_03\n Or just only to lay down.\n\n0:26:21\tSPEAKER_03\n The cover of the docking station is also on top of the television then.\n\n0:26:27\tSPEAKER_01\n Well, or besides it.\n\n0:26:30\tSPEAKER_03\n And you can just click it in. That's okay.\n\n0:26:34\tSPEAKER_03\n So the interface, what type of interface do we want to use?\n\n0:26:44\tSPEAKER_03\n Maybe you can make a little drawing of it on the board.\n\n0:26:51\tSPEAKER_00\n Somebody have ideas for a forum where we can just use the regular forum of it.\n\n0:26:59\tSPEAKER_00\n It's not quite a fancy show.\n\n0:27:05\tSPEAKER_01\n You said you wanted to put the changing channels button on the right side so your thumb would be easily...\n\n0:27:13\tSPEAKER_01\n Well, I think that was a very good point because I pointed out earlier that a lot of remote calls are as I.\n\n0:27:21\tSPEAKER_01\n So it would be great for that.\n\n0:27:24\tSPEAKER_01\n I thought maybe we could just make one of those buttons on both the left and the right side.\n\n0:27:30\tSPEAKER_01\n For left-handed users.\n\n0:27:34\tSPEAKER_00\n Yeah, it's possible to program it.\n\n0:27:43\tSPEAKER_00\n So you got on the left side or on the right side buttons for shifting or pins shifting up.\n\n0:27:49\tSPEAKER_00\n On the other side buttons for shifting for the sound.\n\n0:27:59\tSPEAKER_01\n Well, that could do that.\n\n0:28:04\tSPEAKER_01\n I'm not sure if that would be very good for the ease of use.\n\n0:28:08\tSPEAKER_03\n Use a few.\n\n0:28:11\tSPEAKER_03\n It would be a lot more difficult than that.\n\n0:28:14\tSPEAKER_01\n But it would make changing channels and changing volume buttons on both sides.\n\n0:28:20\tSPEAKER_01\n So it would certainly yield great options for the design of the remote.\n\n0:28:27\tSPEAKER_01\n Because it could be made all symmetrical and stuff.\n\n0:28:31\tSPEAKER_03\n Yeah, but you have extra buttons so people can get confused.\n\n0:28:35\tSPEAKER_01\n Yeah, that is true.\n\n0:28:38\tSPEAKER_03\n Especially if they have the same writings on it.\n\n0:28:44\tSPEAKER_00\n Or you have to make a left...\n\n0:28:47\tSPEAKER_03\n You can make a remote which you can flip over and use on the same functions as the normal one.\n\n0:28:59\tSPEAKER_00\n You mean...\n\n0:29:02\tSPEAKER_03\n Let's see.\n\n0:29:05\tSPEAKER_03\n Blank one.\n\n0:29:11\tSPEAKER_03\n Then you get...\n\n0:29:33\tSPEAKER_03\n Here's a little LCD screen.\n\n0:29:40\tSPEAKER_03\n Now I have to think.\n\n0:30:04\tSPEAKER_03\n It's a plus and a minus.\n\n0:30:08\tSPEAKER_03\n No, it's not very handy, I think.\n\n0:30:11\tSPEAKER_03\n Because the plus and a minus will be opposite.\n\n0:30:15\tSPEAKER_03\n No, that's not going to work.\n\n0:30:20\tSPEAKER_03\n I guess.\n\n0:30:23\tSPEAKER_03\n Maybe it's...\n\n0:30:25\tSPEAKER_03\n Is it a problem that left-handed persons use a different hand?\n\n0:30:31\tSPEAKER_03\n I think the functions are that basic that nobody should have any problems with choosing a channel.\n\n0:30:41\tSPEAKER_00\n It's just using your thumb.\n\n0:30:47\tSPEAKER_03\n I think we could just leave it a normal shape.\n\n0:30:52\tSPEAKER_03\n But maybe we have to make it a bit more fancy in another way.\n\n0:31:02\tSPEAKER_02\n I think we should start by choosing a case because that's the basis you're building on.\n\n0:31:11\tSPEAKER_02\n So I could draw them out.\n\n0:31:20\tSPEAKER_02\n Let's get this flat case.\n\n0:31:30\tSPEAKER_02\n From the side, so this is rather normal.\n\n0:31:33\tSPEAKER_02\n The single curved, so I'm not really sure what they're going to look like, but I think it's something like this.\n\n0:31:47\tSPEAKER_02\n So this type should be better for you or better.\n\n0:31:51\tSPEAKER_02\n Should prevent.\n\n0:31:54\tSPEAKER_02\n Rebet it to straight injury a bit.\n\n0:31:58\tSPEAKER_02\n And the double curved looks something like this, I guess.\n\n0:32:13\tSPEAKER_02\n So those are the three options we have.\n\n0:32:18\tSPEAKER_03\n I should just... the single curved.\n\n0:32:21\tSPEAKER_03\n Because maybe the curve is pretty good to put the screen in.\n\n0:32:27\tSPEAKER_03\n So that elderly people can use the remote control and at the same time look easily at the screen because it's a bit of an angle.\n\n0:32:38\tSPEAKER_00\n What you say is...\n\n0:32:47\tSPEAKER_00\n You got a curved...\n\n0:32:50\tSPEAKER_00\n I believe.\n\n0:32:54\tSPEAKER_00\n So you want to put this play over here?\n\n0:32:58\tSPEAKER_00\n No.\n\n0:32:59\tSPEAKER_03\n Yeah, thanks.\n\n0:33:05\tSPEAKER_03\n But now it's...\n\n0:33:08\tSPEAKER_03\n Do you have an upside down or...\n\n0:33:11\tSPEAKER_00\n That's top.\n\n0:33:14\tSPEAKER_00\n Maybe it's possible to make this side like...\n\n0:33:22\tSPEAKER_00\n Color...\n\n0:33:31\tSPEAKER_00\n To make this side like...\n\n0:33:38\tSPEAKER_00\n A bit like...\n\n0:33:40\tSPEAKER_00\n So in the form of your hand.\n\n0:33:45\tSPEAKER_00\n So the remote control...\n\n0:33:49\tSPEAKER_00\n I have to play in your hand.\n\n0:33:54\tSPEAKER_00\n So get your mouse.\n\n0:33:57\tSPEAKER_00\n And the buttons for...\n\n0:34:02\tSPEAKER_00\n Changing the channel over here.\n\n0:34:07\tSPEAKER_03\n Yeah, that's a good one.\n\n0:34:09\tSPEAKER_03\n But I think it's better to put the screen on top.\n\n0:34:15\tSPEAKER_03\n So just flip it 180 degrees and run.\n\n0:34:19\tSPEAKER_00\n And you get...\n\n0:34:20\tSPEAKER_00\n This play...\n\n0:34:21\tSPEAKER_03\n That's about here.\n\n0:34:23\tSPEAKER_03\n If you can have this one you turn it like this and then flip it upside down.\n\n0:34:29\tSPEAKER_00\n I don't know.\n\n0:34:30\tSPEAKER_03\n Because maybe your hand is in the way if you have to display here.\n\n0:34:36\tSPEAKER_02\n It's more logical to have it on top as well because...\n\n0:34:39\tSPEAKER_02\n Like on your mobile phone.\n\n0:34:41\tSPEAKER_02\n It's always a ball.\n\n0:34:46\tSPEAKER_00\n So...\n\n0:34:47\tSPEAKER_02\n Yeah.\n\n0:34:48\tSPEAKER_03\n Maybe you should just start on a blank page.\n\n0:34:52\tSPEAKER_03\n So then we get...\n\n0:34:59\tSPEAKER_03\n Here's...\n\n0:35:07\tSPEAKER_03\n This is the curve.\n\n0:35:17\tSPEAKER_00\n Five minutes.\n\n0:35:23\tSPEAKER_03\n Here the display and then buttons.\n\n0:35:25\tSPEAKER_03\n And then we can...\n\n0:35:27\tSPEAKER_03\n I'm a little bit off here and here maybe.\n\n0:35:32\tSPEAKER_03\n Just that's for left hand and right hand users.\n\n0:35:36\tSPEAKER_03\n And then the rest of the buttons over here.\n\n0:35:40\tSPEAKER_00\n On the off button, still on the top.\n\n0:35:44\tSPEAKER_03\n Yeah, still here.\n\n0:35:46\tSPEAKER_01\n And I'd prefer the corners to be round.\n\n0:35:49\tSPEAKER_01\n Yeah.\n\n0:35:50\tSPEAKER_01\n Yeah.\n\n0:35:51\tSPEAKER_03\n A bit more friendly.\n\n0:35:53\tSPEAKER_03\n Yeah.\n\n0:35:54\tSPEAKER_01\n And the on the on the on.\n\n0:35:56\tSPEAKER_03\n Okay.\n\n0:35:57\tSPEAKER_03\n Supplements.\n\n0:35:59\tSPEAKER_03\n That's okay.\n\n0:36:01\tSPEAKER_03\n That's very nice.\n\n0:36:04\tSPEAKER_03\n Then...\n\n0:36:09\tSPEAKER_03\n We've got a general idea of the concepts and the materials we're going to use.\n\n0:36:15\tSPEAKER_03\n So now for the next meeting, we'll have to look at a field design.\n\n0:36:21\tSPEAKER_03\n It's important that the corporate design image is going to be in the remote.\n\n0:36:26\tSPEAKER_03\n So check out the corporate website maybe.\n\n0:36:29\tSPEAKER_03\n The user interface design.\n\n0:36:31\tSPEAKER_03\n It's the same story.\n\n0:36:33\tSPEAKER_03\n And product evaluation.\n\n0:36:35\tSPEAKER_03\n So the industrial designer and user interface designer are going to work together on this one.\n\n0:36:42\tSPEAKER_03\n But you're going to get your instructions, I think, send it by the coach.\n\n0:36:49\tSPEAKER_03\n So just...\n\n0:36:52\tSPEAKER_03\n I will put these minutes in the folder.\n\n0:36:58\tSPEAKER_03\n Okay.\n\n0:36:59\tSPEAKER_03\n And then we're going to try to finish our project and make a good design for all the grandfathers and grandmothers.\n\n0:37:09\tSPEAKER_03\n Which one?\n\n0:37:13\tSPEAKER_03\n Let's see.\n\n0:37:14\tSPEAKER_03\n I'm not sure if you're going to start right away to work together or...\n\n0:37:19\tSPEAKER_03\n I think you're going to fill in the questionnaires first.\n\n0:37:22\tSPEAKER_03\n And then you'll get a message.\n\n0:37:25\tSPEAKER_03\n So that's basically it.\n\n0:37:28\tSPEAKER_03\n Maybe this one.\n\n0:37:30\tSPEAKER_03\n Maybe you can save this one in the...\n\n0:37:36\tSPEAKER_03\n The folder's group.\n\n0:37:42\tSPEAKER_03\n It's here.\n\n0:37:46\tSPEAKER_03\n Smart boy.\n\n0:37:47\tSPEAKER_03\n There it is.\n\n0:37:48\tSPEAKER_03\n So if you want to have a look at it, it's over there in the project folder.\n\n0:37:54\tSPEAKER_03\n And then I guess we'll start in 30 minutes again.\n\n0:37:59\tSPEAKER_03\n Thank you.\n\n0:38:00\tSPEAKER_03\n Okay.\n\n0:38:07\tSPEAKER_03\n Right on time.\n\n0:38:36\tNone\n Okay.\n\n0:38:43\tNone\n Okay.\n\n0:39:11\tNone\n Okay.\n\n0:39:18\tNone\n Okay.\n\n0:39:25\tNone\n Okay.\n\n0:39:52\tNone\n Okay.\n\n0:39:59\tNone\n Okay.\n\n0:40:06\tNone\n Okay.\n\n0:40:15\tNone\n Okay.\n\n0:40:22\tNone\n Okay.\n\n0:40:29\tNone\n Okay.\n\n0:40:36\tNone\n Okay.\n\n0:40:51\tNone\n Okay.\n\n0:41:09\tNone\n Okay.\n\n0:41:24\tNone\n Okay.\n\n0:41:42\tNone\n Okay.\n\n0:42:00\tNone\n Okay.\n\n0:42:21\tSPEAKER_00\n Okay.\n\n0:42:39\tSPEAKER_02\n Okay.\n\n", "summary": [{"summary_text": "Today is the third meeting of Speaker's team. They are going to discuss the conceptual design meeting, the requirements and the target market. Speaker will show the agenda in a few minutes. They have about 40 minutes to make a decision on remote control concepts."}]}