{"filename": "./data/TS3007a.txt", "transcript": "0:00:00\tNone\nä¸\u008d youtubeå\u0095¦ä»\u008eè\u0088\u008cè\u0089ºå\u008f°ä¸­è¿\u0099ä¸\u008bç\u009a\u0084ä¸­é\u0097´æ\u0096°ç\u009a\u0084æ\u0088\u0091å\u0092\u008cå®¶ç\u008e\u008bè¯ºå¦\u0088å¦\u0088æ\u0088\u0091ç\u009a\u0084å¤§è\u0083\u008eè\u008c«è\u008c«æ\u0088\u0091å¿\u0085é \u0088 groundç¬¬ä¸\u0080ä»¶äº\u008bæ\u0088\u0091å\u0080\u0091è\u0083½å\u0081\u009aç\u009a\u0084å\u008f¯ä»¥å\u0081\u009aç\u009a\u0084æ\u0088\u0091æ\u009c\u0089é ­ä¸\u008aç\u009a\u0084å\u008f¯ä»¥å\u0081\u009aç\u009a\u0084å±\u0085å®¶\n\n0:01:22\tSPEAKER_00\nå\u0092\u008cæ\u0088\u0091å\u0080\u0091ç\u009a\u0084è\u0087\u0089é\u0083¨\n\n0:01:30\tNone\næ\u0088\u0091æ\u008c\u0087å\u0087ºå\u008e»ä»£ç\u0093¦æ ¼è·\u009få\u0088°æ\u0088\u0091å\u0080\u0091ç\u009a\u0084è\u0087\u0089é\u0083¨å¥½ä»\u008aå¤©å°¤å\u0085¶æ\u0098¯æ ¡å\u0086\u0085ç­\u0089\n\n0:01:50\tNone\nä»¥äº\u0094æ\u009c\u0088 Fei Dreamå\u009c°ç\u0094¨ä¸\u0080æ£\u009fé\u0087\u008då¤§è\u0083½å¤\u009fæµ\u008b Oppositioné¦\u0096å\u0085\u0088ä¸\u0080æ¬¡æ\u0097©ä¸\u008aæ\u0088\u0091å\u0086\u008dæ\u008e¥å¾\u0085è\u0087ªå·±è\u008b±æ\u0096\u0087ç\u009a\u0084è¦\u0081æ±\u0082æ\u008f\u0090èµ·è\u0087ªå·±å\u0086\u008då\u0081\u009aå\u0088°ä¸\u0080äº\u009bå\u009b°å¢\u0083å\u009c\u0093å½¢è\u0087ªæ´¾ä¸ºè\u0087ªå·±å°±ä¼\u009aæ\u009c\u0089äº\u009bå\u009b°å¢\u0083~!\n\n0:02:12\tSPEAKER_02\nè¿\u0099æ ·å­\u0090ç\u009a\u0084å\u009b°å¢\u0083æ\u009c\u0089ä»\u0080ä¹\u0088å\u009b¢å\u009b¢æ\u009c\u0089ä»\u0080ä¹\u0088è¦\u0081å\u0081\u009aç\u0084¶å\u0090\u008eä½ æ\u009c\u0089å\u0088°äº\u0086æ\u0088\u0091ç\u009a\u0084å\u0090\u008då­\u0097æ\u0098¯Daniel Wolvesæ\u0088\u0091æ\u0098¯Protect Manager\n\n0:02:27\tSPEAKER_01\næ\u0088\u0091æ\u0098¯Yerun Topæ\u0088\u0091æ\u0098¯User Interfaceæ\u0088\u0091 Name is Jan van Fuerenæ\u0088\u0091æ\u0098¯ Industrial Designer\n\n0:02:37\tSPEAKER_00\næ\u0088\u0091æ\u0098¯Tem Vanilleæ\u0088\u0091ç\u009a\u0084 Function is Marketing Expert\n\n0:02:42\tSPEAKER_02\nOK, thank youæ\u0088\u0091æ\u0098¯Amy's to make a new remote control maybe you read the website It's a very ambitious company they want to do something else There must be a new remote control First of all, it must be original and trendy it's two things really close to each other but at the same time, it's useful for friendly and they have very important for them There are three stages there's a functional design what are we going to do what are we going to make functions in the remote and why are we going to do it then the conceptual design how are we going to do it and that's really global because at the detailed design how part two we go to dig in really about how the technical if it's possible technical wise each stage is broken up in two stages individual work and a meeting so it's very straightforward OK, the tool training we have two smart boards this one is for the presentations the PowerPoint presentations or the word presentation whatever you had and this is only for drawing so we must let it stand on this program this is called a smart board it speaks for itself and as you may have heard the documents in the Shared folder can be showed on this screen not in my documents so if you want to show something put it in the Shared folder this is very straightforward with the save to print the undo the blank to select the pen well, I don't going to explain it all because I think you know how it works we must not forget everything we draw on here almost be saved we may not delete anything so if you have a draw something save it never delete it that's very important to us OK a little kind of exercise to know each other at the whiteboard on the left every one of us must draw our favorite animal and tell us why we had chosen that animal important is that we use different colors and different pen widths what?\n\n0:05:51\tSPEAKER_02\n I have a question\n\n0:05:52\tSPEAKER_00\n if this exercise did the company board tell you to do it or did you just make it up\n\n0:06:01\tSPEAKER_02\n no no no it's a part of the answer because we really don't know each other and it's kind of new getting used to each other we can have a little fun and before we dig in really to the hearts that kind of thing would you start with drawing your favorite animal?\n\n0:06:20\tSPEAKER_00\n I don't know really how it works maybe you can show us first\n\n0:06:25\tSPEAKER_02\n drawing goes with this thing do not touch your hand on this little thing here that's important all it's like this you get electrocuted yeah kind of so you must push a little good and wait a few seconds it's a fully real time\n\n0:06:53\tNone\n so watch it well I'm gonna paint in the red oh that's the background call well undue the pen one minute please yeah that's the one five okay\n\n0:07:51\tSPEAKER_00\n my favorite animal it's like a dictionary that's what it is the one who says it first\n\n0:08:06\tSPEAKER_02\n got to race\n\n0:08:08\tNone\n may it paint next it's a fork no it's not an arc you don't see it at the years?\n\n0:08:23\tSPEAKER_00\n no I have it at home\n\n0:08:26\tSPEAKER_02\n you have an arc at home thank you so it's a cat\n\n0:08:34\tSPEAKER_01\n what's it called?\n\n0:08:36\tSPEAKER_02\n Sima we have a cat at home and he's called Sima he looks like the lion from the Lion King\n\n0:08:44\tSPEAKER_00\n many of the animals\n\n0:08:46\tSPEAKER_02\n so we have some kind of cool name it after an alien he's happy with us he's smiling\n\n0:09:05\tSPEAKER_01\n he does have body\n\n0:09:07\tSPEAKER_02\n now only the face because we have 25 minutes\n\n0:09:11\tSPEAKER_00\n we have to speed up remember you use different colors and different pen widths\n\n0:09:20\tSPEAKER_02\n okay we want to go next okay choose a color\n\n0:09:30\tSPEAKER_01\n you don't have to change the color and the pen width save it\n\n0:09:36\tSPEAKER_00\n save it okay I've done that\n\n0:09:44\tSPEAKER_01\n okay you have to push hard on the pen\n\n0:09:54\tSPEAKER_00\n not ready that one\n\n0:10:01\tNone\n and that's why we started with the pen case continue on the last file okay open which one is it's on the budget for Pencil okay okay okay thanks okay speed up by the way why was you cat rid?\n\n0:10:53\tSPEAKER_02\n my cat is red and I've red hair\n\n0:10:58\tSPEAKER_01\n must be red it's a frog it's a turtle it's an apple it must be a dog a dog\n\n0:11:16\tSPEAKER_00\n a color something like this\n\n0:11:28\tSPEAKER_01\n oh it's a turtle\n\n0:11:32\tSPEAKER_02\n why a turtle?\n\n0:11:34\tSPEAKER_00\n ten because I like ten-h mutant\n\n0:11:40\tSPEAKER_02\n you watched it a lot it's inside the shell it's a scared turtle\n\n0:11:50\tSPEAKER_00\n no no no it's coming out wow wow\n\n0:12:06\tNone\n okay thanks okay thank you very artistic\n\n0:12:17\tSPEAKER_02\n you want to go next?\n\n0:12:19\tSPEAKER_01\n yes good okay yeah thank you\n\n0:12:25\tSPEAKER_00\n there you go\n\n0:12:27\tSPEAKER_01\n yeah how did it work?\n\n0:12:35\tSPEAKER_02\n format then you have the current color you can change so no red or green and line with I had five dimmets so what kind of line with the dimmets?\n\n0:12:52\tSPEAKER_00\n the big lines were like nine\n\n0:12:56\tSPEAKER_02\n okay it's a dog\n\n0:12:58\tSPEAKER_01\n well first I just thought I picked the easiest one\n\n0:13:03\tSPEAKER_02\n why a dog?\n\n0:13:04\tSPEAKER_01\n you have a dog at home? well we had a dog we had a dog and when it died we didn't get a new one\n\n0:13:11\tSPEAKER_00\n it's pretty good\n\n0:13:14\tSPEAKER_02\n we have an artistic inner middle\n\n0:13:19\tSPEAKER_00\n an artist\n\n0:13:21\tSPEAKER_01\n a graphical user designer\n\n0:13:24\tSPEAKER_00\n thank you picked the wrong function wrong job\n\n0:13:32\tSPEAKER_01\n oh no it worked\n\n0:13:37\tNone\n so I think you can see it's really a easy program to use not difficult at all\n\n0:13:47\tSPEAKER_00\n okay thank you that's enough thanks yeah sure\n\n0:13:58\tSPEAKER_02\n the last one\n\n0:14:00\tSPEAKER_00\n I wonder after a cat, a turtle and a dog\n\n0:14:07\tSPEAKER_02\n I think it's going to draw an elephant I figured she should do something like that\n\n0:14:14\tSPEAKER_01\n but I'm going to do something much more difficult he is a artistic writer I'm going to design a remote\n\n0:14:25\tSPEAKER_00\n a remote control a remote control\n\n0:14:30\tSPEAKER_01\n exactly sorry well with the interface it might be easier to draw here yeah\n\n0:14:47\tSPEAKER_00\n that might be easier but at the other hand a pen like that is easy to hold in your hand I think it's easier to draw better to draw with a pen and with a mouth\n\n0:15:02\tSPEAKER_01\n yeah I mean like a drawing\n\n0:15:05\tSPEAKER_00\n drawing and then playing on the screen but this paper was too well\n\n0:15:10\tSPEAKER_02\n it's a rabbit yes you ever read it at home?\n\n0:15:14\tSPEAKER_00\n no it's a rabbit with broken legs\n\n0:15:18\tSPEAKER_02\n it's the white rabbit it's the white rabbit from the matrix\n\n0:15:22\tSPEAKER_01\n it's the white rabbit he said a little bit stoned I think it is a pretty good impression of a rabbit\n\n0:15:36\tSPEAKER_00\n it will do\n\n0:15:38\tSPEAKER_02\n finishing touch and then we go further\n\n0:15:44\tSPEAKER_00\n project manager\n\n0:15:47\tSPEAKER_01\n with a spingo just\n\n0:15:49\tSPEAKER_00\n counting the time\n\n0:15:52\tSPEAKER_02\n yeah a little\n\n0:15:56\tSPEAKER_00\n let's go on then\n\n0:16:01\tSPEAKER_02\n well I think the dog is the most\n\n0:16:04\tSPEAKER_01\n I figured a rabbit was actually the most impressed\n\n0:16:07\tSPEAKER_02\n don't choose for yourself ok now we're going to dig into the serious stuff the selling price for the remote will be 25 euro and the production cost may not be more than 20 and a half euro so from my point of view I don't think it's going to be very high-tech high-definition ultra-modern kind of remote for 12-12,000,000 euro the profit we must make with the new remote is 50 million euro so that's a lot we have to sell a lot of bike how much?\n\n0:16:53\tSPEAKER_02\n 100 million I think when the selling price is 25 you come 2 million or 2 million our marketing rate is international we have virtually the whole world we can sell our remote too at least that country which have a a television so now it's time for us to discuss a little things you can think about experience with remote control yourself at home what you think might be a useful new future what can distinguish our new trendy remote control from all the others so let's discuss a little I'm going to join you at the table well what's the most important thing at remote control?\n\n0:17:57\tSPEAKER_01\n well I think the most important thing of remote control is that you can switch channels and my opinion is you can keep it as basic as possible\n\n0:18:06\tSPEAKER_02\n so another remote control which can be used for television and DVD and radio\n\n0:18:16\tSPEAKER_00\n or just only but I have some points can I show them on the big screen?\n\n0:18:22\tSPEAKER_00\n if you have them on my I can find them\n\n0:18:38\tSPEAKER_02\n in case you want this is a dead kind of fly between the\n\n0:18:47\tSPEAKER_00\n screen\n\n0:18:49\tSPEAKER_01\n is it possible to open pen drawings in this\n\n0:18:52\tSPEAKER_02\n no no no only all the drawings go there\n\n0:18:56\tSPEAKER_01\n but which ones we made on there\n\n0:19:00\tSPEAKER_02\n oh that pen drawings no I think when it is in word and you have stated in the shared documents folder you can show with them\n\n0:19:09\tSPEAKER_00\n or in word okay I have some points from marketing point of view just a standard thing things like intuitive, small, fairly cheap 25 euros brand independent I think it doesn't have to matter which brand your TV or everything is\n\n0:19:33\tSPEAKER_02\n okay five minutes five minutes\n\n0:19:36\tSPEAKER_00\n okay I'll wrap it up quickly I personally think it has to be multi-purpose most of remote controls are just for one purpose and by making a multi-purpose it as a new feature, add a new feature to the market and distinguish from current products maybe some other technology than infrared I rather find it very annoying like when someone is standing in front of the TV that you can't switch it think about sending it over radio waves or Bluetooth okay that might be a little bit expensive and something like an LCD screen for what purpose like it said here maybe it's easy it's nice as an added feature that when you run a certain channel you can see on LCD screen work programs are coming up\n\n0:20:42\tSPEAKER_02\n so it would be a multi-purpose very technically high from my point of view it must be really innovative technical wise\n\n0:20:55\tSPEAKER_00\n yeah that's to be yeah our company is very good in making new enough diff things\n\n0:21:08\tSPEAKER_02\n so we must focus on things we really add something\n\n0:21:14\tSPEAKER_00\n to the current market look you got some cheap remote controls they just you got a dozen of them but when you enter a new market we're remote control and want to gain market share you have to do something special\n\n0:21:39\tSPEAKER_02\n but we have to keep in mind at the beginning of such a project it's very cool to talk about well this would be cool but we must not lose side of the user\n\n0:21:56\tSPEAKER_00\n frankly yeah of course but this is just from marketing I don't know anything about user interface\n\n0:22:06\tSPEAKER_02\n and that's because we have him and him okay next meeting we'll start in 30 minutes so you will have individual actions where I presume will be some feedback via the mail the industrial designer has to look at the working design the user interface designer has to look at the technical function so we discussed\n\n0:22:42\tSPEAKER_01\n one thing we must first agree on what we are going to make are we going to use it for multiple systems or we should have some agreement on that okay\n\n0:22:54\tSPEAKER_00\n I don't think we have to agree on that I think that's a phase further just make some mock-ups some general ideas and then we can plan yeah we can plan for I think but maybe because you are working on the user requirements\n\n0:23:24\tSPEAKER_02\n you are working on technical functions we must have a little kind of what do you call it?\n\n0:23:38\tSPEAKER_02\n a little plan on what we are going to do so you don't come over the user requirements we don't fit the technical functions at all some basic things we want to go into I think that's what we are coming in yeah\n\n0:24:01\tSPEAKER_00\n I don't know you decide you are the project manager\n\n0:24:06\tSPEAKER_01\n the technical functions have to be designed I've got to know for what kind of machines will be or will we use it a text screen or will it be with Bluetooth\n\n0:24:18\tSPEAKER_02\n well that's really a step further but if you say is it one way or multi-purpose\n\n0:24:26\tSPEAKER_00\n that's the same step yeah\n\n0:24:30\tSPEAKER_01\n why? the individual components\n\n0:24:34\tSPEAKER_00\n yeah like we all have a list of things that have to be in it or how it has to be like and then in the next meeting we decide\n\n0:24:46\tSPEAKER_01\n what it's going to be\n\n0:24:48\tSPEAKER_00\n and then you can delete the the obsolete details\n\n0:24:56\tSPEAKER_02\n so each individual individually must think on what's at his point if you is the most important and then we are going to fit all the pieces together the next meeting I'm just finished of now so it's over you will receive specific instructions by your personal coach and I'll see you in 30 minutes thank you\n\n0:25:34\tNone\n be careful success?\n\n0:25:44\tSPEAKER_01\n success\n\n0:26:14\tNone\n success? success\n\n", "summary": [{"summary_text": "Amy, Yerun Top, Jan vanueren, Daniel Wolves and Fei Dream are talking about making a new remote control. They discuss the three stages of the design of the remote control: the first is the functional design, the second is the user interface and the third is the function. "}]}