{"file_url": "/tmp/parrot/mini_icsi.wav", "transcription": "0:00:00 - 0:00:06 | SPEAKER_01: Yeah, we had a long discussion about how easy we want to make it for people to bleep things out.\n0:00:06 - 0:00:10 | SPEAKER_01: Morgan wants to make it hard.\n0:00:10 - 0:00:13 | None: The counter is not moving.\n0:00:13 - 0:00:16 | SPEAKER_01: It doesn't.\n0:00:16 - 0:00:18 | SPEAKER_00: I didn't even check yesterday.\n0:00:18 - 0:00:20 | SPEAKER_01: It didn't move yesterday either when I started it.\n0:00:20 - 0:00:22 | SPEAKER_01: I don't know if it doesn't look like both.\n0:00:22 - 0:00:24 | SPEAKER_01: Channel 3?\n0:00:24 - 0:00:29 | SPEAKER_01: You know, I discovered something yesterday on these wireless ones.\n0:00:29 - 0:00:33 | SPEAKER_01: You can tell if it's picking up breath noise and stuff.\n0:00:33 - 0:00:37 | SPEAKER_01: Yeah, it has a little indicator on it on the AF.\n0:00:37 - 0:00:43 | SPEAKER_01: So if you breathe under, breathe, and then you see AF go off, then you know.\n0:00:43 - 0:00:45 | SPEAKER_01: You're picking up your mouth nice.\n0:00:45 - 0:00:48 | SPEAKER_00: Well, that's good. Because we have a lot of...\n0:00:48 - 0:00:53 | SPEAKER_00: In fact, if you listen to just the channels of people not talking, it's like...\n0:00:53 - 0:00:59 | SPEAKER_00: Yeah! What did you see Hannibal recently?\n0:00:59 - 0:01:01 | SPEAKER_00: Exactly. Very disgusting.\n0:01:01 - 0:01:06 | SPEAKER_00: Okay. So I was going to try to get out of here in half an hour.\n0:01:06 - 0:01:09 | SPEAKER_00: Because I really appreciate people coming.\n0:01:09 - 0:01:24 | SPEAKER_00: And the main thing that I was going to ask people to help with today is...\n", "text": " Yeah, we had a long discussion about how easy we want to make it for people to bleep things out. Morgan wants to make it hard. The counter is not moving. It doesn't. I didn't even check yesterday. It didn't move yesterday either when I started it. I don't know if it doesn't look like both. Channel 3? You know, I discovered something yesterday on these wireless ones. You can tell if it's picking up breath noise and stuff. Yeah, it has a little indicator on it on the AF. So if you breathe under, breathe, and then you see AF go off, then you know. You're picking up your mouth nice. Well, that's good. Because we have a lot of... In fact, if you listen to just the channels of people not talking, it's like... Yeah! What did you see Hannibal recently? Exactly. Very disgusting. Okay. So I was going to try to get out of here in half an hour. Because I really appreciate people coming. And the main thing that I was going to ask people to help with today is...", "summary": "The meeting was about how to make it easier for people to bleep things out. First, the group discussed the current status on the wireless wireless ones. The team was very satisfied with the progress of the project, but they were still concerned with how they could improve it further. They discussed how they would make it easy to bleeping things out, like how they should make it more difficult to detect voice noise. Then, they discussed how to deal with the issue of bleeping out speech noise. Finally, they talked about how they wanted to make sure that the team would not be forced to give up their recording equipment.", "keywords_list_1": ["bleep", "noise", "listen", "channels", "talking"], "keywords_list_2": ["bleep things", "breath noise", "people bleep", "speaker_01 breathe", "speaker_01 channel"], "keywords_list_3": ["people bleep things", "make people bleep", "breath noise stuff", "picking breath noise", "bleep things speaker_01"]}